TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1160810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jun 27 16:56:16 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/drivers/i2c/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;       c:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\116082 C

    1882              $C$DW$196       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Busy"), DW_AT_const_value(0x1000)
    1883              $C$DW$197       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_NACK_Sent"), DW_AT_const_value(0x2000)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1160810                              PAGE   36

    1884              $C$DW$198       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Slave_Dir"), DW_AT_const_value(0x4000)
    1885                      .dwendtag $C$DW$T$33
    1886              
    1887              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Status_e")
    1888                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1889                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1890              
    1891              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    1892                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1893              $C$DW$199       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Stop"), DW_AT_const_value(0xc00)
    1894              $C$DW$200       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_TX"), DW_AT_const_value(0x2e00)
    1895              $C$DW$201       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_RX"), DW_AT_const_value(0x2c00)
    1896              $C$DW$202       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Start"), DW_AT_const_value(0x2600
    1897              $C$DW$203       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Stop"), DW_AT_const_value(0xe00)
    1898              $C$DW$204       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Start"), DW_AT_const_value(0x2400
    1899              $C$DW$205       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Stop"), DW_AT_const_value(0xc00)
    1900                      .dwendtag $C$DW$T$38
    1901              
    1902              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Control_e")
    1903                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1904                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1905              $C$DW$206       .dwtag  DW_TAG_TI_far_type
    1906                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$39)
    1907              $C$DW$T$40      .dwtag  DW_TAG_const_type
    1908                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$206)
    1909              
    1910              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    1911                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1912              $C$DW$207       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_1_Bit"), DW_AT_const_value(0x01)
    1913              $C$DW$208       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_2_Bits"), DW_AT_const_value(0x02)
    1914              $C$DW$209       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_3_Bits"), DW_AT_const_value(0x03)
    1915              $C$DW$210       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_4_Bits"), DW_AT_const_value(0x04)
    1916              $C$DW$211       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_5_Bits"), DW_AT_const_value(0x05)
    1917              $C$DW$212       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_6_Bits"), DW_AT_const_value(0x06)
    1918              $C$DW$213       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_7_Bits"), DW_AT_const_value(0x07)
    1919              $C$DW$214       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_8_Bits"), DW_AT_const_value(0x00)
    1920                      .dwendtag $C$DW$T$41
    1921              
    1922              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_BitCount_e")
    1923                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1924                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1925              $C$DW$215       .dwtag  DW_TAG_TI_far_type
    1926                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$42)
    1927              $C$DW$T$43      .dwtag  DW_TAG_const_type
    1928                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$215)
    1929              
    1930              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1931                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    1932                      .dwattr $C$DW$T$19, DW_AT_declaration
    1933                      .dwendtag $C$DW$T$19
    1934              
    1935              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    1936                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$19)
    1937                      .dwattr $C$DW$T$29, DW_AT_address_class(0x16)
    1938              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1160810                              PAGE   37

    1939                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1940                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1941              $C$DW$216       .dwtag  DW_TAG_TI_far_type
    1942                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$30)
    1943              $C$DW$T$44      .dwtag  DW_TAG_const_type
    1944                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$216)
    1945              
    1946              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1947                      .dwattr $C$DW$T$23, DW_AT_name("_I2C_Obj_")
    1948                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x22)
    1949              $C$DW$217       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$21)
    1951                      .dwattr $C$DW$217, DW_AT_name("I2COAR")
    1952                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_I2COAR")
    1953                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1955              $C$DW$218       .dwtag  DW_TAG_member
    1956                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$21)
    1957                      .dwattr $C$DW$218, DW_AT_name("I2CIER")
    1958                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_I2CIER")
    1959                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1960                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1961              $C$DW$219       .dwtag  DW_TAG_member
    1962                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$21)
    1963                      .dwattr $C$DW$219, DW_AT_name("I2CSTR")
    1964                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_I2CSTR")
    1965                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1966                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1967              $C$DW$220       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$21)
    1969                      .dwattr $C$DW$220, DW_AT_name("I2CCLKL")
    1970                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_I2CCLKL")
    1971                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1972                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1973              $C$DW$221       .dwtag  DW_TAG_member
    1974                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$21)
    1975                      .dwattr $C$DW$221, DW_AT_name("I2CCLKH")
    1976                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_I2CCLKH")
    1977                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1978                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1979              $C$DW$222       .dwtag  DW_TAG_member
    1980                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$21)
    1981                      .dwattr $C$DW$222, DW_AT_name("I2CCNT")
    1982                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_I2CCNT")
    1983                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1984                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1985              $C$DW$223       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$21)
    1987                      .dwattr $C$DW$223, DW_AT_name("I2CDRR")
    1988                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_I2CDRR")
    1989                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1990                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1991              $C$DW$224       .dwtag  DW_TAG_member
    1992                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$21)
    1993                      .dwattr $C$DW$224, DW_AT_name("I2CSAR")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1160810                              PAGE   38

    1994                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_I2CSAR")
    1995                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1996                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1997              $C$DW$225       .dwtag  DW_TAG_member
    1998                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$21)
    1999                      .dwattr $C$DW$225, DW_AT_name("I2CDXR")
    2000                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_I2CDXR")
    2001                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2002                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2003              $C$DW$226       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$21)
    2005                      .dwattr $C$DW$226, DW_AT_name("I2CMDR")
    2006                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_I2CMDR")
    2007                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2008                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2009              $C$DW$227       .dwtag  DW_TAG_member
    2010                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$21)
    2011                      .dwattr $C$DW$227, DW_AT_name("I2CISRC")
    2012                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_I2CISRC")
    2013                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2014                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2015              $C$DW$228       .dwtag  DW_TAG_member
    2016                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$21)
    2017                      .dwattr $C$DW$228, DW_AT_name("I2CEMDR")
    2018                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_I2CEMDR")
    2019                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2020                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2021              $C$DW$229       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$21)
    2023                      .dwattr $C$DW$229, DW_AT_name("I2CPSC")
    2024                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_I2CPSC")
    2025                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2026                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2027              $C$DW$230       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$22)
    2029                      .dwattr $C$DW$230, DW_AT_name("rsvd_1")
    2030                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_rsvd_1")
    2031                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2032                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2033              $C$DW$231       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$21)
    2035                      .dwattr $C$DW$231, DW_AT_name("I2CFFTX")
    2036                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_I2CFFTX")
    2037                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2038                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2039              $C$DW$232       .dwtag  DW_TAG_member
    2040                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$21)
    2041                      .dwattr $C$DW$232, DW_AT_name("I2CFFRX")
    2042                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_I2CFFRX")
    2043                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2044                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2045                      .dwendtag $C$DW$T$23
    2046              
    2047              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Obj")
    2048                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:16 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1160810                              PAGE   39

    2049                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2050              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    2051                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2052                      .dwattr $C$DW$T$51, DW_AT_address_class(0x16)
    2053              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2054                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    2055              $C$DW$233       .dwtag  DW_TAG_TI_far_type
    2056                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$3)
    2057              $C$DW$T$53      .dwtag  DW_TAG_const_type
    2058                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$233)
    2059              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2060                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2061                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2062                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2063              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2064                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2065                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2066                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2067              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2068                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2069                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2070                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2071              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    2072                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$6)
    2073                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2074              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2075                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2076                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2077                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2078              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2079                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2080                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2081                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2082              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2083                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2084                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2085                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2086              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2087                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    2088                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2089              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    2090                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$20)
    2091                      .dwattr $C$DW$T$66, DW_AT_address_class(0x16)
    2092              $C$DW$234       .dwtag  DW_TAG_TI_far_type
    2093                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    2094              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
    2095                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$234)
    2096              
