TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jun 27 16:56:18 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3259              $C$DW$473       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    3260              $C$DW$474       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    3261                      .dwendtag $C$DW$T$180
    3262              
    3263              $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    3264                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$180)
    3265                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    3266              $C$DW$475       .dwtag  DW_TAG_TI_far_type
    3267                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$181)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   66

    3268              $C$DW$T$182     .dwtag  DW_TAG_const_type
    3269                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$475)
    3270              
    3271              $C$DW$T$183     .dwtag  DW_TAG_enumeration_type
    3272                      .dwattr $C$DW$T$183, DW_AT_byte_size(0x01)
    3273              $C$DW$476       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3274              $C$DW$477       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3275              $C$DW$478       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3276              $C$DW$479       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3277              $C$DW$480       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3278              $C$DW$481       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3279              $C$DW$482       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3280              $C$DW$483       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3281              $C$DW$484       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3282              $C$DW$485       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3283              $C$DW$486       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3284              $C$DW$487       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3285                      .dwendtag $C$DW$T$183
    3286              
    3287              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3288                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
    3289                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    3290              
    3291              $C$DW$T$186     .dwtag  DW_TAG_enumeration_type
    3292                      .dwattr $C$DW$T$186, DW_AT_byte_size(0x01)
    3293              $C$DW$488       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3294              $C$DW$489       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3295              $C$DW$490       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3296                      .dwendtag $C$DW$T$186
    3297              
    3298              $C$DW$T$187     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3299                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$186)
    3300                      .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    3301              
    3302              $C$DW$T$189     .dwtag  DW_TAG_enumeration_type
    3303                      .dwattr $C$DW$T$189, DW_AT_byte_size(0x01)
    3304              $C$DW$491       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3305              $C$DW$492       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3306                      .dwendtag $C$DW$T$189
    3307              
    3308              $C$DW$T$190     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3309                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$189)
    3310                      .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    3311              
    3312              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3313                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3314                      .dwattr $C$DW$T$19, DW_AT_declaration
    3315                      .dwendtag $C$DW$T$19
    3316              
    3317              $C$DW$T$113     .dwtag  DW_TAG_pointer_type
    3318                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$19)
    3319                      .dwattr $C$DW$T$113, DW_AT_address_class(0x16)
    3320              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3321                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    3322                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   67

    3323              
    3324              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3325                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3326                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3327              $C$DW$493       .dwtag  DW_TAG_member
    3328                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$25)
    3329                      .dwattr $C$DW$493, DW_AT_name("ADCRESULT")
    3330                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_ADCRESULT")
    3331                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3332                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3333              $C$DW$494       .dwtag  DW_TAG_member
    3334                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$26)
    3335                      .dwattr $C$DW$494, DW_AT_name("resvd_1")
    3336                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_resvd_1")
    3337                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3338                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3339              $C$DW$495       .dwtag  DW_TAG_member
    3340                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$24)
    3341                      .dwattr $C$DW$495, DW_AT_name("ADCCTL1")
    3342                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_ADCCTL1")
    3343                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3344                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3345              $C$DW$496       .dwtag  DW_TAG_member
    3346                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$24)
    3347                      .dwattr $C$DW$496, DW_AT_name("ADCCTL2")
    3348                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_ADCCTL2")
    3349                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3350                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3351              $C$DW$497       .dwtag  DW_TAG_member
    3352                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$27)
    3353                      .dwattr $C$DW$497, DW_AT_name("rsvd_2")
    3354                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_rsvd_2")
    3355                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3356                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3357              $C$DW$498       .dwtag  DW_TAG_member
    3358                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$24)
    3359                      .dwattr $C$DW$498, DW_AT_name("ADCINTFLG")
    3360                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_ADCINTFLG")
    3361                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3362                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3363              $C$DW$499       .dwtag  DW_TAG_member
    3364                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$24)
    3365                      .dwattr $C$DW$499, DW_AT_name("ADCINTFLGCLR")
    3366                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3367                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3368                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3369              $C$DW$500       .dwtag  DW_TAG_member
    3370                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$24)
    3371                      .dwattr $C$DW$500, DW_AT_name("ADCINTOVF")
    3372                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_ADCINTOVF")
    3373                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3374                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3375              $C$DW$501       .dwtag  DW_TAG_member
    3376                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$24)
    3377                      .dwattr $C$DW$501, DW_AT_name("ADCINTOVFCLR")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   68

    3378                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3379                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3380                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3381              $C$DW$502       .dwtag  DW_TAG_member
    3382                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$28)
    3383                      .dwattr $C$DW$502, DW_AT_name("INTSELxNy")
    3384                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_INTSELxNy")
    3385                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3386                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3387              $C$DW$503       .dwtag  DW_TAG_member
    3388                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$29)
    3389                      .dwattr $C$DW$503, DW_AT_name("rsvd_3")
    3390                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_rsvd_3")
    3391                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3392                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3393              $C$DW$504       .dwtag  DW_TAG_member
    3394                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$24)
    3395                      .dwattr $C$DW$504, DW_AT_name("SOCPRICTRL")
    3396                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3397                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3398                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3399              $C$DW$505       .dwtag  DW_TAG_member
    3400                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$24)
    3401                      .dwattr $C$DW$505, DW_AT_name("rsvd_4")
    3402                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_rsvd_4")
    3403                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3404                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3405              $C$DW$506       .dwtag  DW_TAG_member
    3406                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$24)
    3407                      .dwattr $C$DW$506, DW_AT_name("ADCSAMPLEMODE")
    3408                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3409                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3410                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3411              $C$DW$507       .dwtag  DW_TAG_member
    3412                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$24)
    3413                      .dwattr $C$DW$507, DW_AT_name("rsvd_5")
    3414                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_rsvd_5")
    3415                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3416                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3417              $C$DW$508       .dwtag  DW_TAG_member
    3418                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$24)
    3419                      .dwattr $C$DW$508, DW_AT_name("ADCINTSOCSEL1")
    3420                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3421                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3422                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3423              $C$DW$509       .dwtag  DW_TAG_member
    3424                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$24)
    3425                      .dwattr $C$DW$509, DW_AT_name("ADCINTSOCSEL2")
    3426                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3427                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3428                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3429              $C$DW$510       .dwtag  DW_TAG_member
    3430                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$27)
    3431                      .dwattr $C$DW$510, DW_AT_name("rsvd_6")
    3432                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_rsvd_6")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   69

    3433                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3434                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3435              $C$DW$511       .dwtag  DW_TAG_member
    3436                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$24)
    3437                      .dwattr $C$DW$511, DW_AT_name("ADCSOCFLG1")
    3438                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3439                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3440                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3441              $C$DW$512       .dwtag  DW_TAG_member
    3442                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$24)
    3443                      .dwattr $C$DW$512, DW_AT_name("rsvd_7")
    3444                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_rsvd_7")
    3445                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3446                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3447              $C$DW$513       .dwtag  DW_TAG_member
    3448                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$24)
    3449                      .dwattr $C$DW$513, DW_AT_name("ADCSOCFRC1")
    3450                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3451                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3452                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3453              $C$DW$514       .dwtag  DW_TAG_member
    3454                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$24)
    3455                      .dwattr $C$DW$514, DW_AT_name("rsvd_8")
    3456                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_rsvd_8")
    3457                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3458                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3459              $C$DW$515       .dwtag  DW_TAG_member
    3460                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$24)
    3461                      .dwattr $C$DW$515, DW_AT_name("ADCSOCOVF1")
    3462                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3463                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3464                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3465              $C$DW$516       .dwtag  DW_TAG_member
    3466                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$24)
    3467                      .dwattr $C$DW$516, DW_AT_name("rsvd_9")
    3468                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_rsvd_9")
    3469                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3470                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3471              $C$DW$517       .dwtag  DW_TAG_member
    3472                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$24)
    3473                      .dwattr $C$DW$517, DW_AT_name("ADCSOCOVFCLR1")
    3474                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3475                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3476                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3477              $C$DW$518       .dwtag  DW_TAG_member
    3478                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$24)
    3479                      .dwattr $C$DW$518, DW_AT_name("rsvd_10")
    3480                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_rsvd_10")
    3481                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3482                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3483              $C$DW$519       .dwtag  DW_TAG_member
    3484                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$25)
    3485                      .dwattr $C$DW$519, DW_AT_name("ADCSOCxCTL")
    3486                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3487                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   70

    3488                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    3489              $C$DW$520       .dwtag  DW_TAG_member
    3490                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$25)
    3491                      .dwattr $C$DW$520, DW_AT_name("rsvd_11")
    3492                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_rsvd_11")
    3493                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3494                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    3495              $C$DW$521       .dwtag  DW_TAG_member
    3496                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$24)
    3497                      .dwattr $C$DW$521, DW_AT_name("ADCREFTRIM")
    3498                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3499                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3500                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    3501              $C$DW$522       .dwtag  DW_TAG_member
    3502                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$24)
    3503                      .dwattr $C$DW$522, DW_AT_name("ADCOFFTRIM")
    3504                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3505                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3506                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    3507              $C$DW$523       .dwtag  DW_TAG_member
    3508                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$30)
    3509                      .dwattr $C$DW$523, DW_AT_name("resvd_12")
    3510                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_resvd_12")
    3511                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3512                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    3513              $C$DW$524       .dwtag  DW_TAG_member
    3514                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$24)
    3515                      .dwattr $C$DW$524, DW_AT_name("ADCREV")
    3516                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_ADCREV")
    3517                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3518                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    3519                      .dwendtag $C$DW$T$31
    3520              
    3521              $C$DW$T$192     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3522                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$31)
    3523                      .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    3524              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    3525                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$31)
    3526                      .dwattr $C$DW$T$84, DW_AT_address_class(0x16)
    3527              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3528                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    3529                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3530              
    3531              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3532                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    3533                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    3534              $C$DW$525       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$32)
    3536                      .dwattr $C$DW$525, DW_AT_name("alpha_sf")
    3537                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_alpha_sf")
    3538                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3539                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    3540              $C$DW$526       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$32)
    3542                      .dwattr $C$DW$526, DW_AT_name("beta_sf")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   71

    3543                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_beta_sf")
    3544                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3545                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    3546              $C$DW$527       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$33)
    3548                      .dwattr $C$DW$527, DW_AT_name("numSensors")
    3549                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_numSensors")
    3550                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3551                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    3552                      .dwendtag $C$DW$T$34
    3553              
    3554              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3555                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    3556                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3557              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3558                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    3559                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    3560              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3561                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3562                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3563              
    3564              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3565                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    3566                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    3567              $C$DW$528       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$24)
    3569                      .dwattr $C$DW$528, DW_AT_name("XCLK")
    3570                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_XCLK")
    3571                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3572                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    3573              $C$DW$529       .dwtag  DW_TAG_member
    3574                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$24)
    3575                      .dwattr $C$DW$529, DW_AT_name("rsvd_1")
    3576                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_rsvd_1")
    3577                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3578                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    3579              $C$DW$530       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$24)
    3581                      .dwattr $C$DW$530, DW_AT_name("CLKCTL")
    3582                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_CLKCTL")
    3583                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3584                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    3585              $C$DW$531       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$35)
    3587                      .dwattr $C$DW$531, DW_AT_name("rsvd_2")
    3588                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_rsvd_2")
    3589                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3590                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    3591              $C$DW$532       .dwtag  DW_TAG_member
    3592                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$24)
    3593                      .dwattr $C$DW$532, DW_AT_name("LOSPCP")
    3594                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_LOSPCP")
    3595                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3596                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    3597              $C$DW$533       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   72

    3598                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$24)
    3599                      .dwattr $C$DW$533, DW_AT_name("PCLKCR0")
    3600                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_PCLKCR0")
    3601                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3602                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    3603              $C$DW$534       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$24)
    3605                      .dwattr $C$DW$534, DW_AT_name("PCLKCR1")
    3606                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_PCLKCR1")
    3607                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3608                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    3609              $C$DW$535       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$27)
    3611                      .dwattr $C$DW$535, DW_AT_name("rsvd_3")
    3612                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_rsvd_3")
    3613                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3614                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    3615              $C$DW$536       .dwtag  DW_TAG_member
    3616                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$24)
    3617                      .dwattr $C$DW$536, DW_AT_name("PCLKCR3")
    3618                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_PCLKCR3")
    3619                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3620                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    3621                      .dwendtag $C$DW$T$36
    3622              
    3623              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3624                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$36)
    3625                      .dwattr $C$DW$T$86, DW_AT_address_class(0x16)
    3626              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3627                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3628                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3629              
    3630              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3631                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    3632                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3633              $C$DW$537       .dwtag  DW_TAG_member
    3634                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$33)
    3635                      .dwattr $C$DW$537, DW_AT_name("tmp")
    3636                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_tmp")
    3637                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3638                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    3639                      .dwendtag $C$DW$T$37
    3640              
    3641              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    3642                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$37)
    3643                      .dwattr $C$DW$T$88, DW_AT_address_class(0x16)
    3644              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3645                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    3646                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3647              
    3648              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    3649                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    3650                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    3651              $C$DW$538       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$38)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   73

    3653                      .dwattr $C$DW$538, DW_AT_name("version")
    3654                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_version")
    3655                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3656                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    3657              $C$DW$539       .dwtag  DW_TAG_member
    3658                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$40)
    3659                      .dwattr $C$DW$539, DW_AT_name("state")
    3660                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_state")
    3661                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3662                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    3663              $C$DW$540       .dwtag  DW_TAG_member
    3664                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$40)
    3665                      .dwattr $C$DW$540, DW_AT_name("prevState")
    3666                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_prevState")
    3667                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3668                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    3669              $C$DW$541       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$42)
    3671                      .dwattr $C$DW$541, DW_AT_name("errorCode")
    3672                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_errorCode")
    3673                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3674                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3675              $C$DW$542       .dwtag  DW_TAG_member
    3676                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$44)
    3677                      .dwattr $C$DW$542, DW_AT_name("clarkeHandle_I")
    3678                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3679                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3680                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3681              $C$DW$543       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$45)
    3683                      .dwattr $C$DW$543, DW_AT_name("clarke_I")
    3684                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_clarke_I")
    3685                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3686                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3687              $C$DW$544       .dwtag  DW_TAG_member
    3688                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$44)
    3689                      .dwattr $C$DW$544, DW_AT_name("clarkeHandle_V")
    3690                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3691                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3692                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3693              $C$DW$545       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$45)
    3695                      .dwattr $C$DW$545, DW_AT_name("clarke_V")
    3696                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_clarke_V")
    3697                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3698                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3699              $C$DW$546       .dwtag  DW_TAG_member
    3700                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$47)
    3701                      .dwattr $C$DW$546, DW_AT_name("estHandle")
    3702                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_estHandle")
    3703                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3704                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    3705              $C$DW$547       .dwtag  DW_TAG_member
    3706                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$49)
    3707                      .dwattr $C$DW$547, DW_AT_name("parkHandle")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   74

    3708                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_parkHandle")
    3709                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3710                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3711              $C$DW$548       .dwtag  DW_TAG_member
    3712                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$50)
    3713                      .dwattr $C$DW$548, DW_AT_name("park")
    3714                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_park")
    3715                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3716                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    3717              $C$DW$549       .dwtag  DW_TAG_member
    3718                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$52)
    3719                      .dwattr $C$DW$549, DW_AT_name("pidHandle_Id")
    3720                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_pidHandle_Id")
    3721                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3722                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3723              $C$DW$550       .dwtag  DW_TAG_member
    3724                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$53)
    3725                      .dwattr $C$DW$550, DW_AT_name("pid_Id")
    3726                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_pid_Id")
    3727                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3728                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3729              $C$DW$551       .dwtag  DW_TAG_member
    3730                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$52)
    3731                      .dwattr $C$DW$551, DW_AT_name("pidHandle_Iq")
    3732                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3733                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3734                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3735              $C$DW$552       .dwtag  DW_TAG_member
    3736                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$53)
    3737                      .dwattr $C$DW$552, DW_AT_name("pid_Iq")
    3738                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_pid_Iq")
    3739                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3740                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3741              $C$DW$553       .dwtag  DW_TAG_member
    3742                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$52)
    3743                      .dwattr $C$DW$553, DW_AT_name("pidHandle_spd")
    3744                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_pidHandle_spd")
    3745                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3746                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3747              $C$DW$554       .dwtag  DW_TAG_member
    3748                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$53)
    3749                      .dwattr $C$DW$554, DW_AT_name("pid_spd")
    3750                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_pid_spd")
    3751                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3752                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3753              $C$DW$555       .dwtag  DW_TAG_member
    3754                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$55)
    3755                      .dwattr $C$DW$555, DW_AT_name("iparkHandle")
    3756                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_iparkHandle")
    3757                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3758                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3759              $C$DW$556       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$56)
    3761                      .dwattr $C$DW$556, DW_AT_name("ipark")
    3762                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_ipark")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   75

    3763                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3764                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3765              $C$DW$557       .dwtag  DW_TAG_member
    3766                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$58)
    3767                      .dwattr $C$DW$557, DW_AT_name("svgenHandle")
    3768                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_svgenHandle")
    3769                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3770                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3771              $C$DW$558       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$59)
    3773                      .dwattr $C$DW$558, DW_AT_name("svgen")
    3774                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_svgen")
    3775                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3776                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3777              $C$DW$559       .dwtag  DW_TAG_member
    3778                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$61)
    3779                      .dwattr $C$DW$559, DW_AT_name("trajHandle_Id")
    3780                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_trajHandle_Id")
    3781                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3782                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3783              $C$DW$560       .dwtag  DW_TAG_member
    3784                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$62)
    3785                      .dwattr $C$DW$560, DW_AT_name("traj_Id")
    3786                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_traj_Id")
    3787                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3788                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3789              $C$DW$561       .dwtag  DW_TAG_member
    3790                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$61)
    3791                      .dwattr $C$DW$561, DW_AT_name("trajHandle_spd")
    3792                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_trajHandle_spd")
    3793                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3794                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3795              $C$DW$562       .dwtag  DW_TAG_member
    3796                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$62)
    3797                      .dwattr $C$DW$562, DW_AT_name("traj_spd")
    3798                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_traj_spd")
    3799                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3800                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3801              $C$DW$563       .dwtag  DW_TAG_member
    3802                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$61)
    3803                      .dwattr $C$DW$563, DW_AT_name("trajHandle_spdMax")
    3804                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3805                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3806                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3807              $C$DW$564       .dwtag  DW_TAG_member
    3808                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$62)
    3809                      .dwattr $C$DW$564, DW_AT_name("traj_spdMax")
    3810                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_traj_spdMax")
    3811                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3812                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3813              $C$DW$565       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$63)
    3815                      .dwattr $C$DW$565, DW_AT_name("motorParams")
    3816                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_motorParams")
    3817                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   76

    3818                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3819              $C$DW$566       .dwtag  DW_TAG_member
    3820                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$66)
    3821                      .dwattr $C$DW$566, DW_AT_name("waitTimes")
    3822                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_waitTimes")
    3823                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3824                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3825              $C$DW$567       .dwtag  DW_TAG_member
    3826                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$65)
    3827                      .dwattr $C$DW$567, DW_AT_name("counter_state")
    3828                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_counter_state")
    3829                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3830                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3831              $C$DW$568       .dwtag  DW_TAG_member
    3832                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$67)
    3833                      .dwattr $C$DW$568, DW_AT_name("numIsrTicksPerCtrlTick")
    3834                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3835                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3836                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3837              $C$DW$569       .dwtag  DW_TAG_member
    3838                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$67)
    3839                      .dwattr $C$DW$569, DW_AT_name("numCtrlTicksPerCurrentTick")
    3840                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3841                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3842                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3843              $C$DW$570       .dwtag  DW_TAG_member
    3844                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$67)
    3845                      .dwattr $C$DW$570, DW_AT_name("numCtrlTicksPerSpeedTick")
    3846                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3847                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3848                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3849              $C$DW$571       .dwtag  DW_TAG_member
    3850                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$67)
    3851                      .dwattr $C$DW$571, DW_AT_name("numCtrlTicksPerTrajTick")
    3852                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3853                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3854                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3855              $C$DW$572       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$65)
    3857                      .dwattr $C$DW$572, DW_AT_name("ctrlFreq_Hz")
    3858                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3859                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3860                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3861              $C$DW$573       .dwtag  DW_TAG_member
    3862                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$65)
    3863                      .dwattr $C$DW$573, DW_AT_name("trajFreq_Hz")
    3864                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3865                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3866                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3867              $C$DW$574       .dwtag  DW_TAG_member
    3868                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$32)
    3869                      .dwattr $C$DW$574, DW_AT_name("trajPeriod_sec")
    3870                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3871                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3872                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   77

    3873              $C$DW$575       .dwtag  DW_TAG_member
    3874                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$68)
    3875                      .dwattr $C$DW$575, DW_AT_name("ctrlPeriod_sec")
    3876                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3877                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3878                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3879              $C$DW$576       .dwtag  DW_TAG_member
    3880                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$32)
    3881                      .dwattr $C$DW$576, DW_AT_name("maxVsMag_pu")
    3882                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3883                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3884                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3885              $C$DW$577       .dwtag  DW_TAG_member
    3886                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$69)
    3887                      .dwattr $C$DW$577, DW_AT_name("Iab_in")
    3888                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_Iab_in")
    3889                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3890                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3891              $C$DW$578       .dwtag  DW_TAG_member
    3892                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$69)
    3893                      .dwattr $C$DW$578, DW_AT_name("Iab_filt")
    3894                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_Iab_filt")
    3895                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3896                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3897              $C$DW$579       .dwtag  DW_TAG_member
    3898                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$69)
    3899                      .dwattr $C$DW$579, DW_AT_name("Idq_in")
    3900                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_Idq_in")
    3901                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3902                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3903              $C$DW$580       .dwtag  DW_TAG_member
    3904                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$69)
    3905                      .dwattr $C$DW$580, DW_AT_name("Vab_in")
    3906                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_Vab_in")
    3907                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3908                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3909              $C$DW$581       .dwtag  DW_TAG_member
    3910                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$32)
    3911                      .dwattr $C$DW$581, DW_AT_name("spd_out")
    3912                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_spd_out")
    3913                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3914                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3915              $C$DW$582       .dwtag  DW_TAG_member
    3916                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$69)
    3917                      .dwattr $C$DW$582, DW_AT_name("Vab_out")
    3918                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_Vab_out")
    3919                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3920                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3921              $C$DW$583       .dwtag  DW_TAG_member
    3922                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$69)
    3923                      .dwattr $C$DW$583, DW_AT_name("Vdq_out")
    3924                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_Vdq_out")
    3925                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3926                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3927              $C$DW$584       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   78

    3928                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$68)
    3929                      .dwattr $C$DW$584, DW_AT_name("Rhf")
    3930                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_Rhf")
    3931                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3932                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3933              $C$DW$585       .dwtag  DW_TAG_member
    3934                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$68)
    3935                      .dwattr $C$DW$585, DW_AT_name("Lhf")
    3936                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_Lhf")
    3937                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3938                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3939              $C$DW$586       .dwtag  DW_TAG_member
    3940                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$68)
    3941                      .dwattr $C$DW$586, DW_AT_name("RoverL")
    3942                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_RoverL")
    3943                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3944                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3945              $C$DW$587       .dwtag  DW_TAG_member
    3946                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$32)
    3947                      .dwattr $C$DW$587, DW_AT_name("Kp_Id")
    3948                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_Kp_Id")
    3949                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3950                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3951              $C$DW$588       .dwtag  DW_TAG_member
    3952                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$32)
    3953                      .dwattr $C$DW$588, DW_AT_name("Kp_Iq")
    3954                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_Kp_Iq")
    3955                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3956                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3957              $C$DW$589       .dwtag  DW_TAG_member
    3958                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$32)
    3959                      .dwattr $C$DW$589, DW_AT_name("Kp_spd")
    3960                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_Kp_spd")
    3961                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3962                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3963              $C$DW$590       .dwtag  DW_TAG_member
    3964                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$32)
    3965                      .dwattr $C$DW$590, DW_AT_name("Ki_Id")
    3966                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_Ki_Id")
    3967                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3968                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3969              $C$DW$591       .dwtag  DW_TAG_member
    3970                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$32)
    3971                      .dwattr $C$DW$591, DW_AT_name("Ki_Iq")
    3972                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_Ki_Iq")
    3973                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3974                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3975              $C$DW$592       .dwtag  DW_TAG_member
    3976                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$32)
    3977                      .dwattr $C$DW$592, DW_AT_name("Ki_spd")
    3978                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_Ki_spd")
    3979                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3980                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3981              $C$DW$593       .dwtag  DW_TAG_member
    3982                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   79

    3983                      .dwattr $C$DW$593, DW_AT_name("Kd_Id")
    3984                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_Kd_Id")
    3985                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3986                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3987              $C$DW$594       .dwtag  DW_TAG_member
    3988                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$32)
    3989                      .dwattr $C$DW$594, DW_AT_name("Kd_Iq")
    3990                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_Kd_Iq")
    3991                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3992                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3993              $C$DW$595       .dwtag  DW_TAG_member
    3994                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$32)
    3995                      .dwattr $C$DW$595, DW_AT_name("Kd_spd")
    3996                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_Kd_spd")
    3997                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3998                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3999              $C$DW$596       .dwtag  DW_TAG_member
    4000                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$32)
    4001                      .dwattr $C$DW$596, DW_AT_name("Ui_Id")
    4002                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_Ui_Id")
    4003                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4004                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4005              $C$DW$597       .dwtag  DW_TAG_member
    4006                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$32)
    4007                      .dwattr $C$DW$597, DW_AT_name("Ui_Iq")
    4008                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_Ui_Iq")
    4009                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4010                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4011              $C$DW$598       .dwtag  DW_TAG_member
    4012                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$32)
    4013                      .dwattr $C$DW$598, DW_AT_name("Ui_spd")
    4014                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_Ui_spd")
    4015                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4016                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4017              $C$DW$599       .dwtag  DW_TAG_member
    4018                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$69)
    4019                      .dwattr $C$DW$599, DW_AT_name("Idq_ref")
    4020                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_Idq_ref")
    4021                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4022                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4023              $C$DW$600       .dwtag  DW_TAG_member
    4024                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$32)
    4025                      .dwattr $C$DW$600, DW_AT_name("IdRated")
    4026                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_IdRated")
    4027                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4028                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4029              $C$DW$601       .dwtag  DW_TAG_member
    4030                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$32)
    4031                      .dwattr $C$DW$601, DW_AT_name("spd_ref")
    4032                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_spd_ref")
    4033                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4034                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4035              $C$DW$602       .dwtag  DW_TAG_member
    4036                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$32)
    4037                      .dwattr $C$DW$602, DW_AT_name("spd_max")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   80

    4038                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_spd_max")
    4039                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4040                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4041              $C$DW$603       .dwtag  DW_TAG_member
    4042                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$67)
    4043                      .dwattr $C$DW$603, DW_AT_name("counter_current")
    4044                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_counter_current")
    4045                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4046                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4047              $C$DW$604       .dwtag  DW_TAG_member
    4048                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$67)
    4049                      .dwattr $C$DW$604, DW_AT_name("counter_isr")
    4050                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_counter_isr")
    4051                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4052                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4053              $C$DW$605       .dwtag  DW_TAG_member
    4054                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$67)
    4055                      .dwattr $C$DW$605, DW_AT_name("counter_speed")
    4056                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_counter_speed")
    4057                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4058                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4059              $C$DW$606       .dwtag  DW_TAG_member
    4060                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$67)
    4061                      .dwattr $C$DW$606, DW_AT_name("counter_traj")
    4062                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_counter_traj")
    4063                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4064                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4065              $C$DW$607       .dwtag  DW_TAG_member
    4066                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$70)
    4067                      .dwattr $C$DW$607, DW_AT_name("flag_enableCtrl")
    4068                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4069                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4070                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4071              $C$DW$608       .dwtag  DW_TAG_member
    4072                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$70)
    4073                      .dwattr $C$DW$608, DW_AT_name("flag_enableDcBusComp")
    4074                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4075                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4076                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4077              $C$DW$609       .dwtag  DW_TAG_member
    4078                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$70)
    4079                      .dwattr $C$DW$609, DW_AT_name("flag_enablePowerWarp")
    4080                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4081                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4082                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4083              $C$DW$610       .dwtag  DW_TAG_member
    4084                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$70)
    4085                      .dwattr $C$DW$610, DW_AT_name("flag_enableOffset")
    4086                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_flag_enableOffset")
    4087                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4088                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4089              $C$DW$611       .dwtag  DW_TAG_member
    4090                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$70)
    4091                      .dwattr $C$DW$611, DW_AT_name("flag_enableSpeedCtrl")
    4092                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   81

    4093                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4094                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4095              $C$DW$612       .dwtag  DW_TAG_member
    4096                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$70)
    4097                      .dwattr $C$DW$612, DW_AT_name("flag_enableUserMotorParams")
    4098                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4099                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4100                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4101              $C$DW$613       .dwtag  DW_TAG_member
    4102                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$69)
    4103                      .dwattr $C$DW$613, DW_AT_name("Idq_offset_pu")
    4104                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4105                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4106                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4107              $C$DW$614       .dwtag  DW_TAG_member
    4108                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$69)
    4109                      .dwattr $C$DW$614, DW_AT_name("Vdq_offset_pu")
    4110                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4111                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4112                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4113              $C$DW$615       .dwtag  DW_TAG_member
    4114                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$32)
    4115                      .dwattr $C$DW$615, DW_AT_name("angle_pu")
    4116                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_angle_pu")
    4117                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4118                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4119              $C$DW$616       .dwtag  DW_TAG_member
    4120                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$32)
    4121                      .dwattr $C$DW$616, DW_AT_name("speed_ref_pu")
    4122                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_speed_ref_pu")
    4123                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4124                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4125              $C$DW$617       .dwtag  DW_TAG_member
    4126                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$32)
    4127                      .dwattr $C$DW$617, DW_AT_name("speed_fb_pu")
    4128                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_speed_fb_pu")
    4129                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4130                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4131              $C$DW$618       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$32)
    4133                      .dwattr $C$DW$618, DW_AT_name("speed_outMax_pu")
    4134                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4135                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4136                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4137              $C$DW$619       .dwtag  DW_TAG_member
    4138                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$70)
    4139                      .dwattr $C$DW$619, DW_AT_name("flag_enableCurrentCtrl")
    4140                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4141                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4142                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4143                      .dwendtag $C$DW$T$71
    4144              
    4145              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4146                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$71)
    4147                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   82

    4148              $C$DW$T$194     .dwtag  DW_TAG_pointer_type
    4149                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$193)
    4150                      .dwattr $C$DW$T$194, DW_AT_address_class(0x16)
    4151              $C$DW$T$163     .dwtag  DW_TAG_pointer_type
    4152                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$71)
    4153                      .dwattr $C$DW$T$163, DW_AT_address_class(0x16)
    4154              $C$DW$T$164     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4155                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$163)
    4156                      .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
    4157              $C$DW$620       .dwtag  DW_TAG_TI_far_type
    4158                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$164)
    4159              $C$DW$T$195     .dwtag  DW_TAG_const_type
    4160                      .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$620)
    4161              
    4162              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    4163                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    4164                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    4165              $C$DW$621       .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$23)
    4167                      .dwattr $C$DW$621, DW_AT_name("rsvd")
    4168                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_rsvd")
    4169                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4170                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4171              $C$DW$622       .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$73)
    4173                      .dwattr $C$DW$622, DW_AT_name("targetProc")
    4174                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_targetProc")
    4175                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4176                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4177              $C$DW$623       .dwtag  DW_TAG_member
    4178                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$23)
    4179                      .dwattr $C$DW$623, DW_AT_name("major")
    4180                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_major")
    4181                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4182                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4183              $C$DW$624       .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$23)
    4185                      .dwattr $C$DW$624, DW_AT_name("minor")
    4186                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_minor")
    4187                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4188                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4189                      .dwendtag $C$DW$T$74
    4190              
    4191              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4192                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    4193                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4194              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
    4195                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$38)
    4196                      .dwattr $C$DW$T$203, DW_AT_address_class(0x16)
    4197              
    4198              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4199                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    4200                      .dwattr $C$DW$T$20, DW_AT_declaration
    4201                      .dwendtag $C$DW$T$20
    4202              
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   83

    4203              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4204                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
    4205                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    4206              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4207                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4208                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4209              
    4210              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4211                      .dwattr $C$DW$T$75, DW_AT_name("_FILTER_FO_")
    4212                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x0a)
    4213              $C$DW$625       .dwtag  DW_TAG_member
    4214                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$32)
    4215                      .dwattr $C$DW$625, DW_AT_name("a1")
    4216                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_a1")
    4217                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4218                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4219              $C$DW$626       .dwtag  DW_TAG_member
    4220                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$32)
    4221                      .dwattr $C$DW$626, DW_AT_name("b0")
    4222                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_b0")
    4223                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4224                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4225              $C$DW$627       .dwtag  DW_TAG_member
    4226                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$32)
    4227                      .dwattr $C$DW$627, DW_AT_name("b1")
    4228                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_b1")
    4229                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4230                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4231              $C$DW$628       .dwtag  DW_TAG_member
    4232                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$32)
    4233                      .dwattr $C$DW$628, DW_AT_name("x1")
    4234                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_x1")
    4235                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4236                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4237              $C$DW$629       .dwtag  DW_TAG_member
    4238                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$32)
    4239                      .dwattr $C$DW$629, DW_AT_name("y1")
    4240                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_y1")
    4241                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4242                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4243                      .dwendtag $C$DW$T$75
    4244              
    4245              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4246                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$75)
    4247                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    4248              
    4249              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4250                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    4251                      .dwattr $C$DW$T$21, DW_AT_declaration
    4252                      .dwendtag $C$DW$T$21
    4253              
    4254              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
    4255                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$21)
    4256                      .dwattr $C$DW$T$134, DW_AT_address_class(0x16)
    4257              $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   84

    4258                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    4259                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    4260              
    4261              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4262                      .dwattr $C$DW$T$76, DW_AT_name("_FLASH_Obj_")
    4263                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    4264              $C$DW$630       .dwtag  DW_TAG_member
    4265                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$24)
    4266                      .dwattr $C$DW$630, DW_AT_name("FOPT")
    4267                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_FOPT")
    4268                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4269                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4270              $C$DW$631       .dwtag  DW_TAG_member
    4271                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$24)
    4272                      .dwattr $C$DW$631, DW_AT_name("rsvd_1")
    4273                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_rsvd_1")
    4274                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4275                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4276              $C$DW$632       .dwtag  DW_TAG_member
    4277                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$24)
    4278                      .dwattr $C$DW$632, DW_AT_name("FPWR")
    4279                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_FPWR")
    4280                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4281                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4282              $C$DW$633       .dwtag  DW_TAG_member
    4283                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$24)
    4284                      .dwattr $C$DW$633, DW_AT_name("FSTATUS")
    4285                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_FSTATUS")
    4286                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4287                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4288              $C$DW$634       .dwtag  DW_TAG_member
    4289                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$24)
    4290                      .dwattr $C$DW$634, DW_AT_name("FSTDBYWAIT")
    4291                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4292                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4293                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4294              $C$DW$635       .dwtag  DW_TAG_member
    4295                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$24)
    4296                      .dwattr $C$DW$635, DW_AT_name("FACTIVEWAIT")
    4297                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4298                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4299                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4300              $C$DW$636       .dwtag  DW_TAG_member
    4301                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$24)
    4302                      .dwattr $C$DW$636, DW_AT_name("FBANKWAIT")
    4303                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_FBANKWAIT")
    4304                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4305                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4306              $C$DW$637       .dwtag  DW_TAG_member
    4307                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$24)
    4308                      .dwattr $C$DW$637, DW_AT_name("FOTPWAIT")
    4309                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_FOTPWAIT")
    4310                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4311                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4312                      .dwendtag $C$DW$T$76
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   85

    4313              
    4314              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    4315                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$76)
    4316                      .dwattr $C$DW$T$90, DW_AT_address_class(0x16)
    4317              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4318                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    4319                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    4320              
    4321              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    4322                      .dwattr $C$DW$T$77, DW_AT_name("_FW_Obj_")
    4323                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x14)
    4324              $C$DW$638       .dwtag  DW_TAG_member
    4325                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$64)
    4326                      .dwattr $C$DW$638, DW_AT_name("numIsrTicksPerFwTick")
    4327                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_numIsrTicksPerFwTick")
    4328                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4329                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4330              $C$DW$639       .dwtag  DW_TAG_member
    4331                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$64)
    4332                      .dwattr $C$DW$639, DW_AT_name("counter_fw")
    4333                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_counter_fw")
    4334                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4335                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4336              $C$DW$640       .dwtag  DW_TAG_member
    4337                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$32)
    4338                      .dwattr $C$DW$640, DW_AT_name("delta_inc")
    4339                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_delta_inc")
    4340                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4341                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4342              $C$DW$641       .dwtag  DW_TAG_member
    4343                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$32)
    4344                      .dwattr $C$DW$641, DW_AT_name("delta_dec")
    4345                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_delta_dec")
    4346                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4347                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4348              $C$DW$642       .dwtag  DW_TAG_member
    4349                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$32)
    4350                      .dwattr $C$DW$642, DW_AT_name("refValue")
    4351                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_refValue")
    4352                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4353                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4354              $C$DW$643       .dwtag  DW_TAG_member
    4355                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$32)
    4356                      .dwattr $C$DW$643, DW_AT_name("fbackValue")
    4357                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_fbackValue")
    4358                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4359                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4360              $C$DW$644       .dwtag  DW_TAG_member
    4361                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$32)
    4362                      .dwattr $C$DW$644, DW_AT_name("output")
    4363                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_output")
    4364                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4365                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4366              $C$DW$645       .dwtag  DW_TAG_member
    4367                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   86

    4368                      .dwattr $C$DW$645, DW_AT_name("outMin")
    4369                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_outMin")
    4370                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4371                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4372              $C$DW$646       .dwtag  DW_TAG_member
    4373                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$32)
    4374                      .dwattr $C$DW$646, DW_AT_name("outMax")
    4375                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_outMax")
    4376                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4377                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4378              $C$DW$647       .dwtag  DW_TAG_member
    4379                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$70)
    4380                      .dwattr $C$DW$647, DW_AT_name("flag_enableFw")
    4381                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_flag_enableFw")
    4382                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4383                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4384                      .dwendtag $C$DW$T$77
    4385              
    4386              $C$DW$T$206     .dwtag  DW_TAG_typedef, DW_AT_name("FW_Obj")
    4387                      .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$77)
    4388                      .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    4389              $C$DW$T$207     .dwtag  DW_TAG_pointer_type
    4390                      .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$206)
    4391                      .dwattr $C$DW$T$207, DW_AT_address_class(0x16)
    4392              $C$DW$T$208     .dwtag  DW_TAG_pointer_type
    4393                      .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$77)
    4394                      .dwattr $C$DW$T$208, DW_AT_address_class(0x16)
    4395              $C$DW$T$209     .dwtag  DW_TAG_typedef, DW_AT_name("FW_Handle")
    4396                      .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$208)
    4397                      .dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
    4398              
    4399              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    4400                      .dwattr $C$DW$T$81, DW_AT_name("_GPIO_Obj_")
    4401                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x6a)
    4402              $C$DW$648       .dwtag  DW_TAG_member
    4403                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$78)
    4404                      .dwattr $C$DW$648, DW_AT_name("GPACTRL")
    4405                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_GPACTRL")
    4406                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4407                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4408              $C$DW$649       .dwtag  DW_TAG_member
    4409                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$78)
    4410                      .dwattr $C$DW$649, DW_AT_name("GPAQSEL1")
    4411                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_GPAQSEL1")
    4412                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4413                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4414              $C$DW$650       .dwtag  DW_TAG_member
    4415                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$78)
    4416                      .dwattr $C$DW$650, DW_AT_name("GPAQSEL2")
    4417                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_GPAQSEL2")
    4418                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4419                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4420              $C$DW$651       .dwtag  DW_TAG_member
    4421                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$78)
    4422                      .dwattr $C$DW$651, DW_AT_name("GPAMUX1")
TMS320C2000 Assembler PC v6.2.5 Tue Jun 27 16:56:18 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0727610                              PAGE   87

    4423                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_GPAMUX1")
    4424                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4425                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4426              $C$DW$652       .dwtag  DW_TAG_member
    4427                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$78)
    4428                      .dwattr $C$DW$652, DW_AT_name("GPAMUX2")
    4429                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_GPAMUX2")
    4430                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4431                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4432              $C$DW$653       .dwtag  DW_TAG_member
    4433                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$78)
    4434                      .dwattr $C$DW$653, DW_AT_name("GPADIR")
    4435                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_GPADIR")
    4436                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4437                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4438              $C$DW$654       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$78)
    4440                      .dwattr $C$DW$654, DW_AT_name("GPAPUD")
    4441                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_GPAPUD")
    4442                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4443                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4444              $C$DW$655       .dwtag  DW_TAG_member
    4445                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$27)
    4446                      .dwattr $C$DW$655, DW_AT_name("rsvd_1")
    4447                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_rsvd_1")
    4448                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4449                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4450              $C$DW$656       .dwtag  DW_TAG_member
    4451                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$78)
    4452                      .dwattr $C$DW$656, DW_AT_name("GPBCTRL")
    4453                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_GPBCTRL")
    4454                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4455                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4456              $C$DW$657       .dwtag  DW_TAG_member
    4457                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$78)
    4458                      .dwattr $C$DW$657, DW_AT_name("GPBQSEL1")
    4459                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_GPBQSEL1")
    4460                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4461                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4462              $C$DW$658       .dwtag  DW_TAG_member
    4463                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$27)
    4464                      .dwattr $C$DW$658, DW_AT_name("rsvd_2")
    4465                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_rsvd_2")
    4466                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4467                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4468              $C$DW$659       .dwtag  DW_TAG_member
    4469                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$78)
