TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.3.LTS *
       3              ;* Date/Time created: Wed Jun 28 11:48:12 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("/home/wmj/Documents/motor/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.3.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/home/wmj/Documents/motor/sw/solutions/instaspin_foc/boards/hvkit_r
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    7679              $C$DW$625       .dwtag  DW_TAG_enumerator
    7680                      .dwattr $C$DW$625, DW_AT_name("EST_State_IdRated")
    7681                      .dwattr $C$DW$625, DW_AT_const_value(0x05)
    7682              
    7683              $C$DW$626       .dwtag  DW_TAG_enumerator
    7684                      .dwattr $C$DW$626, DW_AT_name("EST_State_RatedFlux_OL")
    7685                      .dwattr $C$DW$626, DW_AT_const_value(0x06)
    7686              
    7687              $C$DW$627       .dwtag  DW_TAG_enumerator
    7688                      .dwattr $C$DW$627, DW_AT_name("EST_State_RatedFlux")
    7689                      .dwattr $C$DW$627, DW_AT_const_value(0x07)
    7690              
    7691              $C$DW$628       .dwtag  DW_TAG_enumerator
    7692                      .dwattr $C$DW$628, DW_AT_name("EST_State_RampDown")
    7693                      .dwattr $C$DW$628, DW_AT_const_value(0x08)
    7694              
    7695              $C$DW$629       .dwtag  DW_TAG_enumerator
    7696                      .dwattr $C$DW$629, DW_AT_name("EST_State_LockRotor")
    7697                      .dwattr $C$DW$629, DW_AT_const_value(0x09)
    7698              
    7699              $C$DW$630       .dwtag  DW_TAG_enumerator
    7700                      .dwattr $C$DW$630, DW_AT_name("EST_State_Ls")
    7701                      .dwattr $C$DW$630, DW_AT_const_value(0x0a)
    7702              
    7703              $C$DW$631       .dwtag  DW_TAG_enumerator
    7704                      .dwattr $C$DW$631, DW_AT_name("EST_State_Rr")
    7705                      .dwattr $C$DW$631, DW_AT_const_value(0x0b)
    7706              
    7707              $C$DW$632       .dwtag  DW_TAG_enumerator
    7708                      .dwattr $C$DW$632, DW_AT_name("EST_State_MotorIdentified")
    7709                      .dwattr $C$DW$632, DW_AT_const_value(0x0c)
    7710              
    7711              $C$DW$633       .dwtag  DW_TAG_enumerator
    7712                      .dwattr $C$DW$633, DW_AT_name("EST_State_OnLine")
    7713                      .dwattr $C$DW$633, DW_AT_const_value(0x0d)
    7714              
    7715              $C$DW$634       .dwtag  DW_TAG_enumerator
    7716                      .dwattr $C$DW$634, DW_AT_name("EST_numStates")
    7717                      .dwattr $C$DW$634, DW_AT_const_value(0x0e)
    7718              
    7719                      .dwendtag $C$DW$T$165
    7720              
    7721              $C$DW$T$166     .dwtag  DW_TAG_typedef
    7722                      .dwattr $C$DW$T$166, DW_AT_name("EST_State_e")
    7723                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$165)
    7724                      .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    7725              
    7726              
    7727              $C$DW$T$170     .dwtag  DW_TAG_enumeration_type
    7728                      .dwattr $C$DW$T$170, DW_AT_byte_size(0x01)
    7729              $C$DW$635       .dwtag  DW_TAG_enumerator
    7730                      .dwattr $C$DW$635, DW_AT_name("CTRL_Type_PID_spd")
    7731                      .dwattr $C$DW$635, DW_AT_const_value(0x00)
    7732              
    7733              $C$DW$636       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  148

    7734                      .dwattr $C$DW$636, DW_AT_name("CTRL_Type_PID_Id")
    7735                      .dwattr $C$DW$636, DW_AT_const_value(0x01)
    7736              
    7737              $C$DW$637       .dwtag  DW_TAG_enumerator
    7738                      .dwattr $C$DW$637, DW_AT_name("CTRL_Type_PID_Iq")
    7739                      .dwattr $C$DW$637, DW_AT_const_value(0x02)
    7740              
    7741                      .dwendtag $C$DW$T$170
    7742              
    7743              $C$DW$T$171     .dwtag  DW_TAG_typedef
    7744                      .dwattr $C$DW$T$171, DW_AT_name("CTRL_Type_e")
    7745                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$170)
    7746                      .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    7747              
    7748              $C$DW$638       .dwtag  DW_TAG_TI_far_type
    7749                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$171)
    7750              
    7751              $C$DW$T$172     .dwtag  DW_TAG_const_type
    7752                      .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$638)
    7753              
    7754              
    7755              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7756                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    7757                      .dwattr $C$DW$T$19, DW_AT_declaration
    7758                      .dwendtag $C$DW$T$19
    7759              
    7760              $C$DW$T$112     .dwtag  DW_TAG_pointer_type
    7761                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$19)
    7762                      .dwattr $C$DW$T$112, DW_AT_address_class(0x20)
    7763              
    7764              $C$DW$T$113     .dwtag  DW_TAG_typedef
    7765                      .dwattr $C$DW$T$113, DW_AT_name("I2C_Handle")
    7766                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    7767                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    7768              
    7769              
    7770              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    7771                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    7772                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    7773              $C$DW$639       .dwtag  DW_TAG_member
    7774                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$25)
    7775                      .dwattr $C$DW$639, DW_AT_name("ADCRESULT")
    7776                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_ADCRESULT")
    7777                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7778                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    7779              
    7780              $C$DW$640       .dwtag  DW_TAG_member
    7781                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$26)
    7782                      .dwattr $C$DW$640, DW_AT_name("resvd_1")
    7783                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_resvd_1")
    7784                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7785                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    7786              
    7787              $C$DW$641       .dwtag  DW_TAG_member
    7788                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  149

    7789                      .dwattr $C$DW$641, DW_AT_name("ADCCTL1")
    7790                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_ADCCTL1")
    7791                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    7792                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    7793              
    7794              $C$DW$642       .dwtag  DW_TAG_member
    7795                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$24)
    7796                      .dwattr $C$DW$642, DW_AT_name("ADCCTL2")
    7797                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_ADCCTL2")
    7798                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    7799                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    7800              
    7801              $C$DW$643       .dwtag  DW_TAG_member
    7802                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$27)
    7803                      .dwattr $C$DW$643, DW_AT_name("rsvd_2")
    7804                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_rsvd_2")
    7805                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    7806                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    7807              
    7808              $C$DW$644       .dwtag  DW_TAG_member
    7809                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$24)
    7810                      .dwattr $C$DW$644, DW_AT_name("ADCINTFLG")
    7811                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_ADCINTFLG")
    7812                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    7813                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    7814              
    7815              $C$DW$645       .dwtag  DW_TAG_member
    7816                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$24)
    7817                      .dwattr $C$DW$645, DW_AT_name("ADCINTFLGCLR")
    7818                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    7819                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    7820                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    7821              
    7822              $C$DW$646       .dwtag  DW_TAG_member
    7823                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$24)
    7824                      .dwattr $C$DW$646, DW_AT_name("ADCINTOVF")
    7825                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_ADCINTOVF")
    7826                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    7827                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    7828              
    7829              $C$DW$647       .dwtag  DW_TAG_member
    7830                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$24)
    7831                      .dwattr $C$DW$647, DW_AT_name("ADCINTOVFCLR")
    7832                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    7833                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    7834                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    7835              
    7836              $C$DW$648       .dwtag  DW_TAG_member
    7837                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$28)
    7838                      .dwattr $C$DW$648, DW_AT_name("INTSELxNy")
    7839                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_INTSELxNy")
    7840                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    7841                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    7842              
    7843              $C$DW$649       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  150

    7844                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$29)
    7845                      .dwattr $C$DW$649, DW_AT_name("rsvd_3")
    7846                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_rsvd_3")
    7847                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    7848                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    7849              
    7850              $C$DW$650       .dwtag  DW_TAG_member
    7851                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$24)
    7852                      .dwattr $C$DW$650, DW_AT_name("SOCPRICTRL")
    7853                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_SOCPRICTRL")
    7854                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    7855                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    7856              
    7857              $C$DW$651       .dwtag  DW_TAG_member
    7858                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$24)
    7859                      .dwattr $C$DW$651, DW_AT_name("rsvd_4")
    7860                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_rsvd_4")
    7861                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    7862                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    7863              
    7864              $C$DW$652       .dwtag  DW_TAG_member
    7865                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$24)
    7866                      .dwattr $C$DW$652, DW_AT_name("ADCSAMPLEMODE")
    7867                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    7868                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    7869                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    7870              
    7871              $C$DW$653       .dwtag  DW_TAG_member
    7872                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$24)
    7873                      .dwattr $C$DW$653, DW_AT_name("rsvd_5")
    7874                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_rsvd_5")
    7875                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    7876                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    7877              
    7878              $C$DW$654       .dwtag  DW_TAG_member
    7879                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$24)
    7880                      .dwattr $C$DW$654, DW_AT_name("ADCINTSOCSEL1")
    7881                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    7882                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    7883                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    7884              
    7885              $C$DW$655       .dwtag  DW_TAG_member
    7886                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$24)
    7887                      .dwattr $C$DW$655, DW_AT_name("ADCINTSOCSEL2")
    7888                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    7889                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    7890                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    7891              
    7892              $C$DW$656       .dwtag  DW_TAG_member
    7893                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$27)
    7894                      .dwattr $C$DW$656, DW_AT_name("rsvd_6")
    7895                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_rsvd_6")
    7896                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    7897                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    7898              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  151

    7899              $C$DW$657       .dwtag  DW_TAG_member
    7900                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$24)
    7901                      .dwattr $C$DW$657, DW_AT_name("ADCSOCFLG1")
    7902                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    7903                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    7904                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    7905              
    7906              $C$DW$658       .dwtag  DW_TAG_member
    7907                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$24)
    7908                      .dwattr $C$DW$658, DW_AT_name("rsvd_7")
    7909                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_rsvd_7")
    7910                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    7911                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    7912              
    7913              $C$DW$659       .dwtag  DW_TAG_member
    7914                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$24)
    7915                      .dwattr $C$DW$659, DW_AT_name("ADCSOCFRC1")
    7916                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    7917                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    7918                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    7919              
    7920              $C$DW$660       .dwtag  DW_TAG_member
    7921                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$24)
    7922                      .dwattr $C$DW$660, DW_AT_name("rsvd_8")
    7923                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_rsvd_8")
    7924                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    7925                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    7926              
    7927              $C$DW$661       .dwtag  DW_TAG_member
    7928                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$24)
    7929                      .dwattr $C$DW$661, DW_AT_name("ADCSOCOVF1")
    7930                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    7931                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    7932                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    7933              
    7934              $C$DW$662       .dwtag  DW_TAG_member
    7935                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$24)
    7936                      .dwattr $C$DW$662, DW_AT_name("rsvd_9")
    7937                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_rsvd_9")
    7938                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    7939                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    7940              
    7941              $C$DW$663       .dwtag  DW_TAG_member
    7942                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$24)
    7943                      .dwattr $C$DW$663, DW_AT_name("ADCSOCOVFCLR1")
    7944                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    7945                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    7946                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    7947              
    7948              $C$DW$664       .dwtag  DW_TAG_member
    7949                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$24)
    7950                      .dwattr $C$DW$664, DW_AT_name("rsvd_10")
    7951                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_rsvd_10")
    7952                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    7953                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  152

    7954              
    7955              $C$DW$665       .dwtag  DW_TAG_member
    7956                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$25)
    7957                      .dwattr $C$DW$665, DW_AT_name("ADCSOCxCTL")
    7958                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    7959                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    7960                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    7961              
    7962              $C$DW$666       .dwtag  DW_TAG_member
    7963                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$25)
    7964                      .dwattr $C$DW$666, DW_AT_name("rsvd_11")
    7965                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_rsvd_11")
    7966                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    7967                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    7968              
    7969              $C$DW$667       .dwtag  DW_TAG_member
    7970                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$24)
    7971                      .dwattr $C$DW$667, DW_AT_name("ADCREFTRIM")
    7972                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_ADCREFTRIM")
    7973                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    7974                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    7975              
    7976              $C$DW$668       .dwtag  DW_TAG_member
    7977                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$24)
    7978                      .dwattr $C$DW$668, DW_AT_name("ADCOFFTRIM")
    7979                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    7980                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    7981                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    7982              
    7983              $C$DW$669       .dwtag  DW_TAG_member
    7984                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$30)
    7985                      .dwattr $C$DW$669, DW_AT_name("resvd_12")
    7986                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_resvd_12")
    7987                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    7988                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    7989              
    7990              $C$DW$670       .dwtag  DW_TAG_member
    7991                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$24)
    7992                      .dwattr $C$DW$670, DW_AT_name("ADCREV")
    7993                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ADCREV")
    7994                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    7995                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    7996              
    7997                      .dwendtag $C$DW$T$31
    7998              
    7999              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    8000                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$31)
    8001                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
    8002              
    8003              $C$DW$T$84      .dwtag  DW_TAG_typedef
    8004                      .dwattr $C$DW$T$84, DW_AT_name("ADC_Handle")
    8005                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    8006                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    8007              
    8008              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  153

    8009              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8010                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    8011                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    8012              $C$DW$671       .dwtag  DW_TAG_member
    8013                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$32)
    8014                      .dwattr $C$DW$671, DW_AT_name("alpha_sf")
    8015                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_alpha_sf")
    8016                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8017                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    8018              
    8019              $C$DW$672       .dwtag  DW_TAG_member
    8020                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$32)
    8021                      .dwattr $C$DW$672, DW_AT_name("beta_sf")
    8022                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_beta_sf")
    8023                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8024                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    8025              
    8026              $C$DW$673       .dwtag  DW_TAG_member
    8027                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$33)
    8028                      .dwattr $C$DW$673, DW_AT_name("numSensors")
    8029                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_numSensors")
    8030                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8031                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    8032              
    8033                      .dwendtag $C$DW$T$34
    8034              
    8035              $C$DW$T$45      .dwtag  DW_TAG_typedef
    8036                      .dwattr $C$DW$T$45, DW_AT_name("CLARKE_Obj")
    8037                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    8038                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    8039              
    8040              $C$DW$T$173     .dwtag  DW_TAG_pointer_type
    8041                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$45)
    8042                      .dwattr $C$DW$T$173, DW_AT_address_class(0x20)
    8043              
    8044              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    8045                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    8046                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    8047              
    8048              $C$DW$T$44      .dwtag  DW_TAG_typedef
    8049                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Handle")
    8050                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    8051                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    8052              
    8053              
    8054              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    8055                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    8056                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    8057              $C$DW$674       .dwtag  DW_TAG_member
    8058                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$24)
    8059                      .dwattr $C$DW$674, DW_AT_name("XCLK")
    8060                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_XCLK")
    8061                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8062                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    8063              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  154

    8064              $C$DW$675       .dwtag  DW_TAG_member
    8065                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$24)
    8066                      .dwattr $C$DW$675, DW_AT_name("rsvd_1")
    8067                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_rsvd_1")
    8068                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8069                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    8070              
    8071              $C$DW$676       .dwtag  DW_TAG_member
    8072                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$24)
    8073                      .dwattr $C$DW$676, DW_AT_name("CLKCTL")
    8074                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_CLKCTL")
    8075                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8076                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    8077              
    8078              $C$DW$677       .dwtag  DW_TAG_member
    8079                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$35)
    8080                      .dwattr $C$DW$677, DW_AT_name("rsvd_2")
    8081                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_rsvd_2")
    8082                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8083                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    8084              
    8085              $C$DW$678       .dwtag  DW_TAG_member
    8086                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$24)
    8087                      .dwattr $C$DW$678, DW_AT_name("LOSPCP")
    8088                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_LOSPCP")
    8089                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8090                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    8091              
    8092              $C$DW$679       .dwtag  DW_TAG_member
    8093                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$24)
    8094                      .dwattr $C$DW$679, DW_AT_name("PCLKCR0")
    8095                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_PCLKCR0")
    8096                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8097                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    8098              
    8099              $C$DW$680       .dwtag  DW_TAG_member
    8100                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$24)
    8101                      .dwattr $C$DW$680, DW_AT_name("PCLKCR1")
    8102                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_PCLKCR1")
    8103                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8104                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    8105              
    8106              $C$DW$681       .dwtag  DW_TAG_member
    8107                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$27)
    8108                      .dwattr $C$DW$681, DW_AT_name("rsvd_3")
    8109                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_rsvd_3")
    8110                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8111                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    8112              
    8113              $C$DW$682       .dwtag  DW_TAG_member
    8114                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$24)
    8115                      .dwattr $C$DW$682, DW_AT_name("PCLKCR3")
    8116                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_PCLKCR3")
    8117                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8118                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  155

    8119              
    8120                      .dwendtag $C$DW$T$36
    8121              
    8122              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    8123                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$36)
    8124                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
    8125              
    8126              $C$DW$T$86      .dwtag  DW_TAG_typedef
    8127                      .dwattr $C$DW$T$86, DW_AT_name("CLK_Handle")
    8128                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    8129                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    8130              
    8131              
    8132              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    8133                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    8134                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    8135              $C$DW$683       .dwtag  DW_TAG_member
    8136                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$33)
    8137                      .dwattr $C$DW$683, DW_AT_name("tmp")
    8138                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_tmp")
    8139                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8140                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    8141              
    8142                      .dwendtag $C$DW$T$37
    8143              
    8144              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    8145                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$37)
    8146                      .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
    8147              
    8148              $C$DW$T$88      .dwtag  DW_TAG_typedef
    8149                      .dwattr $C$DW$T$88, DW_AT_name("CPU_Handle")
    8150                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    8151                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    8152              
    8153              
    8154              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    8155                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    8156                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    8157              $C$DW$684       .dwtag  DW_TAG_member
    8158                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$38)
    8159                      .dwattr $C$DW$684, DW_AT_name("version")
    8160                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_version")
    8161                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8162                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    8163              
    8164              $C$DW$685       .dwtag  DW_TAG_member
    8165                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$40)
    8166                      .dwattr $C$DW$685, DW_AT_name("state")
    8167                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_state")
    8168                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8169                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    8170              
    8171              $C$DW$686       .dwtag  DW_TAG_member
    8172                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$40)
    8173                      .dwattr $C$DW$686, DW_AT_name("prevState")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  156

    8174                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_prevState")
    8175                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8176                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    8177              
    8178              $C$DW$687       .dwtag  DW_TAG_member
    8179                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$42)
    8180                      .dwattr $C$DW$687, DW_AT_name("errorCode")
    8181                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_errorCode")
    8182                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8183                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    8184              
    8185              $C$DW$688       .dwtag  DW_TAG_member
    8186                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$44)
    8187                      .dwattr $C$DW$688, DW_AT_name("clarkeHandle_I")
    8188                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_clarkeHandle_I")
    8189                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8190                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    8191              
    8192              $C$DW$689       .dwtag  DW_TAG_member
    8193                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$45)
    8194                      .dwattr $C$DW$689, DW_AT_name("clarke_I")
    8195                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_clarke_I")
    8196                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8197                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8198              
    8199              $C$DW$690       .dwtag  DW_TAG_member
    8200                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$44)
    8201                      .dwattr $C$DW$690, DW_AT_name("clarkeHandle_V")
    8202                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_clarkeHandle_V")
    8203                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8204                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8205              
    8206              $C$DW$691       .dwtag  DW_TAG_member
    8207                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$45)
    8208                      .dwattr $C$DW$691, DW_AT_name("clarke_V")
    8209                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_clarke_V")
    8210                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8211                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8212              
    8213              $C$DW$692       .dwtag  DW_TAG_member
    8214                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$47)
    8215                      .dwattr $C$DW$692, DW_AT_name("estHandle")
    8216                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_estHandle")
    8217                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8218                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8219              
    8220              $C$DW$693       .dwtag  DW_TAG_member
    8221                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$49)
    8222                      .dwattr $C$DW$693, DW_AT_name("parkHandle")
    8223                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_parkHandle")
    8224                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8225                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8226              
    8227              $C$DW$694       .dwtag  DW_TAG_member
    8228                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$50)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  157

    8229                      .dwattr $C$DW$694, DW_AT_name("park")
    8230                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_park")
    8231                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8232                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8233              
    8234              $C$DW$695       .dwtag  DW_TAG_member
    8235                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$52)
    8236                      .dwattr $C$DW$695, DW_AT_name("pidHandle_Id")
    8237                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_pidHandle_Id")
    8238                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8239                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8240              
    8241              $C$DW$696       .dwtag  DW_TAG_member
    8242                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$53)
    8243                      .dwattr $C$DW$696, DW_AT_name("pid_Id")
    8244                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_pid_Id")
    8245                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8246                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8247              
    8248              $C$DW$697       .dwtag  DW_TAG_member
    8249                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$52)
    8250                      .dwattr $C$DW$697, DW_AT_name("pidHandle_Iq")
    8251                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_pidHandle_Iq")
    8252                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8253                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8254              
    8255              $C$DW$698       .dwtag  DW_TAG_member
    8256                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$53)
    8257                      .dwattr $C$DW$698, DW_AT_name("pid_Iq")
    8258                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_pid_Iq")
    8259                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8260                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8261              
    8262              $C$DW$699       .dwtag  DW_TAG_member
    8263                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$52)
    8264                      .dwattr $C$DW$699, DW_AT_name("pidHandle_spd")
    8265                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_pidHandle_spd")
    8266                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8267                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8268              
    8269              $C$DW$700       .dwtag  DW_TAG_member
    8270                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$53)
    8271                      .dwattr $C$DW$700, DW_AT_name("pid_spd")
    8272                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_pid_spd")
    8273                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8274                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8275              
    8276              $C$DW$701       .dwtag  DW_TAG_member
    8277                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$55)
    8278                      .dwattr $C$DW$701, DW_AT_name("iparkHandle")
    8279                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_iparkHandle")
    8280                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8281                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8282              
    8283              $C$DW$702       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  158

    8284                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$56)
    8285                      .dwattr $C$DW$702, DW_AT_name("ipark")
    8286                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_ipark")
    8287                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8288                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8289              
    8290              $C$DW$703       .dwtag  DW_TAG_member
    8291                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$58)
    8292                      .dwattr $C$DW$703, DW_AT_name("svgenHandle")
    8293                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_svgenHandle")
    8294                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8295                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8296              
    8297              $C$DW$704       .dwtag  DW_TAG_member
    8298                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$59)
    8299                      .dwattr $C$DW$704, DW_AT_name("svgen")
    8300                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_svgen")
    8301                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8302                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8303              
    8304              $C$DW$705       .dwtag  DW_TAG_member
    8305                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$61)
    8306                      .dwattr $C$DW$705, DW_AT_name("trajHandle_Id")
    8307                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_trajHandle_Id")
    8308                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8309                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8310              
    8311              $C$DW$706       .dwtag  DW_TAG_member
    8312                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$62)
    8313                      .dwattr $C$DW$706, DW_AT_name("traj_Id")
    8314                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_traj_Id")
    8315                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    8316                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8317              
    8318              $C$DW$707       .dwtag  DW_TAG_member
    8319                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$61)
    8320                      .dwattr $C$DW$707, DW_AT_name("trajHandle_spd")
    8321                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_trajHandle_spd")
    8322                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8323                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8324              
    8325              $C$DW$708       .dwtag  DW_TAG_member
    8326                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$62)
    8327                      .dwattr $C$DW$708, DW_AT_name("traj_spd")
    8328                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_traj_spd")
    8329                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    8330                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8331              
    8332              $C$DW$709       .dwtag  DW_TAG_member
    8333                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$61)
    8334                      .dwattr $C$DW$709, DW_AT_name("trajHandle_spdMax")
    8335                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    8336                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8337                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8338              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  159

    8339              $C$DW$710       .dwtag  DW_TAG_member
    8340                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$62)
    8341                      .dwattr $C$DW$710, DW_AT_name("traj_spdMax")
    8342                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_traj_spdMax")
    8343                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8344                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8345              
    8346              $C$DW$711       .dwtag  DW_TAG_member
    8347                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$63)
    8348                      .dwattr $C$DW$711, DW_AT_name("motorParams")
    8349                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_motorParams")
    8350                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    8351                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8352              
    8353              $C$DW$712       .dwtag  DW_TAG_member
    8354                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$66)
    8355                      .dwattr $C$DW$712, DW_AT_name("waitTimes")
    8356                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_waitTimes")
    8357                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8358                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8359              
    8360              $C$DW$713       .dwtag  DW_TAG_member
    8361                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$65)
    8362                      .dwattr $C$DW$713, DW_AT_name("counter_state")
    8363                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_counter_state")
    8364                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    8365                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8366              
    8367              $C$DW$714       .dwtag  DW_TAG_member
    8368                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$67)
    8369                      .dwattr $C$DW$714, DW_AT_name("numIsrTicksPerCtrlTick")
    8370                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    8371                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    8372                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8373              
    8374              $C$DW$715       .dwtag  DW_TAG_member
    8375                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$67)
    8376                      .dwattr $C$DW$715, DW_AT_name("numCtrlTicksPerCurrentTick")
    8377                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    8378                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    8379                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8380              
    8381              $C$DW$716       .dwtag  DW_TAG_member
    8382                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$67)
    8383                      .dwattr $C$DW$716, DW_AT_name("numCtrlTicksPerSpeedTick")
    8384                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    8385                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    8386                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8387              
    8388              $C$DW$717       .dwtag  DW_TAG_member
    8389                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$67)
    8390                      .dwattr $C$DW$717, DW_AT_name("numCtrlTicksPerTrajTick")
    8391                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    8392                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    8393                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  160

    8394              
    8395              $C$DW$718       .dwtag  DW_TAG_member
    8396                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$65)
    8397                      .dwattr $C$DW$718, DW_AT_name("ctrlFreq_Hz")
    8398                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    8399                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8400                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8401              
    8402              $C$DW$719       .dwtag  DW_TAG_member
    8403                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$65)
    8404                      .dwattr $C$DW$719, DW_AT_name("trajFreq_Hz")
    8405                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_trajFreq_Hz")
    8406                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8407                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8408              
    8409              $C$DW$720       .dwtag  DW_TAG_member
    8410                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$32)
    8411                      .dwattr $C$DW$720, DW_AT_name("trajPeriod_sec")
    8412                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_trajPeriod_sec")
    8413                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8414                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8415              
    8416              $C$DW$721       .dwtag  DW_TAG_member
    8417                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$68)
    8418                      .dwattr $C$DW$721, DW_AT_name("ctrlPeriod_sec")
    8419                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    8420                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    8421                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8422              
    8423              $C$DW$722       .dwtag  DW_TAG_member
    8424                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$32)
    8425                      .dwattr $C$DW$722, DW_AT_name("maxVsMag_pu")
    8426                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_maxVsMag_pu")
    8427                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8428                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8429              
    8430              $C$DW$723       .dwtag  DW_TAG_member
    8431                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$69)
    8432                      .dwattr $C$DW$723, DW_AT_name("Iab_in")
    8433                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_Iab_in")
    8434                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    8435                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8436              
    8437              $C$DW$724       .dwtag  DW_TAG_member
    8438                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$69)
    8439                      .dwattr $C$DW$724, DW_AT_name("Iab_filt")
    8440                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_Iab_filt")
    8441                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    8442                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8443              
    8444              $C$DW$725       .dwtag  DW_TAG_member
    8445                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$69)
    8446                      .dwattr $C$DW$725, DW_AT_name("Idq_in")
    8447                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_Idq_in")
    8448                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  161

    8449                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8450              
    8451              $C$DW$726       .dwtag  DW_TAG_member
    8452                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$69)
    8453                      .dwattr $C$DW$726, DW_AT_name("Vab_in")
    8454                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_Vab_in")
    8455                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    8456                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8457              
    8458              $C$DW$727       .dwtag  DW_TAG_member
    8459                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$32)
    8460                      .dwattr $C$DW$727, DW_AT_name("spd_out")
    8461                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_spd_out")
    8462                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    8463                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8464              
    8465              $C$DW$728       .dwtag  DW_TAG_member
    8466                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$69)
    8467                      .dwattr $C$DW$728, DW_AT_name("Vab_out")
    8468                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_Vab_out")
    8469                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    8470                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8471              
    8472              $C$DW$729       .dwtag  DW_TAG_member
    8473                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$69)
    8474                      .dwattr $C$DW$729, DW_AT_name("Vdq_out")
    8475                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_Vdq_out")
    8476                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    8477                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8478              
    8479              $C$DW$730       .dwtag  DW_TAG_member
    8480                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$68)
    8481                      .dwattr $C$DW$730, DW_AT_name("Rhf")
    8482                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_Rhf")
    8483                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    8484                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8485              
    8486              $C$DW$731       .dwtag  DW_TAG_member
    8487                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$68)
    8488                      .dwattr $C$DW$731, DW_AT_name("Lhf")
    8489                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_Lhf")
    8490                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    8491                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8492              
    8493              $C$DW$732       .dwtag  DW_TAG_member
    8494                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$68)
    8495                      .dwattr $C$DW$732, DW_AT_name("RoverL")
    8496                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_RoverL")
    8497                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    8498                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8499              
    8500              $C$DW$733       .dwtag  DW_TAG_member
    8501                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$32)
    8502                      .dwattr $C$DW$733, DW_AT_name("Kp_Id")
    8503                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_Kp_Id")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  162

    8504                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    8505                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8506              
    8507              $C$DW$734       .dwtag  DW_TAG_member
    8508                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$32)
    8509                      .dwattr $C$DW$734, DW_AT_name("Kp_Iq")
    8510                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_Kp_Iq")
    8511                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8512                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8513              
    8514              $C$DW$735       .dwtag  DW_TAG_member
    8515                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$32)
    8516                      .dwattr $C$DW$735, DW_AT_name("Kp_spd")
    8517                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_Kp_spd")
    8518                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    8519                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8520              
    8521              $C$DW$736       .dwtag  DW_TAG_member
    8522                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$32)
    8523                      .dwattr $C$DW$736, DW_AT_name("Ki_Id")
    8524                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_Ki_Id")
    8525                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    8526                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8527              
    8528              $C$DW$737       .dwtag  DW_TAG_member
    8529                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$32)
    8530                      .dwattr $C$DW$737, DW_AT_name("Ki_Iq")
    8531                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_Ki_Iq")
    8532                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    8533                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8534              
    8535              $C$DW$738       .dwtag  DW_TAG_member
    8536                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$32)
    8537                      .dwattr $C$DW$738, DW_AT_name("Ki_spd")
    8538                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_Ki_spd")
    8539                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8540                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8541              
    8542              $C$DW$739       .dwtag  DW_TAG_member
    8543                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$32)
    8544                      .dwattr $C$DW$739, DW_AT_name("Kd_Id")
    8545                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_Kd_Id")
    8546                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    8547                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8548              
    8549              $C$DW$740       .dwtag  DW_TAG_member
    8550                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$32)
    8551                      .dwattr $C$DW$740, DW_AT_name("Kd_Iq")
    8552                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_Kd_Iq")
    8553                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    8554                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8555              
    8556              $C$DW$741       .dwtag  DW_TAG_member
    8557                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$32)
    8558                      .dwattr $C$DW$741, DW_AT_name("Kd_spd")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  163

    8559                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_Kd_spd")
    8560                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    8561                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8562              
    8563              $C$DW$742       .dwtag  DW_TAG_member
    8564                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$32)
    8565                      .dwattr $C$DW$742, DW_AT_name("Ui_Id")
    8566                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_Ui_Id")
    8567                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8568                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8569              
    8570              $C$DW$743       .dwtag  DW_TAG_member
    8571                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$32)
    8572                      .dwattr $C$DW$743, DW_AT_name("Ui_Iq")
    8573                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_Ui_Iq")
    8574                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    8575                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8576              
    8577              $C$DW$744       .dwtag  DW_TAG_member
    8578                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$32)
    8579                      .dwattr $C$DW$744, DW_AT_name("Ui_spd")
    8580                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_Ui_spd")
    8581                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    8582                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8583              
    8584              $C$DW$745       .dwtag  DW_TAG_member
    8585                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$69)
    8586                      .dwattr $C$DW$745, DW_AT_name("Idq_ref")
    8587                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Idq_ref")
    8588                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    8589                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8590              
    8591              $C$DW$746       .dwtag  DW_TAG_member
    8592                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$32)
    8593                      .dwattr $C$DW$746, DW_AT_name("IdRated")
    8594                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_IdRated")
    8595                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    8596                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8597              
    8598              $C$DW$747       .dwtag  DW_TAG_member
    8599                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$32)
    8600                      .dwattr $C$DW$747, DW_AT_name("spd_ref")
    8601                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_spd_ref")
    8602                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    8603                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8604              
    8605              $C$DW$748       .dwtag  DW_TAG_member
    8606                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$32)
    8607                      .dwattr $C$DW$748, DW_AT_name("spd_max")
    8608                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_spd_max")
    8609                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    8610                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8611              
    8612              $C$DW$749       .dwtag  DW_TAG_member
    8613                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$67)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  164

    8614                      .dwattr $C$DW$749, DW_AT_name("counter_current")
    8615                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_counter_current")
    8616                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    8617                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8618              
    8619              $C$DW$750       .dwtag  DW_TAG_member
    8620                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$67)
    8621                      .dwattr $C$DW$750, DW_AT_name("counter_isr")
    8622                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_counter_isr")
    8623                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    8624                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8625              
    8626              $C$DW$751       .dwtag  DW_TAG_member
    8627                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$67)
    8628                      .dwattr $C$DW$751, DW_AT_name("counter_speed")
    8629                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_counter_speed")
    8630                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    8631                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8632              
    8633              $C$DW$752       .dwtag  DW_TAG_member
    8634                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$67)
    8635                      .dwattr $C$DW$752, DW_AT_name("counter_traj")
    8636                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_counter_traj")
    8637                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    8638                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8639              
    8640              $C$DW$753       .dwtag  DW_TAG_member
    8641                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$70)
    8642                      .dwattr $C$DW$753, DW_AT_name("flag_enableCtrl")
    8643                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_flag_enableCtrl")
    8644                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    8645                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8646              
    8647              $C$DW$754       .dwtag  DW_TAG_member
    8648                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$70)
    8649                      .dwattr $C$DW$754, DW_AT_name("flag_enableDcBusComp")
    8650                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    8651                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    8652                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8653              
    8654              $C$DW$755       .dwtag  DW_TAG_member
    8655                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$70)
    8656                      .dwattr $C$DW$755, DW_AT_name("flag_enablePowerWarp")
    8657                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    8658                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    8659                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8660              
    8661              $C$DW$756       .dwtag  DW_TAG_member
    8662                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$70)
    8663                      .dwattr $C$DW$756, DW_AT_name("flag_enableOffset")
    8664                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_flag_enableOffset")
    8665                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    8666                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8667              
    8668              $C$DW$757       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  165

    8669                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$70)
    8670                      .dwattr $C$DW$757, DW_AT_name("flag_enableSpeedCtrl")
    8671                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    8672                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    8673                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8674              
    8675              $C$DW$758       .dwtag  DW_TAG_member
    8676                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$70)
    8677                      .dwattr $C$DW$758, DW_AT_name("flag_enableUserMotorParams")
    8678                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    8679                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    8680                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8681              
    8682              $C$DW$759       .dwtag  DW_TAG_member
    8683                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$69)
    8684                      .dwattr $C$DW$759, DW_AT_name("Idq_offset_pu")
    8685                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_Idq_offset_pu")
    8686                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    8687                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8688              
    8689              $C$DW$760       .dwtag  DW_TAG_member
    8690                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$69)
    8691                      .dwattr $C$DW$760, DW_AT_name("Vdq_offset_pu")
    8692                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    8693                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    8694                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8695              
    8696              $C$DW$761       .dwtag  DW_TAG_member
    8697                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$32)
    8698                      .dwattr $C$DW$761, DW_AT_name("angle_pu")
    8699                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_angle_pu")
    8700                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    8701                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8702              
    8703              $C$DW$762       .dwtag  DW_TAG_member
    8704                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$32)
    8705                      .dwattr $C$DW$762, DW_AT_name("speed_ref_pu")
    8706                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_speed_ref_pu")
    8707                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    8708                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8709              
    8710              $C$DW$763       .dwtag  DW_TAG_member
    8711                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$32)
    8712                      .dwattr $C$DW$763, DW_AT_name("speed_fb_pu")
    8713                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_speed_fb_pu")
    8714                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    8715                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8716              
    8717              $C$DW$764       .dwtag  DW_TAG_member
    8718                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$32)
    8719                      .dwattr $C$DW$764, DW_AT_name("speed_outMax_pu")
    8720                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_speed_outMax_pu")
    8721                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    8722                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8723              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  166

    8724              $C$DW$765       .dwtag  DW_TAG_member
    8725                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$70)
    8726                      .dwattr $C$DW$765, DW_AT_name("flag_enableCurrentCtrl")
    8727                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    8728                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    8729                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8730              
    8731                      .dwendtag $C$DW$T$71
    8732              
    8733              $C$DW$T$174     .dwtag  DW_TAG_typedef
    8734                      .dwattr $C$DW$T$174, DW_AT_name("CTRL_Obj")
    8735                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$71)
    8736                      .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    8737              
    8738              $C$DW$T$160     .dwtag  DW_TAG_pointer_type
    8739                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$71)
    8740                      .dwattr $C$DW$T$160, DW_AT_address_class(0x20)
    8741              
    8742              $C$DW$T$161     .dwtag  DW_TAG_typedef
    8743                      .dwattr $C$DW$T$161, DW_AT_name("CTRL_Handle")
    8744                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$160)
    8745                      .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    8746              
    8747              $C$DW$766       .dwtag  DW_TAG_TI_far_type
    8748                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$161)
    8749              
    8750              $C$DW$T$175     .dwtag  DW_TAG_const_type
    8751                      .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$766)
    8752              
    8753              
    8754              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    8755                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    8756                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    8757              $C$DW$767       .dwtag  DW_TAG_member
    8758                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$23)
    8759                      .dwattr $C$DW$767, DW_AT_name("rsvd")
    8760                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_rsvd")
    8761                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8762                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8763              
    8764              $C$DW$768       .dwtag  DW_TAG_member
    8765                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$73)
    8766                      .dwattr $C$DW$768, DW_AT_name("targetProc")
    8767                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_targetProc")
    8768                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8769                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8770              
    8771              $C$DW$769       .dwtag  DW_TAG_member
    8772                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$23)
    8773                      .dwattr $C$DW$769, DW_AT_name("major")
    8774                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_major")
    8775                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8776                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8777              
    8778              $C$DW$770       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  167

    8779                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$23)
    8780                      .dwattr $C$DW$770, DW_AT_name("minor")
    8781                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_minor")
    8782                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8783                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8784              
    8785                      .dwendtag $C$DW$T$74
    8786              
    8787              $C$DW$T$38      .dwtag  DW_TAG_typedef
    8788                      .dwattr $C$DW$T$38, DW_AT_name("CTRL_Version")
    8789                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    8790                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    8791              
    8792              
    8793              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8794                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    8795                      .dwattr $C$DW$T$20, DW_AT_declaration
    8796                      .dwendtag $C$DW$T$20
    8797              
    8798              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    8799                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
    8800                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    8801              
    8802              $C$DW$T$47      .dwtag  DW_TAG_typedef
    8803                      .dwattr $C$DW$T$47, DW_AT_name("EST_Handle")
    8804                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    8805                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    8806              
    8807              
    8808              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    8809                      .dwattr $C$DW$T$75, DW_AT_name("_FILTER_FO_")
    8810                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x0a)
    8811              $C$DW$771       .dwtag  DW_TAG_member
    8812                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$32)
    8813                      .dwattr $C$DW$771, DW_AT_name("a1")
    8814                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_a1")
    8815                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8816                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8817              
    8818              $C$DW$772       .dwtag  DW_TAG_member
    8819                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$32)
    8820                      .dwattr $C$DW$772, DW_AT_name("b0")
    8821                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_b0")
    8822                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8823                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8824              
    8825              $C$DW$773       .dwtag  DW_TAG_member
    8826                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$32)
    8827                      .dwattr $C$DW$773, DW_AT_name("b1")
    8828                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_b1")
    8829                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8830                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8831              
    8832              $C$DW$774       .dwtag  DW_TAG_member
    8833                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  168

    8834                      .dwattr $C$DW$774, DW_AT_name("x1")
    8835                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_x1")
    8836                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8837                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8838              
    8839              $C$DW$775       .dwtag  DW_TAG_member
    8840                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$32)
    8841                      .dwattr $C$DW$775, DW_AT_name("y1")
    8842                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_y1")
    8843                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8844                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8845              
    8846                      .dwendtag $C$DW$T$75
    8847              
    8848              $C$DW$T$127     .dwtag  DW_TAG_typedef
    8849                      .dwattr $C$DW$T$127, DW_AT_name("FILTER_FO_Obj")
    8850                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$75)
    8851                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    8852              
    8853              $C$DW$T$177     .dwtag  DW_TAG_pointer_type
    8854                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$127)
    8855                      .dwattr $C$DW$T$177, DW_AT_address_class(0x20)
    8856              
    8857              
    8858              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    8859                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    8860                      .dwattr $C$DW$T$21, DW_AT_declaration
    8861                      .dwendtag $C$DW$T$21
    8862              
    8863              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    8864                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$21)
    8865                      .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    8866              
    8867              $C$DW$T$129     .dwtag  DW_TAG_typedef
    8868                      .dwattr $C$DW$T$129, DW_AT_name("FILTER_FO_Handle")
    8869                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    8870                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    8871              
    8872              
    8873              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    8874                      .dwattr $C$DW$T$76, DW_AT_name("_FLASH_Obj_")
    8875                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    8876              $C$DW$776       .dwtag  DW_TAG_member
    8877                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$24)
    8878                      .dwattr $C$DW$776, DW_AT_name("FOPT")
    8879                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_FOPT")
    8880                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8881                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8882              
    8883              $C$DW$777       .dwtag  DW_TAG_member
    8884                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$24)
    8885                      .dwattr $C$DW$777, DW_AT_name("rsvd_1")
    8886                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_rsvd_1")
    8887                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8888                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  169

    8889              
    8890              $C$DW$778       .dwtag  DW_TAG_member
    8891                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$24)
    8892                      .dwattr $C$DW$778, DW_AT_name("FPWR")
    8893                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_FPWR")
    8894                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8895                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8896              
    8897              $C$DW$779       .dwtag  DW_TAG_member
    8898                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$24)
    8899                      .dwattr $C$DW$779, DW_AT_name("FSTATUS")
    8900                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_FSTATUS")
    8901                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8902                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8903              
    8904              $C$DW$780       .dwtag  DW_TAG_member
    8905                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$24)
    8906                      .dwattr $C$DW$780, DW_AT_name("FSTDBYWAIT")
    8907                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    8908                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8909                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8910              
    8911              $C$DW$781       .dwtag  DW_TAG_member
    8912                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$24)
    8913                      .dwattr $C$DW$781, DW_AT_name("FACTIVEWAIT")
    8914                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    8915                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8916                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8917              
    8918              $C$DW$782       .dwtag  DW_TAG_member
    8919                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$24)
    8920                      .dwattr $C$DW$782, DW_AT_name("FBANKWAIT")
    8921                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_FBANKWAIT")
    8922                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8923                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8924              
    8925              $C$DW$783       .dwtag  DW_TAG_member
    8926                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$24)
    8927                      .dwattr $C$DW$783, DW_AT_name("FOTPWAIT")
    8928                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_FOTPWAIT")
    8929                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8930                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8931              
    8932                      .dwendtag $C$DW$T$76
    8933              
    8934              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    8935                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$76)
    8936                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    8937              
    8938              $C$DW$T$90      .dwtag  DW_TAG_typedef
    8939                      .dwattr $C$DW$T$90, DW_AT_name("FLASH_Handle")
    8940                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    8941                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    8942              
    8943              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  170

    8944              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    8945                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
    8946                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
    8947              $C$DW$784       .dwtag  DW_TAG_member
    8948                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$77)
    8949                      .dwattr $C$DW$784, DW_AT_name("GPACTRL")
    8950                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_GPACTRL")
    8951                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8952                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8953              
    8954              $C$DW$785       .dwtag  DW_TAG_member
    8955                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$77)
    8956                      .dwattr $C$DW$785, DW_AT_name("GPAQSEL1")
    8957                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_GPAQSEL1")
    8958                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8959                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8960              
    8961              $C$DW$786       .dwtag  DW_TAG_member
    8962                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$77)
    8963                      .dwattr $C$DW$786, DW_AT_name("GPAQSEL2")
    8964                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_GPAQSEL2")
    8965                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8966                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8967              
    8968              $C$DW$787       .dwtag  DW_TAG_member
    8969                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$77)
    8970                      .dwattr $C$DW$787, DW_AT_name("GPAMUX1")
    8971                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_GPAMUX1")
    8972                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8973                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8974              
    8975              $C$DW$788       .dwtag  DW_TAG_member
    8976                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$77)
    8977                      .dwattr $C$DW$788, DW_AT_name("GPAMUX2")
    8978                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_GPAMUX2")
    8979                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8980                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8981              
    8982              $C$DW$789       .dwtag  DW_TAG_member
    8983                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$77)
    8984                      .dwattr $C$DW$789, DW_AT_name("GPADIR")
    8985                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_GPADIR")
    8986                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8987                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8988              
    8989              $C$DW$790       .dwtag  DW_TAG_member
    8990                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$77)
    8991                      .dwattr $C$DW$790, DW_AT_name("GPAPUD")
    8992                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_GPAPUD")
    8993                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8994                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8995              
    8996              $C$DW$791       .dwtag  DW_TAG_member
    8997                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$27)
    8998                      .dwattr $C$DW$791, DW_AT_name("rsvd_1")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:12 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85684BZyCPu                                                     PAGE  171

    8999                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_rsvd_1")
    9000                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9001                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    9002              
    9003              $C$DW$792       .dwtag  DW_TAG_member
    9004                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$77)
    9005                      .dwattr $C$DW$792, DW_AT_name("GPBCTRL")
    9006                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_GPBCTRL")
    9007                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9008                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    9009              
    9010              $C$DW$793       .dwtag  DW_TAG_member
    9011                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$77)
    9012                      .dwattr $C$DW$793, DW_AT_name("GPBQSEL1")
    9013                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_GPBQSEL1")
    9014                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9015                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    9016              
    9017              $C$DW$794       .dwtag  DW_TAG_member
    9018                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$27)
    9019                      .dwattr $C$DW$794, DW_AT_name("rsvd_2")
    9020                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_rsvd_2")
    9021                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9022                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    9023              
    9024              $C$DW$795       .dwtag  DW_TAG_member
    9025                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$77)
    9026                      .dwattr $C$DW$795, DW_AT_name("GPBMUX1")
    9027                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_GPBMUX1")
    9028                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9029                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    9030              
    9031              $C$DW$796       .dwtag  DW_TAG_member
    9032                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$27)
    9033                      .dwattr $C$DW$796, DW_AT_name("rsvd_3")
    9034                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_rsvd_3")
    9035                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9036                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    9037              
    9038              $C$DW$797       .dwtag  DW_TAG_member
