TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.3.LTS *
       3              ;* Date/Time created: Wed Jun 28 11:48:13 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("/home/wmj/Documents/motor/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.3.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/home/wmj/Documents/motor/sw/solutions/instaspin_foc/boards/hvkit_r
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("PLL_disableClkDetect")

   12035              
   12036              $C$DW$1574      .dwtag  DW_TAG_enumerator
   12037                      .dwattr $C$DW$1574, DW_AT_name("I2C_Status_Reg_Rdy")
   12038                      .dwattr $C$DW$1574, DW_AT_const_value(0x04)
   12039              
   12040              $C$DW$1575      .dwtag  DW_TAG_enumerator
   12041                      .dwattr $C$DW$1575, DW_AT_name("I2C_Status_Rx_Rdy")
   12042                      .dwattr $C$DW$1575, DW_AT_const_value(0x08)
   12043              
   12044              $C$DW$1576      .dwtag  DW_TAG_enumerator
   12045                      .dwattr $C$DW$1576, DW_AT_name("I2C_Status_Tx_Rdy")
   12046                      .dwattr $C$DW$1576, DW_AT_const_value(0x10)
   12047              
   12048              $C$DW$1577      .dwtag  DW_TAG_enumerator
   12049                      .dwattr $C$DW$1577, DW_AT_name("I2C_Status_Stop")
   12050                      .dwattr $C$DW$1577, DW_AT_const_value(0x20)
   12051              
   12052              $C$DW$1578      .dwtag  DW_TAG_enumerator
   12053                      .dwattr $C$DW$1578, DW_AT_name("I2C_Status_AD0")
   12054                      .dwattr $C$DW$1578, DW_AT_const_value(0x100)
   12055              
   12056              $C$DW$1579      .dwtag  DW_TAG_enumerator
   12057                      .dwattr $C$DW$1579, DW_AT_name("I2C_Status_Slave_Addr")
   12058                      .dwattr $C$DW$1579, DW_AT_const_value(0x200)
   12059              
   12060              $C$DW$1580      .dwtag  DW_TAG_enumerator
   12061                      .dwattr $C$DW$1580, DW_AT_name("I2C_Status_Tx_Empty")
   12062                      .dwattr $C$DW$1580, DW_AT_const_value(0x400)
   12063              
   12064              $C$DW$1581      .dwtag  DW_TAG_enumerator
   12065                      .dwattr $C$DW$1581, DW_AT_name("I2C_Status_Rx_Full")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  229

   12066                      .dwattr $C$DW$1581, DW_AT_const_value(0x800)
   12067              
   12068              $C$DW$1582      .dwtag  DW_TAG_enumerator
   12069                      .dwattr $C$DW$1582, DW_AT_name("I2C_Status_Busy")
   12070                      .dwattr $C$DW$1582, DW_AT_const_value(0x1000)
   12071              
   12072              $C$DW$1583      .dwtag  DW_TAG_enumerator
   12073                      .dwattr $C$DW$1583, DW_AT_name("I2C_Status_NACK_Sent")
   12074                      .dwattr $C$DW$1583, DW_AT_const_value(0x2000)
   12075              
   12076              $C$DW$1584      .dwtag  DW_TAG_enumerator
   12077                      .dwattr $C$DW$1584, DW_AT_name("I2C_Status_Slave_Dir")
   12078                      .dwattr $C$DW$1584, DW_AT_const_value(0x4000)
   12079              
   12080                      .dwendtag $C$DW$T$282
   12081              
   12082              $C$DW$T$283     .dwtag  DW_TAG_typedef
   12083                      .dwattr $C$DW$T$283, DW_AT_name("I2C_Status_e")
   12084                      .dwattr $C$DW$T$283, DW_AT_type(*$C$DW$T$282)
   12085                      .dwattr $C$DW$T$283, DW_AT_language(DW_LANG_C)
   12086              
   12087              
   12088              $C$DW$T$287     .dwtag  DW_TAG_enumeration_type
   12089                      .dwattr $C$DW$T$287, DW_AT_byte_size(0x01)
   12090              $C$DW$1585      .dwtag  DW_TAG_enumerator
   12091                      .dwattr $C$DW$1585, DW_AT_name("HAL_SensorType_Current")
   12092                      .dwattr $C$DW$1585, DW_AT_const_value(0x00)
   12093              
   12094              $C$DW$1586      .dwtag  DW_TAG_enumerator
   12095                      .dwattr $C$DW$1586, DW_AT_name("HAL_SensorType_Voltage")
   12096                      .dwattr $C$DW$1586, DW_AT_const_value(0x01)
   12097              
   12098                      .dwendtag $C$DW$T$287
   12099              
   12100              $C$DW$T$288     .dwtag  DW_TAG_typedef
   12101                      .dwattr $C$DW$T$288, DW_AT_name("HAL_SensorType_e")
   12102                      .dwattr $C$DW$T$288, DW_AT_type(*$C$DW$T$287)
   12103                      .dwattr $C$DW$T$288, DW_AT_language(DW_LANG_C)
   12104              
   12105              
   12106              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   12107                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
   12108                      .dwattr $C$DW$T$19, DW_AT_declaration
   12109                      .dwendtag $C$DW$T$19
   12110              
   12111              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   12112                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
   12113                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
   12114              
   12115              $C$DW$T$80      .dwtag  DW_TAG_typedef
   12116                      .dwattr $C$DW$T$80, DW_AT_name("I2C_Handle")
   12117                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   12118                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   12119              
   12120              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  230

   12121              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   12122                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   12123                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   12124              $C$DW$1587      .dwtag  DW_TAG_member
   12125                      .dwattr $C$DW$1587, DW_AT_type(*$C$DW$T$24)
   12126                      .dwattr $C$DW$1587, DW_AT_name("ADCRESULT")
   12127                      .dwattr $C$DW$1587, DW_AT_TI_symbol_name("_ADCRESULT")
   12128                      .dwattr $C$DW$1587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12129                      .dwattr $C$DW$1587, DW_AT_accessibility(DW_ACCESS_public)
   12130              
   12131              $C$DW$1588      .dwtag  DW_TAG_member
   12132                      .dwattr $C$DW$1588, DW_AT_type(*$C$DW$T$25)
   12133                      .dwattr $C$DW$1588, DW_AT_name("resvd_1")
   12134                      .dwattr $C$DW$1588, DW_AT_TI_symbol_name("_resvd_1")
   12135                      .dwattr $C$DW$1588, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12136                      .dwattr $C$DW$1588, DW_AT_accessibility(DW_ACCESS_public)
   12137              
   12138              $C$DW$1589      .dwtag  DW_TAG_member
   12139                      .dwattr $C$DW$1589, DW_AT_type(*$C$DW$T$23)
   12140                      .dwattr $C$DW$1589, DW_AT_name("ADCCTL1")
   12141                      .dwattr $C$DW$1589, DW_AT_TI_symbol_name("_ADCCTL1")
   12142                      .dwattr $C$DW$1589, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   12143                      .dwattr $C$DW$1589, DW_AT_accessibility(DW_ACCESS_public)
   12144              
   12145              $C$DW$1590      .dwtag  DW_TAG_member
   12146                      .dwattr $C$DW$1590, DW_AT_type(*$C$DW$T$23)
   12147                      .dwattr $C$DW$1590, DW_AT_name("ADCCTL2")
   12148                      .dwattr $C$DW$1590, DW_AT_TI_symbol_name("_ADCCTL2")
   12149                      .dwattr $C$DW$1590, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   12150                      .dwattr $C$DW$1590, DW_AT_accessibility(DW_ACCESS_public)
   12151              
   12152              $C$DW$1591      .dwtag  DW_TAG_member
   12153                      .dwattr $C$DW$1591, DW_AT_type(*$C$DW$T$26)
   12154                      .dwattr $C$DW$1591, DW_AT_name("rsvd_2")
   12155                      .dwattr $C$DW$1591, DW_AT_TI_symbol_name("_rsvd_2")
   12156                      .dwattr $C$DW$1591, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   12157                      .dwattr $C$DW$1591, DW_AT_accessibility(DW_ACCESS_public)
   12158              
   12159              $C$DW$1592      .dwtag  DW_TAG_member
   12160                      .dwattr $C$DW$1592, DW_AT_type(*$C$DW$T$23)
   12161                      .dwattr $C$DW$1592, DW_AT_name("ADCINTFLG")
   12162                      .dwattr $C$DW$1592, DW_AT_TI_symbol_name("_ADCINTFLG")
   12163                      .dwattr $C$DW$1592, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   12164                      .dwattr $C$DW$1592, DW_AT_accessibility(DW_ACCESS_public)
   12165              
   12166              $C$DW$1593      .dwtag  DW_TAG_member
   12167                      .dwattr $C$DW$1593, DW_AT_type(*$C$DW$T$23)
   12168                      .dwattr $C$DW$1593, DW_AT_name("ADCINTFLGCLR")
   12169                      .dwattr $C$DW$1593, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   12170                      .dwattr $C$DW$1593, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   12171                      .dwattr $C$DW$1593, DW_AT_accessibility(DW_ACCESS_public)
   12172              
   12173              $C$DW$1594      .dwtag  DW_TAG_member
   12174                      .dwattr $C$DW$1594, DW_AT_type(*$C$DW$T$23)
   12175                      .dwattr $C$DW$1594, DW_AT_name("ADCINTOVF")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  231

   12176                      .dwattr $C$DW$1594, DW_AT_TI_symbol_name("_ADCINTOVF")
   12177                      .dwattr $C$DW$1594, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   12178                      .dwattr $C$DW$1594, DW_AT_accessibility(DW_ACCESS_public)
   12179              
   12180              $C$DW$1595      .dwtag  DW_TAG_member
   12181                      .dwattr $C$DW$1595, DW_AT_type(*$C$DW$T$23)
   12182                      .dwattr $C$DW$1595, DW_AT_name("ADCINTOVFCLR")
   12183                      .dwattr $C$DW$1595, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   12184                      .dwattr $C$DW$1595, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   12185                      .dwattr $C$DW$1595, DW_AT_accessibility(DW_ACCESS_public)
   12186              
   12187              $C$DW$1596      .dwtag  DW_TAG_member
   12188                      .dwattr $C$DW$1596, DW_AT_type(*$C$DW$T$27)
   12189                      .dwattr $C$DW$1596, DW_AT_name("INTSELxNy")
   12190                      .dwattr $C$DW$1596, DW_AT_TI_symbol_name("_INTSELxNy")
   12191                      .dwattr $C$DW$1596, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   12192                      .dwattr $C$DW$1596, DW_AT_accessibility(DW_ACCESS_public)
   12193              
   12194              $C$DW$1597      .dwtag  DW_TAG_member
   12195                      .dwattr $C$DW$1597, DW_AT_type(*$C$DW$T$28)
   12196                      .dwattr $C$DW$1597, DW_AT_name("rsvd_3")
   12197                      .dwattr $C$DW$1597, DW_AT_TI_symbol_name("_rsvd_3")
   12198                      .dwattr $C$DW$1597, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   12199                      .dwattr $C$DW$1597, DW_AT_accessibility(DW_ACCESS_public)
   12200              
   12201              $C$DW$1598      .dwtag  DW_TAG_member
   12202                      .dwattr $C$DW$1598, DW_AT_type(*$C$DW$T$23)
   12203                      .dwattr $C$DW$1598, DW_AT_name("SOCPRICTRL")
   12204                      .dwattr $C$DW$1598, DW_AT_TI_symbol_name("_SOCPRICTRL")
   12205                      .dwattr $C$DW$1598, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   12206                      .dwattr $C$DW$1598, DW_AT_accessibility(DW_ACCESS_public)
   12207              
   12208              $C$DW$1599      .dwtag  DW_TAG_member
   12209                      .dwattr $C$DW$1599, DW_AT_type(*$C$DW$T$23)
   12210                      .dwattr $C$DW$1599, DW_AT_name("rsvd_4")
   12211                      .dwattr $C$DW$1599, DW_AT_TI_symbol_name("_rsvd_4")
   12212                      .dwattr $C$DW$1599, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   12213                      .dwattr $C$DW$1599, DW_AT_accessibility(DW_ACCESS_public)
   12214              
   12215              $C$DW$1600      .dwtag  DW_TAG_member
   12216                      .dwattr $C$DW$1600, DW_AT_type(*$C$DW$T$23)
   12217                      .dwattr $C$DW$1600, DW_AT_name("ADCSAMPLEMODE")
   12218                      .dwattr $C$DW$1600, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   12219                      .dwattr $C$DW$1600, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   12220                      .dwattr $C$DW$1600, DW_AT_accessibility(DW_ACCESS_public)
   12221              
   12222              $C$DW$1601      .dwtag  DW_TAG_member
   12223                      .dwattr $C$DW$1601, DW_AT_type(*$C$DW$T$23)
   12224                      .dwattr $C$DW$1601, DW_AT_name("rsvd_5")
   12225                      .dwattr $C$DW$1601, DW_AT_TI_symbol_name("_rsvd_5")
   12226                      .dwattr $C$DW$1601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   12227                      .dwattr $C$DW$1601, DW_AT_accessibility(DW_ACCESS_public)
   12228              
   12229              $C$DW$1602      .dwtag  DW_TAG_member
   12230                      .dwattr $C$DW$1602, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  232

   12231                      .dwattr $C$DW$1602, DW_AT_name("ADCINTSOCSEL1")
   12232                      .dwattr $C$DW$1602, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   12233                      .dwattr $C$DW$1602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   12234                      .dwattr $C$DW$1602, DW_AT_accessibility(DW_ACCESS_public)
   12235              
   12236              $C$DW$1603      .dwtag  DW_TAG_member
   12237                      .dwattr $C$DW$1603, DW_AT_type(*$C$DW$T$23)
   12238                      .dwattr $C$DW$1603, DW_AT_name("ADCINTSOCSEL2")
   12239                      .dwattr $C$DW$1603, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   12240                      .dwattr $C$DW$1603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   12241                      .dwattr $C$DW$1603, DW_AT_accessibility(DW_ACCESS_public)
   12242              
   12243              $C$DW$1604      .dwtag  DW_TAG_member
   12244                      .dwattr $C$DW$1604, DW_AT_type(*$C$DW$T$26)
   12245                      .dwattr $C$DW$1604, DW_AT_name("rsvd_6")
   12246                      .dwattr $C$DW$1604, DW_AT_TI_symbol_name("_rsvd_6")
   12247                      .dwattr $C$DW$1604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   12248                      .dwattr $C$DW$1604, DW_AT_accessibility(DW_ACCESS_public)
   12249              
   12250              $C$DW$1605      .dwtag  DW_TAG_member
   12251                      .dwattr $C$DW$1605, DW_AT_type(*$C$DW$T$23)
   12252                      .dwattr $C$DW$1605, DW_AT_name("ADCSOCFLG1")
   12253                      .dwattr $C$DW$1605, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   12254                      .dwattr $C$DW$1605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   12255                      .dwattr $C$DW$1605, DW_AT_accessibility(DW_ACCESS_public)
   12256              
   12257              $C$DW$1606      .dwtag  DW_TAG_member
   12258                      .dwattr $C$DW$1606, DW_AT_type(*$C$DW$T$23)
   12259                      .dwattr $C$DW$1606, DW_AT_name("rsvd_7")
   12260                      .dwattr $C$DW$1606, DW_AT_TI_symbol_name("_rsvd_7")
   12261                      .dwattr $C$DW$1606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   12262                      .dwattr $C$DW$1606, DW_AT_accessibility(DW_ACCESS_public)
   12263              
   12264              $C$DW$1607      .dwtag  DW_TAG_member
   12265                      .dwattr $C$DW$1607, DW_AT_type(*$C$DW$T$23)
   12266                      .dwattr $C$DW$1607, DW_AT_name("ADCSOCFRC1")
   12267                      .dwattr $C$DW$1607, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   12268                      .dwattr $C$DW$1607, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   12269                      .dwattr $C$DW$1607, DW_AT_accessibility(DW_ACCESS_public)
   12270              
   12271              $C$DW$1608      .dwtag  DW_TAG_member
   12272                      .dwattr $C$DW$1608, DW_AT_type(*$C$DW$T$23)
   12273                      .dwattr $C$DW$1608, DW_AT_name("rsvd_8")
   12274                      .dwattr $C$DW$1608, DW_AT_TI_symbol_name("_rsvd_8")
   12275                      .dwattr $C$DW$1608, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   12276                      .dwattr $C$DW$1608, DW_AT_accessibility(DW_ACCESS_public)
   12277              
   12278              $C$DW$1609      .dwtag  DW_TAG_member
   12279                      .dwattr $C$DW$1609, DW_AT_type(*$C$DW$T$23)
   12280                      .dwattr $C$DW$1609, DW_AT_name("ADCSOCOVF1")
   12281                      .dwattr $C$DW$1609, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   12282                      .dwattr $C$DW$1609, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   12283                      .dwattr $C$DW$1609, DW_AT_accessibility(DW_ACCESS_public)
   12284              
   12285              $C$DW$1610      .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  233

   12286                      .dwattr $C$DW$1610, DW_AT_type(*$C$DW$T$23)
   12287                      .dwattr $C$DW$1610, DW_AT_name("rsvd_9")
   12288                      .dwattr $C$DW$1610, DW_AT_TI_symbol_name("_rsvd_9")
   12289                      .dwattr $C$DW$1610, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   12290                      .dwattr $C$DW$1610, DW_AT_accessibility(DW_ACCESS_public)
   12291              
   12292              $C$DW$1611      .dwtag  DW_TAG_member
   12293                      .dwattr $C$DW$1611, DW_AT_type(*$C$DW$T$23)
   12294                      .dwattr $C$DW$1611, DW_AT_name("ADCSOCOVFCLR1")
   12295                      .dwattr $C$DW$1611, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   12296                      .dwattr $C$DW$1611, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   12297                      .dwattr $C$DW$1611, DW_AT_accessibility(DW_ACCESS_public)
   12298              
   12299              $C$DW$1612      .dwtag  DW_TAG_member
   12300                      .dwattr $C$DW$1612, DW_AT_type(*$C$DW$T$23)
   12301                      .dwattr $C$DW$1612, DW_AT_name("rsvd_10")
   12302                      .dwattr $C$DW$1612, DW_AT_TI_symbol_name("_rsvd_10")
   12303                      .dwattr $C$DW$1612, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   12304                      .dwattr $C$DW$1612, DW_AT_accessibility(DW_ACCESS_public)
   12305              
   12306              $C$DW$1613      .dwtag  DW_TAG_member
   12307                      .dwattr $C$DW$1613, DW_AT_type(*$C$DW$T$24)
   12308                      .dwattr $C$DW$1613, DW_AT_name("ADCSOCxCTL")
   12309                      .dwattr $C$DW$1613, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   12310                      .dwattr $C$DW$1613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   12311                      .dwattr $C$DW$1613, DW_AT_accessibility(DW_ACCESS_public)
   12312              
   12313              $C$DW$1614      .dwtag  DW_TAG_member
   12314                      .dwattr $C$DW$1614, DW_AT_type(*$C$DW$T$24)
   12315                      .dwattr $C$DW$1614, DW_AT_name("rsvd_11")
   12316                      .dwattr $C$DW$1614, DW_AT_TI_symbol_name("_rsvd_11")
   12317                      .dwattr $C$DW$1614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   12318                      .dwattr $C$DW$1614, DW_AT_accessibility(DW_ACCESS_public)
   12319              
   12320              $C$DW$1615      .dwtag  DW_TAG_member
   12321                      .dwattr $C$DW$1615, DW_AT_type(*$C$DW$T$23)
   12322                      .dwattr $C$DW$1615, DW_AT_name("ADCREFTRIM")
   12323                      .dwattr $C$DW$1615, DW_AT_TI_symbol_name("_ADCREFTRIM")
   12324                      .dwattr $C$DW$1615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   12325                      .dwattr $C$DW$1615, DW_AT_accessibility(DW_ACCESS_public)
   12326              
   12327              $C$DW$1616      .dwtag  DW_TAG_member
   12328                      .dwattr $C$DW$1616, DW_AT_type(*$C$DW$T$23)
   12329                      .dwattr $C$DW$1616, DW_AT_name("ADCOFFTRIM")
   12330                      .dwattr $C$DW$1616, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   12331                      .dwattr $C$DW$1616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   12332                      .dwattr $C$DW$1616, DW_AT_accessibility(DW_ACCESS_public)
   12333              
   12334              $C$DW$1617      .dwtag  DW_TAG_member
   12335                      .dwattr $C$DW$1617, DW_AT_type(*$C$DW$T$29)
   12336                      .dwattr $C$DW$1617, DW_AT_name("resvd_12")
   12337                      .dwattr $C$DW$1617, DW_AT_TI_symbol_name("_resvd_12")
   12338                      .dwattr $C$DW$1617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   12339                      .dwattr $C$DW$1617, DW_AT_accessibility(DW_ACCESS_public)
   12340              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  234

   12341              $C$DW$1618      .dwtag  DW_TAG_member
   12342                      .dwattr $C$DW$1618, DW_AT_type(*$C$DW$T$23)
   12343                      .dwattr $C$DW$1618, DW_AT_name("ADCREV")
   12344                      .dwattr $C$DW$1618, DW_AT_TI_symbol_name("_ADCREV")
   12345                      .dwattr $C$DW$1618, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   12346                      .dwattr $C$DW$1618, DW_AT_accessibility(DW_ACCESS_public)
   12347              
   12348                      .dwendtag $C$DW$T$30
   12349              
   12350              $C$DW$T$295     .dwtag  DW_TAG_typedef
   12351                      .dwattr $C$DW$T$295, DW_AT_name("ADC_Obj")
   12352                      .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$30)
   12353                      .dwattr $C$DW$T$295, DW_AT_language(DW_LANG_C)
   12354              
   12355              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   12356                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
   12357                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
   12358              
   12359              $C$DW$T$51      .dwtag  DW_TAG_typedef
   12360                      .dwattr $C$DW$T$51, DW_AT_name("ADC_Handle")
   12361                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   12362                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   12363              
   12364              
   12365              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   12366                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   12367                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   12368              $C$DW$1619      .dwtag  DW_TAG_member
   12369                      .dwattr $C$DW$1619, DW_AT_type(*$C$DW$T$23)
   12370                      .dwattr $C$DW$1619, DW_AT_name("XCLK")
   12371                      .dwattr $C$DW$1619, DW_AT_TI_symbol_name("_XCLK")
   12372                      .dwattr $C$DW$1619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12373                      .dwattr $C$DW$1619, DW_AT_accessibility(DW_ACCESS_public)
   12374              
   12375              $C$DW$1620      .dwtag  DW_TAG_member
   12376                      .dwattr $C$DW$1620, DW_AT_type(*$C$DW$T$23)
   12377                      .dwattr $C$DW$1620, DW_AT_name("rsvd_1")
   12378                      .dwattr $C$DW$1620, DW_AT_TI_symbol_name("_rsvd_1")
   12379                      .dwattr $C$DW$1620, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12380                      .dwattr $C$DW$1620, DW_AT_accessibility(DW_ACCESS_public)
   12381              
   12382              $C$DW$1621      .dwtag  DW_TAG_member
   12383                      .dwattr $C$DW$1621, DW_AT_type(*$C$DW$T$23)
   12384                      .dwattr $C$DW$1621, DW_AT_name("CLKCTL")
   12385                      .dwattr $C$DW$1621, DW_AT_TI_symbol_name("_CLKCTL")
   12386                      .dwattr $C$DW$1621, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12387                      .dwattr $C$DW$1621, DW_AT_accessibility(DW_ACCESS_public)
   12388              
   12389              $C$DW$1622      .dwtag  DW_TAG_member
   12390                      .dwattr $C$DW$1622, DW_AT_type(*$C$DW$T$31)
   12391                      .dwattr $C$DW$1622, DW_AT_name("rsvd_2")
   12392                      .dwattr $C$DW$1622, DW_AT_TI_symbol_name("_rsvd_2")
   12393                      .dwattr $C$DW$1622, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12394                      .dwattr $C$DW$1622, DW_AT_accessibility(DW_ACCESS_public)
   12395              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  235

   12396              $C$DW$1623      .dwtag  DW_TAG_member
   12397                      .dwattr $C$DW$1623, DW_AT_type(*$C$DW$T$23)
   12398                      .dwattr $C$DW$1623, DW_AT_name("LOSPCP")
   12399                      .dwattr $C$DW$1623, DW_AT_TI_symbol_name("_LOSPCP")
   12400                      .dwattr $C$DW$1623, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   12401                      .dwattr $C$DW$1623, DW_AT_accessibility(DW_ACCESS_public)
   12402              
   12403              $C$DW$1624      .dwtag  DW_TAG_member
   12404                      .dwattr $C$DW$1624, DW_AT_type(*$C$DW$T$23)
   12405                      .dwattr $C$DW$1624, DW_AT_name("PCLKCR0")
   12406                      .dwattr $C$DW$1624, DW_AT_TI_symbol_name("_PCLKCR0")
   12407                      .dwattr $C$DW$1624, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12408                      .dwattr $C$DW$1624, DW_AT_accessibility(DW_ACCESS_public)
   12409              
   12410              $C$DW$1625      .dwtag  DW_TAG_member
   12411                      .dwattr $C$DW$1625, DW_AT_type(*$C$DW$T$23)
   12412                      .dwattr $C$DW$1625, DW_AT_name("PCLKCR1")
   12413                      .dwattr $C$DW$1625, DW_AT_TI_symbol_name("_PCLKCR1")
   12414                      .dwattr $C$DW$1625, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   12415                      .dwattr $C$DW$1625, DW_AT_accessibility(DW_ACCESS_public)
   12416              
   12417              $C$DW$1626      .dwtag  DW_TAG_member
   12418                      .dwattr $C$DW$1626, DW_AT_type(*$C$DW$T$26)
   12419                      .dwattr $C$DW$1626, DW_AT_name("rsvd_3")
   12420                      .dwattr $C$DW$1626, DW_AT_TI_symbol_name("_rsvd_3")
   12421                      .dwattr $C$DW$1626, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12422                      .dwattr $C$DW$1626, DW_AT_accessibility(DW_ACCESS_public)
   12423              
   12424              $C$DW$1627      .dwtag  DW_TAG_member
   12425                      .dwattr $C$DW$1627, DW_AT_type(*$C$DW$T$23)
   12426                      .dwattr $C$DW$1627, DW_AT_name("PCLKCR3")
   12427                      .dwattr $C$DW$1627, DW_AT_TI_symbol_name("_PCLKCR3")
   12428                      .dwattr $C$DW$1627, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12429                      .dwattr $C$DW$1627, DW_AT_accessibility(DW_ACCESS_public)
   12430              
   12431                      .dwendtag $C$DW$T$32
   12432              
   12433              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
   12434                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
   12435                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
   12436              
   12437              $C$DW$T$53      .dwtag  DW_TAG_typedef
   12438                      .dwattr $C$DW$T$53, DW_AT_name("CLK_Handle")
   12439                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   12440                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
   12441              
   12442              
   12443              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   12444                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   12445                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   12446              $C$DW$1628      .dwtag  DW_TAG_member
   12447                      .dwattr $C$DW$1628, DW_AT_type(*$C$DW$T$33)
   12448                      .dwattr $C$DW$1628, DW_AT_name("tmp")
   12449                      .dwattr $C$DW$1628, DW_AT_TI_symbol_name("_tmp")
   12450                      .dwattr $C$DW$1628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  236

   12451                      .dwattr $C$DW$1628, DW_AT_accessibility(DW_ACCESS_public)
   12452              
   12453                      .dwendtag $C$DW$T$34
   12454              
   12455              $C$DW$T$302     .dwtag  DW_TAG_typedef
   12456                      .dwattr $C$DW$T$302, DW_AT_name("CPU_Obj")
   12457                      .dwattr $C$DW$T$302, DW_AT_type(*$C$DW$T$34)
   12458                      .dwattr $C$DW$T$302, DW_AT_language(DW_LANG_C)
   12459              
   12460              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
   12461                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
   12462                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
   12463              
   12464              $C$DW$T$55      .dwtag  DW_TAG_typedef
   12465                      .dwattr $C$DW$T$55, DW_AT_name("CPU_Handle")
   12466                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
   12467                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   12468              
   12469              
   12470              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   12471                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
   12472                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
   12473              $C$DW$1629      .dwtag  DW_TAG_member
   12474                      .dwattr $C$DW$1629, DW_AT_type(*$C$DW$T$35)
   12475                      .dwattr $C$DW$1629, DW_AT_name("a1")
   12476                      .dwattr $C$DW$1629, DW_AT_TI_symbol_name("_a1")
   12477                      .dwattr $C$DW$1629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12478                      .dwattr $C$DW$1629, DW_AT_accessibility(DW_ACCESS_public)
   12479              
   12480              $C$DW$1630      .dwtag  DW_TAG_member
   12481                      .dwattr $C$DW$1630, DW_AT_type(*$C$DW$T$35)
   12482                      .dwattr $C$DW$1630, DW_AT_name("b0")
   12483                      .dwattr $C$DW$1630, DW_AT_TI_symbol_name("_b0")
   12484                      .dwattr $C$DW$1630, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12485                      .dwattr $C$DW$1630, DW_AT_accessibility(DW_ACCESS_public)
   12486              
   12487              $C$DW$1631      .dwtag  DW_TAG_member
   12488                      .dwattr $C$DW$1631, DW_AT_type(*$C$DW$T$35)
   12489                      .dwattr $C$DW$1631, DW_AT_name("b1")
   12490                      .dwattr $C$DW$1631, DW_AT_TI_symbol_name("_b1")
   12491                      .dwattr $C$DW$1631, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12492                      .dwattr $C$DW$1631, DW_AT_accessibility(DW_ACCESS_public)
   12493              
   12494              $C$DW$1632      .dwtag  DW_TAG_member
   12495                      .dwattr $C$DW$1632, DW_AT_type(*$C$DW$T$35)
   12496                      .dwattr $C$DW$1632, DW_AT_name("x1")
   12497                      .dwattr $C$DW$1632, DW_AT_TI_symbol_name("_x1")
   12498                      .dwattr $C$DW$1632, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12499                      .dwattr $C$DW$1632, DW_AT_accessibility(DW_ACCESS_public)
   12500              
   12501              $C$DW$1633      .dwtag  DW_TAG_member
   12502                      .dwattr $C$DW$1633, DW_AT_type(*$C$DW$T$35)
   12503                      .dwattr $C$DW$1633, DW_AT_name("y1")
   12504                      .dwattr $C$DW$1633, DW_AT_TI_symbol_name("_y1")
   12505                      .dwattr $C$DW$1633, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  237

   12506                      .dwattr $C$DW$1633, DW_AT_accessibility(DW_ACCESS_public)
   12507              
   12508                      .dwendtag $C$DW$T$36
   12509              
   12510              $C$DW$T$87      .dwtag  DW_TAG_typedef
   12511                      .dwattr $C$DW$T$87, DW_AT_name("FILTER_FO_Obj")
   12512                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$36)
   12513                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   12514              
   12515              
   12516              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   12517                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   12518                      .dwattr $C$DW$T$20, DW_AT_declaration
   12519                      .dwendtag $C$DW$T$20
   12520              
   12521              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
   12522                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$20)
   12523                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
   12524              
   12525              $C$DW$T$89      .dwtag  DW_TAG_typedef
   12526                      .dwattr $C$DW$T$89, DW_AT_name("FILTER_FO_Handle")
   12527                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   12528                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   12529              
   12530              
   12531              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   12532                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
   12533                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
   12534              $C$DW$1634      .dwtag  DW_TAG_member
   12535                      .dwattr $C$DW$1634, DW_AT_type(*$C$DW$T$23)
   12536                      .dwattr $C$DW$1634, DW_AT_name("FOPT")
   12537                      .dwattr $C$DW$1634, DW_AT_TI_symbol_name("_FOPT")
   12538                      .dwattr $C$DW$1634, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12539                      .dwattr $C$DW$1634, DW_AT_accessibility(DW_ACCESS_public)
   12540              
   12541              $C$DW$1635      .dwtag  DW_TAG_member
   12542                      .dwattr $C$DW$1635, DW_AT_type(*$C$DW$T$23)
   12543                      .dwattr $C$DW$1635, DW_AT_name("rsvd_1")
   12544                      .dwattr $C$DW$1635, DW_AT_TI_symbol_name("_rsvd_1")
   12545                      .dwattr $C$DW$1635, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12546                      .dwattr $C$DW$1635, DW_AT_accessibility(DW_ACCESS_public)
   12547              
   12548              $C$DW$1636      .dwtag  DW_TAG_member
   12549                      .dwattr $C$DW$1636, DW_AT_type(*$C$DW$T$23)
   12550                      .dwattr $C$DW$1636, DW_AT_name("FPWR")
   12551                      .dwattr $C$DW$1636, DW_AT_TI_symbol_name("_FPWR")
   12552                      .dwattr $C$DW$1636, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12553                      .dwattr $C$DW$1636, DW_AT_accessibility(DW_ACCESS_public)
   12554              
   12555              $C$DW$1637      .dwtag  DW_TAG_member
   12556                      .dwattr $C$DW$1637, DW_AT_type(*$C$DW$T$23)
   12557                      .dwattr $C$DW$1637, DW_AT_name("FSTATUS")
   12558                      .dwattr $C$DW$1637, DW_AT_TI_symbol_name("_FSTATUS")
   12559                      .dwattr $C$DW$1637, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12560                      .dwattr $C$DW$1637, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  238

   12561              
   12562              $C$DW$1638      .dwtag  DW_TAG_member
   12563                      .dwattr $C$DW$1638, DW_AT_type(*$C$DW$T$23)
   12564                      .dwattr $C$DW$1638, DW_AT_name("FSTDBYWAIT")
   12565                      .dwattr $C$DW$1638, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   12566                      .dwattr $C$DW$1638, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12567                      .dwattr $C$DW$1638, DW_AT_accessibility(DW_ACCESS_public)
   12568              
   12569              $C$DW$1639      .dwtag  DW_TAG_member
   12570                      .dwattr $C$DW$1639, DW_AT_type(*$C$DW$T$23)
   12571                      .dwattr $C$DW$1639, DW_AT_name("FACTIVEWAIT")
   12572                      .dwattr $C$DW$1639, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   12573                      .dwattr $C$DW$1639, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12574                      .dwattr $C$DW$1639, DW_AT_accessibility(DW_ACCESS_public)
   12575              
   12576              $C$DW$1640      .dwtag  DW_TAG_member
   12577                      .dwattr $C$DW$1640, DW_AT_type(*$C$DW$T$23)
   12578                      .dwattr $C$DW$1640, DW_AT_name("FBANKWAIT")
   12579                      .dwattr $C$DW$1640, DW_AT_TI_symbol_name("_FBANKWAIT")
   12580                      .dwattr $C$DW$1640, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12581                      .dwattr $C$DW$1640, DW_AT_accessibility(DW_ACCESS_public)
   12582              
   12583              $C$DW$1641      .dwtag  DW_TAG_member
   12584                      .dwattr $C$DW$1641, DW_AT_type(*$C$DW$T$23)
   12585                      .dwattr $C$DW$1641, DW_AT_name("FOTPWAIT")
   12586                      .dwattr $C$DW$1641, DW_AT_TI_symbol_name("_FOTPWAIT")
   12587                      .dwattr $C$DW$1641, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12588                      .dwattr $C$DW$1641, DW_AT_accessibility(DW_ACCESS_public)
   12589              
   12590                      .dwendtag $C$DW$T$37
   12591              
   12592              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
   12593                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
   12594                      .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
   12595              
   12596              $C$DW$T$57      .dwtag  DW_TAG_typedef
   12597                      .dwattr $C$DW$T$57, DW_AT_name("FLASH_Handle")
   12598                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   12599                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   12600              
   12601              
   12602              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   12603                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
   12604                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
   12605              $C$DW$1642      .dwtag  DW_TAG_member
   12606                      .dwattr $C$DW$1642, DW_AT_type(*$C$DW$T$39)
   12607                      .dwattr $C$DW$1642, DW_AT_name("GPACTRL")
   12608                      .dwattr $C$DW$1642, DW_AT_TI_symbol_name("_GPACTRL")
   12609                      .dwattr $C$DW$1642, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12610                      .dwattr $C$DW$1642, DW_AT_accessibility(DW_ACCESS_public)
   12611              
   12612              $C$DW$1643      .dwtag  DW_TAG_member
   12613                      .dwattr $C$DW$1643, DW_AT_type(*$C$DW$T$39)
   12614                      .dwattr $C$DW$1643, DW_AT_name("GPAQSEL1")
   12615                      .dwattr $C$DW$1643, DW_AT_TI_symbol_name("_GPAQSEL1")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  239

   12616                      .dwattr $C$DW$1643, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12617                      .dwattr $C$DW$1643, DW_AT_accessibility(DW_ACCESS_public)
   12618              
   12619              $C$DW$1644      .dwtag  DW_TAG_member
   12620                      .dwattr $C$DW$1644, DW_AT_type(*$C$DW$T$39)
   12621                      .dwattr $C$DW$1644, DW_AT_name("GPAQSEL2")
   12622                      .dwattr $C$DW$1644, DW_AT_TI_symbol_name("_GPAQSEL2")
   12623                      .dwattr $C$DW$1644, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12624                      .dwattr $C$DW$1644, DW_AT_accessibility(DW_ACCESS_public)
   12625              
   12626              $C$DW$1645      .dwtag  DW_TAG_member
   12627                      .dwattr $C$DW$1645, DW_AT_type(*$C$DW$T$39)
   12628                      .dwattr $C$DW$1645, DW_AT_name("GPAMUX1")
   12629                      .dwattr $C$DW$1645, DW_AT_TI_symbol_name("_GPAMUX1")
   12630                      .dwattr $C$DW$1645, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12631                      .dwattr $C$DW$1645, DW_AT_accessibility(DW_ACCESS_public)
   12632              
   12633              $C$DW$1646      .dwtag  DW_TAG_member
   12634                      .dwattr $C$DW$1646, DW_AT_type(*$C$DW$T$39)
   12635                      .dwattr $C$DW$1646, DW_AT_name("GPAMUX2")
   12636                      .dwattr $C$DW$1646, DW_AT_TI_symbol_name("_GPAMUX2")
   12637                      .dwattr $C$DW$1646, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12638                      .dwattr $C$DW$1646, DW_AT_accessibility(DW_ACCESS_public)
   12639              
   12640              $C$DW$1647      .dwtag  DW_TAG_member
   12641                      .dwattr $C$DW$1647, DW_AT_type(*$C$DW$T$39)
   12642                      .dwattr $C$DW$1647, DW_AT_name("GPADIR")
   12643                      .dwattr $C$DW$1647, DW_AT_TI_symbol_name("_GPADIR")
   12644                      .dwattr $C$DW$1647, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12645                      .dwattr $C$DW$1647, DW_AT_accessibility(DW_ACCESS_public)
   12646              
   12647              $C$DW$1648      .dwtag  DW_TAG_member
   12648                      .dwattr $C$DW$1648, DW_AT_type(*$C$DW$T$39)
   12649                      .dwattr $C$DW$1648, DW_AT_name("GPAPUD")
   12650                      .dwattr $C$DW$1648, DW_AT_TI_symbol_name("_GPAPUD")
   12651                      .dwattr $C$DW$1648, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12652                      .dwattr $C$DW$1648, DW_AT_accessibility(DW_ACCESS_public)
   12653              
   12654              $C$DW$1649      .dwtag  DW_TAG_member
   12655                      .dwattr $C$DW$1649, DW_AT_type(*$C$DW$T$26)
   12656                      .dwattr $C$DW$1649, DW_AT_name("rsvd_1")
   12657                      .dwattr $C$DW$1649, DW_AT_TI_symbol_name("_rsvd_1")
   12658                      .dwattr $C$DW$1649, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12659                      .dwattr $C$DW$1649, DW_AT_accessibility(DW_ACCESS_public)
   12660              
   12661              $C$DW$1650      .dwtag  DW_TAG_member
   12662                      .dwattr $C$DW$1650, DW_AT_type(*$C$DW$T$39)
   12663                      .dwattr $C$DW$1650, DW_AT_name("GPBCTRL")
   12664                      .dwattr $C$DW$1650, DW_AT_TI_symbol_name("_GPBCTRL")
   12665                      .dwattr $C$DW$1650, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12666                      .dwattr $C$DW$1650, DW_AT_accessibility(DW_ACCESS_public)
   12667              
   12668              $C$DW$1651      .dwtag  DW_TAG_member
   12669                      .dwattr $C$DW$1651, DW_AT_type(*$C$DW$T$39)
   12670                      .dwattr $C$DW$1651, DW_AT_name("GPBQSEL1")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  240

   12671                      .dwattr $C$DW$1651, DW_AT_TI_symbol_name("_GPBQSEL1")
   12672                      .dwattr $C$DW$1651, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   12673                      .dwattr $C$DW$1651, DW_AT_accessibility(DW_ACCESS_public)
   12674              
   12675              $C$DW$1652      .dwtag  DW_TAG_member
   12676                      .dwattr $C$DW$1652, DW_AT_type(*$C$DW$T$26)
   12677                      .dwattr $C$DW$1652, DW_AT_name("rsvd_2")
   12678                      .dwattr $C$DW$1652, DW_AT_TI_symbol_name("_rsvd_2")
   12679                      .dwattr $C$DW$1652, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   12680                      .dwattr $C$DW$1652, DW_AT_accessibility(DW_ACCESS_public)
   12681              
   12682              $C$DW$1653      .dwtag  DW_TAG_member
   12683                      .dwattr $C$DW$1653, DW_AT_type(*$C$DW$T$39)
   12684                      .dwattr $C$DW$1653, DW_AT_name("GPBMUX1")
   12685                      .dwattr $C$DW$1653, DW_AT_TI_symbol_name("_GPBMUX1")
   12686                      .dwattr $C$DW$1653, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12687                      .dwattr $C$DW$1653, DW_AT_accessibility(DW_ACCESS_public)
   12688              
   12689              $C$DW$1654      .dwtag  DW_TAG_member
   12690                      .dwattr $C$DW$1654, DW_AT_type(*$C$DW$T$26)
   12691                      .dwattr $C$DW$1654, DW_AT_name("rsvd_3")
   12692                      .dwattr $C$DW$1654, DW_AT_TI_symbol_name("_rsvd_3")
   12693                      .dwattr $C$DW$1654, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12694                      .dwattr $C$DW$1654, DW_AT_accessibility(DW_ACCESS_public)
   12695              
   12696              $C$DW$1655      .dwtag  DW_TAG_member
   12697                      .dwattr $C$DW$1655, DW_AT_type(*$C$DW$T$39)
   12698                      .dwattr $C$DW$1655, DW_AT_name("GPBDIR")
   12699                      .dwattr $C$DW$1655, DW_AT_TI_symbol_name("_GPBDIR")
   12700                      .dwattr $C$DW$1655, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   12701                      .dwattr $C$DW$1655, DW_AT_accessibility(DW_ACCESS_public)
   12702              
   12703              $C$DW$1656      .dwtag  DW_TAG_member
   12704                      .dwattr $C$DW$1656, DW_AT_type(*$C$DW$T$39)
   12705                      .dwattr $C$DW$1656, DW_AT_name("GPBPUD")
   12706                      .dwattr $C$DW$1656, DW_AT_TI_symbol_name("_GPBPUD")
   12707                      .dwattr $C$DW$1656, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   12708                      .dwattr $C$DW$1656, DW_AT_accessibility(DW_ACCESS_public)
   12709              
   12710              $C$DW$1657      .dwtag  DW_TAG_member
   12711                      .dwattr $C$DW$1657, DW_AT_type(*$C$DW$T$40)
   12712                      .dwattr $C$DW$1657, DW_AT_name("rsvd_4")
   12713                      .dwattr $C$DW$1657, DW_AT_TI_symbol_name("_rsvd_4")
   12714                      .dwattr $C$DW$1657, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   12715                      .dwattr $C$DW$1657, DW_AT_accessibility(DW_ACCESS_public)
   12716              
   12717              $C$DW$1658      .dwtag  DW_TAG_member
   12718                      .dwattr $C$DW$1658, DW_AT_type(*$C$DW$T$39)
   12719                      .dwattr $C$DW$1658, DW_AT_name("AIOMUX1")
   12720                      .dwattr $C$DW$1658, DW_AT_TI_symbol_name("_AIOMUX1")
   12721                      .dwattr $C$DW$1658, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   12722                      .dwattr $C$DW$1658, DW_AT_accessibility(DW_ACCESS_public)
   12723              
   12724              $C$DW$1659      .dwtag  DW_TAG_member
   12725                      .dwattr $C$DW$1659, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  241

   12726                      .dwattr $C$DW$1659, DW_AT_name("rsvd_5")
   12727                      .dwattr $C$DW$1659, DW_AT_TI_symbol_name("_rsvd_5")
   12728                      .dwattr $C$DW$1659, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   12729                      .dwattr $C$DW$1659, DW_AT_accessibility(DW_ACCESS_public)
   12730              
   12731              $C$DW$1660      .dwtag  DW_TAG_member
   12732                      .dwattr $C$DW$1660, DW_AT_type(*$C$DW$T$39)
   12733                      .dwattr $C$DW$1660, DW_AT_name("AIODIR")
   12734                      .dwattr $C$DW$1660, DW_AT_TI_symbol_name("_AIODIR")
   12735                      .dwattr $C$DW$1660, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   12736                      .dwattr $C$DW$1660, DW_AT_accessibility(DW_ACCESS_public)
   12737              
   12738              $C$DW$1661      .dwtag  DW_TAG_member
   12739                      .dwattr $C$DW$1661, DW_AT_type(*$C$DW$T$41)
   12740                      .dwattr $C$DW$1661, DW_AT_name("rsvd_6")
   12741                      .dwattr $C$DW$1661, DW_AT_TI_symbol_name("_rsvd_6")
   12742                      .dwattr $C$DW$1661, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   12743                      .dwattr $C$DW$1661, DW_AT_accessibility(DW_ACCESS_public)
   12744              
   12745              $C$DW$1662      .dwtag  DW_TAG_member
   12746                      .dwattr $C$DW$1662, DW_AT_type(*$C$DW$T$39)
   12747                      .dwattr $C$DW$1662, DW_AT_name("GPADAT")
   12748                      .dwattr $C$DW$1662, DW_AT_TI_symbol_name("_GPADAT")
   12749                      .dwattr $C$DW$1662, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   12750                      .dwattr $C$DW$1662, DW_AT_accessibility(DW_ACCESS_public)
   12751              
   12752              $C$DW$1663      .dwtag  DW_TAG_member
   12753                      .dwattr $C$DW$1663, DW_AT_type(*$C$DW$T$39)
   12754                      .dwattr $C$DW$1663, DW_AT_name("GPASET")
   12755                      .dwattr $C$DW$1663, DW_AT_TI_symbol_name("_GPASET")
   12756                      .dwattr $C$DW$1663, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   12757                      .dwattr $C$DW$1663, DW_AT_accessibility(DW_ACCESS_public)
   12758              
   12759              $C$DW$1664      .dwtag  DW_TAG_member
   12760                      .dwattr $C$DW$1664, DW_AT_type(*$C$DW$T$39)
   12761                      .dwattr $C$DW$1664, DW_AT_name("GPACLEAR")
   12762                      .dwattr $C$DW$1664, DW_AT_TI_symbol_name("_GPACLEAR")
   12763                      .dwattr $C$DW$1664, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   12764                      .dwattr $C$DW$1664, DW_AT_accessibility(DW_ACCESS_public)
   12765              
   12766              $C$DW$1665      .dwtag  DW_TAG_member
   12767                      .dwattr $C$DW$1665, DW_AT_type(*$C$DW$T$39)
   12768                      .dwattr $C$DW$1665, DW_AT_name("GPATOGGLE")
   12769                      .dwattr $C$DW$1665, DW_AT_TI_symbol_name("_GPATOGGLE")
   12770                      .dwattr $C$DW$1665, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   12771                      .dwattr $C$DW$1665, DW_AT_accessibility(DW_ACCESS_public)
   12772              
   12773              $C$DW$1666      .dwtag  DW_TAG_member
   12774                      .dwattr $C$DW$1666, DW_AT_type(*$C$DW$T$39)
   12775                      .dwattr $C$DW$1666, DW_AT_name("GPBDAT")
   12776                      .dwattr $C$DW$1666, DW_AT_TI_symbol_name("_GPBDAT")
   12777                      .dwattr $C$DW$1666, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   12778                      .dwattr $C$DW$1666, DW_AT_accessibility(DW_ACCESS_public)
   12779              
   12780              $C$DW$1667      .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  242

   12781                      .dwattr $C$DW$1667, DW_AT_type(*$C$DW$T$39)
   12782                      .dwattr $C$DW$1667, DW_AT_name("GPBSET")
   12783                      .dwattr $C$DW$1667, DW_AT_TI_symbol_name("_GPBSET")
   12784                      .dwattr $C$DW$1667, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   12785                      .dwattr $C$DW$1667, DW_AT_accessibility(DW_ACCESS_public)
   12786              
   12787              $C$DW$1668      .dwtag  DW_TAG_member
   12788                      .dwattr $C$DW$1668, DW_AT_type(*$C$DW$T$39)
   12789                      .dwattr $C$DW$1668, DW_AT_name("GPBCLEAR")
   12790                      .dwattr $C$DW$1668, DW_AT_TI_symbol_name("_GPBCLEAR")
   12791                      .dwattr $C$DW$1668, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   12792                      .dwattr $C$DW$1668, DW_AT_accessibility(DW_ACCESS_public)
   12793              
   12794              $C$DW$1669      .dwtag  DW_TAG_member
   12795                      .dwattr $C$DW$1669, DW_AT_type(*$C$DW$T$39)
   12796                      .dwattr $C$DW$1669, DW_AT_name("GPBTOGGLE")
   12797                      .dwattr $C$DW$1669, DW_AT_TI_symbol_name("_GPBTOGGLE")
   12798                      .dwattr $C$DW$1669, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   12799                      .dwattr $C$DW$1669, DW_AT_accessibility(DW_ACCESS_public)
   12800              
   12801              $C$DW$1670      .dwtag  DW_TAG_member
   12802                      .dwattr $C$DW$1670, DW_AT_type(*$C$DW$T$31)
   12803                      .dwattr $C$DW$1670, DW_AT_name("rsvd_7")
   12804                      .dwattr $C$DW$1670, DW_AT_TI_symbol_name("_rsvd_7")
   12805                      .dwattr $C$DW$1670, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   12806                      .dwattr $C$DW$1670, DW_AT_accessibility(DW_ACCESS_public)
   12807              
   12808              $C$DW$1671      .dwtag  DW_TAG_member
   12809                      .dwattr $C$DW$1671, DW_AT_type(*$C$DW$T$39)
   12810                      .dwattr $C$DW$1671, DW_AT_name("AIODAT")
   12811                      .dwattr $C$DW$1671, DW_AT_TI_symbol_name("_AIODAT")
   12812                      .dwattr $C$DW$1671, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   12813                      .dwattr $C$DW$1671, DW_AT_accessibility(DW_ACCESS_public)
   12814              
   12815              $C$DW$1672      .dwtag  DW_TAG_member
   12816                      .dwattr $C$DW$1672, DW_AT_type(*$C$DW$T$39)
   12817                      .dwattr $C$DW$1672, DW_AT_name("AIOSET")
   12818                      .dwattr $C$DW$1672, DW_AT_TI_symbol_name("_AIOSET")
   12819                      .dwattr $C$DW$1672, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   12820                      .dwattr $C$DW$1672, DW_AT_accessibility(DW_ACCESS_public)
   12821              
   12822              $C$DW$1673      .dwtag  DW_TAG_member
   12823                      .dwattr $C$DW$1673, DW_AT_type(*$C$DW$T$39)
   12824                      .dwattr $C$DW$1673, DW_AT_name("AIOCLEAR")
   12825                      .dwattr $C$DW$1673, DW_AT_TI_symbol_name("_AIOCLEAR")
   12826                      .dwattr $C$DW$1673, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   12827                      .dwattr $C$DW$1673, DW_AT_accessibility(DW_ACCESS_public)
   12828              
   12829              $C$DW$1674      .dwtag  DW_TAG_member
   12830                      .dwattr $C$DW$1674, DW_AT_type(*$C$DW$T$39)
   12831                      .dwattr $C$DW$1674, DW_AT_name("AIOTOGGLE")
   12832                      .dwattr $C$DW$1674, DW_AT_TI_symbol_name("_AIOTOGGLE")
   12833                      .dwattr $C$DW$1674, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   12834                      .dwattr $C$DW$1674, DW_AT_accessibility(DW_ACCESS_public)
   12835              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  243

   12836              $C$DW$1675      .dwtag  DW_TAG_member
   12837                      .dwattr $C$DW$1675, DW_AT_type(*$C$DW$T$28)
   12838                      .dwattr $C$DW$1675, DW_AT_name("GPIOXINTnSEL")
   12839                      .dwattr $C$DW$1675, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   12840                      .dwattr $C$DW$1675, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   12841                      .dwattr $C$DW$1675, DW_AT_accessibility(DW_ACCESS_public)
   12842              
   12843              $C$DW$1676      .dwtag  DW_TAG_member
   12844                      .dwattr $C$DW$1676, DW_AT_type(*$C$DW$T$27)
   12845                      .dwattr $C$DW$1676, DW_AT_name("rsvd_8")
   12846                      .dwattr $C$DW$1676, DW_AT_TI_symbol_name("_rsvd_8")
   12847                      .dwattr $C$DW$1676, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   12848                      .dwattr $C$DW$1676, DW_AT_accessibility(DW_ACCESS_public)
   12849              
   12850              $C$DW$1677      .dwtag  DW_TAG_member
   12851                      .dwattr $C$DW$1677, DW_AT_type(*$C$DW$T$39)
   12852                      .dwattr $C$DW$1677, DW_AT_name("GPIOLPMSEL")
   12853                      .dwattr $C$DW$1677, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   12854                      .dwattr $C$DW$1677, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   12855                      .dwattr $C$DW$1677, DW_AT_accessibility(DW_ACCESS_public)
   12856              
   12857                      .dwendtag $C$DW$T$42
   12858              
   12859              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
   12860                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
   12861                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
   12862              
   12863              $C$DW$T$59      .dwtag  DW_TAG_typedef
   12864                      .dwattr $C$DW$T$59, DW_AT_name("GPIO_Handle")
   12865                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   12866                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   12867              
   12868              
   12869              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   12870                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
   12871                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x0e)
   12872              $C$DW$1678      .dwtag  DW_TAG_member
   12873                      .dwattr $C$DW$1678, DW_AT_type(*$C$DW$T$43)
   12874                      .dwattr $C$DW$1678, DW_AT_name("I")
   12875                      .dwattr $C$DW$1678, DW_AT_TI_symbol_name("_I")
   12876                      .dwattr $C$DW$1678, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12877                      .dwattr $C$DW$1678, DW_AT_accessibility(DW_ACCESS_public)
   12878              
   12879              $C$DW$1679      .dwtag  DW_TAG_member
   12880                      .dwattr $C$DW$1679, DW_AT_type(*$C$DW$T$43)
   12881                      .dwattr $C$DW$1679, DW_AT_name("V")
   12882                      .dwattr $C$DW$1679, DW_AT_TI_symbol_name("_V")
   12883                      .dwattr $C$DW$1679, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12884                      .dwattr $C$DW$1679, DW_AT_accessibility(DW_ACCESS_public)
   12885              
   12886              $C$DW$1680      .dwtag  DW_TAG_member
   12887                      .dwattr $C$DW$1680, DW_AT_type(*$C$DW$T$35)
   12888                      .dwattr $C$DW$1680, DW_AT_name("dcBus")
   12889                      .dwattr $C$DW$1680, DW_AT_TI_symbol_name("_dcBus")
   12890                      .dwattr $C$DW$1680, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  244

   12891                      .dwattr $C$DW$1680, DW_AT_accessibility(DW_ACCESS_public)
   12892              
   12893                      .dwendtag $C$DW$T$44
   12894              
   12895              $C$DW$T$83      .dwtag  DW_TAG_typedef
   12896                      .dwattr $C$DW$T$83, DW_AT_name("HAL_AdcData_t")
   12897                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$44)
   12898                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
   12899              
   12900              
   12901              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   12902                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
   12903                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
   12904              $C$DW$1681      .dwtag  DW_TAG_member
   12905                      .dwattr $C$DW$1681, DW_AT_type(*$C$DW$T$22)
   12906                      .dwattr $C$DW$1681, DW_AT_name("PeriodMax")
   12907                      .dwattr $C$DW$1681, DW_AT_TI_symbol_name("_PeriodMax")
   12908                      .dwattr $C$DW$1681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12909                      .dwattr $C$DW$1681, DW_AT_accessibility(DW_ACCESS_public)
   12910              
   12911              $C$DW$1682      .dwtag  DW_TAG_member
   12912                      .dwattr $C$DW$1682, DW_AT_type(*$C$DW$T$47)
   12913                      .dwattr $C$DW$1682, DW_AT_name("ptrData")
   12914                      .dwattr $C$DW$1682, DW_AT_TI_symbol_name("_ptrData")
   12915                      .dwattr $C$DW$1682, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12916                      .dwattr $C$DW$1682, DW_AT_accessibility(DW_ACCESS_public)
   12917              
   12918              $C$DW$1683      .dwtag  DW_TAG_member
   12919                      .dwattr $C$DW$1683, DW_AT_type(*$C$DW$T$48)
   12920                      .dwattr $C$DW$1683, DW_AT_name("value")
   12921                      .dwattr $C$DW$1683, DW_AT_TI_symbol_name("_value")
   12922                      .dwattr $C$DW$1683, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12923                      .dwattr $C$DW$1683, DW_AT_accessibility(DW_ACCESS_public)
   12924              
   12925              $C$DW$1684      .dwtag  DW_TAG_member
   12926                      .dwattr $C$DW$1684, DW_AT_type(*$C$DW$T$48)
   12927                      .dwattr $C$DW$1684, DW_AT_name("offset")
   12928                      .dwattr $C$DW$1684, DW_AT_TI_symbol_name("_offset")
   12929                      .dwattr $C$DW$1684, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   12930                      .dwattr $C$DW$1684, DW_AT_accessibility(DW_ACCESS_public)
   12931              
   12932              $C$DW$1685      .dwtag  DW_TAG_member
   12933                      .dwattr $C$DW$1685, DW_AT_type(*$C$DW$T$48)
   12934                      .dwattr $C$DW$1685, DW_AT_name("gain")
   12935                      .dwattr $C$DW$1685, DW_AT_TI_symbol_name("_gain")
   12936                      .dwattr $C$DW$1685, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   12937                      .dwattr $C$DW$1685, DW_AT_accessibility(DW_ACCESS_public)
   12938              
   12939                      .dwendtag $C$DW$T$49
   12940              
   12941              $C$DW$T$312     .dwtag  DW_TAG_typedef
   12942                      .dwattr $C$DW$T$312, DW_AT_name("HAL_DacData_t")
   12943                      .dwattr $C$DW$T$312, DW_AT_type(*$C$DW$T$49)
   12944                      .dwattr $C$DW$T$312, DW_AT_language(DW_LANG_C)
   12945              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  245

   12946              $C$DW$T$313     .dwtag  DW_TAG_pointer_type
   12947                      .dwattr $C$DW$T$313, DW_AT_type(*$C$DW$T$312)
   12948                      .dwattr $C$DW$T$313, DW_AT_address_class(0x20)
   12949              
   12950              $C$DW$1686      .dwtag  DW_TAG_TI_far_type
   12951                      .dwattr $C$DW$1686, DW_AT_type(*$C$DW$T$313)
   12952              
   12953              $C$DW$T$314     .dwtag  DW_TAG_const_type
   12954                      .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$1686)
   12955              
   12956              
   12957              $C$DW$T$84      .dwtag  DW_TAG_structure_type
   12958                      .dwattr $C$DW$T$84, DW_AT_name("_HAL_Obj_")
   12959                      .dwattr $C$DW$T$84, DW_AT_byte_size(0xa8)
   12960              $C$DW$1687      .dwtag  DW_TAG_member
   12961                      .dwattr $C$DW$1687, DW_AT_type(*$C$DW$T$51)
   12962                      .dwattr $C$DW$1687, DW_AT_name("adcHandle")
   12963                      .dwattr $C$DW$1687, DW_AT_TI_symbol_name("_adcHandle")
   12964                      .dwattr $C$DW$1687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12965                      .dwattr $C$DW$1687, DW_AT_accessibility(DW_ACCESS_public)
   12966              
   12967              $C$DW$1688      .dwtag  DW_TAG_member
   12968                      .dwattr $C$DW$1688, DW_AT_type(*$C$DW$T$53)
   12969                      .dwattr $C$DW$1688, DW_AT_name("clkHandle")
   12970                      .dwattr $C$DW$1688, DW_AT_TI_symbol_name("_clkHandle")
   12971                      .dwattr $C$DW$1688, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12972                      .dwattr $C$DW$1688, DW_AT_accessibility(DW_ACCESS_public)
   12973              
   12974              $C$DW$1689      .dwtag  DW_TAG_member
   12975                      .dwattr $C$DW$1689, DW_AT_type(*$C$DW$T$55)
   12976                      .dwattr $C$DW$1689, DW_AT_name("cpuHandle")
   12977                      .dwattr $C$DW$1689, DW_AT_TI_symbol_name("_cpuHandle")
   12978                      .dwattr $C$DW$1689, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12979                      .dwattr $C$DW$1689, DW_AT_accessibility(DW_ACCESS_public)
   12980              
   12981              $C$DW$1690      .dwtag  DW_TAG_member
   12982                      .dwattr $C$DW$1690, DW_AT_type(*$C$DW$T$57)
   12983                      .dwattr $C$DW$1690, DW_AT_name("flashHandle")
   12984                      .dwattr $C$DW$1690, DW_AT_TI_symbol_name("_flashHandle")
   12985                      .dwattr $C$DW$1690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12986                      .dwattr $C$DW$1690, DW_AT_accessibility(DW_ACCESS_public)
   12987              
   12988              $C$DW$1691      .dwtag  DW_TAG_member
   12989                      .dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$59)
   12990                      .dwattr $C$DW$1691, DW_AT_name("gpioHandle")
   12991                      .dwattr $C$DW$1691, DW_AT_TI_symbol_name("_gpioHandle")
   12992                      .dwattr $C$DW$1691, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12993                      .dwattr $C$DW$1691, DW_AT_accessibility(DW_ACCESS_public)
   12994              
   12995              $C$DW$1692      .dwtag  DW_TAG_member
   12996                      .dwattr $C$DW$1692, DW_AT_type(*$C$DW$T$62)
   12997                      .dwattr $C$DW$1692, DW_AT_name("offsetHandle_I")
   12998                      .dwattr $C$DW$1692, DW_AT_TI_symbol_name("_offsetHandle_I")
   12999                      .dwattr $C$DW$1692, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13000                      .dwattr $C$DW$1692, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  246

   13001              
   13002              $C$DW$1693      .dwtag  DW_TAG_member
   13003                      .dwattr $C$DW$1693, DW_AT_type(*$C$DW$T$64)
   13004                      .dwattr $C$DW$1693, DW_AT_name("offset_I")
   13005                      .dwattr $C$DW$1693, DW_AT_TI_symbol_name("_offset_I")
   13006                      .dwattr $C$DW$1693, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13007                      .dwattr $C$DW$1693, DW_AT_accessibility(DW_ACCESS_public)
   13008              
   13009              $C$DW$1694      .dwtag  DW_TAG_member
   13010                      .dwattr $C$DW$1694, DW_AT_type(*$C$DW$T$62)
   13011                      .dwattr $C$DW$1694, DW_AT_name("offsetHandle_V")
   13012                      .dwattr $C$DW$1694, DW_AT_TI_symbol_name("_offsetHandle_V")
   13013                      .dwattr $C$DW$1694, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   13014                      .dwattr $C$DW$1694, DW_AT_accessibility(DW_ACCESS_public)
   13015              
   13016              $C$DW$1695      .dwtag  DW_TAG_member
   13017                      .dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$64)
   13018                      .dwattr $C$DW$1695, DW_AT_name("offset_V")
   13019                      .dwattr $C$DW$1695, DW_AT_TI_symbol_name("_offset_V")
   13020                      .dwattr $C$DW$1695, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   13021                      .dwattr $C$DW$1695, DW_AT_accessibility(DW_ACCESS_public)
   13022              
   13023              $C$DW$1696      .dwtag  DW_TAG_member
   13024                      .dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$66)
   13025                      .dwattr $C$DW$1696, DW_AT_name("oscHandle")
   13026                      .dwattr $C$DW$1696, DW_AT_TI_symbol_name("_oscHandle")
   13027                      .dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   13028                      .dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
   13029              
   13030              $C$DW$1697      .dwtag  DW_TAG_member
   13031                      .dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$68)
   13032                      .dwattr $C$DW$1697, DW_AT_name("pieHandle")
   13033                      .dwattr $C$DW$1697, DW_AT_TI_symbol_name("_pieHandle")
   13034                      .dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   13035                      .dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
   13036              
   13037              $C$DW$1698      .dwtag  DW_TAG_member
   13038                      .dwattr $C$DW$1698, DW_AT_type(*$C$DW$T$70)
   13039                      .dwattr $C$DW$1698, DW_AT_name("pllHandle")
   13040                      .dwattr $C$DW$1698, DW_AT_TI_symbol_name("_pllHandle")
   13041                      .dwattr $C$DW$1698, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   13042                      .dwattr $C$DW$1698, DW_AT_accessibility(DW_ACCESS_public)
   13043              
   13044              $C$DW$1699      .dwtag  DW_TAG_member
   13045                      .dwattr $C$DW$1699, DW_AT_type(*$C$DW$T$73)
   13046                      .dwattr $C$DW$1699, DW_AT_name("pwmHandle")
   13047                      .dwattr $C$DW$1699, DW_AT_TI_symbol_name("_pwmHandle")
   13048                      .dwattr $C$DW$1699, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   13049                      .dwattr $C$DW$1699, DW_AT_accessibility(DW_ACCESS_public)
   13050              
   13051              $C$DW$1700      .dwtag  DW_TAG_member
   13052                      .dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$73)
   13053                      .dwattr $C$DW$1700, DW_AT_name("pwmDacHandle")
   13054                      .dwattr $C$DW$1700, DW_AT_TI_symbol_name("_pwmDacHandle")
   13055                      .dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  247

   13056                      .dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
   13057              
   13058              $C$DW$1701      .dwtag  DW_TAG_member
   13059                      .dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$75)
   13060                      .dwattr $C$DW$1701, DW_AT_name("pwrHandle")
   13061                      .dwattr $C$DW$1701, DW_AT_TI_symbol_name("_pwrHandle")
   13062                      .dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   13063                      .dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
   13064              
   13065              $C$DW$1702      .dwtag  DW_TAG_member
   13066                      .dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$78)
   13067                      .dwattr $C$DW$1702, DW_AT_name("timerHandle")
   13068                      .dwattr $C$DW$1702, DW_AT_TI_symbol_name("_timerHandle")
   13069                      .dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   13070                      .dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
   13071              
   13072              $C$DW$1703      .dwtag  DW_TAG_member
   13073                      .dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$80)
   13074                      .dwattr $C$DW$1703, DW_AT_name("i2cHandle")
   13075                      .dwattr $C$DW$1703, DW_AT_TI_symbol_name("_i2cHandle")
   13076                      .dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   13077                      .dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
   13078              
   13079              $C$DW$1704      .dwtag  DW_TAG_member
   13080                      .dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$82)
   13081                      .dwattr $C$DW$1704, DW_AT_name("wdogHandle")
   13082                      .dwattr $C$DW$1704, DW_AT_TI_symbol_name("_wdogHandle")
   13083                      .dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   13084                      .dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
   13085              
   13086              $C$DW$1705      .dwtag  DW_TAG_member
   13087                      .dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$83)
   13088                      .dwattr $C$DW$1705, DW_AT_name("adcBias")
   13089                      .dwattr $C$DW$1705, DW_AT_TI_symbol_name("_adcBias")
   13090                      .dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   13091                      .dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
   13092              
   13093              $C$DW$1706      .dwtag  DW_TAG_member
   13094                      .dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$35)
   13095                      .dwattr $C$DW$1706, DW_AT_name("current_sf")
   13096                      .dwattr $C$DW$1706, DW_AT_TI_symbol_name("_current_sf")
   13097                      .dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
   13098                      .dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
   13099              
   13100              $C$DW$1707      .dwtag  DW_TAG_member
   13101                      .dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$35)
   13102                      .dwattr $C$DW$1707, DW_AT_name("voltage_sf")
   13103                      .dwattr $C$DW$1707, DW_AT_TI_symbol_name("_voltage_sf")
   13104                      .dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
   13105                      .dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
   13106              
   13107              $C$DW$1708      .dwtag  DW_TAG_member
   13108                      .dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$33)
   13109                      .dwattr $C$DW$1708, DW_AT_name("numCurrentSensors")
   13110                      .dwattr $C$DW$1708, DW_AT_TI_symbol_name("_numCurrentSensors")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  248

   13111                      .dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
   13112                      .dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
   13113              
   13114              $C$DW$1709      .dwtag  DW_TAG_member
   13115                      .dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$33)
   13116                      .dwattr $C$DW$1709, DW_AT_name("numVoltageSensors")
   13117                      .dwattr $C$DW$1709, DW_AT_TI_symbol_name("_numVoltageSensors")
   13118                      .dwattr $C$DW$1709, DW_AT_data_member_location[DW_OP_plus_uconst 0xa7]
   13119                      .dwattr $C$DW$1709, DW_AT_accessibility(DW_ACCESS_public)
   13120              
   13121                      .dwendtag $C$DW$T$84
   13122              
   13123              $C$DW$T$317     .dwtag  DW_TAG_typedef
   13124                      .dwattr $C$DW$T$317, DW_AT_name("HAL_Obj")
   13125                      .dwattr $C$DW$T$317, DW_AT_type(*$C$DW$T$84)
   13126                      .dwattr $C$DW$T$317, DW_AT_language(DW_LANG_C)
   13127              
   13128              $C$DW$T$318     .dwtag  DW_TAG_pointer_type
   13129                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$T$317)
   13130                      .dwattr $C$DW$T$318, DW_AT_address_class(0x20)
   13131              
   13132              $C$DW$T$319     .dwtag  DW_TAG_pointer_type
   13133                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$T$84)
   13134                      .dwattr $C$DW$T$319, DW_AT_address_class(0x20)
   13135              
   13136              $C$DW$T$320     .dwtag  DW_TAG_typedef
   13137                      .dwattr $C$DW$T$320, DW_AT_name("HAL_Handle")
   13138                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$T$319)
   13139                      .dwattr $C$DW$T$320, DW_AT_language(DW_LANG_C)
   13140              
   13141              $C$DW$1710      .dwtag  DW_TAG_TI_far_type
   13142                      .dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$320)
   13143              
   13144              $C$DW$T$321     .dwtag  DW_TAG_const_type
   13145                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$1710)
   13146              
   13147              
   13148              $C$DW$T$86      .dwtag  DW_TAG_structure_type
   13149                      .dwattr $C$DW$T$86, DW_AT_name("_MATH_vec3_")
   13150                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x06)
   13151              $C$DW$1711      .dwtag  DW_TAG_member
   13152                      .dwattr $C$DW$1711, DW_AT_type(*$C$DW$T$85)
   13153                      .dwattr $C$DW$1711, DW_AT_name("value")
   13154                      .dwattr $C$DW$1711, DW_AT_TI_symbol_name("_value")
   13155                      .dwattr $C$DW$1711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13156                      .dwattr $C$DW$1711, DW_AT_accessibility(DW_ACCESS_public)
   13157              
   13158                      .dwendtag $C$DW$T$86
   13159              
   13160              $C$DW$T$43      .dwtag  DW_TAG_typedef
   13161                      .dwattr $C$DW$T$43, DW_AT_name("MATH_vec3")
   13162                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$86)
   13163                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   13164              
   13165              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  249

   13166              $C$DW$T$90      .dwtag  DW_TAG_structure_type
   13167                      .dwattr $C$DW$T$90, DW_AT_name("_OFFSET_")
   13168                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x10)
   13169              $C$DW$1712      .dwtag  DW_TAG_member
   13170                      .dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$35)
   13171                      .dwattr $C$DW$1712, DW_AT_name("value")
   13172                      .dwattr $C$DW$1712, DW_AT_TI_symbol_name("_value")
   13173                      .dwattr $C$DW$1712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13174                      .dwattr $C$DW$1712, DW_AT_accessibility(DW_ACCESS_public)
   13175              
   13176              $C$DW$1713      .dwtag  DW_TAG_member
   13177                      .dwattr $C$DW$1713, DW_AT_type(*$C$DW$T$35)
   13178                      .dwattr $C$DW$1713, DW_AT_name("bias")
   13179                      .dwattr $C$DW$1713, DW_AT_TI_symbol_name("_bias")
   13180                      .dwattr $C$DW$1713, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13181                      .dwattr $C$DW$1713, DW_AT_accessibility(DW_ACCESS_public)
   13182              
   13183              $C$DW$1714      .dwtag  DW_TAG_member
   13184                      .dwattr $C$DW$1714, DW_AT_type(*$C$DW$T$87)
   13185                      .dwattr $C$DW$1714, DW_AT_name("filter")
   13186                      .dwattr $C$DW$1714, DW_AT_TI_symbol_name("_filter")
   13187                      .dwattr $C$DW$1714, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13188                      .dwattr $C$DW$1714, DW_AT_accessibility(DW_ACCESS_public)
   13189              
   13190              $C$DW$1715      .dwtag  DW_TAG_member
   13191                      .dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$89)
   13192                      .dwattr $C$DW$1715, DW_AT_name("filterHandle")
   13193                      .dwattr $C$DW$1715, DW_AT_TI_symbol_name("_filterHandle")
   13194                      .dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13195                      .dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
   13196              
   13197                      .dwendtag $C$DW$T$90
   13198              
   13199              $C$DW$T$63      .dwtag  DW_TAG_typedef
   13200                      .dwattr $C$DW$T$63, DW_AT_name("OFFSET_Obj")
   13201                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$90)
   13202                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   13203              
   13204              
   13205              $C$DW$T$64      .dwtag  DW_TAG_array_type
   13206                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   13207                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   13208                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   13209              $C$DW$1716      .dwtag  DW_TAG_subrange_type
   13210                      .dwattr $C$DW$1716, DW_AT_upper_bound(0x02)
   13211              
   13212                      .dwendtag $C$DW$T$64
   13213              
   13214              
   13215              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   13216                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   13217                      .dwattr $C$DW$T$21, DW_AT_declaration
   13218                      .dwendtag $C$DW$T$21
   13219              
   13220              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  250

   13221                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   13222                      .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
   13223              
   13224              $C$DW$T$61      .dwtag  DW_TAG_typedef
   13225                      .dwattr $C$DW$T$61, DW_AT_name("OFFSET_Handle")
   13226                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   13227                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   13228              
   13229              
   13230              $C$DW$T$62      .dwtag  DW_TAG_array_type
   13231                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   13232                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   13233                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   13234              $C$DW$1717      .dwtag  DW_TAG_subrange_type
   13235                      .dwattr $C$DW$1717, DW_AT_upper_bound(0x02)
   13236              
   13237                      .dwendtag $C$DW$T$62
   13238              
   13239              
   13240              $C$DW$T$91      .dwtag  DW_TAG_structure_type
   13241                      .dwattr $C$DW$T$91, DW_AT_name("_OSC_Obj_")
   13242                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x03)
   13243              $C$DW$1718      .dwtag  DW_TAG_member
   13244                      .dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$23)
   13245                      .dwattr $C$DW$1718, DW_AT_name("INTOSC1TRIM")
   13246                      .dwattr $C$DW$1718, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   13247                      .dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13248                      .dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
   13249              
   13250              $C$DW$1719      .dwtag  DW_TAG_member
   13251                      .dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$23)
   13252                      .dwattr $C$DW$1719, DW_AT_name("rsvd_1")
   13253                      .dwattr $C$DW$1719, DW_AT_TI_symbol_name("_rsvd_1")
   13254                      .dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13255                      .dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
   13256              
   13257              $C$DW$1720      .dwtag  DW_TAG_member
   13258                      .dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$23)
   13259                      .dwattr $C$DW$1720, DW_AT_name("INTOSC2TRIM")
   13260                      .dwattr $C$DW$1720, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   13261                      .dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13262                      .dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
   13263              
   13264                      .dwendtag $C$DW$T$91
   13265              
   13266              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   13267                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$91)
   13268                      .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
   13269              
   13270              $C$DW$T$66      .dwtag  DW_TAG_typedef
   13271                      .dwattr $C$DW$T$66, DW_AT_name("OSC_Handle")
   13272                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   13273                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   13274              
   13275              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  251

   13276              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   13277                      .dwattr $C$DW$T$92, DW_AT_name("_PIE_IERIFR_t")
   13278                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
   13279              $C$DW$1721      .dwtag  DW_TAG_member
   13280                      .dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$23)
   13281                      .dwattr $C$DW$1721, DW_AT_name("IER")
   13282                      .dwattr $C$DW$1721, DW_AT_TI_symbol_name("_IER")
   13283                      .dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13284                      .dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
   13285              
   13286              $C$DW$1722      .dwtag  DW_TAG_member
   13287                      .dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$23)
   13288                      .dwattr $C$DW$1722, DW_AT_name("IFR")
   13289                      .dwattr $C$DW$1722, DW_AT_TI_symbol_name("_IFR")
   13290                      .dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13291                      .dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
   13292              
   13293                      .dwendtag $C$DW$T$92
   13294              
   13295              $C$DW$T$93      .dwtag  DW_TAG_typedef
   13296                      .dwattr $C$DW$T$93, DW_AT_name("PIE_IERIFR_t")
   13297                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   13298                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   13299              
   13300              $C$DW$1723      .dwtag  DW_TAG_TI_far_type
   13301                      .dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$93)
   13302              
   13303              $C$DW$T$94      .dwtag  DW_TAG_volatile_type
   13304                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$1723)
   13305              
   13306              
   13307              $C$DW$T$95      .dwtag  DW_TAG_array_type
   13308                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   13309                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   13310                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x18)
   13311              $C$DW$1724      .dwtag  DW_TAG_subrange_type
   13312                      .dwattr $C$DW$1724, DW_AT_upper_bound(0x0b)
   13313              
   13314                      .dwendtag $C$DW$T$95
   13315              
   13316              
   13317              $C$DW$T$102     .dwtag  DW_TAG_structure_type
   13318                      .dwattr $C$DW$T$102, DW_AT_name("_PIE_Obj_")
   13319                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x639c)
   13320              $C$DW$1725      .dwtag  DW_TAG_member
   13321                      .dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$23)
   13322                      .dwattr $C$DW$1725, DW_AT_name("PIECTRL")
   13323                      .dwattr $C$DW$1725, DW_AT_TI_symbol_name("_PIECTRL")
   13324                      .dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13325                      .dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
   13326              
   13327              $C$DW$1726      .dwtag  DW_TAG_member
   13328                      .dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$23)
   13329                      .dwattr $C$DW$1726, DW_AT_name("PIEACK")
   13330                      .dwattr $C$DW$1726, DW_AT_TI_symbol_name("_PIEACK")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  252

   13331                      .dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13332                      .dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
   13333              
   13334              $C$DW$1727      .dwtag  DW_TAG_member
   13335                      .dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$95)
   13336                      .dwattr $C$DW$1727, DW_AT_name("PIEIER_PIEIFR")
   13337                      .dwattr $C$DW$1727, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   13338                      .dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13339                      .dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
   13340              
   13341              $C$DW$1728      .dwtag  DW_TAG_member
   13342                      .dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$96)
   13343                      .dwattr $C$DW$1728, DW_AT_name("rsvd_1")
   13344                      .dwattr $C$DW$1728, DW_AT_TI_symbol_name("_rsvd_1")
   13345                      .dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13346                      .dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
   13347              
   13348              $C$DW$1729      .dwtag  DW_TAG_member
   13349                      .dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$100)
   13350                      .dwattr $C$DW$1729, DW_AT_name("Reset")
   13351                      .dwattr $C$DW$1729, DW_AT_TI_symbol_name("_Reset")
   13352                      .dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   13353                      .dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
   13354              
   13355              $C$DW$1730      .dwtag  DW_TAG_member
   13356                      .dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$100)
   13357                      .dwattr $C$DW$1730, DW_AT_name("INT1")
   13358                      .dwattr $C$DW$1730, DW_AT_TI_symbol_name("_INT1")
   13359                      .dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   13360                      .dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
   13361              
   13362              $C$DW$1731      .dwtag  DW_TAG_member
   13363                      .dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$100)
   13364                      .dwattr $C$DW$1731, DW_AT_name("INT2")
   13365                      .dwattr $C$DW$1731, DW_AT_TI_symbol_name("_INT2")
   13366                      .dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   13367                      .dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
   13368              
   13369              $C$DW$1732      .dwtag  DW_TAG_member
   13370                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$100)
   13371                      .dwattr $C$DW$1732, DW_AT_name("INT3")
   13372                      .dwattr $C$DW$1732, DW_AT_TI_symbol_name("_INT3")
   13373                      .dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   13374                      .dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
   13375              
   13376              $C$DW$1733      .dwtag  DW_TAG_member
   13377                      .dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$100)
   13378                      .dwattr $C$DW$1733, DW_AT_name("INT4")
   13379                      .dwattr $C$DW$1733, DW_AT_TI_symbol_name("_INT4")
   13380                      .dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   13381                      .dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
   13382              
   13383              $C$DW$1734      .dwtag  DW_TAG_member
   13384                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$100)
   13385                      .dwattr $C$DW$1734, DW_AT_name("INT5")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:14 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85724oRYIjQ                                                     PAGE  253

   13386                      .dwattr $C$DW$1734, DW_AT_TI_symbol_name("_INT5")
   13387                      .dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   13388                      .dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
   13389              
   13390              $C$DW$1735      .dwtag  DW_TAG_member
   13391                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$100)
   13392                      .dwattr $C$DW$1735, DW_AT_name("INT6")
   13393                      .dwattr $C$DW$1735, DW_AT_TI_symbol_name("_INT6")
   13394                      .dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   13395                      .dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
   13396              
   13397              $C$DW$1736      .dwtag  DW_TAG_member
   13398                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$100)
   13399                      .dwattr $C$DW$1736, DW_AT_name("INT7")
   13400                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_INT7")
   13401                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   13402                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
   13403              
   13404              $C$DW$1737      .dwtag  DW_TAG_member
   13405                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$100)
   13406                      .dwattr $C$DW$1737, DW_AT_name("INT8")
   13407                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_INT8")
   13408                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
