TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.3.LTS *
       3              ;* Date/Time created: Wed Jun 28 11:48:15 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("/home/wmj/Documents/motor/sw/solutions/instaspin_foc/src/proj_lab04.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.3.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/home/wmj/Documents/motor/sw/solutions/instaspin_foc/boards/hvkit_r
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3362                      .dwattr $C$DW$374, DW_AT_const_value(0x00)
    3363              
    3364              $C$DW$375       .dwtag  DW_TAG_enumerator
    3365                      .dwattr $C$DW$375, DW_AT_name("PIE_GroupNumber_2")
    3366                      .dwattr $C$DW$375, DW_AT_const_value(0x01)
    3367              
    3368              $C$DW$376       .dwtag  DW_TAG_enumerator
    3369                      .dwattr $C$DW$376, DW_AT_name("PIE_GroupNumber_3")
    3370                      .dwattr $C$DW$376, DW_AT_const_value(0x02)
    3371              
    3372              $C$DW$377       .dwtag  DW_TAG_enumerator
    3373                      .dwattr $C$DW$377, DW_AT_name("PIE_GroupNumber_4")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   67

    3374                      .dwattr $C$DW$377, DW_AT_const_value(0x03)
    3375              
    3376              $C$DW$378       .dwtag  DW_TAG_enumerator
    3377                      .dwattr $C$DW$378, DW_AT_name("PIE_GroupNumber_5")
    3378                      .dwattr $C$DW$378, DW_AT_const_value(0x04)
    3379              
    3380              $C$DW$379       .dwtag  DW_TAG_enumerator
    3381                      .dwattr $C$DW$379, DW_AT_name("PIE_GroupNumber_6")
    3382                      .dwattr $C$DW$379, DW_AT_const_value(0x05)
    3383              
    3384              $C$DW$380       .dwtag  DW_TAG_enumerator
    3385                      .dwattr $C$DW$380, DW_AT_name("PIE_GroupNumber_7")
    3386                      .dwattr $C$DW$380, DW_AT_const_value(0x06)
    3387              
    3388              $C$DW$381       .dwtag  DW_TAG_enumerator
    3389                      .dwattr $C$DW$381, DW_AT_name("PIE_GroupNumber_8")
    3390                      .dwattr $C$DW$381, DW_AT_const_value(0x07)
    3391              
    3392              $C$DW$382       .dwtag  DW_TAG_enumerator
    3393                      .dwattr $C$DW$382, DW_AT_name("PIE_GroupNumber_9")
    3394                      .dwattr $C$DW$382, DW_AT_const_value(0x08)
    3395              
    3396              $C$DW$383       .dwtag  DW_TAG_enumerator
    3397                      .dwattr $C$DW$383, DW_AT_name("PIE_GroupNumber_10")
    3398                      .dwattr $C$DW$383, DW_AT_const_value(0x09)
    3399              
    3400              $C$DW$384       .dwtag  DW_TAG_enumerator
    3401                      .dwattr $C$DW$384, DW_AT_name("PIE_GroupNumber_11")
    3402                      .dwattr $C$DW$384, DW_AT_const_value(0x0a)
    3403              
    3404              $C$DW$385       .dwtag  DW_TAG_enumerator
    3405                      .dwattr $C$DW$385, DW_AT_name("PIE_GroupNumber_12")
    3406                      .dwattr $C$DW$385, DW_AT_const_value(0x0b)
    3407              
    3408                      .dwendtag $C$DW$T$179
    3409              
    3410              $C$DW$T$180     .dwtag  DW_TAG_typedef
    3411                      .dwattr $C$DW$T$180, DW_AT_name("PIE_GroupNumber_e")
    3412                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
    3413                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    3414              
    3415              
    3416              $C$DW$T$182     .dwtag  DW_TAG_enumeration_type
    3417                      .dwattr $C$DW$T$182, DW_AT_byte_size(0x01)
    3418              $C$DW$386       .dwtag  DW_TAG_enumerator
    3419                      .dwattr $C$DW$386, DW_AT_name("HAL_SensorType_Current")
    3420                      .dwattr $C$DW$386, DW_AT_const_value(0x00)
    3421              
    3422              $C$DW$387       .dwtag  DW_TAG_enumerator
    3423                      .dwattr $C$DW$387, DW_AT_name("HAL_SensorType_Voltage")
    3424                      .dwattr $C$DW$387, DW_AT_const_value(0x01)
    3425              
    3426                      .dwendtag $C$DW$T$182
    3427              
    3428              $C$DW$T$183     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   68

    3429                      .dwattr $C$DW$T$183, DW_AT_name("HAL_SensorType_e")
    3430                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$182)
    3431                      .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    3432              
    3433              
    3434              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3435                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3436                      .dwattr $C$DW$T$19, DW_AT_declaration
    3437                      .dwendtag $C$DW$T$19
    3438              
    3439              $C$DW$T$112     .dwtag  DW_TAG_pointer_type
    3440                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$19)
    3441                      .dwattr $C$DW$T$112, DW_AT_address_class(0x20)
    3442              
    3443              $C$DW$T$113     .dwtag  DW_TAG_typedef
    3444                      .dwattr $C$DW$T$113, DW_AT_name("I2C_Handle")
    3445                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    3446                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3447              
    3448              
    3449              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3450                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3451                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3452              $C$DW$388       .dwtag  DW_TAG_member
    3453                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$25)
    3454                      .dwattr $C$DW$388, DW_AT_name("ADCRESULT")
    3455                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_ADCRESULT")
    3456                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3457                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3458              
    3459              $C$DW$389       .dwtag  DW_TAG_member
    3460                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$26)
    3461                      .dwattr $C$DW$389, DW_AT_name("resvd_1")
    3462                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_resvd_1")
    3463                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3464                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3465              
    3466              $C$DW$390       .dwtag  DW_TAG_member
    3467                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$24)
    3468                      .dwattr $C$DW$390, DW_AT_name("ADCCTL1")
    3469                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_ADCCTL1")
    3470                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3471                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3472              
    3473              $C$DW$391       .dwtag  DW_TAG_member
    3474                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$24)
    3475                      .dwattr $C$DW$391, DW_AT_name("ADCCTL2")
    3476                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_ADCCTL2")
    3477                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3478                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3479              
    3480              $C$DW$392       .dwtag  DW_TAG_member
    3481                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$27)
    3482                      .dwattr $C$DW$392, DW_AT_name("rsvd_2")
    3483                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_rsvd_2")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   69

    3484                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3485                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3486              
    3487              $C$DW$393       .dwtag  DW_TAG_member
    3488                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$24)
    3489                      .dwattr $C$DW$393, DW_AT_name("ADCINTFLG")
    3490                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_ADCINTFLG")
    3491                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3492                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3493              
    3494              $C$DW$394       .dwtag  DW_TAG_member
    3495                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$24)
    3496                      .dwattr $C$DW$394, DW_AT_name("ADCINTFLGCLR")
    3497                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3498                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3499                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3500              
    3501              $C$DW$395       .dwtag  DW_TAG_member
    3502                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$24)
    3503                      .dwattr $C$DW$395, DW_AT_name("ADCINTOVF")
    3504                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_ADCINTOVF")
    3505                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3506                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3507              
    3508              $C$DW$396       .dwtag  DW_TAG_member
    3509                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$24)
    3510                      .dwattr $C$DW$396, DW_AT_name("ADCINTOVFCLR")
    3511                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3512                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3513                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3514              
    3515              $C$DW$397       .dwtag  DW_TAG_member
    3516                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$28)
    3517                      .dwattr $C$DW$397, DW_AT_name("INTSELxNy")
    3518                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_INTSELxNy")
    3519                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3520                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3521              
    3522              $C$DW$398       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$29)
    3524                      .dwattr $C$DW$398, DW_AT_name("rsvd_3")
    3525                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_rsvd_3")
    3526                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3527                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3528              
    3529              $C$DW$399       .dwtag  DW_TAG_member
    3530                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$24)
    3531                      .dwattr $C$DW$399, DW_AT_name("SOCPRICTRL")
    3532                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3533                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3534                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3535              
    3536              $C$DW$400       .dwtag  DW_TAG_member
    3537                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$24)
    3538                      .dwattr $C$DW$400, DW_AT_name("rsvd_4")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   70

    3539                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_rsvd_4")
    3540                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3541                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3542              
    3543              $C$DW$401       .dwtag  DW_TAG_member
    3544                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$24)
    3545                      .dwattr $C$DW$401, DW_AT_name("ADCSAMPLEMODE")
    3546                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3547                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3548                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3549              
    3550              $C$DW$402       .dwtag  DW_TAG_member
    3551                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$24)
    3552                      .dwattr $C$DW$402, DW_AT_name("rsvd_5")
    3553                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_rsvd_5")
    3554                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3555                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3556              
    3557              $C$DW$403       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$24)
    3559                      .dwattr $C$DW$403, DW_AT_name("ADCINTSOCSEL1")
    3560                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3561                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3562                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3563              
    3564              $C$DW$404       .dwtag  DW_TAG_member
    3565                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$24)
    3566                      .dwattr $C$DW$404, DW_AT_name("ADCINTSOCSEL2")
    3567                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3568                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3569                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3570              
    3571              $C$DW$405       .dwtag  DW_TAG_member
    3572                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$27)
    3573                      .dwattr $C$DW$405, DW_AT_name("rsvd_6")
    3574                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_rsvd_6")
    3575                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3576                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3577              
    3578              $C$DW$406       .dwtag  DW_TAG_member
    3579                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$24)
    3580                      .dwattr $C$DW$406, DW_AT_name("ADCSOCFLG1")
    3581                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3582                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3583                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3584              
    3585              $C$DW$407       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$24)
    3587                      .dwattr $C$DW$407, DW_AT_name("rsvd_7")
    3588                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_rsvd_7")
    3589                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3590                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3591              
    3592              $C$DW$408       .dwtag  DW_TAG_member
    3593                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   71

    3594                      .dwattr $C$DW$408, DW_AT_name("ADCSOCFRC1")
    3595                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3596                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3597                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3598              
    3599              $C$DW$409       .dwtag  DW_TAG_member
    3600                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$24)
    3601                      .dwattr $C$DW$409, DW_AT_name("rsvd_8")
    3602                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_rsvd_8")
    3603                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3604                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3605              
    3606              $C$DW$410       .dwtag  DW_TAG_member
    3607                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$24)
    3608                      .dwattr $C$DW$410, DW_AT_name("ADCSOCOVF1")
    3609                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3610                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3611                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3612              
    3613              $C$DW$411       .dwtag  DW_TAG_member
    3614                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$24)
    3615                      .dwattr $C$DW$411, DW_AT_name("rsvd_9")
    3616                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_rsvd_9")
    3617                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3618                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3619              
    3620              $C$DW$412       .dwtag  DW_TAG_member
    3621                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$24)
    3622                      .dwattr $C$DW$412, DW_AT_name("ADCSOCOVFCLR1")
    3623                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3624                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3625                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3626              
    3627              $C$DW$413       .dwtag  DW_TAG_member
    3628                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$24)
    3629                      .dwattr $C$DW$413, DW_AT_name("rsvd_10")
    3630                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_rsvd_10")
    3631                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3632                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3633              
    3634              $C$DW$414       .dwtag  DW_TAG_member
    3635                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$25)
    3636                      .dwattr $C$DW$414, DW_AT_name("ADCSOCxCTL")
    3637                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3638                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3639                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3640              
    3641              $C$DW$415       .dwtag  DW_TAG_member
    3642                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$25)
    3643                      .dwattr $C$DW$415, DW_AT_name("rsvd_11")
    3644                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_rsvd_11")
    3645                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3646                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3647              
    3648              $C$DW$416       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   72

    3649                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$24)
    3650                      .dwattr $C$DW$416, DW_AT_name("ADCREFTRIM")
    3651                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3652                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3653                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3654              
    3655              $C$DW$417       .dwtag  DW_TAG_member
    3656                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$24)
    3657                      .dwattr $C$DW$417, DW_AT_name("ADCOFFTRIM")
    3658                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3659                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3660                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3661              
    3662              $C$DW$418       .dwtag  DW_TAG_member
    3663                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$30)
    3664                      .dwattr $C$DW$418, DW_AT_name("resvd_12")
    3665                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_resvd_12")
    3666                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3667                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3668              
    3669              $C$DW$419       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$24)
    3671                      .dwattr $C$DW$419, DW_AT_name("ADCREV")
    3672                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_ADCREV")
    3673                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3674                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3675              
    3676                      .dwendtag $C$DW$T$31
    3677              
    3678              $C$DW$T$185     .dwtag  DW_TAG_typedef
    3679                      .dwattr $C$DW$T$185, DW_AT_name("ADC_Obj")
    3680                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$31)
    3681                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    3682              
    3683              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    3684                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$31)
    3685                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
    3686              
    3687              $C$DW$T$84      .dwtag  DW_TAG_typedef
    3688                      .dwattr $C$DW$T$84, DW_AT_name("ADC_Handle")
    3689                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3690                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3691              
    3692              
    3693              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3694                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    3695                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    3696              $C$DW$420       .dwtag  DW_TAG_member
    3697                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$32)
    3698                      .dwattr $C$DW$420, DW_AT_name("alpha_sf")
    3699                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_alpha_sf")
    3700                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3701                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3702              
    3703              $C$DW$421       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   73

    3704                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$32)
    3705                      .dwattr $C$DW$421, DW_AT_name("beta_sf")
    3706                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_beta_sf")
    3707                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3708                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3709              
    3710              $C$DW$422       .dwtag  DW_TAG_member
    3711                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$33)
    3712                      .dwattr $C$DW$422, DW_AT_name("numSensors")
    3713                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_numSensors")
    3714                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3715                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3716              
    3717                      .dwendtag $C$DW$T$34
    3718              
    3719              $C$DW$T$45      .dwtag  DW_TAG_typedef
    3720                      .dwattr $C$DW$T$45, DW_AT_name("CLARKE_Obj")
    3721                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    3722                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3723              
    3724              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3725                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    3726                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3727              
    3728              $C$DW$T$44      .dwtag  DW_TAG_typedef
    3729                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Handle")
    3730                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3731                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3732              
    3733              
    3734              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3735                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    3736                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    3737              $C$DW$423       .dwtag  DW_TAG_member
    3738                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$24)
    3739                      .dwattr $C$DW$423, DW_AT_name("XCLK")
    3740                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_XCLK")
    3741                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3742                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3743              
    3744              $C$DW$424       .dwtag  DW_TAG_member
    3745                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$24)
    3746                      .dwattr $C$DW$424, DW_AT_name("rsvd_1")
    3747                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_rsvd_1")
    3748                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3749                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3750              
    3751              $C$DW$425       .dwtag  DW_TAG_member
    3752                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$24)
    3753                      .dwattr $C$DW$425, DW_AT_name("CLKCTL")
    3754                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_CLKCTL")
    3755                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3756                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3757              
    3758              $C$DW$426       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   74

    3759                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$35)
    3760                      .dwattr $C$DW$426, DW_AT_name("rsvd_2")
    3761                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_rsvd_2")
    3762                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3763                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3764              
    3765              $C$DW$427       .dwtag  DW_TAG_member
    3766                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$24)
    3767                      .dwattr $C$DW$427, DW_AT_name("LOSPCP")
    3768                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_LOSPCP")
    3769                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3770                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3771              
    3772              $C$DW$428       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$24)
    3774                      .dwattr $C$DW$428, DW_AT_name("PCLKCR0")
    3775                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_PCLKCR0")
    3776                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3777                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3778              
    3779              $C$DW$429       .dwtag  DW_TAG_member
    3780                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$24)
    3781                      .dwattr $C$DW$429, DW_AT_name("PCLKCR1")
    3782                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_PCLKCR1")
    3783                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3784                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3785              
    3786              $C$DW$430       .dwtag  DW_TAG_member
    3787                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$27)
    3788                      .dwattr $C$DW$430, DW_AT_name("rsvd_3")
    3789                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_rsvd_3")
    3790                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3791                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3792              
    3793              $C$DW$431       .dwtag  DW_TAG_member
    3794                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$24)
    3795                      .dwattr $C$DW$431, DW_AT_name("PCLKCR3")
    3796                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_PCLKCR3")
    3797                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3798                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3799              
    3800                      .dwendtag $C$DW$T$36
    3801              
    3802              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    3803                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$36)
    3804                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
    3805              
    3806              $C$DW$T$86      .dwtag  DW_TAG_typedef
    3807                      .dwattr $C$DW$T$86, DW_AT_name("CLK_Handle")
    3808                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3809                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3810              
    3811              
    3812              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3813                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   75

    3814                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3815              $C$DW$432       .dwtag  DW_TAG_member
    3816                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$33)
    3817                      .dwattr $C$DW$432, DW_AT_name("tmp")
    3818                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_tmp")
    3819                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3820                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3821              
    3822                      .dwendtag $C$DW$T$37
    3823              
    3824              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    3825                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$37)
    3826                      .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
    3827              
    3828              $C$DW$T$88      .dwtag  DW_TAG_typedef
    3829                      .dwattr $C$DW$T$88, DW_AT_name("CPU_Handle")
    3830                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    3831                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3832              
    3833              
    3834              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    3835                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    3836                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    3837              $C$DW$433       .dwtag  DW_TAG_member
    3838                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$38)
    3839                      .dwattr $C$DW$433, DW_AT_name("version")
    3840                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_version")
    3841                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3842                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3843              
    3844              $C$DW$434       .dwtag  DW_TAG_member
    3845                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$40)
    3846                      .dwattr $C$DW$434, DW_AT_name("state")
    3847                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_state")
    3848                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3849                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3850              
    3851              $C$DW$435       .dwtag  DW_TAG_member
    3852                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$40)
    3853                      .dwattr $C$DW$435, DW_AT_name("prevState")
    3854                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_prevState")
    3855                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3856                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3857              
    3858              $C$DW$436       .dwtag  DW_TAG_member
    3859                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$42)
    3860                      .dwattr $C$DW$436, DW_AT_name("errorCode")
    3861                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_errorCode")
    3862                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3863                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3864              
    3865              $C$DW$437       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$44)
    3867                      .dwattr $C$DW$437, DW_AT_name("clarkeHandle_I")
    3868                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_clarkeHandle_I")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   76

    3869                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3870                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3871              
    3872              $C$DW$438       .dwtag  DW_TAG_member
    3873                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$45)
    3874                      .dwattr $C$DW$438, DW_AT_name("clarke_I")
    3875                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_clarke_I")
    3876                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3877                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3878              
    3879              $C$DW$439       .dwtag  DW_TAG_member
    3880                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$44)
    3881                      .dwattr $C$DW$439, DW_AT_name("clarkeHandle_V")
    3882                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3883                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3884                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3885              
    3886              $C$DW$440       .dwtag  DW_TAG_member
    3887                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$45)
    3888                      .dwattr $C$DW$440, DW_AT_name("clarke_V")
    3889                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_clarke_V")
    3890                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3891                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3892              
    3893              $C$DW$441       .dwtag  DW_TAG_member
    3894                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$47)
    3895                      .dwattr $C$DW$441, DW_AT_name("estHandle")
    3896                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_estHandle")
    3897                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3898                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3899              
    3900              $C$DW$442       .dwtag  DW_TAG_member
    3901                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$49)
    3902                      .dwattr $C$DW$442, DW_AT_name("parkHandle")
    3903                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_parkHandle")
    3904                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3905                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3906              
    3907              $C$DW$443       .dwtag  DW_TAG_member
    3908                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$50)
    3909                      .dwattr $C$DW$443, DW_AT_name("park")
    3910                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_park")
    3911                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3912                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3913              
    3914              $C$DW$444       .dwtag  DW_TAG_member
    3915                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$52)
    3916                      .dwattr $C$DW$444, DW_AT_name("pidHandle_Id")
    3917                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_pidHandle_Id")
    3918                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3919                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3920              
    3921              $C$DW$445       .dwtag  DW_TAG_member
    3922                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$53)
    3923                      .dwattr $C$DW$445, DW_AT_name("pid_Id")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   77

    3924                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_pid_Id")
    3925                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3926                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3927              
    3928              $C$DW$446       .dwtag  DW_TAG_member
    3929                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$52)
    3930                      .dwattr $C$DW$446, DW_AT_name("pidHandle_Iq")
    3931                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3932                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3933                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3934              
    3935              $C$DW$447       .dwtag  DW_TAG_member
    3936                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$53)
    3937                      .dwattr $C$DW$447, DW_AT_name("pid_Iq")
    3938                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_pid_Iq")
    3939                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3940                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3941              
    3942              $C$DW$448       .dwtag  DW_TAG_member
    3943                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$52)
    3944                      .dwattr $C$DW$448, DW_AT_name("pidHandle_spd")
    3945                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_pidHandle_spd")
    3946                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3947                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3948              
    3949              $C$DW$449       .dwtag  DW_TAG_member
    3950                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$53)
    3951                      .dwattr $C$DW$449, DW_AT_name("pid_spd")
    3952                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_pid_spd")
    3953                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3954                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3955              
    3956              $C$DW$450       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$55)
    3958                      .dwattr $C$DW$450, DW_AT_name("iparkHandle")
    3959                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_iparkHandle")
    3960                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3961                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3962              
    3963              $C$DW$451       .dwtag  DW_TAG_member
    3964                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$56)
    3965                      .dwattr $C$DW$451, DW_AT_name("ipark")
    3966                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_ipark")
    3967                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3968                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3969              
    3970              $C$DW$452       .dwtag  DW_TAG_member
    3971                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$58)
    3972                      .dwattr $C$DW$452, DW_AT_name("svgenHandle")
    3973                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_svgenHandle")
    3974                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3975                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3976              
    3977              $C$DW$453       .dwtag  DW_TAG_member
    3978                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$59)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   78

    3979                      .dwattr $C$DW$453, DW_AT_name("svgen")
    3980                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_svgen")
    3981                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3982                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3983              
    3984              $C$DW$454       .dwtag  DW_TAG_member
    3985                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$61)
    3986                      .dwattr $C$DW$454, DW_AT_name("trajHandle_Id")
    3987                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_trajHandle_Id")
    3988                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3989                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3990              
    3991              $C$DW$455       .dwtag  DW_TAG_member
    3992                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$62)
    3993                      .dwattr $C$DW$455, DW_AT_name("traj_Id")
    3994                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_traj_Id")
    3995                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3996                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3997              
    3998              $C$DW$456       .dwtag  DW_TAG_member
    3999                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$61)
    4000                      .dwattr $C$DW$456, DW_AT_name("trajHandle_spd")
    4001                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_trajHandle_spd")
    4002                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4003                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4004              
    4005              $C$DW$457       .dwtag  DW_TAG_member
    4006                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$62)
    4007                      .dwattr $C$DW$457, DW_AT_name("traj_spd")
    4008                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_traj_spd")
    4009                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4010                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4011              
    4012              $C$DW$458       .dwtag  DW_TAG_member
    4013                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$61)
    4014                      .dwattr $C$DW$458, DW_AT_name("trajHandle_spdMax")
    4015                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4016                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4017                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4018              
    4019              $C$DW$459       .dwtag  DW_TAG_member
    4020                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$62)
    4021                      .dwattr $C$DW$459, DW_AT_name("traj_spdMax")
    4022                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_traj_spdMax")
    4023                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4024                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4025              
    4026              $C$DW$460       .dwtag  DW_TAG_member
    4027                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$63)
    4028                      .dwattr $C$DW$460, DW_AT_name("motorParams")
    4029                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_motorParams")
    4030                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4031                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4032              
    4033              $C$DW$461       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   79

    4034                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$66)
    4035                      .dwattr $C$DW$461, DW_AT_name("waitTimes")
    4036                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_waitTimes")
    4037                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4038                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4039              
    4040              $C$DW$462       .dwtag  DW_TAG_member
    4041                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$65)
    4042                      .dwattr $C$DW$462, DW_AT_name("counter_state")
    4043                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_counter_state")
    4044                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4045                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4046              
    4047              $C$DW$463       .dwtag  DW_TAG_member
    4048                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$67)
    4049                      .dwattr $C$DW$463, DW_AT_name("numIsrTicksPerCtrlTick")
    4050                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4051                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4052                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4053              
    4054              $C$DW$464       .dwtag  DW_TAG_member
    4055                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$67)
    4056                      .dwattr $C$DW$464, DW_AT_name("numCtrlTicksPerCurrentTick")
    4057                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4058                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4059                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4060              
    4061              $C$DW$465       .dwtag  DW_TAG_member
    4062                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$67)
    4063                      .dwattr $C$DW$465, DW_AT_name("numCtrlTicksPerSpeedTick")
    4064                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4065                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4066                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4067              
    4068              $C$DW$466       .dwtag  DW_TAG_member
    4069                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$67)
    4070                      .dwattr $C$DW$466, DW_AT_name("numCtrlTicksPerTrajTick")
    4071                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4072                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4073                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4074              
    4075              $C$DW$467       .dwtag  DW_TAG_member
    4076                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$65)
    4077                      .dwattr $C$DW$467, DW_AT_name("ctrlFreq_Hz")
    4078                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4079                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4080                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4081              
    4082              $C$DW$468       .dwtag  DW_TAG_member
    4083                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$65)
    4084                      .dwattr $C$DW$468, DW_AT_name("trajFreq_Hz")
    4085                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4086                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4087                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4088              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   80

    4089              $C$DW$469       .dwtag  DW_TAG_member
    4090                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$32)
    4091                      .dwattr $C$DW$469, DW_AT_name("trajPeriod_sec")
    4092                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4093                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4094                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4095              
    4096              $C$DW$470       .dwtag  DW_TAG_member
    4097                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$68)
    4098                      .dwattr $C$DW$470, DW_AT_name("ctrlPeriod_sec")
    4099                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4100                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4101                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4102              
    4103              $C$DW$471       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$32)
    4105                      .dwattr $C$DW$471, DW_AT_name("maxVsMag_pu")
    4106                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4107                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4108                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4109              
    4110              $C$DW$472       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$69)
    4112                      .dwattr $C$DW$472, DW_AT_name("Iab_in")
    4113                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_Iab_in")
    4114                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4115                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4116              
    4117              $C$DW$473       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$69)
    4119                      .dwattr $C$DW$473, DW_AT_name("Iab_filt")
    4120                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_Iab_filt")
    4121                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4122                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4123              
    4124              $C$DW$474       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$69)
    4126                      .dwattr $C$DW$474, DW_AT_name("Idq_in")
    4127                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_Idq_in")
    4128                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4129                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4130              
    4131              $C$DW$475       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$69)
    4133                      .dwattr $C$DW$475, DW_AT_name("Vab_in")
    4134                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_Vab_in")
    4135                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4136                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4137              
    4138              $C$DW$476       .dwtag  DW_TAG_member
    4139                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$32)
    4140                      .dwattr $C$DW$476, DW_AT_name("spd_out")
    4141                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_spd_out")
    4142                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4143                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   81

    4144              
    4145              $C$DW$477       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$69)
    4147                      .dwattr $C$DW$477, DW_AT_name("Vab_out")
    4148                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_Vab_out")
    4149                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4150                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4151              
    4152              $C$DW$478       .dwtag  DW_TAG_member
    4153                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$69)
    4154                      .dwattr $C$DW$478, DW_AT_name("Vdq_out")
    4155                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_Vdq_out")
    4156                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4157                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4158              
    4159              $C$DW$479       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$68)
    4161                      .dwattr $C$DW$479, DW_AT_name("Rhf")
    4162                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_Rhf")
    4163                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4164                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4165              
    4166              $C$DW$480       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$68)
    4168                      .dwattr $C$DW$480, DW_AT_name("Lhf")
    4169                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_Lhf")
    4170                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4171                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4172              
    4173              $C$DW$481       .dwtag  DW_TAG_member
    4174                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$68)
    4175                      .dwattr $C$DW$481, DW_AT_name("RoverL")
    4176                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_RoverL")
    4177                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4178                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4179              
    4180              $C$DW$482       .dwtag  DW_TAG_member
    4181                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$32)
    4182                      .dwattr $C$DW$482, DW_AT_name("Kp_Id")
    4183                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_Kp_Id")
    4184                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4185                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4186              
    4187              $C$DW$483       .dwtag  DW_TAG_member
    4188                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$32)
    4189                      .dwattr $C$DW$483, DW_AT_name("Kp_Iq")
    4190                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_Kp_Iq")
    4191                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4192                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4193              
    4194              $C$DW$484       .dwtag  DW_TAG_member
    4195                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$32)
    4196                      .dwattr $C$DW$484, DW_AT_name("Kp_spd")
    4197                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_Kp_spd")
    4198                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   82

    4199                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4200              
    4201              $C$DW$485       .dwtag  DW_TAG_member
    4202                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$32)
    4203                      .dwattr $C$DW$485, DW_AT_name("Ki_Id")
    4204                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_Ki_Id")
    4205                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4206                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4207              
    4208              $C$DW$486       .dwtag  DW_TAG_member
    4209                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$32)
    4210                      .dwattr $C$DW$486, DW_AT_name("Ki_Iq")
    4211                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_Ki_Iq")
    4212                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4213                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4214              
    4215              $C$DW$487       .dwtag  DW_TAG_member
    4216                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$32)
    4217                      .dwattr $C$DW$487, DW_AT_name("Ki_spd")
    4218                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_Ki_spd")
    4219                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4220                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4221              
    4222              $C$DW$488       .dwtag  DW_TAG_member
    4223                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$32)
    4224                      .dwattr $C$DW$488, DW_AT_name("Kd_Id")
    4225                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_Kd_Id")
    4226                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4227                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4228              
    4229              $C$DW$489       .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$32)
    4231                      .dwattr $C$DW$489, DW_AT_name("Kd_Iq")
    4232                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_Kd_Iq")
    4233                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4234                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4235              
    4236              $C$DW$490       .dwtag  DW_TAG_member
    4237                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$32)
    4238                      .dwattr $C$DW$490, DW_AT_name("Kd_spd")
    4239                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_Kd_spd")
    4240                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4241                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4242              
    4243              $C$DW$491       .dwtag  DW_TAG_member
    4244                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$32)
    4245                      .dwattr $C$DW$491, DW_AT_name("Ui_Id")
    4246                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_Ui_Id")
    4247                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4248                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4249              
    4250              $C$DW$492       .dwtag  DW_TAG_member
    4251                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$32)
    4252                      .dwattr $C$DW$492, DW_AT_name("Ui_Iq")
    4253                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_Ui_Iq")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   83

    4254                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4255                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4256              
    4257              $C$DW$493       .dwtag  DW_TAG_member
    4258                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$32)
    4259                      .dwattr $C$DW$493, DW_AT_name("Ui_spd")
    4260                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_Ui_spd")
    4261                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4262                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4263              
    4264              $C$DW$494       .dwtag  DW_TAG_member
    4265                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$69)
    4266                      .dwattr $C$DW$494, DW_AT_name("Idq_ref")
    4267                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_Idq_ref")
    4268                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4269                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4270              
    4271              $C$DW$495       .dwtag  DW_TAG_member
    4272                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$32)
    4273                      .dwattr $C$DW$495, DW_AT_name("IdRated")
    4274                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_IdRated")
    4275                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4276                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4277              
    4278              $C$DW$496       .dwtag  DW_TAG_member
    4279                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$32)
    4280                      .dwattr $C$DW$496, DW_AT_name("spd_ref")
    4281                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_spd_ref")
    4282                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4283                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4284              
    4285              $C$DW$497       .dwtag  DW_TAG_member
    4286                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$32)
    4287                      .dwattr $C$DW$497, DW_AT_name("spd_max")
    4288                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_spd_max")
    4289                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4290                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4291              
    4292              $C$DW$498       .dwtag  DW_TAG_member
    4293                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$67)
    4294                      .dwattr $C$DW$498, DW_AT_name("counter_current")
    4295                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_counter_current")
    4296                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4297                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4298              
    4299              $C$DW$499       .dwtag  DW_TAG_member
    4300                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$67)
    4301                      .dwattr $C$DW$499, DW_AT_name("counter_isr")
    4302                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_counter_isr")
    4303                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4304                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    4305              
    4306              $C$DW$500       .dwtag  DW_TAG_member
    4307                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$67)
    4308                      .dwattr $C$DW$500, DW_AT_name("counter_speed")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   84

    4309                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_counter_speed")
    4310                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4311                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    4312              
    4313              $C$DW$501       .dwtag  DW_TAG_member
    4314                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$67)
    4315                      .dwattr $C$DW$501, DW_AT_name("counter_traj")
    4316                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_counter_traj")
    4317                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4318                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    4319              
    4320              $C$DW$502       .dwtag  DW_TAG_member
    4321                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$70)
    4322                      .dwattr $C$DW$502, DW_AT_name("flag_enableCtrl")
    4323                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4324                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4325                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    4326              
    4327              $C$DW$503       .dwtag  DW_TAG_member
    4328                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$70)
    4329                      .dwattr $C$DW$503, DW_AT_name("flag_enableDcBusComp")
    4330                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4331                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4332                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    4333              
    4334              $C$DW$504       .dwtag  DW_TAG_member
    4335                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$70)
    4336                      .dwattr $C$DW$504, DW_AT_name("flag_enablePowerWarp")
    4337                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4338                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4339                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    4340              
    4341              $C$DW$505       .dwtag  DW_TAG_member
    4342                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$70)
    4343                      .dwattr $C$DW$505, DW_AT_name("flag_enableOffset")
    4344                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_flag_enableOffset")
    4345                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4346                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    4347              
    4348              $C$DW$506       .dwtag  DW_TAG_member
    4349                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$70)
    4350                      .dwattr $C$DW$506, DW_AT_name("flag_enableSpeedCtrl")
    4351                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4352                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4353                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    4354              
    4355              $C$DW$507       .dwtag  DW_TAG_member
    4356                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$70)
    4357                      .dwattr $C$DW$507, DW_AT_name("flag_enableUserMotorParams")
    4358                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4359                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4360                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    4361              
    4362              $C$DW$508       .dwtag  DW_TAG_member
    4363                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   85

    4364                      .dwattr $C$DW$508, DW_AT_name("Idq_offset_pu")
    4365                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4366                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4367                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    4368              
    4369              $C$DW$509       .dwtag  DW_TAG_member
    4370                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$69)
    4371                      .dwattr $C$DW$509, DW_AT_name("Vdq_offset_pu")
    4372                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4373                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4374                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    4375              
    4376              $C$DW$510       .dwtag  DW_TAG_member
    4377                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$32)
    4378                      .dwattr $C$DW$510, DW_AT_name("angle_pu")
    4379                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_angle_pu")
    4380                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4381                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    4382              
    4383              $C$DW$511       .dwtag  DW_TAG_member
    4384                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$32)
    4385                      .dwattr $C$DW$511, DW_AT_name("speed_ref_pu")
    4386                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_speed_ref_pu")
    4387                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4388                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    4389              
    4390              $C$DW$512       .dwtag  DW_TAG_member
    4391                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$32)
    4392                      .dwattr $C$DW$512, DW_AT_name("speed_fb_pu")
    4393                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_speed_fb_pu")
    4394                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4395                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    4396              
    4397              $C$DW$513       .dwtag  DW_TAG_member
    4398                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$32)
    4399                      .dwattr $C$DW$513, DW_AT_name("speed_outMax_pu")
    4400                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4401                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4402                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    4403              
    4404              $C$DW$514       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$70)
    4406                      .dwattr $C$DW$514, DW_AT_name("flag_enableCurrentCtrl")
    4407                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4408                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4409                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    4410              
    4411                      .dwendtag $C$DW$T$71
    4412              
    4413              $C$DW$T$186     .dwtag  DW_TAG_typedef
    4414                      .dwattr $C$DW$T$186, DW_AT_name("CTRL_Obj")
    4415                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$71)
    4416                      .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    4417              
    4418              $C$DW$T$187     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   86

    4419                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$186)
    4420                      .dwattr $C$DW$T$187, DW_AT_address_class(0x20)
    4421              
    4422              $C$DW$T$162     .dwtag  DW_TAG_pointer_type
    4423                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$71)
    4424                      .dwattr $C$DW$T$162, DW_AT_address_class(0x20)
    4425              
    4426              $C$DW$T$163     .dwtag  DW_TAG_typedef
    4427                      .dwattr $C$DW$T$163, DW_AT_name("CTRL_Handle")
    4428                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
    4429                      .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    4430              
    4431              $C$DW$515       .dwtag  DW_TAG_TI_far_type
    4432                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$163)
    4433              
    4434              $C$DW$T$188     .dwtag  DW_TAG_const_type
    4435                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$515)
    4436              
    4437              
    4438              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    4439                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    4440                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    4441              $C$DW$516       .dwtag  DW_TAG_member
    4442                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$23)
    4443                      .dwattr $C$DW$516, DW_AT_name("rsvd")
    4444                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_rsvd")
    4445                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4446                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    4447              
    4448              $C$DW$517       .dwtag  DW_TAG_member
    4449                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$73)
    4450                      .dwattr $C$DW$517, DW_AT_name("targetProc")
    4451                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_targetProc")
    4452                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4453                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    4454              
    4455              $C$DW$518       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$23)
    4457                      .dwattr $C$DW$518, DW_AT_name("major")
    4458                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_major")
    4459                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4460                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    4461              
    4462              $C$DW$519       .dwtag  DW_TAG_member
    4463                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$23)
    4464                      .dwattr $C$DW$519, DW_AT_name("minor")
    4465                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_minor")
    4466                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4467                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    4468              
    4469                      .dwendtag $C$DW$T$74
    4470              
    4471              $C$DW$T$38      .dwtag  DW_TAG_typedef
    4472                      .dwattr $C$DW$T$38, DW_AT_name("CTRL_Version")
    4473                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   87

    4474                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4475              
    4476              $C$DW$T$196     .dwtag  DW_TAG_pointer_type
    4477                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$38)
    4478                      .dwattr $C$DW$T$196, DW_AT_address_class(0x20)
    4479              
    4480              
    4481              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4482                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    4483                      .dwattr $C$DW$T$20, DW_AT_declaration
    4484                      .dwendtag $C$DW$T$20
    4485              
    4486              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4487                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
    4488                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4489              
    4490              $C$DW$T$47      .dwtag  DW_TAG_typedef
    4491                      .dwattr $C$DW$T$47, DW_AT_name("EST_Handle")
    4492                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4493                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4494              
    4495              
    4496              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4497                      .dwattr $C$DW$T$75, DW_AT_name("_FILTER_FO_")
    4498                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x0a)
    4499              $C$DW$520       .dwtag  DW_TAG_member
    4500                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$32)
    4501                      .dwattr $C$DW$520, DW_AT_name("a1")
    4502                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_a1")
    4503                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4504                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4505              
    4506              $C$DW$521       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$32)
    4508                      .dwattr $C$DW$521, DW_AT_name("b0")
    4509                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_b0")
    4510                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4511                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4512              
    4513              $C$DW$522       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$32)
    4515                      .dwattr $C$DW$522, DW_AT_name("b1")
    4516                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_b1")
    4517                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4518                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4519              
    4520              $C$DW$523       .dwtag  DW_TAG_member
    4521                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$32)
    4522                      .dwattr $C$DW$523, DW_AT_name("x1")
    4523                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_x1")
    4524                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4525                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4526              
    4527              $C$DW$524       .dwtag  DW_TAG_member
    4528                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   88

    4529                      .dwattr $C$DW$524, DW_AT_name("y1")
    4530                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_y1")
    4531                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4532                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4533              
    4534                      .dwendtag $C$DW$T$75
    4535              
    4536              $C$DW$T$132     .dwtag  DW_TAG_typedef
    4537                      .dwattr $C$DW$T$132, DW_AT_name("FILTER_FO_Obj")
    4538                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$75)
    4539                      .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    4540              
    4541              
    4542              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4543                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    4544                      .dwattr $C$DW$T$21, DW_AT_declaration
    4545                      .dwendtag $C$DW$T$21
    4546              
    4547              $C$DW$T$133     .dwtag  DW_TAG_pointer_type
    4548                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$21)
    4549                      .dwattr $C$DW$T$133, DW_AT_address_class(0x20)
    4550              
    4551              $C$DW$T$134     .dwtag  DW_TAG_typedef
    4552                      .dwattr $C$DW$T$134, DW_AT_name("FILTER_FO_Handle")
    4553                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$133)
    4554                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    4555              
    4556              
    4557              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4558                      .dwattr $C$DW$T$76, DW_AT_name("_FLASH_Obj_")
    4559                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    4560              $C$DW$525       .dwtag  DW_TAG_member
    4561                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$24)
    4562                      .dwattr $C$DW$525, DW_AT_name("FOPT")
    4563                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_FOPT")
    4564                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4565                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4566              
    4567              $C$DW$526       .dwtag  DW_TAG_member
    4568                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$24)
    4569                      .dwattr $C$DW$526, DW_AT_name("rsvd_1")
    4570                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_rsvd_1")
    4571                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4572                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4573              
    4574              $C$DW$527       .dwtag  DW_TAG_member
    4575                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$24)
    4576                      .dwattr $C$DW$527, DW_AT_name("FPWR")
    4577                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_FPWR")
    4578                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4579                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4580              
    4581              $C$DW$528       .dwtag  DW_TAG_member
    4582                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$24)
    4583                      .dwattr $C$DW$528, DW_AT_name("FSTATUS")
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   89

    4584                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_FSTATUS")
    4585                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4586                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4587              
    4588              $C$DW$529       .dwtag  DW_TAG_member
    4589                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$24)
    4590                      .dwattr $C$DW$529, DW_AT_name("FSTDBYWAIT")
    4591                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4592                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4593                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4594              
    4595              $C$DW$530       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$24)
    4597                      .dwattr $C$DW$530, DW_AT_name("FACTIVEWAIT")
    4598                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4599                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4600                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4601              
    4602              $C$DW$531       .dwtag  DW_TAG_member
    4603                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$24)
    4604                      .dwattr $C$DW$531, DW_AT_name("FBANKWAIT")
    4605                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_FBANKWAIT")
    4606                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4607                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4608              
    4609              $C$DW$532       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$24)
    4611                      .dwattr $C$DW$532, DW_AT_name("FOTPWAIT")
    4612                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_FOTPWAIT")
    4613                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4614                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4615              
    4616                      .dwendtag $C$DW$T$76
    4617              
    4618              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    4619                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$76)
    4620                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    4621              
    4622              $C$DW$T$90      .dwtag  DW_TAG_typedef
    4623                      .dwattr $C$DW$T$90, DW_AT_name("FLASH_Handle")
    4624                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    4625                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    4626              
    4627              
    4628              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    4629                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
    4630                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
    4631              $C$DW$533       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$77)
    4633                      .dwattr $C$DW$533, DW_AT_name("GPACTRL")
    4634                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_GPACTRL")
    4635                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4636                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4637              
    4638              $C$DW$534       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   90

    4639                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$77)
    4640                      .dwattr $C$DW$534, DW_AT_name("GPAQSEL1")
    4641                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_GPAQSEL1")
    4642                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4643                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4644              
    4645              $C$DW$535       .dwtag  DW_TAG_member
    4646                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$77)
    4647                      .dwattr $C$DW$535, DW_AT_name("GPAQSEL2")
    4648                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_GPAQSEL2")
    4649                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4650                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    4651              
    4652              $C$DW$536       .dwtag  DW_TAG_member
    4653                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$77)
    4654                      .dwattr $C$DW$536, DW_AT_name("GPAMUX1")
    4655                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_GPAMUX1")
    4656                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4657                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    4658              
    4659              $C$DW$537       .dwtag  DW_TAG_member
    4660                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$77)
    4661                      .dwattr $C$DW$537, DW_AT_name("GPAMUX2")
    4662                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_GPAMUX2")
    4663                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4664                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    4665              
    4666              $C$DW$538       .dwtag  DW_TAG_member
    4667                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$77)
    4668                      .dwattr $C$DW$538, DW_AT_name("GPADIR")
    4669                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_GPADIR")
    4670                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4671                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    4672              
    4673              $C$DW$539       .dwtag  DW_TAG_member
    4674                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$77)
    4675                      .dwattr $C$DW$539, DW_AT_name("GPAPUD")
    4676                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_GPAPUD")
    4677                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4678                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    4679              
    4680              $C$DW$540       .dwtag  DW_TAG_member
    4681                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$27)
    4682                      .dwattr $C$DW$540, DW_AT_name("rsvd_1")
    4683                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_rsvd_1")
    4684                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4685                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    4686              
    4687              $C$DW$541       .dwtag  DW_TAG_member
    4688                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$77)
    4689                      .dwattr $C$DW$541, DW_AT_name("GPBCTRL")
    4690                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_GPBCTRL")
    4691                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4692                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    4693              
TMS320C2000 Assembler Unix v15.12.3 Wed Jun 28 11:48:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/85824XaPRv6                                                     PAGE   91

    4694              $C$DW$542       .dwtag  DW_TAG_member
    4695                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$77)
    4696                      .dwattr $C$DW$542, DW_AT_name("GPBQSEL1")
    4697                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_GPBQSEL1")
    4698                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4699                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    4700              
    4701              $C$DW$543       .dwtag  DW_TAG_member
    4702                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$27)
    4703                      .dwattr $C$DW$543, DW_AT_name("rsvd_2")
    4704                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_rsvd_2")
    4705                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4706                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4707              
    4708              $C$DW$544       .dwtag  DW_TAG_member
    4709                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$77)
    4710                      .dwattr $C$DW$544, DW_AT_name("GPBMUX1")
    4711                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_GPBMUX1")
    4712                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4713                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4714              
    4715              $C$DW$545       .dwtag  DW_TAG_member
    4716                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$27)
    4717                      .dwattr $C$DW$545, DW_AT_name("rsvd_3")
