TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622010                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Jul 10 09:53:35 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/drivers/adc/src/32b/f28x/f2802x/adc.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;       c:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\062202 C

    2563              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_SocFrc_13"), DW_AT_const_value(0x0d)
    2564              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_SocFrc_14"), DW_AT_const_value(0x0e)
    2565              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_SocFrc_15"), DW_AT_const_value(0x0f)
    2566                      .dwendtag $C$DW$T$58
    2567              
    2568              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_SocFrc_e")
    2569                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2570                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2571              $C$DW$347       .dwtag  DW_TAG_TI_far_type
    2572                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$59)
    2573              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2574                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$347)
    2575              
    2576              $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    2577                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
    2578              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_TempSensorSrc_Ext"), DW_AT_const_value(0x00)
    2579              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_TempSensorSrc_Int"), DW_AT_const_value(0x01)
    2580                      .dwendtag $C$DW$T$61
    2581              
    2582              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_TempSensorSrc_e")
    2583                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622010                              PAGE   50

    2584                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2585              $C$DW$350       .dwtag  DW_TAG_TI_far_type
    2586                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$62)
    2587              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2588                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$350)
    2589              
    2590              $C$DW$T$64      .dwtag  DW_TAG_enumeration_type
    2591                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    2592              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_VoltageRefSrc_Int"), DW_AT_const_value(0x00)
    2593              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_VoltageRefSrc_Ext"), DW_AT_const_value(0x08)
    2594                      .dwendtag $C$DW$T$64
    2595              
    2596              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_VoltageRefSrc_e")
    2597                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2598                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2599              $C$DW$353       .dwtag  DW_TAG_TI_far_type
    2600                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$65)
    2601              $C$DW$T$66      .dwtag  DW_TAG_const_type
    2602                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$353)
    2603              
    2604              $C$DW$T$67      .dwtag  DW_TAG_enumeration_type
    2605                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
    2606              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_DivideSelect_ClkIn_by_1"), DW_AT_const_value(0x00)
    2607              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_DivideSelect_ClkIn_by_2"), DW_AT_const_value(0x01)
    2608                      .dwendtag $C$DW$T$67
    2609              
    2610              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_DivideSelect_e")
    2611                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2612                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2613              $C$DW$356       .dwtag  DW_TAG_TI_far_type
    2614                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$68)
    2615              $C$DW$T$69      .dwtag  DW_TAG_const_type
    2616                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$356)
    2617              
    2618              $C$DW$T$74      .dwtag  DW_TAG_enumeration_type
    2619                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    2620              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_NoIntTriggersSOC"), DW_AT_const_value(0x00)
    2621              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_Int1TriggersSOC"), DW_AT_const_value(0x01)
    2622              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_Int2TriggersSOC"), DW_AT_const_value(0x02)
    2623                      .dwendtag $C$DW$T$74
    2624              
    2625              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_IntTriggerSOC_e")
    2626                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2627                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2628              $C$DW$360       .dwtag  DW_TAG_TI_far_type
    2629                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$75)
    2630              $C$DW$T$76      .dwtag  DW_TAG_const_type
    2631                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$360)
    2632              
    2633              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2634                      .dwattr $C$DW$T$27, DW_AT_name("_ADC_Obj_")
    2635                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x6650)
    2636              $C$DW$361       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$21)
    2638                      .dwattr $C$DW$361, DW_AT_name("ADCRESULT")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622010                              PAGE   51

    2639                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_ADCRESULT")
    2640                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2641                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2642              $C$DW$362       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$22)
    2644                      .dwattr $C$DW$362, DW_AT_name("resvd_1")
    2645                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_resvd_1")
    2646                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2647                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2648              $C$DW$363       .dwtag  DW_TAG_member
    2649                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    2650                      .dwattr $C$DW$363, DW_AT_name("ADCCTL1")
    2651                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_ADCCTL1")
    2652                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    2653                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2654              $C$DW$364       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    2656                      .dwattr $C$DW$364, DW_AT_name("ADCCTL2")
    2657                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_ADCCTL2")
    2658                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    2659                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$365       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    2662                      .dwattr $C$DW$365, DW_AT_name("rsvd_2")
    2663                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_rsvd_2")
    2664                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    2665                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2666              $C$DW$366       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    2668                      .dwattr $C$DW$366, DW_AT_name("ADCINTFLG")
    2669                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_ADCINTFLG")
    2670                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    2671                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2672              $C$DW$367       .dwtag  DW_TAG_member
    2673                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2674                      .dwattr $C$DW$367, DW_AT_name("ADCINTFLGCLR")
    2675                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    2676                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    2677                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2678              $C$DW$368       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2680                      .dwattr $C$DW$368, DW_AT_name("ADCINTOVF")
    2681                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_ADCINTOVF")
    2682                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    2683                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2684              $C$DW$369       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    2686                      .dwattr $C$DW$369, DW_AT_name("ADCINTOVFCLR")
    2687                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    2688                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    2689                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2690              $C$DW$370       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$24)
    2692                      .dwattr $C$DW$370, DW_AT_name("INTSELxNy")
    2693                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_INTSELxNy")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622010                              PAGE   52

    2694                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    2695                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2696              $C$DW$371       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$25)
    2698                      .dwattr $C$DW$371, DW_AT_name("rsvd_3")
    2699                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd_3")
    2700                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    2701                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$372       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    2704                      .dwattr $C$DW$372, DW_AT_name("SOCPRICTRL")
    2705                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_SOCPRICTRL")
    2706                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    2707                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2708              $C$DW$373       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    2710                      .dwattr $C$DW$373, DW_AT_name("rsvd_4")
    2711                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd_4")
    2712                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    2713                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2714              $C$DW$374       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    2716                      .dwattr $C$DW$374, DW_AT_name("ADCSAMPLEMODE")
    2717                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    2718                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    2719                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2720              $C$DW$375       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    2722                      .dwattr $C$DW$375, DW_AT_name("rsvd_5")
    2723                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_rsvd_5")
    2724                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    2725                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2726              $C$DW$376       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    2728                      .dwattr $C$DW$376, DW_AT_name("ADCINTSOCSEL1")
    2729                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    2730                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    2731                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2732              $C$DW$377       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    2734                      .dwattr $C$DW$377, DW_AT_name("ADCINTSOCSEL2")
    2735                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    2736                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    2737                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$378       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    2740                      .dwattr $C$DW$378, DW_AT_name("rsvd_6")
    2741                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_rsvd_6")
    2742                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    2743                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$379       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    2746                      .dwattr $C$DW$379, DW_AT_name("ADCSOCFLG1")
    2747                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    2748                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622010                              PAGE   53

    2749                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2750              $C$DW$380       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    2752                      .dwattr $C$DW$380, DW_AT_name("rsvd_7")
    2753                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd_7")
    2754                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    2755                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$381       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    2758                      .dwattr $C$DW$381, DW_AT_name("ADCSOCFRC1")
    2759                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    2760                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    2761                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$382       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    2764                      .dwattr $C$DW$382, DW_AT_name("rsvd_8")
    2765                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_rsvd_8")
    2766                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    2767                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$383       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    2770                      .dwattr $C$DW$383, DW_AT_name("ADCSOCOVF1")
    2771                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    2772                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    2773                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2774              $C$DW$384       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$20)
    2776                      .dwattr $C$DW$384, DW_AT_name("rsvd_9")
    2777                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_rsvd_9")
    2778                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    2779                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2780              $C$DW$385       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    2782                      .dwattr $C$DW$385, DW_AT_name("ADCSOCOVFCLR1")
    2783                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    2784                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    2785                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$386       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    2788                      .dwattr $C$DW$386, DW_AT_name("rsvd_10")
    2789                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_rsvd_10")
    2790                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    2791                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2792              $C$DW$387       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$21)
    2794                      .dwattr $C$DW$387, DW_AT_name("ADCSOCxCTL")
    2795                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    2796                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    2797                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2798              $C$DW$388       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$21)
    2800                      .dwattr $C$DW$388, DW_AT_name("rsvd_11")
    2801                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd_11")
    2802                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    2803                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622010                              PAGE   54

    2804              $C$DW$389       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    2806                      .dwattr $C$DW$389, DW_AT_name("ADCREFTRIM")
    2807                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_ADCREFTRIM")
    2808                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    2809                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2810              $C$DW$390       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    2812                      .dwattr $C$DW$390, DW_AT_name("ADCOFFTRIM")
    2813                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    2814                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    2815                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2816              $C$DW$391       .dwtag  DW_TAG_member
    2817                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$26)
    2818                      .dwattr $C$DW$391, DW_AT_name("resvd_12")
    2819                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_resvd_12")
    2820                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    2821                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2822              $C$DW$392       .dwtag  DW_TAG_member
    2823                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    2824                      .dwattr $C$DW$392, DW_AT_name("ADCREV")
    2825                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ADCREV")
    2826                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    2827                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2828                      .dwendtag $C$DW$T$27
    2829              
    2830              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    2831                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$27)
    2832                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2833              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    2834                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$27)
    2835                      .dwattr $C$DW$T$70, DW_AT_address_class(0x16)
    2836              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    2837                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2838                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2839              $C$DW$393       .dwtag  DW_TAG_TI_far_type
    2840                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$71)
    2841              $C$DW$T$78      .dwtag  DW_TAG_const_type
    2842                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$393)
    2843              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2844                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    2845              $C$DW$394       .dwtag  DW_TAG_TI_far_type
    2846                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$3)
    2847              $C$DW$T$84      .dwtag  DW_TAG_const_type
    2848                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$394)
    2849              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2850                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2851                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2852                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2853              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2854                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2855                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2856                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2857              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2858                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0622010                              PAGE   55

    2859                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2860                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2861              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2862                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2863                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2864                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2865              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2866                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2867                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2868                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2869              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2870                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2871                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2872                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2873              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2874                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2875                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2876              $C$DW$395       .dwtag  DW_TAG_TI_far_type
    2877                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    2878              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
