TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0807210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Jul 10 09:53:36 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/drivers/drvic/decoder.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

     623              $C$DW$89        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
     624              $C$DW$90        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
     625              $C$DW$91        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
     626              $C$DW$92        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
     627              $C$DW$93        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_39"), DW_AT_const_value(0x27)
     628              $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_40"), DW_AT_const_value(0x28)
     629              $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_41"), DW_AT_const_value(0x29)
     630              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_42"), DW_AT_const_value(0x2a)
     631              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_43"), DW_AT_const_value(0x2b)
     632              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_44"), DW_AT_const_value(0x2c)
     633              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_50"), DW_AT_const_value(0x32)
     634              $C$DW$100       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_51"), DW_AT_const_value(0x33)
     635              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_52"), DW_AT_const_value(0x34)
     636              $C$DW$102       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_53"), DW_AT_const_value(0x35)
     637              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_54"), DW_AT_const_value(0x36)
     638              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_55"), DW_AT_const_value(0x37)
     639              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_56"), DW_AT_const_value(0x38)
     640              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_57"), DW_AT_const_value(0x39)
     641              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_58"), DW_AT_const_value(0x3a)
     642              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x3b)
     643                      .dwendtag $C$DW$T$26
     644              
     645              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
     646                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0807210                              PAGE   13

     647                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     648              $C$DW$109       .dwtag  DW_TAG_TI_far_type
     649                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$27)
     650              $C$DW$T$42      .dwtag  DW_TAG_const_type
     651                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$109)
     652              
     653              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
     654                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
     655              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_Empty"), DW_AT_const_value(0x00)
     656              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_1_Word"), DW_AT_const_value(0x100)
     657              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_2_Words"), DW_AT_const_value(0x200)
     658              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_3_Words"), DW_AT_const_value(0x300)
     659              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_4_Words"), DW_AT_const_value(0x400)
     660                      .dwendtag $C$DW$T$43
     661              
     662              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FifoStatus_e")
     663                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
     664                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
     665              $C$DW$115       .dwtag  DW_TAG_TI_far_type
     666                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$44)
     667              $C$DW$T$45      .dwtag  DW_TAG_volatile_type
     668                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$115)
     669              
     670              $C$DW$T$49      .dwtag  DW_TAG_enumeration_type
     671                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
     672              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("DECODER_CycReg"), DW_AT_const_value(0x00)
     673              $C$DW$117       .dwtag  DW_TAG_enumerator, DW_AT_name("DECODER_PosReg"), DW_AT_const_value(-32768)
     674                      .dwendtag $C$DW$T$49
     675              
     676              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_RegName_e")
     677                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
     678                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
     679              $C$DW$118       .dwtag  DW_TAG_TI_far_type
     680                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$50)
     681              $C$DW$T$51      .dwtag  DW_TAG_const_type
     682                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$118)
     683              
     684              $C$DW$T$21      .dwtag  DW_TAG_union_type
     685                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
     686              $C$DW$119       .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
     688                      .dwattr $C$DW$119, DW_AT_name("data_uint")
     689                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_data_uint")
     690                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     692              $C$DW$120       .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
     694                      .dwattr $C$DW$120, DW_AT_name("drvRegData")
     695                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_drvRegData")
     696                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     698                      .dwendtag $C$DW$T$21
     699              
     700              
     701              $C$DW$T$29      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0807210                              PAGE   14

     702                      .dwattr $C$DW$T$29, DW_AT_name("_DECODER_Obj_")
     703                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x06)
     704              $C$DW$121       .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$23)
     706                      .dwattr $C$DW$121, DW_AT_name("spiHandle")
     707                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_spiHandle")
     708                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     709                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     710              $C$DW$122       .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$25)
     712                      .dwattr $C$DW$122, DW_AT_name("gpioHandle")
     713                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_gpioHandle")
     714                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     715                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     716              $C$DW$123       .dwtag  DW_TAG_member
     717                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$27)
     718                      .dwattr $C$DW$123, DW_AT_name("gpioNumber")
     719                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_gpioNumber")
     720                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     721                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     722              $C$DW$124       .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$28)
     724                      .dwattr $C$DW$124, DW_AT_name("RxTimeOut")
     725                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_RxTimeOut")
     726                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     727                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     728                      .dwendtag $C$DW$T$29
     729              
     730              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
     731                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
     732                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
     733              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
     734                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$29)
     735                      .dwattr $C$DW$T$53, DW_AT_address_class(0x16)
     736              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
     737                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
     738                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
     739              $C$DW$125       .dwtag  DW_TAG_TI_far_type
     740                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$54)
     741              $C$DW$T$55      .dwtag  DW_TAG_const_type
     742                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$125)
     743              
     744              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     745                      .dwattr $C$DW$T$31, DW_AT_name("_DECODER_Vars_t_")
     746                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     747              $C$DW$126       .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$30)
     749                      .dwattr $C$DW$126, DW_AT_name("Pos_Reg")
     750                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_Pos_Reg")
     751                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     752                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     753              $C$DW$127       .dwtag  DW_TAG_member
     754                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$30)
     755                      .dwattr $C$DW$127, DW_AT_name("Cyc_Reg")
     756                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_Cyc_Reg")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0807210                              PAGE   15

     757                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     758                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     759                      .dwendtag $C$DW$T$31
     760              
     761              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Vars_t")
     762                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$31)
     763                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     764              
     765              $C$DW$T$40      .dwtag  DW_TAG_structure_type
     766                      .dwattr $C$DW$T$40, DW_AT_name("_GPIO_Obj_")
     767                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x6a)
     768              $C$DW$128       .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$32)
     770                      .dwattr $C$DW$128, DW_AT_name("GPACTRL")
     771                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPACTRL")
     772                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     773                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
     774              $C$DW$129       .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$32)
     776                      .dwattr $C$DW$129, DW_AT_name("GPAQSEL1")
     777                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPAQSEL1")
     778                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     779                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
     780              $C$DW$130       .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$32)
     782                      .dwattr $C$DW$130, DW_AT_name("GPAQSEL2")
     783                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPAQSEL2")
     784                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     785                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
     786              $C$DW$131       .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$32)
     788                      .dwattr $C$DW$131, DW_AT_name("GPAMUX1")
     789                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPAMUX1")
     790                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     791                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
     792              $C$DW$132       .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$32)
     794                      .dwattr $C$DW$132, DW_AT_name("GPAMUX2")
     795                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPAMUX2")
     796                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     797                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
     798              $C$DW$133       .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$32)
     800                      .dwattr $C$DW$133, DW_AT_name("GPADIR")
     801                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPADIR")
     802                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     803                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
     804              $C$DW$134       .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$32)
     806                      .dwattr $C$DW$134, DW_AT_name("GPAPUD")
     807                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPAPUD")
     808                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     809                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
     810              $C$DW$135       .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$34)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0807210                              PAGE   16

     812                      .dwattr $C$DW$135, DW_AT_name("rsvd_1")
     813                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd_1")
     814                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     815                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
     816              $C$DW$136       .dwtag  DW_TAG_member
     817                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$32)
     818                      .dwattr $C$DW$136, DW_AT_name("GPBCTRL")
     819                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPBCTRL")
     820                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     821                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
     822              $C$DW$137       .dwtag  DW_TAG_member
     823                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$32)
     824                      .dwattr $C$DW$137, DW_AT_name("GPBQSEL1")
     825                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPBQSEL1")
     826                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     827                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
     828              $C$DW$138       .dwtag  DW_TAG_member
     829                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$32)
     830                      .dwattr $C$DW$138, DW_AT_name("GPBQSEL2")
     831                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPBQSEL2")
     832                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     833                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
     834              $C$DW$139       .dwtag  DW_TAG_member
     835                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$32)
     836                      .dwattr $C$DW$139, DW_AT_name("GPBMUX1")
     837                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPBMUX1")
     838                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     839                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
     840              $C$DW$140       .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$32)
     842                      .dwattr $C$DW$140, DW_AT_name("GPBMUX2")
     843                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPBMUX2")
     844                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     845                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
     846              $C$DW$141       .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$32)
     848                      .dwattr $C$DW$141, DW_AT_name("GPBDIR")
     849                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPBDIR")
     850                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     851                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
     852              $C$DW$142       .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$32)
     854                      .dwattr $C$DW$142, DW_AT_name("GPBPUD")
     855                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPBPUD")
     856                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     857                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
     858              $C$DW$143       .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$35)
     860                      .dwattr $C$DW$143, DW_AT_name("rsvd_4")
     861                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd_4")
     862                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     863                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
     864              $C$DW$144       .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$32)
     866                      .dwattr $C$DW$144, DW_AT_name("AIOMUX1")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0807210                              PAGE   17

     867                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_AIOMUX1")
     868                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     869                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
     870              $C$DW$145       .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$34)
     872                      .dwattr $C$DW$145, DW_AT_name("rsvd_5")
     873                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd_5")
     874                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     875                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
     876              $C$DW$146       .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$32)
     878                      .dwattr $C$DW$146, DW_AT_name("AIODIR")
     879                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_AIODIR")
     880                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     881                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
     882              $C$DW$147       .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$36)
     884                      .dwattr $C$DW$147, DW_AT_name("rsvd_6")
     885                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd_6")
     886                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     887                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
     888              $C$DW$148       .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$32)
     890                      .dwattr $C$DW$148, DW_AT_name("GPADAT")
     891                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPADAT")
     892                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     893                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
     894              $C$DW$149       .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$32)
     896                      .dwattr $C$DW$149, DW_AT_name("GPASET")
     897                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPASET")
     898                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     899                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
     900              $C$DW$150       .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$32)
     902                      .dwattr $C$DW$150, DW_AT_name("GPACLEAR")
     903                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPACLEAR")
     904                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     905                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
     906              $C$DW$151       .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$32)
     908                      .dwattr $C$DW$151, DW_AT_name("GPATOGGLE")
     909                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPATOGGLE")
     910                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     911                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
     912              $C$DW$152       .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$32)
     914                      .dwattr $C$DW$152, DW_AT_name("GPBDAT")
     915                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPBDAT")
     916                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     917                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
     918              $C$DW$153       .dwtag  DW_TAG_member
     919                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$32)
     920                      .dwattr $C$DW$153, DW_AT_name("GPBSET")
     921                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPBSET")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0807210                              PAGE   18

     922                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
     923                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
     924              $C$DW$154       .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$32)
     926                      .dwattr $C$DW$154, DW_AT_name("GPBCLEAR")
     927                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPBCLEAR")
     928                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     929                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
     930              $C$DW$155       .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$32)
     932                      .dwattr $C$DW$155, DW_AT_name("GPBTOGGLE")
     933                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPBTOGGLE")
     934                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
     935                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
     936              $C$DW$156       .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$37)
     938                      .dwattr $C$DW$156, DW_AT_name("rsvd_7")
     939                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd_7")
     940                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     941                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
     942              $C$DW$157       .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$32)
     944                      .dwattr $C$DW$157, DW_AT_name("AIODAT")
     945                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_AIODAT")
     946                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     947                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
     948              $C$DW$158       .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$32)
     950                      .dwattr $C$DW$158, DW_AT_name("AIOSET")
     951                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_AIOSET")
     952                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
     953                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
     954              $C$DW$159       .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$32)
     956                      .dwattr $C$DW$159, DW_AT_name("AIOCLEAR")
     957                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_AIOCLEAR")
     958                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     959                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
     960              $C$DW$160       .dwtag  DW_TAG_member
     961                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$32)
     962                      .dwattr $C$DW$160, DW_AT_name("AIOTOGGLE")
     963                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_AIOTOGGLE")
     964                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
     965                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
     966              $C$DW$161       .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$38)
     968                      .dwattr $C$DW$161, DW_AT_name("GPIOXINTnSEL")
     969                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
     970                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     971                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
     972              $C$DW$162       .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$39)
     974                      .dwattr $C$DW$162, DW_AT_name("rsvd_8")
     975                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd_8")
     976                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0807210                              PAGE   19

     977                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
     978              $C$DW$163       .dwtag  DW_TAG_member
     979                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$32)
     980                      .dwattr $C$DW$163, DW_AT_name("GPIOLPMSEL")
     981                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIOLPMSEL")
     982                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
     983                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
     984                      .dwendtag $C$DW$T$40
     985              
     986              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     987                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$40)
     988                      .dwattr $C$DW$T$24, DW_AT_address_class(0x16)
     989              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
     990                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     991                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     992              $C$DW$164       .dwtag  DW_TAG_TI_far_type
     993                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$25)
     994              $C$DW$T$61      .dwtag  DW_TAG_const_type
     995                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$164)
     996              
     997              $C$DW$T$41      .dwtag  DW_TAG_structure_type
     998                      .dwattr $C$DW$T$41, DW_AT_name("_SPI_Obj_")
     999                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x10)
    1000              $C$DW$165       .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$33)
    1002                      .dwattr $C$DW$165, DW_AT_name("SPICCR")
    1003                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SPICCR")
    1004                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1005                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1006              $C$DW$166       .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$33)
    1008                      .dwattr $C$DW$166, DW_AT_name("SPICTL")
    1009                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_SPICTL")
    1010                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1011                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1012              $C$DW$167       .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$33)
    1014                      .dwattr $C$DW$167, DW_AT_name("SPIST")
    1015                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_SPIST")
    1016                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1017                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1018              $C$DW$168       .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$33)
    1020                      .dwattr $C$DW$168, DW_AT_name("rsvd_1")
    1021                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd_1")
    1022                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1023                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$169       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$33)
    1026                      .dwattr $C$DW$169, DW_AT_name("SPIBRR")
    1027                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_SPIBRR")
    1028                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1029                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1030              $C$DW$170       .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0807210                              PAGE   20

    1032                      .dwattr $C$DW$170, DW_AT_name("rsvd_2")
    1033                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd_2")
    1034                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1035                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1036              $C$DW$171       .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$33)
    1038                      .dwattr $C$DW$171, DW_AT_name("SPIEMU")
    1039                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_SPIEMU")
    1040                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1041                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1042              $C$DW$172       .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$33)
    1044                      .dwattr $C$DW$172, DW_AT_name("SPIRXBUF")
    1045                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_SPIRXBUF")
    1046                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1047                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1048              $C$DW$173       .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$33)
    1050                      .dwattr $C$DW$173, DW_AT_name("SPITXBUF")
    1051                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_SPITXBUF")
    1052                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1053                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1054              $C$DW$174       .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$33)
    1056                      .dwattr $C$DW$174, DW_AT_name("SPIDAT")
    1057                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_SPIDAT")
    1058                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1059                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1060              $C$DW$175       .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$33)
    1062                      .dwattr $C$DW$175, DW_AT_name("SPIFFTX")
    1063                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_SPIFFTX")
    1064                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1065                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1066              $C$DW$176       .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$33)
    1068                      .dwattr $C$DW$176, DW_AT_name("SPIFFRX")
    1069                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_SPIFFRX")
    1070                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1071                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1072              $C$DW$177       .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$33)
    1074                      .dwattr $C$DW$177, DW_AT_name("SPIFFCT")
    1075                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_SPIFFCT")
    1076                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1077                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1078              $C$DW$178       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$34)
    1080                      .dwattr $C$DW$178, DW_AT_name("rsvd_3")
    1081                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd_3")
    1082                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1083                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1084              $C$DW$179       .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$33)
    1086                      .dwattr $C$DW$179, DW_AT_name("SPIPRI")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0807210                              PAGE   21

    1087                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_SPIPRI")
    1088                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1089                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1090                      .dwendtag $C$DW$T$41
    1091              
    1092              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Obj")
    1093                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$41)
    1094                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1095              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    1096                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$41)
    1097                      .dwattr $C$DW$T$22, DW_AT_address_class(0x16)
    1098              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Handle")
    1099                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1100                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1101              $C$DW$180       .dwtag  DW_TAG_TI_far_type
    1102                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$23)
    1103              $C$DW$T$64      .dwtag  DW_TAG_const_type
    1104                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$180)
    1105              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1106                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    1107              $C$DW$181       .dwtag  DW_TAG_TI_far_type
    1108                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$3)
    1109              $C$DW$T$66      .dwtag  DW_TAG_const_type
    1110                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$181)
    1111              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1112                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1113                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1114                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1115              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1116                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1117                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1118                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1119              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1120                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1121                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1122                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1123              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    1124                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$6)
    1125                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1126              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1127                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1128                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1129                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1130              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1131                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1132                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1133                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1134              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1135                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1136                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1137                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1138              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1139                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$9)
    1140                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1141              $C$DW$182       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
