TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Jul 10 09:53:37 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("TIMER_setDecimationFactor")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_TIMER_setDecimationFactor")

    9019                      .dwattr $C$DW$T$285, DW_AT_language(DW_LANG_C)
    9020              $C$DW$1593      .dwtag  DW_TAG_TI_far_type
    9021                      .dwattr $C$DW$1593, DW_AT_type(*$C$DW$T$285)
    9022              $C$DW$T$286     .dwtag  DW_TAG_const_type
    9023                      .dwattr $C$DW$T$286, DW_AT_type(*$C$DW$1593)
    9024              
    9025              $C$DW$T$287     .dwtag  DW_TAG_enumeration_type
    9026                      .dwattr $C$DW$T$287, DW_AT_byte_size(0x01)
    9027              $C$DW$1594      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputRisingEdge_InputFallingEdge"), D
    9028              $C$DW$1595      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputFallingEdge_InputRisingEdge"), D
    9029                      .dwendtag $C$DW$T$287
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  174

    9030              
    9031              $C$DW$T$288     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity_e")
    9032                      .dwattr $C$DW$T$288, DW_AT_type(*$C$DW$T$287)
    9033                      .dwattr $C$DW$T$288, DW_AT_language(DW_LANG_C)
    9034              $C$DW$1596      .dwtag  DW_TAG_TI_far_type
    9035                      .dwattr $C$DW$1596, DW_AT_type(*$C$DW$T$288)
    9036              $C$DW$T$289     .dwtag  DW_TAG_const_type
    9037                      .dwattr $C$DW$T$289, DW_AT_type(*$C$DW$1596)
    9038              
    9039              $C$DW$T$290     .dwtag  DW_TAG_enumeration_type
    9040                      .dwattr $C$DW$T$290, DW_AT_byte_size(0x01)
    9041              $C$DW$1597      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Slave"), DW_AT_const_value(0x00)
    9042              $C$DW$1598      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Master"), DW_AT_const_value(0x04)
    9043                      .dwendtag $C$DW$T$290
    9044              
    9045              $C$DW$T$291     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
    9046                      .dwattr $C$DW$T$291, DW_AT_type(*$C$DW$T$290)
    9047                      .dwattr $C$DW$T$291, DW_AT_language(DW_LANG_C)
    9048              $C$DW$1599      .dwtag  DW_TAG_TI_far_type
    9049                      .dwattr $C$DW$1599, DW_AT_type(*$C$DW$T$291)
    9050              $C$DW$T$292     .dwtag  DW_TAG_const_type
    9051                      .dwattr $C$DW$T$292, DW_AT_type(*$C$DW$1599)
    9052              
    9053              $C$DW$T$293     .dwtag  DW_TAG_enumeration_type
    9054                      .dwattr $C$DW$T$293, DW_AT_byte_size(0x01)
    9055              $C$DW$1600      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
    9056              $C$DW$1601      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
    9057              $C$DW$1602      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
    9058                      .dwendtag $C$DW$T$293
    9059              
    9060              $C$DW$T$294     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
    9061                      .dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$293)
    9062                      .dwattr $C$DW$T$294, DW_AT_language(DW_LANG_C)
    9063              $C$DW$1603      .dwtag  DW_TAG_TI_far_type
    9064                      .dwattr $C$DW$1603, DW_AT_type(*$C$DW$T$294)
    9065              $C$DW$T$295     .dwtag  DW_TAG_const_type
    9066                      .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$1603)
    9067              
    9068              $C$DW$T$296     .dwtag  DW_TAG_enumeration_type
    9069                      .dwattr $C$DW$T$296, DW_AT_byte_size(0x01)
    9070              $C$DW$1604      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    9071              $C$DW$1605      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    9072                      .dwendtag $C$DW$T$296
    9073              
    9074              $C$DW$T$297     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    9075                      .dwattr $C$DW$T$297, DW_AT_type(*$C$DW$T$296)
    9076                      .dwattr $C$DW$T$297, DW_AT_language(DW_LANG_C)
    9077              
    9078              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9079                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    9080                      .dwattr $C$DW$T$19, DW_AT_declaration
    9081                      .dwendtag $C$DW$T$19
    9082              
    9083              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9084                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  175

    9085                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
    9086              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    9087                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    9088                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    9089              
    9090              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    9091                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    9092                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    9093              $C$DW$1606      .dwtag  DW_TAG_member
    9094                      .dwattr $C$DW$1606, DW_AT_type(*$C$DW$T$24)
    9095                      .dwattr $C$DW$1606, DW_AT_name("ADCRESULT")
    9096                      .dwattr $C$DW$1606, DW_AT_TI_symbol_name("_ADCRESULT")
    9097                      .dwattr $C$DW$1606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9098                      .dwattr $C$DW$1606, DW_AT_accessibility(DW_ACCESS_public)
    9099              $C$DW$1607      .dwtag  DW_TAG_member
    9100                      .dwattr $C$DW$1607, DW_AT_type(*$C$DW$T$25)
    9101                      .dwattr $C$DW$1607, DW_AT_name("resvd_1")
    9102                      .dwattr $C$DW$1607, DW_AT_TI_symbol_name("_resvd_1")
    9103                      .dwattr $C$DW$1607, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9104                      .dwattr $C$DW$1607, DW_AT_accessibility(DW_ACCESS_public)
    9105              $C$DW$1608      .dwtag  DW_TAG_member
    9106                      .dwattr $C$DW$1608, DW_AT_type(*$C$DW$T$23)
    9107                      .dwattr $C$DW$1608, DW_AT_name("ADCCTL1")
    9108                      .dwattr $C$DW$1608, DW_AT_TI_symbol_name("_ADCCTL1")
    9109                      .dwattr $C$DW$1608, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9110                      .dwattr $C$DW$1608, DW_AT_accessibility(DW_ACCESS_public)
    9111              $C$DW$1609      .dwtag  DW_TAG_member
    9112                      .dwattr $C$DW$1609, DW_AT_type(*$C$DW$T$23)
    9113                      .dwattr $C$DW$1609, DW_AT_name("ADCCTL2")
    9114                      .dwattr $C$DW$1609, DW_AT_TI_symbol_name("_ADCCTL2")
    9115                      .dwattr $C$DW$1609, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9116                      .dwattr $C$DW$1609, DW_AT_accessibility(DW_ACCESS_public)
    9117              $C$DW$1610      .dwtag  DW_TAG_member
    9118                      .dwattr $C$DW$1610, DW_AT_type(*$C$DW$T$26)
    9119                      .dwattr $C$DW$1610, DW_AT_name("rsvd_2")
    9120                      .dwattr $C$DW$1610, DW_AT_TI_symbol_name("_rsvd_2")
    9121                      .dwattr $C$DW$1610, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9122                      .dwattr $C$DW$1610, DW_AT_accessibility(DW_ACCESS_public)
    9123              $C$DW$1611      .dwtag  DW_TAG_member
    9124                      .dwattr $C$DW$1611, DW_AT_type(*$C$DW$T$23)
    9125                      .dwattr $C$DW$1611, DW_AT_name("ADCINTFLG")
    9126                      .dwattr $C$DW$1611, DW_AT_TI_symbol_name("_ADCINTFLG")
    9127                      .dwattr $C$DW$1611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9128                      .dwattr $C$DW$1611, DW_AT_accessibility(DW_ACCESS_public)
    9129              $C$DW$1612      .dwtag  DW_TAG_member
    9130                      .dwattr $C$DW$1612, DW_AT_type(*$C$DW$T$23)
    9131                      .dwattr $C$DW$1612, DW_AT_name("ADCINTFLGCLR")
    9132                      .dwattr $C$DW$1612, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9133                      .dwattr $C$DW$1612, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9134                      .dwattr $C$DW$1612, DW_AT_accessibility(DW_ACCESS_public)
    9135              $C$DW$1613      .dwtag  DW_TAG_member
    9136                      .dwattr $C$DW$1613, DW_AT_type(*$C$DW$T$23)
    9137                      .dwattr $C$DW$1613, DW_AT_name("ADCINTOVF")
    9138                      .dwattr $C$DW$1613, DW_AT_TI_symbol_name("_ADCINTOVF")
    9139                      .dwattr $C$DW$1613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  176

    9140                      .dwattr $C$DW$1613, DW_AT_accessibility(DW_ACCESS_public)
    9141              $C$DW$1614      .dwtag  DW_TAG_member
    9142                      .dwattr $C$DW$1614, DW_AT_type(*$C$DW$T$23)
    9143                      .dwattr $C$DW$1614, DW_AT_name("ADCINTOVFCLR")
    9144                      .dwattr $C$DW$1614, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9145                      .dwattr $C$DW$1614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9146                      .dwattr $C$DW$1614, DW_AT_accessibility(DW_ACCESS_public)
    9147              $C$DW$1615      .dwtag  DW_TAG_member
    9148                      .dwattr $C$DW$1615, DW_AT_type(*$C$DW$T$27)
    9149                      .dwattr $C$DW$1615, DW_AT_name("INTSELxNy")
    9150                      .dwattr $C$DW$1615, DW_AT_TI_symbol_name("_INTSELxNy")
    9151                      .dwattr $C$DW$1615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9152                      .dwattr $C$DW$1615, DW_AT_accessibility(DW_ACCESS_public)
    9153              $C$DW$1616      .dwtag  DW_TAG_member
    9154                      .dwattr $C$DW$1616, DW_AT_type(*$C$DW$T$28)
    9155                      .dwattr $C$DW$1616, DW_AT_name("rsvd_3")
    9156                      .dwattr $C$DW$1616, DW_AT_TI_symbol_name("_rsvd_3")
    9157                      .dwattr $C$DW$1616, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9158                      .dwattr $C$DW$1616, DW_AT_accessibility(DW_ACCESS_public)
    9159              $C$DW$1617      .dwtag  DW_TAG_member
    9160                      .dwattr $C$DW$1617, DW_AT_type(*$C$DW$T$23)
    9161                      .dwattr $C$DW$1617, DW_AT_name("SOCPRICTRL")
    9162                      .dwattr $C$DW$1617, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9163                      .dwattr $C$DW$1617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9164                      .dwattr $C$DW$1617, DW_AT_accessibility(DW_ACCESS_public)
    9165              $C$DW$1618      .dwtag  DW_TAG_member
    9166                      .dwattr $C$DW$1618, DW_AT_type(*$C$DW$T$23)
    9167                      .dwattr $C$DW$1618, DW_AT_name("rsvd_4")
    9168                      .dwattr $C$DW$1618, DW_AT_TI_symbol_name("_rsvd_4")
    9169                      .dwattr $C$DW$1618, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9170                      .dwattr $C$DW$1618, DW_AT_accessibility(DW_ACCESS_public)
    9171              $C$DW$1619      .dwtag  DW_TAG_member
    9172                      .dwattr $C$DW$1619, DW_AT_type(*$C$DW$T$23)
    9173                      .dwattr $C$DW$1619, DW_AT_name("ADCSAMPLEMODE")
    9174                      .dwattr $C$DW$1619, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9175                      .dwattr $C$DW$1619, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9176                      .dwattr $C$DW$1619, DW_AT_accessibility(DW_ACCESS_public)
    9177              $C$DW$1620      .dwtag  DW_TAG_member
    9178                      .dwattr $C$DW$1620, DW_AT_type(*$C$DW$T$23)
    9179                      .dwattr $C$DW$1620, DW_AT_name("rsvd_5")
    9180                      .dwattr $C$DW$1620, DW_AT_TI_symbol_name("_rsvd_5")
    9181                      .dwattr $C$DW$1620, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9182                      .dwattr $C$DW$1620, DW_AT_accessibility(DW_ACCESS_public)
    9183              $C$DW$1621      .dwtag  DW_TAG_member
    9184                      .dwattr $C$DW$1621, DW_AT_type(*$C$DW$T$23)
    9185                      .dwattr $C$DW$1621, DW_AT_name("ADCINTSOCSEL1")
    9186                      .dwattr $C$DW$1621, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9187                      .dwattr $C$DW$1621, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9188                      .dwattr $C$DW$1621, DW_AT_accessibility(DW_ACCESS_public)
    9189              $C$DW$1622      .dwtag  DW_TAG_member
    9190                      .dwattr $C$DW$1622, DW_AT_type(*$C$DW$T$23)
    9191                      .dwattr $C$DW$1622, DW_AT_name("ADCINTSOCSEL2")
    9192                      .dwattr $C$DW$1622, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9193                      .dwattr $C$DW$1622, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9194                      .dwattr $C$DW$1622, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  177

    9195              $C$DW$1623      .dwtag  DW_TAG_member
    9196                      .dwattr $C$DW$1623, DW_AT_type(*$C$DW$T$26)
    9197                      .dwattr $C$DW$1623, DW_AT_name("rsvd_6")
    9198                      .dwattr $C$DW$1623, DW_AT_TI_symbol_name("_rsvd_6")
    9199                      .dwattr $C$DW$1623, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9200                      .dwattr $C$DW$1623, DW_AT_accessibility(DW_ACCESS_public)
    9201              $C$DW$1624      .dwtag  DW_TAG_member
    9202                      .dwattr $C$DW$1624, DW_AT_type(*$C$DW$T$23)
    9203                      .dwattr $C$DW$1624, DW_AT_name("ADCSOCFLG1")
    9204                      .dwattr $C$DW$1624, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9205                      .dwattr $C$DW$1624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9206                      .dwattr $C$DW$1624, DW_AT_accessibility(DW_ACCESS_public)
    9207              $C$DW$1625      .dwtag  DW_TAG_member
    9208                      .dwattr $C$DW$1625, DW_AT_type(*$C$DW$T$23)
    9209                      .dwattr $C$DW$1625, DW_AT_name("rsvd_7")
    9210                      .dwattr $C$DW$1625, DW_AT_TI_symbol_name("_rsvd_7")
    9211                      .dwattr $C$DW$1625, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9212                      .dwattr $C$DW$1625, DW_AT_accessibility(DW_ACCESS_public)
    9213              $C$DW$1626      .dwtag  DW_TAG_member
    9214                      .dwattr $C$DW$1626, DW_AT_type(*$C$DW$T$23)
    9215                      .dwattr $C$DW$1626, DW_AT_name("ADCSOCFRC1")
    9216                      .dwattr $C$DW$1626, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9217                      .dwattr $C$DW$1626, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9218                      .dwattr $C$DW$1626, DW_AT_accessibility(DW_ACCESS_public)
    9219              $C$DW$1627      .dwtag  DW_TAG_member
    9220                      .dwattr $C$DW$1627, DW_AT_type(*$C$DW$T$23)
    9221                      .dwattr $C$DW$1627, DW_AT_name("rsvd_8")
    9222                      .dwattr $C$DW$1627, DW_AT_TI_symbol_name("_rsvd_8")
    9223                      .dwattr $C$DW$1627, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9224                      .dwattr $C$DW$1627, DW_AT_accessibility(DW_ACCESS_public)
    9225              $C$DW$1628      .dwtag  DW_TAG_member
    9226                      .dwattr $C$DW$1628, DW_AT_type(*$C$DW$T$23)
    9227                      .dwattr $C$DW$1628, DW_AT_name("ADCSOCOVF1")
    9228                      .dwattr $C$DW$1628, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9229                      .dwattr $C$DW$1628, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9230                      .dwattr $C$DW$1628, DW_AT_accessibility(DW_ACCESS_public)
    9231              $C$DW$1629      .dwtag  DW_TAG_member
    9232                      .dwattr $C$DW$1629, DW_AT_type(*$C$DW$T$23)
    9233                      .dwattr $C$DW$1629, DW_AT_name("rsvd_9")
    9234                      .dwattr $C$DW$1629, DW_AT_TI_symbol_name("_rsvd_9")
    9235                      .dwattr $C$DW$1629, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9236                      .dwattr $C$DW$1629, DW_AT_accessibility(DW_ACCESS_public)
    9237              $C$DW$1630      .dwtag  DW_TAG_member
    9238                      .dwattr $C$DW$1630, DW_AT_type(*$C$DW$T$23)
    9239                      .dwattr $C$DW$1630, DW_AT_name("ADCSOCOVFCLR1")
    9240                      .dwattr $C$DW$1630, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9241                      .dwattr $C$DW$1630, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9242                      .dwattr $C$DW$1630, DW_AT_accessibility(DW_ACCESS_public)
    9243              $C$DW$1631      .dwtag  DW_TAG_member
    9244                      .dwattr $C$DW$1631, DW_AT_type(*$C$DW$T$23)
    9245                      .dwattr $C$DW$1631, DW_AT_name("rsvd_10")
    9246                      .dwattr $C$DW$1631, DW_AT_TI_symbol_name("_rsvd_10")
    9247                      .dwattr $C$DW$1631, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9248                      .dwattr $C$DW$1631, DW_AT_accessibility(DW_ACCESS_public)
    9249              $C$DW$1632      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  178

    9250                      .dwattr $C$DW$1632, DW_AT_type(*$C$DW$T$24)
    9251                      .dwattr $C$DW$1632, DW_AT_name("ADCSOCxCTL")
    9252                      .dwattr $C$DW$1632, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9253                      .dwattr $C$DW$1632, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9254                      .dwattr $C$DW$1632, DW_AT_accessibility(DW_ACCESS_public)
    9255              $C$DW$1633      .dwtag  DW_TAG_member
    9256                      .dwattr $C$DW$1633, DW_AT_type(*$C$DW$T$24)
    9257                      .dwattr $C$DW$1633, DW_AT_name("rsvd_11")
    9258                      .dwattr $C$DW$1633, DW_AT_TI_symbol_name("_rsvd_11")
    9259                      .dwattr $C$DW$1633, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9260                      .dwattr $C$DW$1633, DW_AT_accessibility(DW_ACCESS_public)
    9261              $C$DW$1634      .dwtag  DW_TAG_member
    9262                      .dwattr $C$DW$1634, DW_AT_type(*$C$DW$T$23)
    9263                      .dwattr $C$DW$1634, DW_AT_name("ADCREFTRIM")
    9264                      .dwattr $C$DW$1634, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9265                      .dwattr $C$DW$1634, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9266                      .dwattr $C$DW$1634, DW_AT_accessibility(DW_ACCESS_public)
    9267              $C$DW$1635      .dwtag  DW_TAG_member
    9268                      .dwattr $C$DW$1635, DW_AT_type(*$C$DW$T$23)
    9269                      .dwattr $C$DW$1635, DW_AT_name("ADCOFFTRIM")
    9270                      .dwattr $C$DW$1635, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9271                      .dwattr $C$DW$1635, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9272                      .dwattr $C$DW$1635, DW_AT_accessibility(DW_ACCESS_public)
    9273              $C$DW$1636      .dwtag  DW_TAG_member
    9274                      .dwattr $C$DW$1636, DW_AT_type(*$C$DW$T$29)
    9275                      .dwattr $C$DW$1636, DW_AT_name("resvd_12")
    9276                      .dwattr $C$DW$1636, DW_AT_TI_symbol_name("_resvd_12")
    9277                      .dwattr $C$DW$1636, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9278                      .dwattr $C$DW$1636, DW_AT_accessibility(DW_ACCESS_public)
    9279              $C$DW$1637      .dwtag  DW_TAG_member
    9280                      .dwattr $C$DW$1637, DW_AT_type(*$C$DW$T$23)
    9281                      .dwattr $C$DW$1637, DW_AT_name("ADCREV")
    9282                      .dwattr $C$DW$1637, DW_AT_TI_symbol_name("_ADCREV")
    9283                      .dwattr $C$DW$1637, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9284                      .dwattr $C$DW$1637, DW_AT_accessibility(DW_ACCESS_public)
    9285                      .dwendtag $C$DW$T$30
    9286              
    9287              $C$DW$T$304     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    9288                      .dwattr $C$DW$T$304, DW_AT_type(*$C$DW$T$30)
    9289                      .dwattr $C$DW$T$304, DW_AT_language(DW_LANG_C)
    9290              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    9291                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
    9292                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
    9293              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    9294                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    9295                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    9296              
    9297              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    9298                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
    9299                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
    9300              $C$DW$1638      .dwtag  DW_TAG_member
    9301                      .dwattr $C$DW$1638, DW_AT_type(*$C$DW$T$23)
    9302                      .dwattr $C$DW$1638, DW_AT_name("XCLK")
    9303                      .dwattr $C$DW$1638, DW_AT_TI_symbol_name("_XCLK")
    9304                      .dwattr $C$DW$1638, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  179

    9305                      .dwattr $C$DW$1638, DW_AT_accessibility(DW_ACCESS_public)
    9306              $C$DW$1639      .dwtag  DW_TAG_member
    9307                      .dwattr $C$DW$1639, DW_AT_type(*$C$DW$T$23)
    9308                      .dwattr $C$DW$1639, DW_AT_name("rsvd_1")
    9309                      .dwattr $C$DW$1639, DW_AT_TI_symbol_name("_rsvd_1")
    9310                      .dwattr $C$DW$1639, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9311                      .dwattr $C$DW$1639, DW_AT_accessibility(DW_ACCESS_public)
    9312              $C$DW$1640      .dwtag  DW_TAG_member
    9313                      .dwattr $C$DW$1640, DW_AT_type(*$C$DW$T$23)
    9314                      .dwattr $C$DW$1640, DW_AT_name("CLKCTL")
    9315                      .dwattr $C$DW$1640, DW_AT_TI_symbol_name("_CLKCTL")
    9316                      .dwattr $C$DW$1640, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9317                      .dwattr $C$DW$1640, DW_AT_accessibility(DW_ACCESS_public)
    9318              $C$DW$1641      .dwtag  DW_TAG_member
    9319                      .dwattr $C$DW$1641, DW_AT_type(*$C$DW$T$31)
    9320                      .dwattr $C$DW$1641, DW_AT_name("rsvd_2")
    9321                      .dwattr $C$DW$1641, DW_AT_TI_symbol_name("_rsvd_2")
    9322                      .dwattr $C$DW$1641, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9323                      .dwattr $C$DW$1641, DW_AT_accessibility(DW_ACCESS_public)
    9324              $C$DW$1642      .dwtag  DW_TAG_member
    9325                      .dwattr $C$DW$1642, DW_AT_type(*$C$DW$T$23)
    9326                      .dwattr $C$DW$1642, DW_AT_name("LOSPCP")
    9327                      .dwattr $C$DW$1642, DW_AT_TI_symbol_name("_LOSPCP")
    9328                      .dwattr $C$DW$1642, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9329                      .dwattr $C$DW$1642, DW_AT_accessibility(DW_ACCESS_public)
    9330              $C$DW$1643      .dwtag  DW_TAG_member
    9331                      .dwattr $C$DW$1643, DW_AT_type(*$C$DW$T$23)
    9332                      .dwattr $C$DW$1643, DW_AT_name("PCLKCR0")
    9333                      .dwattr $C$DW$1643, DW_AT_TI_symbol_name("_PCLKCR0")
    9334                      .dwattr $C$DW$1643, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9335                      .dwattr $C$DW$1643, DW_AT_accessibility(DW_ACCESS_public)
    9336              $C$DW$1644      .dwtag  DW_TAG_member
    9337                      .dwattr $C$DW$1644, DW_AT_type(*$C$DW$T$23)
    9338                      .dwattr $C$DW$1644, DW_AT_name("PCLKCR1")
    9339                      .dwattr $C$DW$1644, DW_AT_TI_symbol_name("_PCLKCR1")
    9340                      .dwattr $C$DW$1644, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9341                      .dwattr $C$DW$1644, DW_AT_accessibility(DW_ACCESS_public)
    9342              $C$DW$1645      .dwtag  DW_TAG_member
    9343                      .dwattr $C$DW$1645, DW_AT_type(*$C$DW$T$26)
    9344                      .dwattr $C$DW$1645, DW_AT_name("rsvd_3")
    9345                      .dwattr $C$DW$1645, DW_AT_TI_symbol_name("_rsvd_3")
    9346                      .dwattr $C$DW$1645, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9347                      .dwattr $C$DW$1645, DW_AT_accessibility(DW_ACCESS_public)
    9348              $C$DW$1646      .dwtag  DW_TAG_member
    9349                      .dwattr $C$DW$1646, DW_AT_type(*$C$DW$T$23)
    9350                      .dwattr $C$DW$1646, DW_AT_name("PCLKCR3")
    9351                      .dwattr $C$DW$1646, DW_AT_TI_symbol_name("_PCLKCR3")
    9352                      .dwattr $C$DW$1646, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9353                      .dwattr $C$DW$1646, DW_AT_accessibility(DW_ACCESS_public)
    9354                      .dwendtag $C$DW$T$32
    9355              
    9356              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    9357                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
    9358                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
    9359              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  180

    9360                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    9361                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    9362              
    9363              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    9364                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
    9365                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    9366              $C$DW$1647      .dwtag  DW_TAG_member
    9367                      .dwattr $C$DW$1647, DW_AT_type(*$C$DW$T$33)
    9368                      .dwattr $C$DW$1647, DW_AT_name("tmp")
    9369                      .dwattr $C$DW$1647, DW_AT_TI_symbol_name("_tmp")
    9370                      .dwattr $C$DW$1647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9371                      .dwattr $C$DW$1647, DW_AT_accessibility(DW_ACCESS_public)
    9372                      .dwendtag $C$DW$T$34
    9373              
    9374              $C$DW$T$311     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
    9375                      .dwattr $C$DW$T$311, DW_AT_type(*$C$DW$T$34)
    9376                      .dwattr $C$DW$T$311, DW_AT_language(DW_LANG_C)
    9377              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    9378                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
    9379                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
    9380              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    9381                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    9382                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    9383              
    9384              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9385                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
    9386                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
    9387              $C$DW$1648      .dwtag  DW_TAG_member
    9388                      .dwattr $C$DW$1648, DW_AT_type(*$C$DW$T$35)
    9389                      .dwattr $C$DW$1648, DW_AT_name("a1")
    9390                      .dwattr $C$DW$1648, DW_AT_TI_symbol_name("_a1")
    9391                      .dwattr $C$DW$1648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9392                      .dwattr $C$DW$1648, DW_AT_accessibility(DW_ACCESS_public)
    9393              $C$DW$1649      .dwtag  DW_TAG_member
    9394                      .dwattr $C$DW$1649, DW_AT_type(*$C$DW$T$35)
    9395                      .dwattr $C$DW$1649, DW_AT_name("b0")
    9396                      .dwattr $C$DW$1649, DW_AT_TI_symbol_name("_b0")
    9397                      .dwattr $C$DW$1649, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9398                      .dwattr $C$DW$1649, DW_AT_accessibility(DW_ACCESS_public)
    9399              $C$DW$1650      .dwtag  DW_TAG_member
    9400                      .dwattr $C$DW$1650, DW_AT_type(*$C$DW$T$35)
    9401                      .dwattr $C$DW$1650, DW_AT_name("b1")
    9402                      .dwattr $C$DW$1650, DW_AT_TI_symbol_name("_b1")
    9403                      .dwattr $C$DW$1650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9404                      .dwattr $C$DW$1650, DW_AT_accessibility(DW_ACCESS_public)
    9405              $C$DW$1651      .dwtag  DW_TAG_member
    9406                      .dwattr $C$DW$1651, DW_AT_type(*$C$DW$T$35)
    9407                      .dwattr $C$DW$1651, DW_AT_name("x1")
    9408                      .dwattr $C$DW$1651, DW_AT_TI_symbol_name("_x1")
    9409                      .dwattr $C$DW$1651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9410                      .dwattr $C$DW$1651, DW_AT_accessibility(DW_ACCESS_public)
    9411              $C$DW$1652      .dwtag  DW_TAG_member
    9412                      .dwattr $C$DW$1652, DW_AT_type(*$C$DW$T$35)
    9413                      .dwattr $C$DW$1652, DW_AT_name("y1")
    9414                      .dwattr $C$DW$1652, DW_AT_TI_symbol_name("_y1")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  181

    9415                      .dwattr $C$DW$1652, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9416                      .dwattr $C$DW$1652, DW_AT_accessibility(DW_ACCESS_public)
    9417                      .dwendtag $C$DW$T$36
    9418              
    9419              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    9420                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$36)
    9421                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    9422              
    9423              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9424                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    9425                      .dwattr $C$DW$T$20, DW_AT_declaration
    9426                      .dwendtag $C$DW$T$20
    9427              
    9428              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    9429                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$20)
    9430                      .dwattr $C$DW$T$90, DW_AT_address_class(0x16)
    9431              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    9432                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    9433                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    9434              
    9435              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    9436                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
    9437                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    9438              $C$DW$1653      .dwtag  DW_TAG_member
    9439                      .dwattr $C$DW$1653, DW_AT_type(*$C$DW$T$23)
    9440                      .dwattr $C$DW$1653, DW_AT_name("FOPT")
    9441                      .dwattr $C$DW$1653, DW_AT_TI_symbol_name("_FOPT")
    9442                      .dwattr $C$DW$1653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9443                      .dwattr $C$DW$1653, DW_AT_accessibility(DW_ACCESS_public)
    9444              $C$DW$1654      .dwtag  DW_TAG_member
    9445                      .dwattr $C$DW$1654, DW_AT_type(*$C$DW$T$23)
    9446                      .dwattr $C$DW$1654, DW_AT_name("rsvd_1")
    9447                      .dwattr $C$DW$1654, DW_AT_TI_symbol_name("_rsvd_1")
    9448                      .dwattr $C$DW$1654, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9449                      .dwattr $C$DW$1654, DW_AT_accessibility(DW_ACCESS_public)
    9450              $C$DW$1655      .dwtag  DW_TAG_member
    9451                      .dwattr $C$DW$1655, DW_AT_type(*$C$DW$T$23)
    9452                      .dwattr $C$DW$1655, DW_AT_name("FPWR")
    9453                      .dwattr $C$DW$1655, DW_AT_TI_symbol_name("_FPWR")
    9454                      .dwattr $C$DW$1655, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9455                      .dwattr $C$DW$1655, DW_AT_accessibility(DW_ACCESS_public)
    9456              $C$DW$1656      .dwtag  DW_TAG_member
    9457                      .dwattr $C$DW$1656, DW_AT_type(*$C$DW$T$23)
    9458                      .dwattr $C$DW$1656, DW_AT_name("FSTATUS")
    9459                      .dwattr $C$DW$1656, DW_AT_TI_symbol_name("_FSTATUS")
    9460                      .dwattr $C$DW$1656, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9461                      .dwattr $C$DW$1656, DW_AT_accessibility(DW_ACCESS_public)
    9462              $C$DW$1657      .dwtag  DW_TAG_member
    9463                      .dwattr $C$DW$1657, DW_AT_type(*$C$DW$T$23)
    9464                      .dwattr $C$DW$1657, DW_AT_name("FSTDBYWAIT")
    9465                      .dwattr $C$DW$1657, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9466                      .dwattr $C$DW$1657, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9467                      .dwattr $C$DW$1657, DW_AT_accessibility(DW_ACCESS_public)
    9468              $C$DW$1658      .dwtag  DW_TAG_member
    9469                      .dwattr $C$DW$1658, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  182

    9470                      .dwattr $C$DW$1658, DW_AT_name("FACTIVEWAIT")
    9471                      .dwattr $C$DW$1658, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9472                      .dwattr $C$DW$1658, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9473                      .dwattr $C$DW$1658, DW_AT_accessibility(DW_ACCESS_public)
    9474              $C$DW$1659      .dwtag  DW_TAG_member
    9475                      .dwattr $C$DW$1659, DW_AT_type(*$C$DW$T$23)
    9476                      .dwattr $C$DW$1659, DW_AT_name("FBANKWAIT")
    9477                      .dwattr $C$DW$1659, DW_AT_TI_symbol_name("_FBANKWAIT")
    9478                      .dwattr $C$DW$1659, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9479                      .dwattr $C$DW$1659, DW_AT_accessibility(DW_ACCESS_public)
    9480              $C$DW$1660      .dwtag  DW_TAG_member
    9481                      .dwattr $C$DW$1660, DW_AT_type(*$C$DW$T$23)
    9482                      .dwattr $C$DW$1660, DW_AT_name("FOTPWAIT")
    9483                      .dwattr $C$DW$1660, DW_AT_TI_symbol_name("_FOTPWAIT")
    9484                      .dwattr $C$DW$1660, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9485                      .dwattr $C$DW$1660, DW_AT_accessibility(DW_ACCESS_public)
    9486                      .dwendtag $C$DW$T$37
    9487              
    9488              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    9489                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
    9490                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
    9491              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    9492                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    9493                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    9494              
    9495              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    9496                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
    9497                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
    9498              $C$DW$1661      .dwtag  DW_TAG_member
    9499                      .dwattr $C$DW$1661, DW_AT_type(*$C$DW$T$39)
    9500                      .dwattr $C$DW$1661, DW_AT_name("GPACTRL")
    9501                      .dwattr $C$DW$1661, DW_AT_TI_symbol_name("_GPACTRL")
    9502                      .dwattr $C$DW$1661, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9503                      .dwattr $C$DW$1661, DW_AT_accessibility(DW_ACCESS_public)
    9504              $C$DW$1662      .dwtag  DW_TAG_member
    9505                      .dwattr $C$DW$1662, DW_AT_type(*$C$DW$T$39)
    9506                      .dwattr $C$DW$1662, DW_AT_name("GPAQSEL1")
    9507                      .dwattr $C$DW$1662, DW_AT_TI_symbol_name("_GPAQSEL1")
    9508                      .dwattr $C$DW$1662, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9509                      .dwattr $C$DW$1662, DW_AT_accessibility(DW_ACCESS_public)
    9510              $C$DW$1663      .dwtag  DW_TAG_member
    9511                      .dwattr $C$DW$1663, DW_AT_type(*$C$DW$T$39)
    9512                      .dwattr $C$DW$1663, DW_AT_name("GPAQSEL2")
    9513                      .dwattr $C$DW$1663, DW_AT_TI_symbol_name("_GPAQSEL2")
    9514                      .dwattr $C$DW$1663, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9515                      .dwattr $C$DW$1663, DW_AT_accessibility(DW_ACCESS_public)
    9516              $C$DW$1664      .dwtag  DW_TAG_member
    9517                      .dwattr $C$DW$1664, DW_AT_type(*$C$DW$T$39)
    9518                      .dwattr $C$DW$1664, DW_AT_name("GPAMUX1")
    9519                      .dwattr $C$DW$1664, DW_AT_TI_symbol_name("_GPAMUX1")
    9520                      .dwattr $C$DW$1664, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9521                      .dwattr $C$DW$1664, DW_AT_accessibility(DW_ACCESS_public)
    9522              $C$DW$1665      .dwtag  DW_TAG_member
    9523                      .dwattr $C$DW$1665, DW_AT_type(*$C$DW$T$39)
    9524                      .dwattr $C$DW$1665, DW_AT_name("GPAMUX2")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  183

    9525                      .dwattr $C$DW$1665, DW_AT_TI_symbol_name("_GPAMUX2")
    9526                      .dwattr $C$DW$1665, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9527                      .dwattr $C$DW$1665, DW_AT_accessibility(DW_ACCESS_public)
    9528              $C$DW$1666      .dwtag  DW_TAG_member
    9529                      .dwattr $C$DW$1666, DW_AT_type(*$C$DW$T$39)
    9530                      .dwattr $C$DW$1666, DW_AT_name("GPADIR")
    9531                      .dwattr $C$DW$1666, DW_AT_TI_symbol_name("_GPADIR")
    9532                      .dwattr $C$DW$1666, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9533                      .dwattr $C$DW$1666, DW_AT_accessibility(DW_ACCESS_public)
    9534              $C$DW$1667      .dwtag  DW_TAG_member
    9535                      .dwattr $C$DW$1667, DW_AT_type(*$C$DW$T$39)
    9536                      .dwattr $C$DW$1667, DW_AT_name("GPAPUD")
    9537                      .dwattr $C$DW$1667, DW_AT_TI_symbol_name("_GPAPUD")
    9538                      .dwattr $C$DW$1667, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9539                      .dwattr $C$DW$1667, DW_AT_accessibility(DW_ACCESS_public)
    9540              $C$DW$1668      .dwtag  DW_TAG_member
    9541                      .dwattr $C$DW$1668, DW_AT_type(*$C$DW$T$26)
    9542                      .dwattr $C$DW$1668, DW_AT_name("rsvd_1")
    9543                      .dwattr $C$DW$1668, DW_AT_TI_symbol_name("_rsvd_1")
    9544                      .dwattr $C$DW$1668, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9545                      .dwattr $C$DW$1668, DW_AT_accessibility(DW_ACCESS_public)
    9546              $C$DW$1669      .dwtag  DW_TAG_member
    9547                      .dwattr $C$DW$1669, DW_AT_type(*$C$DW$T$39)
    9548                      .dwattr $C$DW$1669, DW_AT_name("GPBCTRL")
    9549                      .dwattr $C$DW$1669, DW_AT_TI_symbol_name("_GPBCTRL")
    9550                      .dwattr $C$DW$1669, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9551                      .dwattr $C$DW$1669, DW_AT_accessibility(DW_ACCESS_public)
    9552              $C$DW$1670      .dwtag  DW_TAG_member
    9553                      .dwattr $C$DW$1670, DW_AT_type(*$C$DW$T$39)
    9554                      .dwattr $C$DW$1670, DW_AT_name("GPBQSEL1")
    9555                      .dwattr $C$DW$1670, DW_AT_TI_symbol_name("_GPBQSEL1")
    9556                      .dwattr $C$DW$1670, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9557                      .dwattr $C$DW$1670, DW_AT_accessibility(DW_ACCESS_public)
    9558              $C$DW$1671      .dwtag  DW_TAG_member
    9559                      .dwattr $C$DW$1671, DW_AT_type(*$C$DW$T$26)
    9560                      .dwattr $C$DW$1671, DW_AT_name("rsvd_2")
    9561                      .dwattr $C$DW$1671, DW_AT_TI_symbol_name("_rsvd_2")
    9562                      .dwattr $C$DW$1671, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9563                      .dwattr $C$DW$1671, DW_AT_accessibility(DW_ACCESS_public)
    9564              $C$DW$1672      .dwtag  DW_TAG_member
    9565                      .dwattr $C$DW$1672, DW_AT_type(*$C$DW$T$39)
    9566                      .dwattr $C$DW$1672, DW_AT_name("GPBMUX1")
    9567                      .dwattr $C$DW$1672, DW_AT_TI_symbol_name("_GPBMUX1")
    9568                      .dwattr $C$DW$1672, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9569                      .dwattr $C$DW$1672, DW_AT_accessibility(DW_ACCESS_public)
    9570              $C$DW$1673      .dwtag  DW_TAG_member
    9571                      .dwattr $C$DW$1673, DW_AT_type(*$C$DW$T$26)
    9572                      .dwattr $C$DW$1673, DW_AT_name("rsvd_3")
    9573                      .dwattr $C$DW$1673, DW_AT_TI_symbol_name("_rsvd_3")
    9574                      .dwattr $C$DW$1673, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9575                      .dwattr $C$DW$1673, DW_AT_accessibility(DW_ACCESS_public)
    9576              $C$DW$1674      .dwtag  DW_TAG_member
    9577                      .dwattr $C$DW$1674, DW_AT_type(*$C$DW$T$39)
    9578                      .dwattr $C$DW$1674, DW_AT_name("GPBDIR")
    9579                      .dwattr $C$DW$1674, DW_AT_TI_symbol_name("_GPBDIR")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  184

    9580                      .dwattr $C$DW$1674, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9581                      .dwattr $C$DW$1674, DW_AT_accessibility(DW_ACCESS_public)
    9582              $C$DW$1675      .dwtag  DW_TAG_member
    9583                      .dwattr $C$DW$1675, DW_AT_type(*$C$DW$T$39)
    9584                      .dwattr $C$DW$1675, DW_AT_name("GPBPUD")
    9585                      .dwattr $C$DW$1675, DW_AT_TI_symbol_name("_GPBPUD")
    9586                      .dwattr $C$DW$1675, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9587                      .dwattr $C$DW$1675, DW_AT_accessibility(DW_ACCESS_public)
    9588              $C$DW$1676      .dwtag  DW_TAG_member
    9589                      .dwattr $C$DW$1676, DW_AT_type(*$C$DW$T$40)
    9590                      .dwattr $C$DW$1676, DW_AT_name("rsvd_4")
    9591                      .dwattr $C$DW$1676, DW_AT_TI_symbol_name("_rsvd_4")
    9592                      .dwattr $C$DW$1676, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9593                      .dwattr $C$DW$1676, DW_AT_accessibility(DW_ACCESS_public)
    9594              $C$DW$1677      .dwtag  DW_TAG_member
    9595                      .dwattr $C$DW$1677, DW_AT_type(*$C$DW$T$39)
    9596                      .dwattr $C$DW$1677, DW_AT_name("AIOMUX1")
    9597                      .dwattr $C$DW$1677, DW_AT_TI_symbol_name("_AIOMUX1")
    9598                      .dwattr $C$DW$1677, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9599                      .dwattr $C$DW$1677, DW_AT_accessibility(DW_ACCESS_public)
    9600              $C$DW$1678      .dwtag  DW_TAG_member
    9601                      .dwattr $C$DW$1678, DW_AT_type(*$C$DW$T$26)
    9602                      .dwattr $C$DW$1678, DW_AT_name("rsvd_5")
    9603                      .dwattr $C$DW$1678, DW_AT_TI_symbol_name("_rsvd_5")
    9604                      .dwattr $C$DW$1678, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9605                      .dwattr $C$DW$1678, DW_AT_accessibility(DW_ACCESS_public)
    9606              $C$DW$1679      .dwtag  DW_TAG_member
    9607                      .dwattr $C$DW$1679, DW_AT_type(*$C$DW$T$39)
    9608                      .dwattr $C$DW$1679, DW_AT_name("AIODIR")
    9609                      .dwattr $C$DW$1679, DW_AT_TI_symbol_name("_AIODIR")
    9610                      .dwattr $C$DW$1679, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9611                      .dwattr $C$DW$1679, DW_AT_accessibility(DW_ACCESS_public)
    9612              $C$DW$1680      .dwtag  DW_TAG_member
    9613                      .dwattr $C$DW$1680, DW_AT_type(*$C$DW$T$41)
    9614                      .dwattr $C$DW$1680, DW_AT_name("rsvd_6")
    9615                      .dwattr $C$DW$1680, DW_AT_TI_symbol_name("_rsvd_6")
    9616                      .dwattr $C$DW$1680, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9617                      .dwattr $C$DW$1680, DW_AT_accessibility(DW_ACCESS_public)
    9618              $C$DW$1681      .dwtag  DW_TAG_member
    9619                      .dwattr $C$DW$1681, DW_AT_type(*$C$DW$T$39)
    9620                      .dwattr $C$DW$1681, DW_AT_name("GPADAT")
    9621                      .dwattr $C$DW$1681, DW_AT_TI_symbol_name("_GPADAT")
    9622                      .dwattr $C$DW$1681, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9623                      .dwattr $C$DW$1681, DW_AT_accessibility(DW_ACCESS_public)
    9624              $C$DW$1682      .dwtag  DW_TAG_member
    9625                      .dwattr $C$DW$1682, DW_AT_type(*$C$DW$T$39)
    9626                      .dwattr $C$DW$1682, DW_AT_name("GPASET")
    9627                      .dwattr $C$DW$1682, DW_AT_TI_symbol_name("_GPASET")
    9628                      .dwattr $C$DW$1682, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    9629                      .dwattr $C$DW$1682, DW_AT_accessibility(DW_ACCESS_public)
    9630              $C$DW$1683      .dwtag  DW_TAG_member
    9631                      .dwattr $C$DW$1683, DW_AT_type(*$C$DW$T$39)
    9632                      .dwattr $C$DW$1683, DW_AT_name("GPACLEAR")
    9633                      .dwattr $C$DW$1683, DW_AT_TI_symbol_name("_GPACLEAR")
    9634                      .dwattr $C$DW$1683, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  185

    9635                      .dwattr $C$DW$1683, DW_AT_accessibility(DW_ACCESS_public)
    9636              $C$DW$1684      .dwtag  DW_TAG_member
    9637                      .dwattr $C$DW$1684, DW_AT_type(*$C$DW$T$39)
    9638                      .dwattr $C$DW$1684, DW_AT_name("GPATOGGLE")
    9639                      .dwattr $C$DW$1684, DW_AT_TI_symbol_name("_GPATOGGLE")
    9640                      .dwattr $C$DW$1684, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9641                      .dwattr $C$DW$1684, DW_AT_accessibility(DW_ACCESS_public)
    9642              $C$DW$1685      .dwtag  DW_TAG_member
    9643                      .dwattr $C$DW$1685, DW_AT_type(*$C$DW$T$39)
    9644                      .dwattr $C$DW$1685, DW_AT_name("GPBDAT")
    9645                      .dwattr $C$DW$1685, DW_AT_TI_symbol_name("_GPBDAT")
    9646                      .dwattr $C$DW$1685, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    9647                      .dwattr $C$DW$1685, DW_AT_accessibility(DW_ACCESS_public)
    9648              $C$DW$1686      .dwtag  DW_TAG_member
    9649                      .dwattr $C$DW$1686, DW_AT_type(*$C$DW$T$39)
    9650                      .dwattr $C$DW$1686, DW_AT_name("GPBSET")
    9651                      .dwattr $C$DW$1686, DW_AT_TI_symbol_name("_GPBSET")
    9652                      .dwattr $C$DW$1686, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    9653                      .dwattr $C$DW$1686, DW_AT_accessibility(DW_ACCESS_public)
    9654              $C$DW$1687      .dwtag  DW_TAG_member
    9655                      .dwattr $C$DW$1687, DW_AT_type(*$C$DW$T$39)
    9656                      .dwattr $C$DW$1687, DW_AT_name("GPBCLEAR")
    9657                      .dwattr $C$DW$1687, DW_AT_TI_symbol_name("_GPBCLEAR")
    9658                      .dwattr $C$DW$1687, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    9659                      .dwattr $C$DW$1687, DW_AT_accessibility(DW_ACCESS_public)
    9660              $C$DW$1688      .dwtag  DW_TAG_member
    9661                      .dwattr $C$DW$1688, DW_AT_type(*$C$DW$T$39)
    9662                      .dwattr $C$DW$1688, DW_AT_name("GPBTOGGLE")
    9663                      .dwattr $C$DW$1688, DW_AT_TI_symbol_name("_GPBTOGGLE")
    9664                      .dwattr $C$DW$1688, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    9665                      .dwattr $C$DW$1688, DW_AT_accessibility(DW_ACCESS_public)
    9666              $C$DW$1689      .dwtag  DW_TAG_member
    9667                      .dwattr $C$DW$1689, DW_AT_type(*$C$DW$T$31)
    9668                      .dwattr $C$DW$1689, DW_AT_name("rsvd_7")
    9669                      .dwattr $C$DW$1689, DW_AT_TI_symbol_name("_rsvd_7")
    9670                      .dwattr $C$DW$1689, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    9671                      .dwattr $C$DW$1689, DW_AT_accessibility(DW_ACCESS_public)
    9672              $C$DW$1690      .dwtag  DW_TAG_member
    9673                      .dwattr $C$DW$1690, DW_AT_type(*$C$DW$T$39)
    9674                      .dwattr $C$DW$1690, DW_AT_name("AIODAT")
    9675                      .dwattr $C$DW$1690, DW_AT_TI_symbol_name("_AIODAT")
    9676                      .dwattr $C$DW$1690, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9677                      .dwattr $C$DW$1690, DW_AT_accessibility(DW_ACCESS_public)
    9678              $C$DW$1691      .dwtag  DW_TAG_member
    9679                      .dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$39)
    9680                      .dwattr $C$DW$1691, DW_AT_name("AIOSET")
    9681                      .dwattr $C$DW$1691, DW_AT_TI_symbol_name("_AIOSET")
    9682                      .dwattr $C$DW$1691, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    9683                      .dwattr $C$DW$1691, DW_AT_accessibility(DW_ACCESS_public)
    9684              $C$DW$1692      .dwtag  DW_TAG_member
    9685                      .dwattr $C$DW$1692, DW_AT_type(*$C$DW$T$39)
    9686                      .dwattr $C$DW$1692, DW_AT_name("AIOCLEAR")
    9687                      .dwattr $C$DW$1692, DW_AT_TI_symbol_name("_AIOCLEAR")
    9688                      .dwattr $C$DW$1692, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9689                      .dwattr $C$DW$1692, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  186

    9690              $C$DW$1693      .dwtag  DW_TAG_member
    9691                      .dwattr $C$DW$1693, DW_AT_type(*$C$DW$T$39)
    9692                      .dwattr $C$DW$1693, DW_AT_name("AIOTOGGLE")
    9693                      .dwattr $C$DW$1693, DW_AT_TI_symbol_name("_AIOTOGGLE")
    9694                      .dwattr $C$DW$1693, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9695                      .dwattr $C$DW$1693, DW_AT_accessibility(DW_ACCESS_public)
    9696              $C$DW$1694      .dwtag  DW_TAG_member
    9697                      .dwattr $C$DW$1694, DW_AT_type(*$C$DW$T$28)
    9698                      .dwattr $C$DW$1694, DW_AT_name("GPIOXINTnSEL")
    9699                      .dwattr $C$DW$1694, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    9700                      .dwattr $C$DW$1694, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9701                      .dwattr $C$DW$1694, DW_AT_accessibility(DW_ACCESS_public)
    9702              $C$DW$1695      .dwtag  DW_TAG_member
    9703                      .dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$27)
    9704                      .dwattr $C$DW$1695, DW_AT_name("rsvd_8")
    9705                      .dwattr $C$DW$1695, DW_AT_TI_symbol_name("_rsvd_8")
    9706                      .dwattr $C$DW$1695, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    9707                      .dwattr $C$DW$1695, DW_AT_accessibility(DW_ACCESS_public)
    9708              $C$DW$1696      .dwtag  DW_TAG_member
    9709                      .dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$39)
    9710                      .dwattr $C$DW$1696, DW_AT_name("GPIOLPMSEL")
    9711                      .dwattr $C$DW$1696, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    9712                      .dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    9713                      .dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
    9714                      .dwendtag $C$DW$T$42
    9715              
    9716              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    9717                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
    9718                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    9719              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    9720                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    9721                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    9722              
    9723              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9724                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
    9725                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
    9726              $C$DW$1697      .dwtag  DW_TAG_member
    9727                      .dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$43)
    9728                      .dwattr $C$DW$1697, DW_AT_name("I")
    9729                      .dwattr $C$DW$1697, DW_AT_TI_symbol_name("_I")
    9730                      .dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9731                      .dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
    9732              $C$DW$1698      .dwtag  DW_TAG_member
    9733                      .dwattr $C$DW$1698, DW_AT_type(*$C$DW$T$43)
    9734                      .dwattr $C$DW$1698, DW_AT_name("V")
    9735                      .dwattr $C$DW$1698, DW_AT_TI_symbol_name("_V")
    9736                      .dwattr $C$DW$1698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9737                      .dwattr $C$DW$1698, DW_AT_accessibility(DW_ACCESS_public)
    9738              $C$DW$1699      .dwtag  DW_TAG_member
    9739                      .dwattr $C$DW$1699, DW_AT_type(*$C$DW$T$35)
    9740                      .dwattr $C$DW$1699, DW_AT_name("dcBus")
    9741                      .dwattr $C$DW$1699, DW_AT_TI_symbol_name("_dcBus")
    9742                      .dwattr $C$DW$1699, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9743                      .dwattr $C$DW$1699, DW_AT_accessibility(DW_ACCESS_public)
    9744              $C$DW$1700      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  187

    9745                      .dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$35)
    9746                      .dwattr $C$DW$1700, DW_AT_name("analogSensor1")
    9747                      .dwattr $C$DW$1700, DW_AT_TI_symbol_name("_analogSensor1")
    9748                      .dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9749                      .dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
    9750              $C$DW$1701      .dwtag  DW_TAG_member
    9751                      .dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$35)
    9752                      .dwattr $C$DW$1701, DW_AT_name("analogSensor2")
    9753                      .dwattr $C$DW$1701, DW_AT_TI_symbol_name("_analogSensor2")
    9754                      .dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9755                      .dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
    9756              $C$DW$1702      .dwtag  DW_TAG_member
    9757                      .dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$35)
    9758                      .dwattr $C$DW$1702, DW_AT_name("igbtNTC")
    9759                      .dwattr $C$DW$1702, DW_AT_TI_symbol_name("_igbtNTC")
    9760                      .dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9761                      .dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
    9762              $C$DW$1703      .dwtag  DW_TAG_member
    9763                      .dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$35)
    9764                      .dwattr $C$DW$1703, DW_AT_name("boardAddr")
    9765                      .dwattr $C$DW$1703, DW_AT_TI_symbol_name("_boardAddr")
    9766                      .dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9767                      .dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
    9768                      .dwendtag $C$DW$T$44
    9769              
    9770              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    9771                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$44)
    9772                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    9773              
    9774              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    9775                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
    9776                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
    9777              $C$DW$1704      .dwtag  DW_TAG_member
    9778                      .dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$22)
    9779                      .dwattr $C$DW$1704, DW_AT_name("PeriodMax")
    9780                      .dwattr $C$DW$1704, DW_AT_TI_symbol_name("_PeriodMax")
    9781                      .dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9782                      .dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
    9783              $C$DW$1705      .dwtag  DW_TAG_member
    9784                      .dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$47)
    9785                      .dwattr $C$DW$1705, DW_AT_name("ptrData")
    9786                      .dwattr $C$DW$1705, DW_AT_TI_symbol_name("_ptrData")
    9787                      .dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9788                      .dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
    9789              $C$DW$1706      .dwtag  DW_TAG_member
    9790                      .dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$48)
    9791                      .dwattr $C$DW$1706, DW_AT_name("value")
    9792                      .dwattr $C$DW$1706, DW_AT_TI_symbol_name("_value")
    9793                      .dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9794                      .dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
    9795              $C$DW$1707      .dwtag  DW_TAG_member
    9796                      .dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$48)
    9797                      .dwattr $C$DW$1707, DW_AT_name("offset")
    9798                      .dwattr $C$DW$1707, DW_AT_TI_symbol_name("_offset")
    9799                      .dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  188

    9800                      .dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
    9801              $C$DW$1708      .dwtag  DW_TAG_member
    9802                      .dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$48)
    9803                      .dwattr $C$DW$1708, DW_AT_name("gain")
    9804                      .dwattr $C$DW$1708, DW_AT_TI_symbol_name("_gain")
    9805                      .dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9806                      .dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
    9807                      .dwendtag $C$DW$T$49
    9808              
    9809              $C$DW$T$321     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_DacData_t")
    9810                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$T$49)
    9811                      .dwattr $C$DW$T$321, DW_AT_language(DW_LANG_C)
    9812              $C$DW$T$322     .dwtag  DW_TAG_pointer_type
    9813                      .dwattr $C$DW$T$322, DW_AT_type(*$C$DW$T$321)
    9814                      .dwattr $C$DW$T$322, DW_AT_address_class(0x16)
    9815              $C$DW$1709      .dwtag  DW_TAG_TI_far_type
    9816                      .dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$322)
    9817              $C$DW$T$323     .dwtag  DW_TAG_const_type
    9818                      .dwattr $C$DW$T$323, DW_AT_type(*$C$DW$1709)
    9819              
    9820              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9821                      .dwattr $C$DW$T$86, DW_AT_name("_HAL_Obj_")
    9822                      .dwattr $C$DW$T$86, DW_AT_byte_size(0xb2)
    9823              $C$DW$1710      .dwtag  DW_TAG_member
    9824                      .dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$51)
    9825                      .dwattr $C$DW$1710, DW_AT_name("adcHandle")
    9826                      .dwattr $C$DW$1710, DW_AT_TI_symbol_name("_adcHandle")
    9827                      .dwattr $C$DW$1710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9828                      .dwattr $C$DW$1710, DW_AT_accessibility(DW_ACCESS_public)
    9829              $C$DW$1711      .dwtag  DW_TAG_member
    9830                      .dwattr $C$DW$1711, DW_AT_type(*$C$DW$T$53)
    9831                      .dwattr $C$DW$1711, DW_AT_name("clkHandle")
    9832                      .dwattr $C$DW$1711, DW_AT_TI_symbol_name("_clkHandle")
    9833                      .dwattr $C$DW$1711, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9834                      .dwattr $C$DW$1711, DW_AT_accessibility(DW_ACCESS_public)
    9835              $C$DW$1712      .dwtag  DW_TAG_member
    9836                      .dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$55)
    9837                      .dwattr $C$DW$1712, DW_AT_name("cpuHandle")
    9838                      .dwattr $C$DW$1712, DW_AT_TI_symbol_name("_cpuHandle")
    9839                      .dwattr $C$DW$1712, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9840                      .dwattr $C$DW$1712, DW_AT_accessibility(DW_ACCESS_public)
    9841              $C$DW$1713      .dwtag  DW_TAG_member
    9842                      .dwattr $C$DW$1713, DW_AT_type(*$C$DW$T$57)
    9843                      .dwattr $C$DW$1713, DW_AT_name("flashHandle")
    9844                      .dwattr $C$DW$1713, DW_AT_TI_symbol_name("_flashHandle")
    9845                      .dwattr $C$DW$1713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9846                      .dwattr $C$DW$1713, DW_AT_accessibility(DW_ACCESS_public)
    9847              $C$DW$1714      .dwtag  DW_TAG_member
    9848                      .dwattr $C$DW$1714, DW_AT_type(*$C$DW$T$59)
    9849                      .dwattr $C$DW$1714, DW_AT_name("gpioHandle")
    9850                      .dwattr $C$DW$1714, DW_AT_TI_symbol_name("_gpioHandle")
    9851                      .dwattr $C$DW$1714, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9852                      .dwattr $C$DW$1714, DW_AT_accessibility(DW_ACCESS_public)
    9853              $C$DW$1715      .dwtag  DW_TAG_member
    9854                      .dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$62)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  189

    9855                      .dwattr $C$DW$1715, DW_AT_name("offsetHandle_I")
    9856                      .dwattr $C$DW$1715, DW_AT_TI_symbol_name("_offsetHandle_I")
    9857                      .dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9858                      .dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
    9859              $C$DW$1716      .dwtag  DW_TAG_member
    9860                      .dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$64)
    9861                      .dwattr $C$DW$1716, DW_AT_name("offset_I")
    9862                      .dwattr $C$DW$1716, DW_AT_TI_symbol_name("_offset_I")
    9863                      .dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9864                      .dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
    9865              $C$DW$1717      .dwtag  DW_TAG_member
    9866                      .dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$62)
    9867                      .dwattr $C$DW$1717, DW_AT_name("offsetHandle_V")
    9868                      .dwattr $C$DW$1717, DW_AT_TI_symbol_name("_offsetHandle_V")
    9869                      .dwattr $C$DW$1717, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9870                      .dwattr $C$DW$1717, DW_AT_accessibility(DW_ACCESS_public)
    9871              $C$DW$1718      .dwtag  DW_TAG_member
    9872                      .dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$64)
    9873                      .dwattr $C$DW$1718, DW_AT_name("offset_V")
    9874                      .dwattr $C$DW$1718, DW_AT_TI_symbol_name("_offset_V")
    9875                      .dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9876                      .dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
    9877              $C$DW$1719      .dwtag  DW_TAG_member
    9878                      .dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$66)
    9879                      .dwattr $C$DW$1719, DW_AT_name("oscHandle")
    9880                      .dwattr $C$DW$1719, DW_AT_TI_symbol_name("_oscHandle")
    9881                      .dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    9882                      .dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
    9883              $C$DW$1720      .dwtag  DW_TAG_member
    9884                      .dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$68)
    9885                      .dwattr $C$DW$1720, DW_AT_name("pieHandle")
    9886                      .dwattr $C$DW$1720, DW_AT_TI_symbol_name("_pieHandle")
    9887                      .dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9888                      .dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
    9889              $C$DW$1721      .dwtag  DW_TAG_member
    9890                      .dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$70)
    9891                      .dwattr $C$DW$1721, DW_AT_name("pllHandle")
    9892                      .dwattr $C$DW$1721, DW_AT_TI_symbol_name("_pllHandle")
    9893                      .dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9894                      .dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
    9895              $C$DW$1722      .dwtag  DW_TAG_member
    9896                      .dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$73)
    9897                      .dwattr $C$DW$1722, DW_AT_name("pwmHandle")
    9898                      .dwattr $C$DW$1722, DW_AT_TI_symbol_name("_pwmHandle")
    9899                      .dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    9900                      .dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
    9901              $C$DW$1723      .dwtag  DW_TAG_member
    9902                      .dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$73)
    9903                      .dwattr $C$DW$1723, DW_AT_name("pwmDacHandle")
    9904                      .dwattr $C$DW$1723, DW_AT_TI_symbol_name("_pwmDacHandle")
    9905                      .dwattr $C$DW$1723, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    9906                      .dwattr $C$DW$1723, DW_AT_accessibility(DW_ACCESS_public)
    9907              $C$DW$1724      .dwtag  DW_TAG_member
    9908                      .dwattr $C$DW$1724, DW_AT_type(*$C$DW$T$75)
    9909                      .dwattr $C$DW$1724, DW_AT_name("pwrHandle")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  190

    9910                      .dwattr $C$DW$1724, DW_AT_TI_symbol_name("_pwrHandle")
    9911                      .dwattr $C$DW$1724, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    9912                      .dwattr $C$DW$1724, DW_AT_accessibility(DW_ACCESS_public)
    9913              $C$DW$1725      .dwtag  DW_TAG_member
    9914                      .dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$78)
    9915                      .dwattr $C$DW$1725, DW_AT_name("timerHandle")
    9916                      .dwattr $C$DW$1725, DW_AT_TI_symbol_name("_timerHandle")
    9917                      .dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    9918                      .dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
    9919              $C$DW$1726      .dwtag  DW_TAG_member
    9920                      .dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$80)
    9921                      .dwattr $C$DW$1726, DW_AT_name("i2cHandle")
    9922                      .dwattr $C$DW$1726, DW_AT_TI_symbol_name("_i2cHandle")
    9923                      .dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    9924                      .dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
    9925              $C$DW$1727      .dwtag  DW_TAG_member
    9926                      .dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$82)
    9927                      .dwattr $C$DW$1727, DW_AT_name("spiAHandle")
    9928                      .dwattr $C$DW$1727, DW_AT_TI_symbol_name("_spiAHandle")
    9929                      .dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9930                      .dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
    9931              $C$DW$1728      .dwtag  DW_TAG_member
    9932                      .dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$84)
    9933                      .dwattr $C$DW$1728, DW_AT_name("wdogHandle")
    9934                      .dwattr $C$DW$1728, DW_AT_TI_symbol_name("_wdogHandle")
    9935                      .dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    9936                      .dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
    9937              $C$DW$1729      .dwtag  DW_TAG_member
    9938                      .dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$85)
    9939                      .dwattr $C$DW$1729, DW_AT_name("adcBias")
    9940                      .dwattr $C$DW$1729, DW_AT_TI_symbol_name("_adcBias")
    9941                      .dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    9942                      .dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
    9943              $C$DW$1730      .dwtag  DW_TAG_member
    9944                      .dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$35)
    9945                      .dwattr $C$DW$1730, DW_AT_name("current_sf")
    9946                      .dwattr $C$DW$1730, DW_AT_TI_symbol_name("_current_sf")
    9947                      .dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    9948                      .dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
    9949              $C$DW$1731      .dwtag  DW_TAG_member
    9950                      .dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$35)
    9951                      .dwattr $C$DW$1731, DW_AT_name("voltage_sf")
    9952                      .dwattr $C$DW$1731, DW_AT_TI_symbol_name("_voltage_sf")
    9953                      .dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9954                      .dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
    9955              $C$DW$1732      .dwtag  DW_TAG_member
    9956                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$33)
    9957                      .dwattr $C$DW$1732, DW_AT_name("numCurrentSensors")
    9958                      .dwattr $C$DW$1732, DW_AT_TI_symbol_name("_numCurrentSensors")
    9959                      .dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    9960                      .dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
    9961              $C$DW$1733      .dwtag  DW_TAG_member
    9962                      .dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$33)
    9963                      .dwattr $C$DW$1733, DW_AT_name("numVoltageSensors")
    9964                      .dwattr $C$DW$1733, DW_AT_TI_symbol_name("_numVoltageSensors")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  191

    9965                      .dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
    9966                      .dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
    9967                      .dwendtag $C$DW$T$86
    9968              
    9969              $C$DW$T$326     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    9970                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$86)
    9971                      .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
    9972              $C$DW$T$327     .dwtag  DW_TAG_pointer_type
    9973                      .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$326)
    9974                      .dwattr $C$DW$T$327, DW_AT_address_class(0x16)
    9975              $C$DW$T$328     .dwtag  DW_TAG_pointer_type
    9976                      .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$86)
    9977                      .dwattr $C$DW$T$328, DW_AT_address_class(0x16)
    9978              $C$DW$T$329     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    9979                      .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$328)
    9980                      .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
    9981              $C$DW$1734      .dwtag  DW_TAG_TI_far_type
    9982                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$329)
    9983              $C$DW$T$330     .dwtag  DW_TAG_const_type
    9984                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$1734)
    9985              
    9986              $C$DW$T$88      .dwtag  DW_TAG_structure_type
    9987                      .dwattr $C$DW$T$88, DW_AT_name("_MATH_vec3_")
    9988                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x06)
    9989              $C$DW$1735      .dwtag  DW_TAG_member
    9990                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$87)
    9991                      .dwattr $C$DW$1735, DW_AT_name("value")
    9992                      .dwattr $C$DW$1735, DW_AT_TI_symbol_name("_value")
    9993                      .dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9994                      .dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
    9995                      .dwendtag $C$DW$T$88
    9996              
    9997              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    9998                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$88)
    9999                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   10000              
   10001              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   10002                      .dwattr $C$DW$T$92, DW_AT_name("_OFFSET_")
   10003                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x10)
   10004              $C$DW$1736      .dwtag  DW_TAG_member
   10005                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$35)
   10006                      .dwattr $C$DW$1736, DW_AT_name("value")
   10007                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_value")
   10008                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10009                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
   10010              $C$DW$1737      .dwtag  DW_TAG_member
   10011                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$35)
   10012                      .dwattr $C$DW$1737, DW_AT_name("bias")
   10013                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_bias")
   10014                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10015                      .dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
   10016              $C$DW$1738      .dwtag  DW_TAG_member
   10017                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$89)
   10018                      .dwattr $C$DW$1738, DW_AT_name("filter")
   10019                      .dwattr $C$DW$1738, DW_AT_TI_symbol_name("_filter")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  192

   10020                      .dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10021                      .dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
   10022              $C$DW$1739      .dwtag  DW_TAG_member
   10023                      .dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$91)
   10024                      .dwattr $C$DW$1739, DW_AT_name("filterHandle")
   10025                      .dwattr $C$DW$1739, DW_AT_TI_symbol_name("_filterHandle")
   10026                      .dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10027                      .dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
   10028                      .dwendtag $C$DW$T$92
   10029              
   10030              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
   10031                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$92)
   10032                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   10033              
   10034              $C$DW$T$64      .dwtag  DW_TAG_array_type
   10035                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   10036                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   10037                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   10038              $C$DW$1740      .dwtag  DW_TAG_subrange_type
   10039                      .dwattr $C$DW$1740, DW_AT_upper_bound(0x02)
   10040                      .dwendtag $C$DW$T$64
   10041              
   10042              
   10043              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   10044                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   10045                      .dwattr $C$DW$T$21, DW_AT_declaration
   10046                      .dwendtag $C$DW$T$21
   10047              
   10048              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   10049                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   10050                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
   10051              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
   10052                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   10053                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   10054              
   10055              $C$DW$T$62      .dwtag  DW_TAG_array_type
   10056                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   10057                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   10058                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   10059              $C$DW$1741      .dwtag  DW_TAG_subrange_type
   10060                      .dwattr $C$DW$1741, DW_AT_upper_bound(0x02)
   10061                      .dwendtag $C$DW$T$62
   10062              
   10063              
   10064              $C$DW$T$93      .dwtag  DW_TAG_structure_type
   10065                      .dwattr $C$DW$T$93, DW_AT_name("_OSC_Obj_")
   10066                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x03)
   10067              $C$DW$1742      .dwtag  DW_TAG_member
   10068                      .dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$23)
   10069                      .dwattr $C$DW$1742, DW_AT_name("INTOSC1TRIM")
   10070                      .dwattr $C$DW$1742, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   10071                      .dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10072                      .dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
   10073              $C$DW$1743      .dwtag  DW_TAG_member
   10074                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  193

   10075                      .dwattr $C$DW$1743, DW_AT_name("rsvd_1")
   10076                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_rsvd_1")
   10077                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10078                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
   10079              $C$DW$1744      .dwtag  DW_TAG_member
   10080                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$23)
   10081                      .dwattr $C$DW$1744, DW_AT_name("INTOSC2TRIM")
   10082                      .dwattr $C$DW$1744, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   10083                      .dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10084                      .dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
   10085                      .dwendtag $C$DW$T$93
   10086              
   10087              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   10088                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$93)
   10089                      .dwattr $C$DW$T$65, DW_AT_address_class(0x16)
   10090              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
   10091                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   10092                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   10093              
   10094              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   10095                      .dwattr $C$DW$T$94, DW_AT_name("_PIE_IERIFR_t")
   10096                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x02)
   10097              $C$DW$1745      .dwtag  DW_TAG_member
   10098                      .dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$23)
   10099                      .dwattr $C$DW$1745, DW_AT_name("IER")
   10100                      .dwattr $C$DW$1745, DW_AT_TI_symbol_name("_IER")
   10101                      .dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10102                      .dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
   10103              $C$DW$1746      .dwtag  DW_TAG_member
   10104                      .dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$23)
   10105                      .dwattr $C$DW$1746, DW_AT_name("IFR")
   10106                      .dwattr $C$DW$1746, DW_AT_TI_symbol_name("_IFR")
   10107                      .dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10108                      .dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
   10109                      .dwendtag $C$DW$T$94
   10110              
   10111              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
   10112                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   10113                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   10114              $C$DW$1747      .dwtag  DW_TAG_TI_far_type
   10115                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$95)
   10116              $C$DW$T$96      .dwtag  DW_TAG_volatile_type
   10117                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$1747)
   10118              
   10119              $C$DW$T$97      .dwtag  DW_TAG_array_type
   10120                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
   10121                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   10122                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x18)
   10123              $C$DW$1748      .dwtag  DW_TAG_subrange_type
   10124                      .dwattr $C$DW$1748, DW_AT_upper_bound(0x0b)
   10125                      .dwendtag $C$DW$T$97
   10126              
   10127              
   10128              $C$DW$T$104     .dwtag  DW_TAG_structure_type
   10129                      .dwattr $C$DW$T$104, DW_AT_name("_PIE_Obj_")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  194

   10130                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x639c)
   10131              $C$DW$1749      .dwtag  DW_TAG_member
   10132                      .dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$23)
   10133                      .dwattr $C$DW$1749, DW_AT_name("PIECTRL")
   10134                      .dwattr $C$DW$1749, DW_AT_TI_symbol_name("_PIECTRL")
   10135                      .dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10136                      .dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
   10137              $C$DW$1750      .dwtag  DW_TAG_member
   10138                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$23)
   10139                      .dwattr $C$DW$1750, DW_AT_name("PIEACK")
   10140                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_PIEACK")
   10141                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10142                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
   10143              $C$DW$1751      .dwtag  DW_TAG_member
   10144                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$97)
   10145                      .dwattr $C$DW$1751, DW_AT_name("PIEIER_PIEIFR")
   10146                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   10147                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10148                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
   10149              $C$DW$1752      .dwtag  DW_TAG_member
   10150                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$98)
   10151                      .dwattr $C$DW$1752, DW_AT_name("rsvd_1")
   10152                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_rsvd_1")
   10153                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10154                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
   10155              $C$DW$1753      .dwtag  DW_TAG_member
   10156                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$102)
   10157                      .dwattr $C$DW$1753, DW_AT_name("Reset")
   10158                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_Reset")
   10159                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   10160                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
   10161              $C$DW$1754      .dwtag  DW_TAG_member
   10162                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$102)
   10163                      .dwattr $C$DW$1754, DW_AT_name("INT1")
   10164                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_INT1")
   10165                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   10166                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
   10167              $C$DW$1755      .dwtag  DW_TAG_member
   10168                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$102)
   10169                      .dwattr $C$DW$1755, DW_AT_name("INT2")
   10170                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_INT2")
   10171                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   10172                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
   10173              $C$DW$1756      .dwtag  DW_TAG_member
   10174                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$102)
   10175                      .dwattr $C$DW$1756, DW_AT_name("INT3")
   10176                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_INT3")
   10177                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   10178                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
   10179              $C$DW$1757      .dwtag  DW_TAG_member
   10180                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$102)
   10181                      .dwattr $C$DW$1757, DW_AT_name("INT4")
   10182                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_INT4")
   10183                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   10184                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  195

   10185              $C$DW$1758      .dwtag  DW_TAG_member
   10186                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$102)
   10187                      .dwattr $C$DW$1758, DW_AT_name("INT5")
   10188                      .dwattr $C$DW$1758, DW_AT_TI_symbol_name("_INT5")
   10189                      .dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   10190                      .dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
   10191              $C$DW$1759      .dwtag  DW_TAG_member
   10192                      .dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$102)
   10193                      .dwattr $C$DW$1759, DW_AT_name("INT6")
   10194                      .dwattr $C$DW$1759, DW_AT_TI_symbol_name("_INT6")
   10195                      .dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   10196                      .dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
   10197              $C$DW$1760      .dwtag  DW_TAG_member
   10198                      .dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$102)
   10199                      .dwattr $C$DW$1760, DW_AT_name("INT7")
   10200                      .dwattr $C$DW$1760, DW_AT_TI_symbol_name("_INT7")
   10201                      .dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   10202                      .dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
   10203              $C$DW$1761      .dwtag  DW_TAG_member
   10204                      .dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$102)
   10205                      .dwattr $C$DW$1761, DW_AT_name("INT8")
   10206                      .dwattr $C$DW$1761, DW_AT_TI_symbol_name("_INT8")
   10207                      .dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   10208                      .dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
   10209              $C$DW$1762      .dwtag  DW_TAG_member
   10210                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$102)
   10211                      .dwattr $C$DW$1762, DW_AT_name("INT9")
   10212                      .dwattr $C$DW$1762, DW_AT_TI_symbol_name("_INT9")
   10213                      .dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   10214                      .dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
   10215              $C$DW$1763      .dwtag  DW_TAG_member
   10216                      .dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$102)
   10217                      .dwattr $C$DW$1763, DW_AT_name("INT10")
   10218                      .dwattr $C$DW$1763, DW_AT_TI_symbol_name("_INT10")
   10219                      .dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   10220                      .dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
   10221              $C$DW$1764      .dwtag  DW_TAG_member
   10222                      .dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$102)
   10223                      .dwattr $C$DW$1764, DW_AT_name("INT11")
   10224                      .dwattr $C$DW$1764, DW_AT_TI_symbol_name("_INT11")
   10225                      .dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10226                      .dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
   10227              $C$DW$1765      .dwtag  DW_TAG_member
   10228                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$102)
   10229                      .dwattr $C$DW$1765, DW_AT_name("INT12")
   10230                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_INT12")
   10231                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10232                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
   10233              $C$DW$1766      .dwtag  DW_TAG_member
   10234                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$102)
   10235                      .dwattr $C$DW$1766, DW_AT_name("TINT1")
   10236                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_TINT1")
   10237                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10238                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
   10239              $C$DW$1767      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1346811                              PAGE  196

   10240                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$102)
   10241                      .dwattr $C$DW$1767, DW_AT_name("TINT2")
   10242                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_TINT2")
   10243                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10244                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
   10245              $C$DW$1768      .dwtag  DW_TAG_member
   10246                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$102)
