TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Jul 10 09:53:38 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/drivers/drvic/ldc1612.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5886              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_MUX_CONFIG"), DW_AT_const_value(0x1b)
    5887              $C$DW$651       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_RESET_DEV"), DW_AT_const_value(0x1c)
    5888              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch0DrvCurrent"), DW_AT_const_value(0x1
    5889              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch1DrvCurrent"), DW_AT_const_value(0x1
    5890              $C$DW$654       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch2DrvCurrent"), DW_AT_const_value(0x2
    5891              $C$DW$655       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch3DrvCurrent"), DW_AT_const_value(0x2
    5892              $C$DW$656       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_MANUFACTURER_ID"), DW_AT_const_value(0
    5893              $C$DW$657       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_DEVICE_ID"), DW_AT_const_value(0x7f)
    5894                      .dwendtag $C$DW$T$92
    5895              
    5896              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_RegName_e")
    5897                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    5898                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    5899              $C$DW$658       .dwtag  DW_TAG_TI_far_type
    5900                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$93)
    5901              $C$DW$T$94      .dwtag  DW_TAG_const_type
    5902                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$658)
    5903              
    5904              $C$DW$T$95      .dwtag  DW_TAG_enumeration_type
    5905                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x01)
    5906              $C$DW$659       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH0"), DW_AT_const_value(0x00)
    5907              $C$DW$660       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH1"), DW_AT_const_value(0x01)
    5908              $C$DW$661       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH2"), DW_AT_const_value(0x02)
    5909              $C$DW$662       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH3"), DW_AT_const_value(0x03)
    5910                      .dwendtag $C$DW$T$95
    5911              
    5912              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ChNum_e")
    5913                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    5914                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    5915              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    5916                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$96)
    5917              $C$DW$T$97      .dwtag  DW_TAG_const_type
    5918                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$663)
    5919              $C$DW$664       .dwtag  DW_TAG_TI_far_type
    5920                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$96)
    5921              $C$DW$T$98      .dwtag  DW_TAG_const_type
    5922                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$664)
    5923              $C$DW$665       .dwtag  DW_TAG_TI_far_type
    5924                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$96)
    5925              $C$DW$T$99      .dwtag  DW_TAG_const_type
    5926                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$665)
    5927              $C$DW$666       .dwtag  DW_TAG_TI_far_type
    5928                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$96)
    5929              $C$DW$T$100     .dwtag  DW_TAG_const_type
    5930                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$666)
    5931              $C$DW$667       .dwtag  DW_TAG_TI_far_type
    5932                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$96)
    5933              $C$DW$T$101     .dwtag  DW_TAG_const_type
    5934                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$667)
    5935              $C$DW$668       .dwtag  DW_TAG_TI_far_type
    5936                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$96)
    5937              $C$DW$T$102     .dwtag  DW_TAG_const_type
    5938                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$668)
    5939              $C$DW$669       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  113

    5940                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$96)
    5941              $C$DW$T$103     .dwtag  DW_TAG_const_type
    5942                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$669)
    5943              $C$DW$670       .dwtag  DW_TAG_TI_far_type
    5944                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$96)
    5945              $C$DW$T$104     .dwtag  DW_TAG_const_type
    5946                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$670)
    5947              $C$DW$671       .dwtag  DW_TAG_TI_far_type
    5948                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$96)
    5949              $C$DW$T$105     .dwtag  DW_TAG_const_type
    5950                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$671)
    5951              $C$DW$672       .dwtag  DW_TAG_TI_far_type
    5952                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$96)
    5953              $C$DW$T$106     .dwtag  DW_TAG_const_type
    5954                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$672)
    5955              
    5956              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5957                      .dwattr $C$DW$T$22, DW_AT_name("Data")
    5958                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    5959              $C$DW$673       .dwtag  DW_TAG_member
    5960                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$21)
    5961                      .dwattr $C$DW$673, DW_AT_name("LSB")
    5962                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_LSB")
    5963                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5964                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5965              $C$DW$674       .dwtag  DW_TAG_member
    5966                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$21)
    5967                      .dwattr $C$DW$674, DW_AT_name("MSB")
    5968                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_MSB")
    5969                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5970                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5971                      .dwendtag $C$DW$T$22
    5972              
    5973              
    5974              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5975                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    5976                      .dwattr $C$DW$T$19, DW_AT_declaration
    5977                      .dwendtag $C$DW$T$19
    5978              
    5979              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    5980                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$19)
    5981                      .dwattr $C$DW$T$42, DW_AT_address_class(0x16)
    5982              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    5983                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5984                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5985              $C$DW$675       .dwtag  DW_TAG_TI_far_type
    5986                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$43)
    5987              $C$DW$T$107     .dwtag  DW_TAG_const_type
    5988                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$675)
    5989              
    5990              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5991                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    5992                      .dwattr $C$DW$T$20, DW_AT_declaration
    5993                      .dwendtag $C$DW$T$20
    5994              
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  114

    5995              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    5996                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
    5997                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    5998              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    5999                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    6000                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    6001              $C$DW$676       .dwtag  DW_TAG_TI_far_type
    6002                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$47)
    6003              $C$DW$T$109     .dwtag  DW_TAG_const_type
    6004                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$676)
    6005              
    6006              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6007                      .dwattr $C$DW$T$23, DW_AT_name("_CLK_DIV_t_")
    6008                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    6009              $C$DW$677       .dwtag  DW_TAG_member
    6010                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$21)
    6011                      .dwattr $C$DW$677, DW_AT_name("FREF_DIVIDER")
    6012                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    6013                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6014                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6015              $C$DW$678       .dwtag  DW_TAG_member
    6016                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$21)
    6017                      .dwattr $C$DW$678, DW_AT_name("FIN_DIVIDER")
    6018                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    6019                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6020                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6021                      .dwendtag $C$DW$T$23
    6022              
    6023              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    6024                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$23)
    6025                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    6026              
    6027              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    6028                      .dwattr $C$DW$T$24, DW_AT_name("_DRIVE_CURRENT_t_")
    6029                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    6030              $C$DW$679       .dwtag  DW_TAG_member
    6031                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$21)
    6032                      .dwattr $C$DW$679, DW_AT_name("IDRIVE")
    6033                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_IDRIVE")
    6034                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6035                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6036              $C$DW$680       .dwtag  DW_TAG_member
    6037                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$21)
    6038                      .dwattr $C$DW$680, DW_AT_name("INIT_IDRIVE")
    6039                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    6040                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6041                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6042                      .dwendtag $C$DW$T$24
    6043              
    6044              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    6045                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$24)
    6046                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    6047              
    6048              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6049                      .dwattr $C$DW$T$34, DW_AT_name("_GPIO_Obj_")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  115

    6050                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6a)
    6051              $C$DW$681       .dwtag  DW_TAG_member
    6052                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$26)
    6053                      .dwattr $C$DW$681, DW_AT_name("GPACTRL")
    6054                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_GPACTRL")
    6055                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6056                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6057              $C$DW$682       .dwtag  DW_TAG_member
    6058                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$26)
    6059                      .dwattr $C$DW$682, DW_AT_name("GPAQSEL1")
    6060                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_GPAQSEL1")
    6061                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6062                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6063              $C$DW$683       .dwtag  DW_TAG_member
    6064                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$26)
    6065                      .dwattr $C$DW$683, DW_AT_name("GPAQSEL2")
    6066                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_GPAQSEL2")
    6067                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6068                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6069              $C$DW$684       .dwtag  DW_TAG_member
    6070                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$26)
    6071                      .dwattr $C$DW$684, DW_AT_name("GPAMUX1")
    6072                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_GPAMUX1")
    6073                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6074                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6075              $C$DW$685       .dwtag  DW_TAG_member
    6076                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$26)
    6077                      .dwattr $C$DW$685, DW_AT_name("GPAMUX2")
    6078                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_GPAMUX2")
    6079                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6080                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6081              $C$DW$686       .dwtag  DW_TAG_member
    6082                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$26)
    6083                      .dwattr $C$DW$686, DW_AT_name("GPADIR")
    6084                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_GPADIR")
    6085                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6086                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6087              $C$DW$687       .dwtag  DW_TAG_member
    6088                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$26)
    6089                      .dwattr $C$DW$687, DW_AT_name("GPAPUD")
    6090                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_GPAPUD")
    6091                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6092                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6093              $C$DW$688       .dwtag  DW_TAG_member
    6094                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$28)
    6095                      .dwattr $C$DW$688, DW_AT_name("rsvd_1")
    6096                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_rsvd_1")
    6097                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6098                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6099              $C$DW$689       .dwtag  DW_TAG_member
    6100                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$26)
    6101                      .dwattr $C$DW$689, DW_AT_name("GPBCTRL")
    6102                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_GPBCTRL")
    6103                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6104                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  116

    6105              $C$DW$690       .dwtag  DW_TAG_member
    6106                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$26)
    6107                      .dwattr $C$DW$690, DW_AT_name("GPBQSEL1")
    6108                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_GPBQSEL1")
    6109                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6110                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6111              $C$DW$691       .dwtag  DW_TAG_member
    6112                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$28)
    6113                      .dwattr $C$DW$691, DW_AT_name("rsvd_2")
    6114                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_2")
    6115                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6116                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6117              $C$DW$692       .dwtag  DW_TAG_member
    6118                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$26)
    6119                      .dwattr $C$DW$692, DW_AT_name("GPBMUX1")
    6120                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_GPBMUX1")
    6121                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6122                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6123              $C$DW$693       .dwtag  DW_TAG_member
    6124                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$28)
    6125                      .dwattr $C$DW$693, DW_AT_name("rsvd_3")
    6126                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_rsvd_3")
    6127                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6128                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6129              $C$DW$694       .dwtag  DW_TAG_member
    6130                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$26)
    6131                      .dwattr $C$DW$694, DW_AT_name("GPBDIR")
    6132                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_GPBDIR")
    6133                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6134                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6135              $C$DW$695       .dwtag  DW_TAG_member
    6136                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$26)
    6137                      .dwattr $C$DW$695, DW_AT_name("GPBPUD")
    6138                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_GPBPUD")
    6139                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6140                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6141              $C$DW$696       .dwtag  DW_TAG_member
    6142                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$29)
    6143                      .dwattr $C$DW$696, DW_AT_name("rsvd_4")
    6144                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_4")
    6145                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6146                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6147              $C$DW$697       .dwtag  DW_TAG_member
    6148                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$26)
    6149                      .dwattr $C$DW$697, DW_AT_name("AIOMUX1")
    6150                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_AIOMUX1")
    6151                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    6152                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6153              $C$DW$698       .dwtag  DW_TAG_member
    6154                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$28)
    6155                      .dwattr $C$DW$698, DW_AT_name("rsvd_5")
    6156                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_5")
    6157                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6158                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6159              $C$DW$699       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  117

    6160                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$26)
    6161                      .dwattr $C$DW$699, DW_AT_name("AIODIR")
    6162                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_AIODIR")
    6163                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6164                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6165              $C$DW$700       .dwtag  DW_TAG_member
    6166                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$30)
    6167                      .dwattr $C$DW$700, DW_AT_name("rsvd_6")
    6168                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd_6")
    6169                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6170                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6171              $C$DW$701       .dwtag  DW_TAG_member
    6172                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$26)
    6173                      .dwattr $C$DW$701, DW_AT_name("GPADAT")
    6174                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_GPADAT")
    6175                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6176                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6177              $C$DW$702       .dwtag  DW_TAG_member
    6178                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$26)
    6179                      .dwattr $C$DW$702, DW_AT_name("GPASET")
    6180                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_GPASET")
    6181                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    6182                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6183              $C$DW$703       .dwtag  DW_TAG_member
    6184                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$26)
    6185                      .dwattr $C$DW$703, DW_AT_name("GPACLEAR")
    6186                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_GPACLEAR")
    6187                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6188                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6189              $C$DW$704       .dwtag  DW_TAG_member
    6190                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$26)
    6191                      .dwattr $C$DW$704, DW_AT_name("GPATOGGLE")
    6192                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_GPATOGGLE")
    6193                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6194                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6195              $C$DW$705       .dwtag  DW_TAG_member
    6196                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$26)
    6197                      .dwattr $C$DW$705, DW_AT_name("GPBDAT")
    6198                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_GPBDAT")
    6199                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6200                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6201              $C$DW$706       .dwtag  DW_TAG_member
    6202                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$26)
    6203                      .dwattr $C$DW$706, DW_AT_name("GPBSET")
    6204                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_GPBSET")
    6205                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    6206                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6207              $C$DW$707       .dwtag  DW_TAG_member
    6208                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$26)
    6209                      .dwattr $C$DW$707, DW_AT_name("GPBCLEAR")
    6210                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_GPBCLEAR")
    6211                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6212                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6213              $C$DW$708       .dwtag  DW_TAG_member
    6214                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  118

    6215                      .dwattr $C$DW$708, DW_AT_name("GPBTOGGLE")
    6216                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_GPBTOGGLE")
    6217                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    6218                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6219              $C$DW$709       .dwtag  DW_TAG_member
    6220                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$31)
    6221                      .dwattr $C$DW$709, DW_AT_name("rsvd_7")
    6222                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_rsvd_7")
    6223                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6224                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6225              $C$DW$710       .dwtag  DW_TAG_member
    6226                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$26)
    6227                      .dwattr $C$DW$710, DW_AT_name("AIODAT")
    6228                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_AIODAT")
    6229                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6230                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6231              $C$DW$711       .dwtag  DW_TAG_member
    6232                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$26)
    6233                      .dwattr $C$DW$711, DW_AT_name("AIOSET")
    6234                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_AIOSET")
    6235                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    6236                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6237              $C$DW$712       .dwtag  DW_TAG_member
    6238                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$26)
    6239                      .dwattr $C$DW$712, DW_AT_name("AIOCLEAR")
    6240                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_AIOCLEAR")
    6241                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6242                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6243              $C$DW$713       .dwtag  DW_TAG_member
    6244                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$26)
    6245                      .dwattr $C$DW$713, DW_AT_name("AIOTOGGLE")
    6246                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_AIOTOGGLE")
    6247                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6248                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6249              $C$DW$714       .dwtag  DW_TAG_member
    6250                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$32)
    6251                      .dwattr $C$DW$714, DW_AT_name("GPIOXINTnSEL")
    6252                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    6253                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6254                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6255              $C$DW$715       .dwtag  DW_TAG_member
    6256                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$33)
    6257                      .dwattr $C$DW$715, DW_AT_name("rsvd_8")
    6258                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_rsvd_8")
    6259                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    6260                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6261              $C$DW$716       .dwtag  DW_TAG_member
    6262                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$26)
    6263                      .dwattr $C$DW$716, DW_AT_name("GPIOLPMSEL")
    6264                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    6265                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    6266                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6267                      .dwendtag $C$DW$T$34
    6268              
    6269              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  119

    6270                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$34)
    6271                      .dwattr $C$DW$T$44, DW_AT_address_class(0x16)
    6272              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    6273                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    6274                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    6275              $C$DW$717       .dwtag  DW_TAG_TI_far_type
    6276                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$45)
    6277              $C$DW$T$116     .dwtag  DW_TAG_const_type
    6278                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$717)
    6279              
    6280              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6281                      .dwattr $C$DW$T$36, DW_AT_name("_LDC1612_CONFIG_t_")
    6282                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x09)
    6283              $C$DW$718       .dwtag  DW_TAG_member
    6284                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$35)
    6285                      .dwattr $C$DW$718, DW_AT_name("ACTIVE_CHAN_0")
    6286                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_ACTIVE_CHAN_0")
    6287                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6288                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6289              $C$DW$719       .dwtag  DW_TAG_member
    6290                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$35)
    6291                      .dwattr $C$DW$719, DW_AT_name("ACTIVE_CHAN_1")
    6292                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_ACTIVE_CHAN_1")
    6293                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6294                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6295              $C$DW$720       .dwtag  DW_TAG_member
    6296                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$35)
    6297                      .dwattr $C$DW$720, DW_AT_name("SLEEP_MODE_EN")
    6298                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_SLEEP_MODE_EN")
    6299                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6300                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6301              $C$DW$721       .dwtag  DW_TAG_member
    6302                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$35)
    6303                      .dwattr $C$DW$721, DW_AT_name("RP_OVERRIDE_EN")
    6304                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_RP_OVERRIDE_EN")
    6305                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6306                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6307              $C$DW$722       .dwtag  DW_TAG_member
    6308                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$35)
    6309                      .dwattr $C$DW$722, DW_AT_name("SENSOR_ACTV_SEL")
    6310                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_SENSOR_ACTV_SEL")
    6311                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6312                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6313              $C$DW$723       .dwtag  DW_TAG_member
    6314                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$35)
    6315                      .dwattr $C$DW$723, DW_AT_name("AUTO_AMP_DIS")
    6316                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_AUTO_AMP_DIS")
    6317                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6318                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6319              $C$DW$724       .dwtag  DW_TAG_member
    6320                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$35)
    6321                      .dwattr $C$DW$724, DW_AT_name("REF_CLK_SRC")
    6322                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_REF_CLK_SRC")
    6323                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6324                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  120

    6325              $C$DW$725       .dwtag  DW_TAG_member
    6326                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$35)
    6327                      .dwattr $C$DW$725, DW_AT_name("INTB_DIS")
    6328                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_INTB_DIS")
    6329                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6330                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6331              $C$DW$726       .dwtag  DW_TAG_member
    6332                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$35)
    6333                      .dwattr $C$DW$726, DW_AT_name("HIGH_CURRENT_DRV")
    6334                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_HIGH_CURRENT_DRV")
    6335                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6336                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6337                      .dwendtag $C$DW$T$36
    6338              
    6339              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("LDC1612_CONFIG_t_")
    6340                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$36)
    6341                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    6342              
    6343              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6344                      .dwattr $C$DW$T$38, DW_AT_name("_LDC161x_CLK_DIVS_t_")
    6345                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    6346              $C$DW$727       .dwtag  DW_TAG_member
    6347                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$37)
    6348                      .dwattr $C$DW$727, DW_AT_name("CLK_DIVS_CH0")
    6349                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_CLK_DIVS_CH0")
    6350                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6351                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6352              $C$DW$728       .dwtag  DW_TAG_member
    6353                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$37)
    6354                      .dwattr $C$DW$728, DW_AT_name("CLK_DIVS_CH1")
    6355                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_CLK_DIVS_CH1")
    6356                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6357                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6358              $C$DW$729       .dwtag  DW_TAG_member
    6359                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$37)
    6360                      .dwattr $C$DW$729, DW_AT_name("CLK_DIVS_CH2")
    6361                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_CLK_DIVS_CH2")
    6362                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6363                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6364              $C$DW$730       .dwtag  DW_TAG_member
    6365                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$37)
    6366                      .dwattr $C$DW$730, DW_AT_name("CLK_DIVS_CH3")
    6367                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_CLK_DIVS_CH3")
    6368                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6369                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6370                      .dwendtag $C$DW$T$38
    6371              
    6372              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_CLK_DIVS_t_")
    6373                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$38)
    6374                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    6375              
    6376              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6377                      .dwattr $C$DW$T$39, DW_AT_name("_LDC161x_ERROR_CONFIG_t_")
    6378                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0c)
    6379              $C$DW$731       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  121

    6380                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$35)
    6381                      .dwattr $C$DW$731, DW_AT_name("UR_ERR2OUT")
    6382                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_UR_ERR2OUT")
    6383                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6384                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6385              $C$DW$732       .dwtag  DW_TAG_member
    6386                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$35)
    6387                      .dwattr $C$DW$732, DW_AT_name("OR_ERR2OUT")
    6388                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_OR_ERR2OUT")
    6389                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6390                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6391              $C$DW$733       .dwtag  DW_TAG_member
    6392                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$35)
    6393                      .dwattr $C$DW$733, DW_AT_name("WD_ERR2OUT")
    6394                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_WD_ERR2OUT")
    6395                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6396                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6397              $C$DW$734       .dwtag  DW_TAG_member
    6398                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$35)
    6399                      .dwattr $C$DW$734, DW_AT_name("AH_ERR2OUT")
    6400                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_AH_ERR2OUT")
    6401                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6402                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6403              $C$DW$735       .dwtag  DW_TAG_member
    6404                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$35)
    6405                      .dwattr $C$DW$735, DW_AT_name("AL_ERR2OUT")
    6406                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_AL_ERR2OUT")
    6407                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6408                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6409              $C$DW$736       .dwtag  DW_TAG_member
    6410                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$35)
    6411                      .dwattr $C$DW$736, DW_AT_name("UR_ERR2INT")
    6412                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_UR_ERR2INT")
    6413                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6414                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6415              $C$DW$737       .dwtag  DW_TAG_member
    6416                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$35)
    6417                      .dwattr $C$DW$737, DW_AT_name("OR_ERR2INT")
    6418                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_OR_ERR2INT")
    6419                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6420                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6421              $C$DW$738       .dwtag  DW_TAG_member
    6422                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$35)
    6423                      .dwattr $C$DW$738, DW_AT_name("WD_ERR2INT")
    6424                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_WD_ERR2INT")
    6425                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6426                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6427              $C$DW$739       .dwtag  DW_TAG_member
    6428                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$35)
    6429                      .dwattr $C$DW$739, DW_AT_name("AH_ERR2INT")
    6430                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_AH_ERR2INT")
    6431                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6432                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6433              $C$DW$740       .dwtag  DW_TAG_member
    6434                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  122

    6435                      .dwattr $C$DW$740, DW_AT_name("AL_ERR2INT")
    6436                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_AL_ERR2INT")
    6437                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6438                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6439              $C$DW$741       .dwtag  DW_TAG_member
    6440                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$35)
    6441                      .dwattr $C$DW$741, DW_AT_name("ZC_ERR2INT")
    6442                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_ZC_ERR2INT")
    6443                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6444                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6445              $C$DW$742       .dwtag  DW_TAG_member
    6446                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$35)
    6447                      .dwattr $C$DW$742, DW_AT_name("DRDY_2INT")
    6448                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_DRDY_2INT")
    6449                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6450                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6451                      .dwendtag $C$DW$T$39
    6452              
    6453              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ERROR_CONFIG_t_")
    6454                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$39)
    6455                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    6456              
    6457              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6458                      .dwattr $C$DW$T$40, DW_AT_name("_LDC161x_MUX_CONFIG_t_")
    6459                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x06)
    6460              $C$DW$743       .dwtag  DW_TAG_member
    6461                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$35)
    6462                      .dwattr $C$DW$743, DW_AT_name("AUTOSCAN_EN")
    6463                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_AUTOSCAN_EN")
    6464                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6465                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6466              $C$DW$744       .dwtag  DW_TAG_member
    6467                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$35)
    6468                      .dwattr $C$DW$744, DW_AT_name("RR_SEQUENCE_0")
    6469                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_RR_SEQUENCE_0")
    6470                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6471                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6472              $C$DW$745       .dwtag  DW_TAG_member
    6473                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$35)
    6474                      .dwattr $C$DW$745, DW_AT_name("RR_SEQUENCE_1")
    6475                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_RR_SEQUENCE_1")
    6476                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6477                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    6478              $C$DW$746       .dwtag  DW_TAG_member
    6479                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$35)
    6480                      .dwattr $C$DW$746, DW_AT_name("DEGLITCH_0")
    6481                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_DEGLITCH_0")
    6482                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6483                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    6484              $C$DW$747       .dwtag  DW_TAG_member
    6485                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$35)
    6486                      .dwattr $C$DW$747, DW_AT_name("DEGLITCH_1")
    6487                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_DEGLITCH_1")
    6488                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6489                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  123

    6490              $C$DW$748       .dwtag  DW_TAG_member
    6491                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$35)
    6492                      .dwattr $C$DW$748, DW_AT_name("DEGLITCH_2")
    6493                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_DEGLITCH_2")
    6494                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6495                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    6496                      .dwendtag $C$DW$T$40
    6497              
    6498              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_MUX_CONFIG_t_")
    6499                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$40)
    6500                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6501              
    6502              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6503                      .dwattr $C$DW$T$41, DW_AT_name("_LDC161x_OFFSET_t_")
    6504                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    6505              $C$DW$749       .dwtag  DW_TAG_member
    6506                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$21)
    6507                      .dwattr $C$DW$749, DW_AT_name("OFFSET_CH0")
    6508                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_OFFSET_CH0")
    6509                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6510                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    6511              $C$DW$750       .dwtag  DW_TAG_member
    6512                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$21)
    6513                      .dwattr $C$DW$750, DW_AT_name("OFFSET_CH1")
    6514                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_OFFSET_CH1")
    6515                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6516                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    6517              $C$DW$751       .dwtag  DW_TAG_member
    6518                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$21)
    6519                      .dwattr $C$DW$751, DW_AT_name("OFFSET_CH2")
    6520                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_OFFSET_CH2")
    6521                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6522                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    6523              $C$DW$752       .dwtag  DW_TAG_member
    6524                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$21)
    6525                      .dwattr $C$DW$752, DW_AT_name("OFFSET_CH3")
    6526                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_OFFSET_CH3")
    6527                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6528                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    6529                      .dwendtag $C$DW$T$41
    6530              
    6531              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_OFFSET_t_")
    6532                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$41)
    6533                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    6534              
    6535              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    6536                      .dwattr $C$DW$T$49, DW_AT_name("_LDC161x_Obj_")
    6537                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x60)
    6538              $C$DW$753       .dwtag  DW_TAG_member
    6539                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$43)
    6540                      .dwattr $C$DW$753, DW_AT_name("i2cHandle")
    6541                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_i2cHandle")
    6542                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6543                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    6544              $C$DW$754       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  124

    6545                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$45)
    6546                      .dwattr $C$DW$754, DW_AT_name("gpioHandle")
    6547                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_gpioHandle")
    6548                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6549                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    6550              $C$DW$755       .dwtag  DW_TAG_member
    6551                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$47)
    6552                      .dwattr $C$DW$755, DW_AT_name("ldcHandle")
    6553                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_ldcHandle")
    6554                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6555                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    6556              $C$DW$756       .dwtag  DW_TAG_member
    6557                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$48)
    6558                      .dwattr $C$DW$756, DW_AT_name("ldc161x")
    6559                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_ldc161x")
    6560                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6561                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    6562              $C$DW$757       .dwtag  DW_TAG_member
    6563                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$35)
    6564                      .dwattr $C$DW$757, DW_AT_name("RxTimeOut")
    6565                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_RxTimeOut")
    6566                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6567                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    6568              $C$DW$758       .dwtag  DW_TAG_member
    6569                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$35)
    6570                      .dwattr $C$DW$758, DW_AT_name("TxTimeOut")
    6571                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_TxTimeOut")
    6572                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
    6573                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    6574                      .dwendtag $C$DW$T$49
    6575              
    6576              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_Obj")
    6577                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$49)
    6578                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    6579              $C$DW$T$119     .dwtag  DW_TAG_pointer_type
    6580                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$49)
    6581                      .dwattr $C$DW$T$119, DW_AT_address_class(0x16)
    6582              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_Handle")
    6583                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    6584                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    6585              $C$DW$759       .dwtag  DW_TAG_TI_far_type
    6586                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$120)
    6587              $C$DW$T$121     .dwtag  DW_TAG_const_type
    6588                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$759)
    6589              
    6590              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    6591                      .dwattr $C$DW$T$50, DW_AT_name("_LDC161x_RCOUNT_t_")
    6592                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    6593              $C$DW$760       .dwtag  DW_TAG_member
    6594                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$21)
    6595                      .dwattr $C$DW$760, DW_AT_name("RCOUNT_CH0")
    6596                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_RCOUNT_CH0")
    6597                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6598                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    6599              $C$DW$761       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  125

    6600                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$21)
    6601                      .dwattr $C$DW$761, DW_AT_name("RCOUNT_CH1")
    6602                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_RCOUNT_CH1")
    6603                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6604                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    6605              $C$DW$762       .dwtag  DW_TAG_member
    6606                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$21)
    6607                      .dwattr $C$DW$762, DW_AT_name("RCOUNT_CH2")
    6608                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_RCOUNT_CH2")
    6609                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6610                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    6611              $C$DW$763       .dwtag  DW_TAG_member
    6612                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$21)
    6613                      .dwattr $C$DW$763, DW_AT_name("RCOUNT_CH3")
    6614                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_RCOUNT_CH3")
    6615                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6616                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    6617                      .dwendtag $C$DW$T$50
    6618              
    6619              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_RCOUNT_t_")
    6620                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$50)
    6621                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    6622              
    6623              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    6624                      .dwattr $C$DW$T$65, DW_AT_name("_LDC161x_REG_Obj_")
    6625                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x58)
    6626              $C$DW$764       .dwtag  DW_TAG_member
    6627                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$51)
    6628                      .dwattr $C$DW$764, DW_AT_name("LdcChData")
    6629                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_LdcChData")
    6630                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6631                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    6632              $C$DW$765       .dwtag  DW_TAG_member
    6633                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$52)
    6634                      .dwattr $C$DW$765, DW_AT_name("LdcRcount")
    6635                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_LdcRcount")
    6636                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6637                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    6638              $C$DW$766       .dwtag  DW_TAG_member
    6639                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$53)
    6640                      .dwattr $C$DW$766, DW_AT_name("LdcOffset")
    6641                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_LdcOffset")
    6642                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6643                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    6644              $C$DW$767       .dwtag  DW_TAG_member
    6645                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$54)
    6646                      .dwattr $C$DW$767, DW_AT_name("LdcSettleCnt")
    6647                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_LdcSettleCnt")
    6648                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6649                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    6650              $C$DW$768       .dwtag  DW_TAG_member
    6651                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$55)
    6652                      .dwattr $C$DW$768, DW_AT_name("LdcClkDiv")
    6653                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_LdcClkDiv")
    6654                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  126

    6655                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    6656              $C$DW$769       .dwtag  DW_TAG_member
    6657                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$56)
    6658                      .dwattr $C$DW$769, DW_AT_name("LdcStatus")
    6659                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_LdcStatus")
    6660                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6661                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    6662              $C$DW$770       .dwtag  DW_TAG_member
    6663                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$57)
    6664                      .dwattr $C$DW$770, DW_AT_name("LdcError")
    6665                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_LdcError")
    6666                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    6667                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    6668              $C$DW$771       .dwtag  DW_TAG_member
    6669                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$58)
    6670                      .dwattr $C$DW$771, DW_AT_name("LdcConfig")
    6671                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_LdcConfig")
    6672                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    6673                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    6674              $C$DW$772       .dwtag  DW_TAG_member
    6675                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$59)
    6676                      .dwattr $C$DW$772, DW_AT_name("LdcMuxConf")
    6677                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_LdcMuxConf")
    6678                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    6679                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    6680              $C$DW$773       .dwtag  DW_TAG_member
    6681                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$60)
    6682                      .dwattr $C$DW$773, DW_AT_name("LdcDriveCurrent")
    6683                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_LdcDriveCurrent")
    6684                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6685                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    6686              $C$DW$774       .dwtag  DW_TAG_member
    6687                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$62)
    6688                      .dwattr $C$DW$774, DW_AT_name("LdcType")
    6689                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_LdcType")
    6690                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6691                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    6692              $C$DW$775       .dwtag  DW_TAG_member
    6693                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$64)
    6694                      .dwattr $C$DW$775, DW_AT_name("LdcSerial")
    6695                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_LdcSerial")
    6696                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x57]
    6697                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    6698                      .dwendtag $C$DW$T$65
    6699              
    6700              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_REG_Obj")
    6701                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$65)
    6702                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    6703              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    6704                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$48)
    6705                      .dwattr $C$DW$T$125, DW_AT_address_class(0x16)
    6706              
    6707              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    6708                      .dwattr $C$DW$T$66, DW_AT_name("_LDC161x_SETTLECOUNT_t_")
    6709                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x04)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  127

    6710              $C$DW$776       .dwtag  DW_TAG_member
    6711                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$21)
    6712                      .dwattr $C$DW$776, DW_AT_name("SETTLECOUNT_CH0")
    6713                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_SETTLECOUNT_CH0")
    6714                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6715                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    6716              $C$DW$777       .dwtag  DW_TAG_member
    6717                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$21)
    6718                      .dwattr $C$DW$777, DW_AT_name("SETTLECOUNT_CH1")
    6719                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_SETTLECOUNT_CH1")
    6720                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6721                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    6722              $C$DW$778       .dwtag  DW_TAG_member
    6723                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$21)
    6724                      .dwattr $C$DW$778, DW_AT_name("SETTLECOUNT_CH2")
    6725                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_SETTLECOUNT_CH2")
    6726                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6727                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    6728              $C$DW$779       .dwtag  DW_TAG_member
    6729                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$21)
    6730                      .dwattr $C$DW$779, DW_AT_name("SETTLECOUNT_CH3")
    6731                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_SETTLECOUNT_CH3")
    6732                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6733                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    6734                      .dwendtag $C$DW$T$66
    6735              
    6736              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_SETTLECOUNT_t_")
    6737                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$66)
    6738                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    6739              
    6740              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    6741                      .dwattr $C$DW$T$67, DW_AT_name("_LDC161x_STATUS_t_")
    6742                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x0d)
    6743              $C$DW$780       .dwtag  DW_TAG_member
    6744                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$35)
    6745                      .dwattr $C$DW$780, DW_AT_name("UNRDCONV_CH3")
    6746                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_UNRDCONV_CH3")
    6747                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6748                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    6749              $C$DW$781       .dwtag  DW_TAG_member
    6750                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$35)
    6751                      .dwattr $C$DW$781, DW_AT_name("UNRDCONV_CH2")
    6752                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_UNRDCONV_CH2")
    6753                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6754                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    6755              $C$DW$782       .dwtag  DW_TAG_member
    6756                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$35)
    6757                      .dwattr $C$DW$782, DW_AT_name("UNRDCONV_CH1")
    6758                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_UNRDCONV_CH1")
    6759                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6760                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    6761              $C$DW$783       .dwtag  DW_TAG_member
    6762                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$35)
    6763                      .dwattr $C$DW$783, DW_AT_name("UNRDCONV_CH0")
    6764                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_UNRDCONV_CH0")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  128

    6765                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6766                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    6767              $C$DW$784       .dwtag  DW_TAG_member
    6768                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$35)
    6769                      .dwattr $C$DW$784, DW_AT_name("DRDY")
    6770                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_DRDY")
    6771                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6772                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    6773              $C$DW$785       .dwtag  DW_TAG_member
    6774                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$35)
    6775                      .dwattr $C$DW$785, DW_AT_name("ERR_ZC")
    6776                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_ERR_ZC")
    6777                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6778                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    6779              $C$DW$786       .dwtag  DW_TAG_member
    6780                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$35)
    6781                      .dwattr $C$DW$786, DW_AT_name("ERR_ALE")
    6782                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_ERR_ALE")
    6783                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6784                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    6785              $C$DW$787       .dwtag  DW_TAG_member
    6786                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$35)
    6787                      .dwattr $C$DW$787, DW_AT_name("ERR_AHE")
    6788                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_ERR_AHE")
    6789                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6790                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    6791              $C$DW$788       .dwtag  DW_TAG_member
    6792                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$35)
    6793                      .dwattr $C$DW$788, DW_AT_name("ERR_WD")
    6794                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_ERR_WD")
    6795                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6796                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    6797              $C$DW$789       .dwtag  DW_TAG_member
    6798                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$35)
    6799                      .dwattr $C$DW$789, DW_AT_name("ERR_OR")
    6800                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_ERR_OR")
    6801                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6802                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    6803              $C$DW$790       .dwtag  DW_TAG_member
    6804                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$35)
    6805                      .dwattr $C$DW$790, DW_AT_name("ERR_UR")
    6806                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_ERR_UR")
    6807                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6808                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    6809              $C$DW$791       .dwtag  DW_TAG_member
    6810                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$35)
    6811                      .dwattr $C$DW$791, DW_AT_name("ERR_CHAN_0")
    6812                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_ERR_CHAN_0")
    6813                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6814                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    6815              $C$DW$792       .dwtag  DW_TAG_member
    6816                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$35)
    6817                      .dwattr $C$DW$792, DW_AT_name("ERR_CHAN_1")
    6818                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_ERR_CHAN_1")
    6819                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  129

    6820                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    6821                      .dwendtag $C$DW$T$67
    6822              
    6823              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_STATUS_t_")
    6824                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$67)
    6825                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    6826              
    6827              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    6828                      .dwattr $C$DW$T$68, DW_AT_name("_LDC_161x_CHDATA_MSB_t_")
    6829                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x05)
    6830              $C$DW$793       .dwtag  DW_TAG_member
    6831                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$35)
    6832                      .dwattr $C$DW$793, DW_AT_name("ERR_UR")
    6833                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_ERR_UR")
    6834                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6835                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    6836              $C$DW$794       .dwtag  DW_TAG_member
    6837                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$35)
    6838                      .dwattr $C$DW$794, DW_AT_name("ERR_OR")
    6839                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_ERR_OR")
    6840                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6841                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    6842              $C$DW$795       .dwtag  DW_TAG_member
    6843                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$35)
    6844                      .dwattr $C$DW$795, DW_AT_name("ERR_WD")
    6845                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_ERR_WD")
    6846                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6847                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    6848              $C$DW$796       .dwtag  DW_TAG_member
    6849                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$35)
    6850                      .dwattr $C$DW$796, DW_AT_name("ERR_AE")
    6851                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_ERR_AE")
    6852                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6853                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    6854              $C$DW$797       .dwtag  DW_TAG_member
    6855                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$21)
    6856                      .dwattr $C$DW$797, DW_AT_name("DAT_MB")
    6857                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_DAT_MB")
    6858                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6859                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    6860                      .dwendtag $C$DW$T$68
    6861              
    6862              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_161x_CHDATA_MSB_t_")
    6863                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    6864                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    6865              
    6866              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    6867                      .dwattr $C$DW$T$70, DW_AT_name("_LDC_161x_CHDATA_t_")
    6868                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x06)
    6869              $C$DW$798       .dwtag  DW_TAG_member
    6870                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$69)
    6871                      .dwattr $C$DW$798, DW_AT_name("MSB")
    6872                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_MSB")
    6873                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6874                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  130

    6875              $C$DW$799       .dwtag  DW_TAG_member
    6876                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$21)
    6877                      .dwattr $C$DW$799, DW_AT_name("LSB")
    6878                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_LSB")
    6879                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6880                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    6881                      .dwendtag $C$DW$T$70
    6882              
    6883              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_161x_CHDATA_t_")
    6884                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    6885                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    6886              
    6887              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    6888                      .dwattr $C$DW$T$72, DW_AT_name("_LDC_161x_DATA_t_")
    6889                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x18)
    6890              $C$DW$800       .dwtag  DW_TAG_member
    6891                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$71)
    6892                      .dwattr $C$DW$800, DW_AT_name("CH0_DATA")
    6893                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_CH0_DATA")
    6894                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6895                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    6896              $C$DW$801       .dwtag  DW_TAG_member
    6897                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$71)
    6898                      .dwattr $C$DW$801, DW_AT_name("CH1_DATA")
    6899                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_CH1_DATA")
    6900                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6901                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    6902              $C$DW$802       .dwtag  DW_TAG_member
    6903                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$71)
    6904                      .dwattr $C$DW$802, DW_AT_name("CH2_DATA")
    6905                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_CH2_DATA")
    6906                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6907                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    6908              $C$DW$803       .dwtag  DW_TAG_member
    6909                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$71)
    6910                      .dwattr $C$DW$803, DW_AT_name("CH3_DATA")
    6911                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_CH3_DATA")
    6912                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6913                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    6914                      .dwendtag $C$DW$T$72
    6915              
    6916              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_161x_DATA_t_")
    6917                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$72)
    6918                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    6919              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    6920                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    6921              $C$DW$804       .dwtag  DW_TAG_TI_far_type
    6922                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$3)
    6923              $C$DW$T$127     .dwtag  DW_TAG_const_type
    6924                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$804)
    6925              $C$DW$T$4       .dwtag  DW_TAG_base_type
    6926                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    6927                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    6928                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    6929              $C$DW$T$5       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  131

    6930                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    6931                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    6932                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    6933              $C$DW$T$6       .dwtag  DW_TAG_base_type
    6934                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6935                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    6936                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    6937              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    6938                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$6)
    6939                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    6940              $C$DW$T$7       .dwtag  DW_TAG_base_type
    6941                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    6942                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    6943                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    6944              $C$DW$T$8       .dwtag  DW_TAG_base_type
    6945                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    6946                      .dwattr $C$DW$T$8, DW_AT_name("short")
    6947                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    6948              $C$DW$T$9       .dwtag  DW_TAG_base_type
    6949                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    6950                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    6951                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    6952              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    6953                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    6954                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    6955              $C$DW$T$155     .dwtag  DW_TAG_pointer_type
    6956                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$21)
    6957                      .dwattr $C$DW$T$155, DW_AT_address_class(0x16)
    6958              $C$DW$805       .dwtag  DW_TAG_TI_far_type
    6959                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$155)
    6960              $C$DW$T$167     .dwtag  DW_TAG_const_type
    6961                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$805)
    6962              $C$DW$806       .dwtag  DW_TAG_TI_far_type
    6963                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$21)
    6964              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    6965                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$806)
    6966              
    6967              $C$DW$T$28      .dwtag  DW_TAG_array_type
    6968                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    6969                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    6970                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    6971              $C$DW$807       .dwtag  DW_TAG_subrange_type
    6972                      .dwattr $C$DW$807, DW_AT_upper_bound(0x01)
    6973                      .dwendtag $C$DW$T$28
    6974              
    6975              
    6976              $C$DW$T$29      .dwtag  DW_TAG_array_type
    6977                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$27)
    6978                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    6979                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x18)
    6980              $C$DW$808       .dwtag  DW_TAG_subrange_type
    6981                      .dwattr $C$DW$808, DW_AT_upper_bound(0x17)
    6982                      .dwendtag $C$DW$T$29
    6983              
    6984              
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  132

    6985              $C$DW$T$30      .dwtag  DW_TAG_array_type
    6986                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    6987                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    6988                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    6989              $C$DW$809       .dwtag  DW_TAG_subrange_type
    6990                      .dwattr $C$DW$809, DW_AT_upper_bound(0x03)
    6991                      .dwendtag $C$DW$T$30
    6992              
    6993              
    6994              $C$DW$T$31      .dwtag  DW_TAG_array_type
    6995                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    6996                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    6997                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    6998              $C$DW$810       .dwtag  DW_TAG_subrange_type
    6999                      .dwattr $C$DW$810, DW_AT_upper_bound(0x07)
    7000                      .dwendtag $C$DW$T$31
    7001              
    7002              
    7003              $C$DW$T$32      .dwtag  DW_TAG_array_type
    7004                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
    7005                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    7006                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x03)
    7007              $C$DW$811       .dwtag  DW_TAG_subrange_type
    7008                      .dwattr $C$DW$811, DW_AT_upper_bound(0x02)
    7009                      .dwendtag $C$DW$T$32
    7010              
    7011              
    7012              $C$DW$T$33      .dwtag  DW_TAG_array_type
    7013                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$27)
    7014                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    7015                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x05)
    7016              $C$DW$812       .dwtag  DW_TAG_subrange_type
    7017                      .dwattr $C$DW$812, DW_AT_upper_bound(0x04)
    7018                      .dwendtag $C$DW$T$33
    7019              
    7020              $C$DW$813       .dwtag  DW_TAG_TI_far_type
    7021                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$21)
    7022              $C$DW$T$136     .dwtag  DW_TAG_const_type
    7023                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$813)
    7024              $C$DW$T$10      .dwtag  DW_TAG_base_type
    7025                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    7026                      .dwattr $C$DW$T$10, DW_AT_name("int")
    7027                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    7028              $C$DW$T$11      .dwtag  DW_TAG_base_type
    7029                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    7030                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    7031                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    7032              $C$DW$T$12      .dwtag  DW_TAG_base_type
    7033                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    7034                      .dwattr $C$DW$T$12, DW_AT_name("long")
    7035                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    7036              $C$DW$T$13      .dwtag  DW_TAG_base_type
    7037                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    7038                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    7039                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  133

    7040              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    7041                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$13)
    7042                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    7043              $C$DW$814       .dwtag  DW_TAG_TI_far_type
    7044                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$110)
    7045              $C$DW$T$111     .dwtag  DW_TAG_const_type
    7046                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$814)
    7047              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    7048                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    7049                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    7050              $C$DW$T$158     .dwtag  DW_TAG_pointer_type
    7051                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$25)
    7052                      .dwattr $C$DW$T$158, DW_AT_address_class(0x16)
    7053              $C$DW$815       .dwtag  DW_TAG_TI_far_type
    7054                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$158)
    7055              $C$DW$T$182     .dwtag  DW_TAG_const_type
    7056                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$815)
    7057              $C$DW$816       .dwtag  DW_TAG_TI_far_type
    7058                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$25)
    7059              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    7060                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$816)
    7061              $C$DW$T$14      .dwtag  DW_TAG_base_type
    7062                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    7063                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    7064                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    7065              $C$DW$T$15      .dwtag  DW_TAG_base_type
    7066                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7067                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7068                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7069              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7070                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7071                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7072                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7073              $C$DW$T$17      .dwtag  DW_TAG_base_type
    7074                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    7075                      .dwattr $C$DW$T$17, DW_AT_name("double")
    7076                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    7077              $C$DW$T$18      .dwtag  DW_TAG_base_type
    7078                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    7079                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    7080                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    7081              
    7082              $C$DW$T$73      .dwtag  DW_TAG_union_type
    7083                      .dwattr $C$DW$T$73, DW_AT_name("data_u")
    7084                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x02)
    7085              $C$DW$817       .dwtag  DW_TAG_member
    7086                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$22)
    7087                      .dwattr $C$DW$817, DW_AT_name("Data_t")
    7088                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_Data_t")
    7089                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7090                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7091              $C$DW$818       .dwtag  DW_TAG_member
    7092                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$25)
    7093                      .dwattr $C$DW$818, DW_AT_name("Data_u32")
    7094                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_Data_u32")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  134

    7095                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7096                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7097                      .dwendtag $C$DW$T$73
    7098              
    7099                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    7100              
    7101              ;***************************************************************
    7102              ;* DWARF CIE ENTRIES                                           *
    7103              ;***************************************************************
    7104              
    7105              $C$DW$CIE       .dwcie 78
    7106                      .dwcfi  cfa_register, 20
    7107                      .dwcfi  cfa_offset, 0
    7108                      .dwcfi  undefined, 0
    7109                      .dwcfi  undefined, 1
    7110                      .dwcfi  undefined, 2
    7111                      .dwcfi  undefined, 3
    7112                      .dwcfi  undefined, 20
    7113                      .dwcfi  undefined, 21
    7114                      .dwcfi  undefined, 22
    7115                      .dwcfi  undefined, 23
    7116                      .dwcfi  undefined, 24
    7117                      .dwcfi  undefined, 25
    7118                      .dwcfi  undefined, 26
    7119                      .dwcfi  same_value, 28
    7120                      .dwcfi  undefined, 29
    7121                      .dwcfi  undefined, 30
    7122                      .dwcfi  undefined, 31
    7123                      .dwcfi  undefined, 32
    7124                      .dwcfi  undefined, 33
    7125                      .dwcfi  undefined, 34
    7126                      .dwcfi  undefined, 35
    7127                      .dwcfi  undefined, 36
    7128                      .dwcfi  undefined, 37
    7129                      .dwcfi  undefined, 38
    7130                      .dwcfi  undefined, 75
    7131                      .dwcfi  undefined, 76
    7132                      .dwcfi  undefined, 77
    7133                      .dwcfi  undefined, 4
    7134                      .dwcfi  same_value, 6
    7135                      .dwcfi  same_value, 8
    7136                      .dwcfi  same_value, 10
    7137                      .dwcfi  undefined, 12
    7138                      .dwcfi  undefined, 14
    7139                      .dwcfi  undefined, 16
    7140                      .dwcfi  undefined, 17
    7141                      .dwcfi  undefined, 18
    7142                      .dwcfi  undefined, 19
    7143                      .dwcfi  undefined, 5
    7144                      .dwcfi  same_value, 7
    7145                      .dwcfi  same_value, 9
    7146                      .dwcfi  same_value, 11
    7147                      .dwcfi  undefined, 13
    7148                      .dwcfi  undefined, 15
    7149                      .dwcfi  undefined, 78
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 09:53:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1375610                              PAGE  135

    7150                      .dwendentry
    7151              
    7152              ;***************************************************************
    7153              ;* DWARF REGISTER MAP                                          *
    7154              ;***************************************************************
    7155              
