TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Jul 10 10:43:56 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/solutions/instaspin_foc/src/proj_lab01.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    2042              $C$DW$414       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    2043              $C$DW$415       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    2044              $C$DW$416       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    2045              $C$DW$417       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    2046              $C$DW$418       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    2047              $C$DW$419       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    2048              $C$DW$420       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    2049              $C$DW$421       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   42

    2050              $C$DW$422       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    2051              $C$DW$423       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    2052                      .dwendtag $C$DW$T$190
    2053              
    2054              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    2055                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    2056                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    2057              
    2058              $C$DW$T$193     .dwtag  DW_TAG_enumeration_type
    2059                      .dwattr $C$DW$T$193, DW_AT_byte_size(0x01)
    2060              $C$DW$424       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    2061              $C$DW$425       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    2062              $C$DW$426       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    2063              $C$DW$427       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    2064              $C$DW$428       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    2065              $C$DW$429       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    2066              $C$DW$430       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    2067              $C$DW$431       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    2068              $C$DW$432       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    2069              $C$DW$433       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    2070              $C$DW$434       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    2071              $C$DW$435       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    2072                      .dwendtag $C$DW$T$193
    2073              
    2074              $C$DW$T$194     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    2075                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$193)
    2076                      .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    2077              
    2078              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2079                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    2080                      .dwattr $C$DW$T$19, DW_AT_declaration
    2081                      .dwendtag $C$DW$T$19
    2082              
    2083              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    2084                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$19)
    2085                      .dwattr $C$DW$T$86, DW_AT_address_class(0x16)
    2086              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    2087                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    2088                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2089              
    2090              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2091                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    2092                      .dwattr $C$DW$T$20, DW_AT_declaration
    2093                      .dwendtag $C$DW$T$20
    2094              
    2095              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    2096                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$20)
    2097                      .dwattr $C$DW$T$99, DW_AT_address_class(0x16)
    2098              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    2099                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    2100                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    2101              
    2102              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2103                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    2104                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   43

    2105              $C$DW$436       .dwtag  DW_TAG_member
    2106                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$25)
    2107                      .dwattr $C$DW$436, DW_AT_name("ADCRESULT")
    2108                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_ADCRESULT")
    2109                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2110                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    2111              $C$DW$437       .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$26)
    2113                      .dwattr $C$DW$437, DW_AT_name("resvd_1")
    2114                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_resvd_1")
    2115                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2116                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    2117              $C$DW$438       .dwtag  DW_TAG_member
    2118                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$24)
    2119                      .dwattr $C$DW$438, DW_AT_name("ADCCTL1")
    2120                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_ADCCTL1")
    2121                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    2122                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    2123              $C$DW$439       .dwtag  DW_TAG_member
    2124                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$24)
    2125                      .dwattr $C$DW$439, DW_AT_name("ADCCTL2")
    2126                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_ADCCTL2")
    2127                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    2128                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    2129              $C$DW$440       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$27)
    2131                      .dwattr $C$DW$440, DW_AT_name("rsvd_2")
    2132                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_rsvd_2")
    2133                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    2134                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    2135              $C$DW$441       .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$24)
    2137                      .dwattr $C$DW$441, DW_AT_name("ADCINTFLG")
    2138                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_ADCINTFLG")
    2139                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    2140                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    2141              $C$DW$442       .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    2143                      .dwattr $C$DW$442, DW_AT_name("ADCINTFLGCLR")
    2144                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    2145                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    2146                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    2147              $C$DW$443       .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$24)
    2149                      .dwattr $C$DW$443, DW_AT_name("ADCINTOVF")
    2150                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_ADCINTOVF")
    2151                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    2152                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    2153              $C$DW$444       .dwtag  DW_TAG_member
    2154                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
    2155                      .dwattr $C$DW$444, DW_AT_name("ADCINTOVFCLR")
    2156                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    2157                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    2158                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    2159              $C$DW$445       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   44

    2160                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$28)
    2161                      .dwattr $C$DW$445, DW_AT_name("INTSELxNy")
    2162                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_INTSELxNy")
    2163                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    2164                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    2165              $C$DW$446       .dwtag  DW_TAG_member
    2166                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$29)
    2167                      .dwattr $C$DW$446, DW_AT_name("rsvd_3")
    2168                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_rsvd_3")
    2169                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    2170                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    2171              $C$DW$447       .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$24)
    2173                      .dwattr $C$DW$447, DW_AT_name("SOCPRICTRL")
    2174                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_SOCPRICTRL")
    2175                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    2176                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    2177              $C$DW$448       .dwtag  DW_TAG_member
    2178                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$24)
    2179                      .dwattr $C$DW$448, DW_AT_name("rsvd_4")
    2180                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_rsvd_4")
    2181                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    2182                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    2183              $C$DW$449       .dwtag  DW_TAG_member
    2184                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$24)
    2185                      .dwattr $C$DW$449, DW_AT_name("ADCSAMPLEMODE")
    2186                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    2187                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    2188                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    2189              $C$DW$450       .dwtag  DW_TAG_member
    2190                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$24)
    2191                      .dwattr $C$DW$450, DW_AT_name("rsvd_5")
    2192                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_rsvd_5")
    2193                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    2194                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    2195              $C$DW$451       .dwtag  DW_TAG_member
    2196                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$24)
    2197                      .dwattr $C$DW$451, DW_AT_name("ADCINTSOCSEL1")
    2198                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    2199                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    2200                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    2201              $C$DW$452       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$24)
    2203                      .dwattr $C$DW$452, DW_AT_name("ADCINTSOCSEL2")
    2204                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    2205                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    2206                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    2207              $C$DW$453       .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$27)
    2209                      .dwattr $C$DW$453, DW_AT_name("rsvd_6")
    2210                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_rsvd_6")
    2211                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    2212                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    2213              $C$DW$454       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   45

    2215                      .dwattr $C$DW$454, DW_AT_name("ADCSOCFLG1")
    2216                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    2217                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    2218                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    2219              $C$DW$455       .dwtag  DW_TAG_member
    2220                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$24)
    2221                      .dwattr $C$DW$455, DW_AT_name("rsvd_7")
    2222                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_rsvd_7")
    2223                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    2224                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    2225              $C$DW$456       .dwtag  DW_TAG_member
    2226                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$24)
    2227                      .dwattr $C$DW$456, DW_AT_name("ADCSOCFRC1")
    2228                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    2229                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    2230                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    2231              $C$DW$457       .dwtag  DW_TAG_member
    2232                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$24)
    2233                      .dwattr $C$DW$457, DW_AT_name("rsvd_8")
    2234                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_rsvd_8")
    2235                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    2236                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    2237              $C$DW$458       .dwtag  DW_TAG_member
    2238                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$24)
    2239                      .dwattr $C$DW$458, DW_AT_name("ADCSOCOVF1")
    2240                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    2241                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    2242                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    2243              $C$DW$459       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$24)
    2245                      .dwattr $C$DW$459, DW_AT_name("rsvd_9")
    2246                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_rsvd_9")
    2247                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    2248                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    2249              $C$DW$460       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$24)
    2251                      .dwattr $C$DW$460, DW_AT_name("ADCSOCOVFCLR1")
    2252                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    2253                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    2254                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    2255              $C$DW$461       .dwtag  DW_TAG_member
    2256                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$24)
    2257                      .dwattr $C$DW$461, DW_AT_name("rsvd_10")
    2258                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_rsvd_10")
    2259                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    2260                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    2261              $C$DW$462       .dwtag  DW_TAG_member
    2262                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$25)
    2263                      .dwattr $C$DW$462, DW_AT_name("ADCSOCxCTL")
    2264                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    2265                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    2266                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    2267              $C$DW$463       .dwtag  DW_TAG_member
    2268                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$25)
    2269                      .dwattr $C$DW$463, DW_AT_name("rsvd_11")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   46

    2270                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_rsvd_11")
    2271                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    2272                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    2273              $C$DW$464       .dwtag  DW_TAG_member
    2274                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$24)
    2275                      .dwattr $C$DW$464, DW_AT_name("ADCREFTRIM")
    2276                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_ADCREFTRIM")
    2277                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    2278                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    2279              $C$DW$465       .dwtag  DW_TAG_member
    2280                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$24)
    2281                      .dwattr $C$DW$465, DW_AT_name("ADCOFFTRIM")
    2282                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    2283                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    2284                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    2285              $C$DW$466       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$30)
    2287                      .dwattr $C$DW$466, DW_AT_name("resvd_12")
    2288                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_resvd_12")
    2289                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    2290                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    2291              $C$DW$467       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$24)
    2293                      .dwattr $C$DW$467, DW_AT_name("ADCREV")
    2294                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_ADCREV")
    2295                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    2296                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    2297                      .dwendtag $C$DW$T$31
    2298              
    2299              $C$DW$T$196     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    2300                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$31)
    2301                      .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    2302              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    2303                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$31)
    2304                      .dwattr $C$DW$T$59, DW_AT_address_class(0x16)
    2305              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    2306                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2307                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2308              
    2309              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2310                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_DIV_t_")
    2311                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2312              $C$DW$468       .dwtag  DW_TAG_member
    2313                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$23)
    2314                      .dwattr $C$DW$468, DW_AT_name("FREF_DIVIDER")
    2315                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    2316                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2317                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    2318              $C$DW$469       .dwtag  DW_TAG_member
    2319                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$23)
    2320                      .dwattr $C$DW$469, DW_AT_name("FIN_DIVIDER")
    2321                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    2322                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2323                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    2324                      .dwendtag $C$DW$T$32
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   47

    2325              
    2326              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    2327                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$32)
    2328                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2329              
    2330              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2331                      .dwattr $C$DW$T$34, DW_AT_name("_CLK_Obj_")
    2332                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x11)
    2333              $C$DW$470       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$24)
    2335                      .dwattr $C$DW$470, DW_AT_name("XCLK")
    2336                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_XCLK")
    2337                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2338                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    2339              $C$DW$471       .dwtag  DW_TAG_member
    2340                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$24)
    2341                      .dwattr $C$DW$471, DW_AT_name("rsvd_1")
    2342                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_rsvd_1")
    2343                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2344                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    2345              $C$DW$472       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$24)
    2347                      .dwattr $C$DW$472, DW_AT_name("CLKCTL")
    2348                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_CLKCTL")
    2349                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2350                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    2351              $C$DW$473       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$33)
    2353                      .dwattr $C$DW$473, DW_AT_name("rsvd_2")
    2354                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_rsvd_2")
    2355                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2356                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    2357              $C$DW$474       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$24)
    2359                      .dwattr $C$DW$474, DW_AT_name("LOSPCP")
    2360                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_LOSPCP")
    2361                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2362                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    2363              $C$DW$475       .dwtag  DW_TAG_member
    2364                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$24)
    2365                      .dwattr $C$DW$475, DW_AT_name("PCLKCR0")
    2366                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_PCLKCR0")
    2367                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2368                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    2369              $C$DW$476       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$24)
    2371                      .dwattr $C$DW$476, DW_AT_name("PCLKCR1")
    2372                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_PCLKCR1")
    2373                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2374                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    2375              $C$DW$477       .dwtag  DW_TAG_member
    2376                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$27)
    2377                      .dwattr $C$DW$477, DW_AT_name("rsvd_3")
    2378                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_rsvd_3")
    2379                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   48

    2380                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    2381              $C$DW$478       .dwtag  DW_TAG_member
    2382                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$24)
    2383                      .dwattr $C$DW$478, DW_AT_name("PCLKCR3")
    2384                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_PCLKCR3")
    2385                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2386                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    2387                      .dwendtag $C$DW$T$34
    2388              
    2389              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    2390                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$34)
    2391                      .dwattr $C$DW$T$61, DW_AT_address_class(0x16)
    2392              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    2393                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2394                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2395              
    2396              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2397                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    2398                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2399              $C$DW$479       .dwtag  DW_TAG_member
    2400                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$35)
    2401                      .dwattr $C$DW$479, DW_AT_name("tmp")
    2402                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_tmp")
    2403                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2404                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    2405                      .dwendtag $C$DW$T$36
    2406              
    2407              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    2408                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$36)
    2409                      .dwattr $C$DW$T$63, DW_AT_address_class(0x16)
    2410              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    2411                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    2412                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    2413              
    2414              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2415                      .dwattr $C$DW$T$39, DW_AT_name("_CTRL_Version_")
    2416                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2417              $C$DW$480       .dwtag  DW_TAG_member
    2418                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$23)
    2419                      .dwattr $C$DW$480, DW_AT_name("rsvd")
    2420                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_rsvd")
    2421                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2422                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    2423              $C$DW$481       .dwtag  DW_TAG_member
    2424                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$38)
    2425                      .dwattr $C$DW$481, DW_AT_name("targetProc")
    2426                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_targetProc")
    2427                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2428                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    2429              $C$DW$482       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$23)
    2431                      .dwattr $C$DW$482, DW_AT_name("major")
    2432                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_major")
    2433                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2434                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   49

    2435              $C$DW$483       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$23)
    2437                      .dwattr $C$DW$483, DW_AT_name("minor")
    2438                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_minor")
    2439                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2440                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    2441                      .dwendtag $C$DW$T$39
    2442              
    2443              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    2444                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$39)
    2445                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    2446              
    2447              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2448                      .dwattr $C$DW$T$47, DW_AT_name("_DECODER_Obj_")
    2449                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x06)
    2450              $C$DW$484       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$41)
    2452                      .dwattr $C$DW$484, DW_AT_name("spiHandle")
    2453                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_spiHandle")
    2454                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2455                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    2456              $C$DW$485       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$43)
    2458                      .dwattr $C$DW$485, DW_AT_name("gpioHandle")
    2459                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_gpioHandle")
    2460                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2461                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    2462              $C$DW$486       .dwtag  DW_TAG_member
    2463                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$45)
    2464                      .dwattr $C$DW$486, DW_AT_name("gpioNumber")
    2465                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_gpioNumber")
    2466                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2467                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    2468              $C$DW$487       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$46)
    2470                      .dwattr $C$DW$487, DW_AT_name("RxTimeOut")
    2471                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_RxTimeOut")
    2472                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2473                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    2474                      .dwendtag $C$DW$T$47
    2475              
    2476              $C$DW$T$197     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
    2477                      .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$47)
    2478                      .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    2479              $C$DW$T$198     .dwtag  DW_TAG_pointer_type
    2480                      .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$47)
    2481                      .dwattr $C$DW$T$198, DW_AT_address_class(0x16)
    2482              $C$DW$T$199     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
    2483                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$198)
    2484                      .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    2485              
    2486              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2487                      .dwattr $C$DW$T$48, DW_AT_name("_DRIVE_CURRENT_t_")
    2488                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2489              $C$DW$488       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   50

    2490                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$23)
    2491                      .dwattr $C$DW$488, DW_AT_name("IDRIVE")
    2492                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_IDRIVE")
    2493                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    2495              $C$DW$489       .dwtag  DW_TAG_member
    2496                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$23)
    2497                      .dwattr $C$DW$489, DW_AT_name("INIT_IDRIVE")
    2498                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    2499                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2500                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    2501                      .dwendtag $C$DW$T$48
    2502              
    2503              $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    2504                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$48)
    2505                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    2506              
    2507              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2508                      .dwattr $C$DW$T$50, DW_AT_name("_FILTER_FO_")
    2509                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0a)
    2510              $C$DW$490       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$49)
    2512                      .dwattr $C$DW$490, DW_AT_name("a1")
    2513                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_a1")
    2514                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2515                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    2516              $C$DW$491       .dwtag  DW_TAG_member
    2517                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$49)
    2518                      .dwattr $C$DW$491, DW_AT_name("b0")
    2519                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_b0")
    2520                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2521                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    2522              $C$DW$492       .dwtag  DW_TAG_member
    2523                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$49)
    2524                      .dwattr $C$DW$492, DW_AT_name("b1")
    2525                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_b1")
    2526                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2527                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    2528              $C$DW$493       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$49)
    2530                      .dwattr $C$DW$493, DW_AT_name("x1")
    2531                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_x1")
    2532                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2533                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    2534              $C$DW$494       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$49)
    2536                      .dwattr $C$DW$494, DW_AT_name("y1")
    2537                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_y1")
    2538                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2539                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    2540                      .dwendtag $C$DW$T$50
    2541              
    2542              $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    2543                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$50)
    2544                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   51

    2545              
    2546              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2547                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    2548                      .dwattr $C$DW$T$21, DW_AT_declaration
    2549                      .dwendtag $C$DW$T$21
    2550              
    2551              $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    2552                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$21)
    2553                      .dwattr $C$DW$T$138, DW_AT_address_class(0x16)
    2554              $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    2555                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    2556                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    2557              
    2558              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    2559                      .dwattr $C$DW$T$51, DW_AT_name("_FLASH_Obj_")
    2560                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x08)
    2561              $C$DW$495       .dwtag  DW_TAG_member
    2562                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$24)
    2563                      .dwattr $C$DW$495, DW_AT_name("FOPT")
    2564                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_FOPT")
    2565                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2566                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    2567              $C$DW$496       .dwtag  DW_TAG_member
    2568                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$24)
    2569                      .dwattr $C$DW$496, DW_AT_name("rsvd_1")
    2570                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_rsvd_1")
    2571                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2572                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    2573              $C$DW$497       .dwtag  DW_TAG_member
    2574                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$24)
    2575                      .dwattr $C$DW$497, DW_AT_name("FPWR")
    2576                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_FPWR")
    2577                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2578                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    2579              $C$DW$498       .dwtag  DW_TAG_member
    2580                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$24)
    2581                      .dwattr $C$DW$498, DW_AT_name("FSTATUS")
    2582                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_FSTATUS")
    2583                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2584                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    2585              $C$DW$499       .dwtag  DW_TAG_member
    2586                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$24)
    2587                      .dwattr $C$DW$499, DW_AT_name("FSTDBYWAIT")
    2588                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    2589                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2590                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    2591              $C$DW$500       .dwtag  DW_TAG_member
    2592                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$24)
    2593                      .dwattr $C$DW$500, DW_AT_name("FACTIVEWAIT")
    2594                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    2595                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2596                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    2597              $C$DW$501       .dwtag  DW_TAG_member
    2598                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$24)
    2599                      .dwattr $C$DW$501, DW_AT_name("FBANKWAIT")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   52

    2600                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_FBANKWAIT")
    2601                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2602                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    2603              $C$DW$502       .dwtag  DW_TAG_member
    2604                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$24)
    2605                      .dwattr $C$DW$502, DW_AT_name("FOTPWAIT")
    2606                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_FOTPWAIT")
    2607                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2608                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    2609                      .dwendtag $C$DW$T$51
    2610              
    2611              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    2612                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$51)
    2613                      .dwattr $C$DW$T$65, DW_AT_address_class(0x16)
    2614              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    2615                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    2616                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    2617              
    2618              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2619                      .dwattr $C$DW$T$56, DW_AT_name("_GPIO_Obj_")
    2620                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x6a)
    2621              $C$DW$503       .dwtag  DW_TAG_member
    2622                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$53)
    2623                      .dwattr $C$DW$503, DW_AT_name("GPACTRL")
    2624                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_GPACTRL")
    2625                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2626                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    2627              $C$DW$504       .dwtag  DW_TAG_member
    2628                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$53)
    2629                      .dwattr $C$DW$504, DW_AT_name("GPAQSEL1")
    2630                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_GPAQSEL1")
    2631                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2632                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    2633              $C$DW$505       .dwtag  DW_TAG_member
    2634                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$53)
    2635                      .dwattr $C$DW$505, DW_AT_name("GPAQSEL2")
    2636                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_GPAQSEL2")
    2637                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2638                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    2639              $C$DW$506       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$53)
    2641                      .dwattr $C$DW$506, DW_AT_name("GPAMUX1")
    2642                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_GPAMUX1")
    2643                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2644                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    2645              $C$DW$507       .dwtag  DW_TAG_member
    2646                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$53)
    2647                      .dwattr $C$DW$507, DW_AT_name("GPAMUX2")
    2648                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_GPAMUX2")
    2649                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2650                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    2651              $C$DW$508       .dwtag  DW_TAG_member
    2652                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$53)
    2653                      .dwattr $C$DW$508, DW_AT_name("GPADIR")
    2654                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_GPADIR")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   53

    2655                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2656                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    2657              $C$DW$509       .dwtag  DW_TAG_member
    2658                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$53)
    2659                      .dwattr $C$DW$509, DW_AT_name("GPAPUD")
    2660                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_GPAPUD")
    2661                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2662                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    2663              $C$DW$510       .dwtag  DW_TAG_member
    2664                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$27)
    2665                      .dwattr $C$DW$510, DW_AT_name("rsvd_1")
    2666                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_rsvd_1")
    2667                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2668                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    2669              $C$DW$511       .dwtag  DW_TAG_member
    2670                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$53)
    2671                      .dwattr $C$DW$511, DW_AT_name("GPBCTRL")
    2672                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_GPBCTRL")
    2673                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2674                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    2675              $C$DW$512       .dwtag  DW_TAG_member
    2676                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$53)
    2677                      .dwattr $C$DW$512, DW_AT_name("GPBQSEL1")
    2678                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_GPBQSEL1")
    2679                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2680                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    2681              $C$DW$513       .dwtag  DW_TAG_member
    2682                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$27)
    2683                      .dwattr $C$DW$513, DW_AT_name("rsvd_2")
    2684                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_rsvd_2")
    2685                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2686                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    2687              $C$DW$514       .dwtag  DW_TAG_member
    2688                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$53)
    2689                      .dwattr $C$DW$514, DW_AT_name("GPBMUX1")
    2690                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_GPBMUX1")
    2691                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2692                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    2693              $C$DW$515       .dwtag  DW_TAG_member
    2694                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$27)
    2695                      .dwattr $C$DW$515, DW_AT_name("rsvd_3")
    2696                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_rsvd_3")
    2697                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2698                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    2699              $C$DW$516       .dwtag  DW_TAG_member
    2700                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$53)
    2701                      .dwattr $C$DW$516, DW_AT_name("GPBDIR")
    2702                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_GPBDIR")
    2703                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2704                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    2705              $C$DW$517       .dwtag  DW_TAG_member
    2706                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$53)
    2707                      .dwattr $C$DW$517, DW_AT_name("GPBPUD")
    2708                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_GPBPUD")
    2709                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   54

    2710                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    2711              $C$DW$518       .dwtag  DW_TAG_member
    2712                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$54)
    2713                      .dwattr $C$DW$518, DW_AT_name("rsvd_4")
    2714                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_rsvd_4")
    2715                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2716                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    2717              $C$DW$519       .dwtag  DW_TAG_member
    2718                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$53)
    2719                      .dwattr $C$DW$519, DW_AT_name("AIOMUX1")
    2720                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_AIOMUX1")
    2721                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2722                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    2723              $C$DW$520       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$27)
    2725                      .dwattr $C$DW$520, DW_AT_name("rsvd_5")
    2726                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_rsvd_5")
    2727                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2728                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    2729              $C$DW$521       .dwtag  DW_TAG_member
    2730                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$53)
    2731                      .dwattr $C$DW$521, DW_AT_name("AIODIR")
    2732                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_AIODIR")
    2733                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2734                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    2735              $C$DW$522       .dwtag  DW_TAG_member
    2736                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$55)
    2737                      .dwattr $C$DW$522, DW_AT_name("rsvd_6")
    2738                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_rsvd_6")
    2739                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2740                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    2741              $C$DW$523       .dwtag  DW_TAG_member
    2742                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$53)
    2743                      .dwattr $C$DW$523, DW_AT_name("GPADAT")
    2744                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_GPADAT")
    2745                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2746                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    2747              $C$DW$524       .dwtag  DW_TAG_member
    2748                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$53)
    2749                      .dwattr $C$DW$524, DW_AT_name("GPASET")
    2750                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_GPASET")
    2751                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2752                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    2753              $C$DW$525       .dwtag  DW_TAG_member
    2754                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$53)
    2755                      .dwattr $C$DW$525, DW_AT_name("GPACLEAR")
    2756                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_GPACLEAR")
    2757                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2758                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    2759              $C$DW$526       .dwtag  DW_TAG_member
    2760                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$53)
    2761                      .dwattr $C$DW$526, DW_AT_name("GPATOGGLE")
    2762                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_GPATOGGLE")
    2763                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2764                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   55

    2765              $C$DW$527       .dwtag  DW_TAG_member
    2766                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$53)
    2767                      .dwattr $C$DW$527, DW_AT_name("GPBDAT")
    2768                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_GPBDAT")
    2769                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2770                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    2771              $C$DW$528       .dwtag  DW_TAG_member
    2772                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$53)
    2773                      .dwattr $C$DW$528, DW_AT_name("GPBSET")
    2774                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_GPBSET")
    2775                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2776                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    2777              $C$DW$529       .dwtag  DW_TAG_member
    2778                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$53)
    2779                      .dwattr $C$DW$529, DW_AT_name("GPBCLEAR")
    2780                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_GPBCLEAR")
    2781                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2782                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    2783              $C$DW$530       .dwtag  DW_TAG_member
    2784                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$53)
    2785                      .dwattr $C$DW$530, DW_AT_name("GPBTOGGLE")
    2786                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_GPBTOGGLE")
    2787                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2788                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    2789              $C$DW$531       .dwtag  DW_TAG_member
    2790                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$33)
    2791                      .dwattr $C$DW$531, DW_AT_name("rsvd_7")
    2792                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_rsvd_7")
    2793                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2794                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    2795              $C$DW$532       .dwtag  DW_TAG_member
    2796                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$53)
    2797                      .dwattr $C$DW$532, DW_AT_name("AIODAT")
    2798                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_AIODAT")
    2799                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2800                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    2801              $C$DW$533       .dwtag  DW_TAG_member
    2802                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$53)
    2803                      .dwattr $C$DW$533, DW_AT_name("AIOSET")
    2804                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_AIOSET")
    2805                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2806                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    2807              $C$DW$534       .dwtag  DW_TAG_member
    2808                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$53)
    2809                      .dwattr $C$DW$534, DW_AT_name("AIOCLEAR")
    2810                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_AIOCLEAR")
    2811                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2812                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    2813              $C$DW$535       .dwtag  DW_TAG_member
    2814                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$53)
    2815                      .dwattr $C$DW$535, DW_AT_name("AIOTOGGLE")
    2816                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_AIOTOGGLE")
    2817                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2818                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    2819              $C$DW$536       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   56

    2820                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$29)
    2821                      .dwattr $C$DW$536, DW_AT_name("GPIOXINTnSEL")
    2822                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    2823                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2824                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    2825              $C$DW$537       .dwtag  DW_TAG_member
    2826                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$28)
    2827                      .dwattr $C$DW$537, DW_AT_name("rsvd_8")
    2828                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_rsvd_8")
    2829                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2830                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    2831              $C$DW$538       .dwtag  DW_TAG_member
    2832                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$53)
    2833                      .dwattr $C$DW$538, DW_AT_name("GPIOLPMSEL")
    2834                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    2835                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2836                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    2837                      .dwendtag $C$DW$T$56
    2838              
    2839              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    2840                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$56)
    2841                      .dwattr $C$DW$T$42, DW_AT_address_class(0x16)
    2842              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    2843                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2844                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2845              
    2846              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    2847                      .dwattr $C$DW$T$58, DW_AT_name("_HAL_AdcData_t_")
    2848                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x16)
    2849              $C$DW$539       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$57)
    2851                      .dwattr $C$DW$539, DW_AT_name("I")
    2852                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_I")
    2853                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2854                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    2855              $C$DW$540       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$57)
    2857                      .dwattr $C$DW$540, DW_AT_name("V")
    2858                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_V")
    2859                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2860                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    2861              $C$DW$541       .dwtag  DW_TAG_member
    2862                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$49)
    2863                      .dwattr $C$DW$541, DW_AT_name("dcBus")
    2864                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_dcBus")
    2865                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2866                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    2867              $C$DW$542       .dwtag  DW_TAG_member
    2868                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$49)
    2869                      .dwattr $C$DW$542, DW_AT_name("analogSensor1")
    2870                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_analogSensor1")
    2871                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2872                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    2873              $C$DW$543       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$49)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   57

    2875                      .dwattr $C$DW$543, DW_AT_name("analogSensor2")
    2876                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_analogSensor2")
    2877                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2878                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    2879              $C$DW$544       .dwtag  DW_TAG_member
    2880                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$49)
    2881                      .dwattr $C$DW$544, DW_AT_name("igbtNTC")
    2882                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_igbtNTC")
    2883                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2884                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    2885              $C$DW$545       .dwtag  DW_TAG_member
    2886                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$49)
    2887                      .dwattr $C$DW$545, DW_AT_name("boardAddr")
    2888                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_boardAddr")
    2889                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2890                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    2891                      .dwendtag $C$DW$T$58
    2892              
    2893              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    2894                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$58)
    2895                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2896              
    2897              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    2898                      .dwattr $C$DW$T$91, DW_AT_name("_HAL_Obj_")
    2899                      .dwattr $C$DW$T$91, DW_AT_byte_size(0xb2)
    2900              $C$DW$546       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$60)
    2902                      .dwattr $C$DW$546, DW_AT_name("adcHandle")
    2903                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_adcHandle")
    2904                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2905                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    2906              $C$DW$547       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$62)
    2908                      .dwattr $C$DW$547, DW_AT_name("clkHandle")
    2909                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_clkHandle")
    2910                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2911                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    2912              $C$DW$548       .dwtag  DW_TAG_member
    2913                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$64)
    2914                      .dwattr $C$DW$548, DW_AT_name("cpuHandle")
    2915                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_cpuHandle")
    2916                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2917                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    2918              $C$DW$549       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$66)
    2920                      .dwattr $C$DW$549, DW_AT_name("flashHandle")
    2921                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_flashHandle")
    2922                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2923                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    2924              $C$DW$550       .dwtag  DW_TAG_member
    2925                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$43)
    2926                      .dwattr $C$DW$550, DW_AT_name("gpioHandle")
    2927                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_gpioHandle")
    2928                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2929                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   58

    2930              $C$DW$551       .dwtag  DW_TAG_member
    2931                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$69)
    2932                      .dwattr $C$DW$551, DW_AT_name("offsetHandle_I")
    2933                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_offsetHandle_I")
    2934                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2935                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    2936              $C$DW$552       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$71)
    2938                      .dwattr $C$DW$552, DW_AT_name("offset_I")
    2939                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_offset_I")
    2940                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2941                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    2942              $C$DW$553       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$69)
    2944                      .dwattr $C$DW$553, DW_AT_name("offsetHandle_V")
    2945                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_offsetHandle_V")
    2946                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2947                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    2948              $C$DW$554       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$71)
    2950                      .dwattr $C$DW$554, DW_AT_name("offset_V")
    2951                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_offset_V")
    2952                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2953                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    2954              $C$DW$555       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$73)
    2956                      .dwattr $C$DW$555, DW_AT_name("oscHandle")
    2957                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_oscHandle")
    2958                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2959                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    2960              $C$DW$556       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$75)
    2962                      .dwattr $C$DW$556, DW_AT_name("pieHandle")
    2963                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_pieHandle")
    2964                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2965                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    2966              $C$DW$557       .dwtag  DW_TAG_member
    2967                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$77)
    2968                      .dwattr $C$DW$557, DW_AT_name("pllHandle")
    2969                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_pllHandle")
    2970                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2971                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    2972              $C$DW$558       .dwtag  DW_TAG_member
    2973                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$80)
    2974                      .dwattr $C$DW$558, DW_AT_name("pwmHandle")
    2975                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_pwmHandle")
    2976                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2977                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    2978              $C$DW$559       .dwtag  DW_TAG_member
    2979                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$80)
    2980                      .dwattr $C$DW$559, DW_AT_name("pwmDacHandle")
    2981                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_pwmDacHandle")
    2982                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2983                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    2984              $C$DW$560       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   59

    2985                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$82)
    2986                      .dwattr $C$DW$560, DW_AT_name("pwrHandle")
    2987                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_pwrHandle")
    2988                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2989                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    2990              $C$DW$561       .dwtag  DW_TAG_member
    2991                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$85)
    2992                      .dwattr $C$DW$561, DW_AT_name("timerHandle")
    2993                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_timerHandle")
    2994                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2995                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    2996              $C$DW$562       .dwtag  DW_TAG_member
    2997                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$87)
    2998                      .dwattr $C$DW$562, DW_AT_name("i2cHandle")
    2999                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_i2cHandle")
    3000                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    3001                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3002              $C$DW$563       .dwtag  DW_TAG_member
    3003                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$41)
    3004                      .dwattr $C$DW$563, DW_AT_name("spiAHandle")
    3005                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_spiAHandle")
    3006                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3007                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3008              $C$DW$564       .dwtag  DW_TAG_member
    3009                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$89)
    3010                      .dwattr $C$DW$564, DW_AT_name("wdogHandle")
    3011                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_wdogHandle")
    3012                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    3013                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3014              $C$DW$565       .dwtag  DW_TAG_member
    3015                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$90)
    3016                      .dwattr $C$DW$565, DW_AT_name("adcBias")
    3017                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_adcBias")
    3018                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    3019                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3020              $C$DW$566       .dwtag  DW_TAG_member
    3021                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$49)
    3022                      .dwattr $C$DW$566, DW_AT_name("current_sf")
    3023                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_current_sf")
    3024                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    3025                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3026              $C$DW$567       .dwtag  DW_TAG_member
    3027                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$49)
    3028                      .dwattr $C$DW$567, DW_AT_name("voltage_sf")
    3029                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_voltage_sf")
    3030                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3031                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3032              $C$DW$568       .dwtag  DW_TAG_member
    3033                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$35)
    3034                      .dwattr $C$DW$568, DW_AT_name("numCurrentSensors")
    3035                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_numCurrentSensors")
    3036                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    3037                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3038              $C$DW$569       .dwtag  DW_TAG_member
    3039                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   60

    3040                      .dwattr $C$DW$569, DW_AT_name("numVoltageSensors")
    3041                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_numVoltageSensors")
    3042                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
    3043                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3044                      .dwendtag $C$DW$T$91
    3045              
    3046              $C$DW$T$207     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    3047                      .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$91)
    3048                      .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
    3049              $C$DW$T$208     .dwtag  DW_TAG_pointer_type
    3050                      .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$207)
    3051                      .dwattr $C$DW$T$208, DW_AT_address_class(0x16)
    3052              $C$DW$T$209     .dwtag  DW_TAG_pointer_type
    3053                      .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$91)
    3054                      .dwattr $C$DW$T$209, DW_AT_address_class(0x16)
    3055              $C$DW$T$210     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    3056                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$209)
    3057                      .dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
    3058              
    3059              $C$DW$T$92      .dwtag  DW_TAG_structure_type
    3060                      .dwattr $C$DW$T$92, DW_AT_name("_HAL_PwmData_t_")
    3061                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x06)
    3062              $C$DW$570       .dwtag  DW_TAG_member
    3063                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$57)
    3064                      .dwattr $C$DW$570, DW_AT_name("Tabc")
    3065                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_Tabc")
    3066                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3067                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3068                      .dwendtag $C$DW$T$92
    3069              
    3070              $C$DW$T$214     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_PwmData_t")
    3071                      .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$92)
    3072                      .dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
    3073              
    3074              $C$DW$T$93      .dwtag  DW_TAG_structure_type
    3075                      .dwattr $C$DW$T$93, DW_AT_name("_LDC1612_CONFIG_t_")
    3076                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x09)
    3077              $C$DW$571       .dwtag  DW_TAG_member
    3078                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$46)
    3079                      .dwattr $C$DW$571, DW_AT_name("ACTIVE_CHAN_0")
    3080                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_ACTIVE_CHAN_0")
    3081                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3082                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3083              $C$DW$572       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$46)
    3085                      .dwattr $C$DW$572, DW_AT_name("ACTIVE_CHAN_1")
    3086                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_ACTIVE_CHAN_1")
    3087                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3088                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3089              $C$DW$573       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$46)
    3091                      .dwattr $C$DW$573, DW_AT_name("SLEEP_MODE_EN")
    3092                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_SLEEP_MODE_EN")
    3093                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3094                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   61

    3095              $C$DW$574       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$46)
    3097                      .dwattr $C$DW$574, DW_AT_name("RP_OVERRIDE_EN")
    3098                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_RP_OVERRIDE_EN")
    3099                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3100                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3101              $C$DW$575       .dwtag  DW_TAG_member
    3102                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$46)
    3103                      .dwattr $C$DW$575, DW_AT_name("SENSOR_ACTV_SEL")
    3104                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_SENSOR_ACTV_SEL")
    3105                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3106                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3107              $C$DW$576       .dwtag  DW_TAG_member
    3108                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$46)
    3109                      .dwattr $C$DW$576, DW_AT_name("AUTO_AMP_DIS")
    3110                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_AUTO_AMP_DIS")
    3111                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3112                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3113              $C$DW$577       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$46)
    3115                      .dwattr $C$DW$577, DW_AT_name("REF_CLK_SRC")
    3116                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_REF_CLK_SRC")
    3117                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3118                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3119              $C$DW$578       .dwtag  DW_TAG_member
    3120                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$46)
    3121                      .dwattr $C$DW$578, DW_AT_name("INTB_DIS")
    3122                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_INTB_DIS")
    3123                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3124                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3125              $C$DW$579       .dwtag  DW_TAG_member
    3126                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$46)
    3127                      .dwattr $C$DW$579, DW_AT_name("HIGH_CURRENT_DRV")
    3128                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_HIGH_CURRENT_DRV")
    3129                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3130                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3131                      .dwendtag $C$DW$T$93
    3132              
    3133              $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("LDC1612_CONFIG_t_")
    3134                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$93)
    3135                      .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3136              
    3137              $C$DW$T$95      .dwtag  DW_TAG_structure_type
    3138                      .dwattr $C$DW$T$95, DW_AT_name("_LDC161x_CLK_DIVS_t_")
    3139                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x08)
    3140              $C$DW$580       .dwtag  DW_TAG_member
    3141                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$94)
    3142                      .dwattr $C$DW$580, DW_AT_name("CLK_DIVS_CH0")
    3143                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_CLK_DIVS_CH0")
    3144                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3145                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3146              $C$DW$581       .dwtag  DW_TAG_member
    3147                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$94)
    3148                      .dwattr $C$DW$581, DW_AT_name("CLK_DIVS_CH1")
    3149                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_CLK_DIVS_CH1")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   62

    3150                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3151                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3152              $C$DW$582       .dwtag  DW_TAG_member
    3153                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$94)
    3154                      .dwattr $C$DW$582, DW_AT_name("CLK_DIVS_CH2")
    3155                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_CLK_DIVS_CH2")
    3156                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3157                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3158              $C$DW$583       .dwtag  DW_TAG_member
    3159                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$94)
    3160                      .dwattr $C$DW$583, DW_AT_name("CLK_DIVS_CH3")
    3161                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_CLK_DIVS_CH3")
    3162                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3163                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3164                      .dwendtag $C$DW$T$95
    3165              
    3166              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_CLK_DIVS_t_")
    3167                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$95)
    3168                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    3169              
    3170              $C$DW$T$96      .dwtag  DW_TAG_structure_type
    3171                      .dwattr $C$DW$T$96, DW_AT_name("_LDC161x_ERROR_CONFIG_t_")
    3172                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x0c)
    3173              $C$DW$584       .dwtag  DW_TAG_member
    3174                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$46)
    3175                      .dwattr $C$DW$584, DW_AT_name("UR_ERR2OUT")
    3176                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_UR_ERR2OUT")
    3177                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3178                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3179              $C$DW$585       .dwtag  DW_TAG_member
    3180                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$46)
    3181                      .dwattr $C$DW$585, DW_AT_name("OR_ERR2OUT")
    3182                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_OR_ERR2OUT")
    3183                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3184                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3185              $C$DW$586       .dwtag  DW_TAG_member
    3186                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$46)
    3187                      .dwattr $C$DW$586, DW_AT_name("WD_ERR2OUT")
    3188                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_WD_ERR2OUT")
    3189                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3190                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3191              $C$DW$587       .dwtag  DW_TAG_member
    3192                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$46)
    3193                      .dwattr $C$DW$587, DW_AT_name("AH_ERR2OUT")
    3194                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_AH_ERR2OUT")
    3195                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3196                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3197              $C$DW$588       .dwtag  DW_TAG_member
    3198                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$46)
    3199                      .dwattr $C$DW$588, DW_AT_name("AL_ERR2OUT")
    3200                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_AL_ERR2OUT")
    3201                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3202                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3203              $C$DW$589       .dwtag  DW_TAG_member
    3204                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$46)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0523610                              PAGE   63

    3205                      .dwattr $C$DW$589, DW_AT_name("UR_ERR2INT")
    3206                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_UR_ERR2INT")
    3207                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3208                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3209              $C$DW$590       .dwtag  DW_TAG_member
    3210                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$46)
    3211                      .dwattr $C$DW$590, DW_AT_name("OR_ERR2INT")
    3212                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_OR_ERR2INT")
    3213                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3214                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3215              $C$DW$591       .dwtag  DW_TAG_member
    3216                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$46)
    3217                      .dwattr $C$DW$591, DW_AT_name("WD_ERR2INT")
    3218                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_WD_ERR2INT")
    3219                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3220                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3221              $C$DW$592       .dwtag  DW_TAG_member
    3222                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$46)
    3223                      .dwattr $C$DW$592, DW_AT_name("AH_ERR2INT")
    3224                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_AH_ERR2INT")
    3225                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3226                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3227              $C$DW$593       .dwtag  DW_TAG_member
    3228                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$46)
    3229                      .dwattr $C$DW$593, DW_AT_name("AL_ERR2INT")
    3230                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_AL_ERR2INT")
    3231                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3232                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3233              $C$DW$594       .dwtag  DW_TAG_member
    3234                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$46)
    3235                      .dwattr $C$DW$594, DW_AT_name("ZC_ERR2INT")
    3236                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_ZC_ERR2INT")
    3237                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3238                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3239              $C$DW$595       .dwtag  DW_TAG_member
    3240                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$46)
    3241                      .dwattr $C$DW$595, DW_AT_name("DRDY_2INT")
    3242                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_DRDY_2INT")
    3243                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3244                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3245                      .dwendtag $C$DW$T$96
    3246              
    3247              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ERROR_CONFIG_t_")
    3248                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$96)
    3249                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3250              
    3251              $C$DW$T$97      .dwtag  DW_TAG_structure_type
    3252                      .dwattr $C$DW$T$97, DW_AT_name("_LDC161x_MUX_CONFIG_t_")
    3253                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x06)
    3254              $C$DW$596       .dwtag  DW_TAG_member
    3255                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$46)
    3256                      .dwattr $C$DW$596, DW_AT_name("AUTOSCAN_EN")
    3257                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_AUTOSCAN_EN")
    3258                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3259                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 10:43:56 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
