TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.3.LTS *
       3              ;* Date/Time created: Tue Jul  4 10:34:27 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("/home/wmj/Documents/my_motor/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.3.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/home/wmj/Documents/my_motor/sw/solutions/instaspin_foc/boards/hvki
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("CTRL_setGains")

    3337                      .dwattr $C$DW$331, DW_AT_const_value(0x5f)
    3338              
    3339              $C$DW$332       .dwtag  DW_TAG_enumerator
    3340                      .dwattr $C$DW$332, DW_AT_name("USER_ErrorCode_estFreq_Hz_High")
    3341                      .dwattr $C$DW$332, DW_AT_const_value(0x60)
    3342              
    3343              $C$DW$333       .dwtag  DW_TAG_enumerator
    3344                      .dwattr $C$DW$333, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low")
    3345                      .dwattr $C$DW$333, DW_AT_const_value(0x61)
    3346              
    3347              $C$DW$334       .dwtag  DW_TAG_enumerator
    3348                      .dwattr $C$DW$334, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High")
    3349                      .dwattr $C$DW$334, DW_AT_const_value(0x62)
    3350              
    3351              $C$DW$335       .dwtag  DW_TAG_enumerator
    3352                      .dwattr $C$DW$335, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low")
    3353                      .dwattr $C$DW$335, DW_AT_const_value(0x63)
    3354              
    3355              $C$DW$336       .dwtag  DW_TAG_enumerator
    3356                      .dwattr $C$DW$336, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High")
    3357                      .dwattr $C$DW$336, DW_AT_const_value(0x64)
    3358              
    3359              $C$DW$337       .dwtag  DW_TAG_enumerator
    3360                      .dwattr $C$DW$337, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low")
    3361                      .dwattr $C$DW$337, DW_AT_const_value(0x65)
    3362              
    3363              $C$DW$338       .dwtag  DW_TAG_enumerator
    3364                      .dwattr $C$DW$338, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High")
    3365                      .dwattr $C$DW$338, DW_AT_const_value(0x66)
    3366              
    3367              $C$DW$339       .dwtag  DW_TAG_enumerator
    3368                      .dwattr $C$DW$339, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low")
    3369                      .dwattr $C$DW$339, DW_AT_const_value(0x67)
    3370              
    3371              $C$DW$340       .dwtag  DW_TAG_enumerator
    3372                      .dwattr $C$DW$340, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High")
    3373                      .dwattr $C$DW$340, DW_AT_const_value(0x68)
    3374              
    3375              $C$DW$341       .dwtag  DW_TAG_enumerator
    3376                      .dwattr $C$DW$341, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low")
    3377                      .dwattr $C$DW$341, DW_AT_const_value(0x69)
    3378              
    3379              $C$DW$342       .dwtag  DW_TAG_enumerator
    3380                      .dwattr $C$DW$342, DW_AT_name("USER_numErrorCodes")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   67

    3381                      .dwattr $C$DW$342, DW_AT_const_value(0x6a)
    3382              
    3383                      .dwendtag $C$DW$T$74
    3384              
    3385              $C$DW$T$75      .dwtag  DW_TAG_typedef
    3386                      .dwattr $C$DW$T$75, DW_AT_name("USER_ErrorCode_e")
    3387                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3388                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3389              
    3390              $C$DW$343       .dwtag  DW_TAG_TI_far_type
    3391                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$75)
    3392              
    3393              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3394                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$343)
    3395              
    3396              
    3397              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3398                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3399              $C$DW$344       .dwtag  DW_TAG_enumerator
    3400                      .dwattr $C$DW$344, DW_AT_name("CTRL_Type_PID_spd")
    3401                      .dwattr $C$DW$344, DW_AT_const_value(0x00)
    3402              
    3403              $C$DW$345       .dwtag  DW_TAG_enumerator
    3404                      .dwattr $C$DW$345, DW_AT_name("CTRL_Type_PID_Id")
    3405                      .dwattr $C$DW$345, DW_AT_const_value(0x01)
    3406              
    3407              $C$DW$346       .dwtag  DW_TAG_enumerator
    3408                      .dwattr $C$DW$346, DW_AT_name("CTRL_Type_PID_Iq")
    3409                      .dwattr $C$DW$346, DW_AT_const_value(0x02)
    3410              
    3411                      .dwendtag $C$DW$T$82
    3412              
    3413              $C$DW$T$83      .dwtag  DW_TAG_typedef
    3414                      .dwattr $C$DW$T$83, DW_AT_name("CTRL_Type_e")
    3415                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3416                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3417              
    3418              $C$DW$347       .dwtag  DW_TAG_TI_far_type
    3419                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$83)
    3420              
    3421              $C$DW$T$84      .dwtag  DW_TAG_const_type
    3422                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$347)
    3423              
    3424              
    3425              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3426                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    3427                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    3428              $C$DW$348       .dwtag  DW_TAG_member
    3429                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    3430                      .dwattr $C$DW$348, DW_AT_name("alpha_sf")
    3431                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_alpha_sf")
    3432                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3433                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3434              
    3435              $C$DW$349       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   68

    3436                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    3437                      .dwattr $C$DW$349, DW_AT_name("beta_sf")
    3438                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_beta_sf")
    3439                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3440                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3441              
    3442              $C$DW$350       .dwtag  DW_TAG_member
    3443                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$22)
    3444                      .dwattr $C$DW$350, DW_AT_name("numSensors")
    3445                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_numSensors")
    3446                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3447                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3448              
    3449                      .dwendtag $C$DW$T$23
    3450              
    3451              $C$DW$T$31      .dwtag  DW_TAG_typedef
    3452                      .dwattr $C$DW$T$31, DW_AT_name("CLARKE_Obj")
    3453                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    3454                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3455              
    3456              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3457                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    3458                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3459              
    3460              $C$DW$T$30      .dwtag  DW_TAG_typedef
    3461                      .dwattr $C$DW$T$30, DW_AT_name("CLARKE_Handle")
    3462                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3463                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3464              
    3465              
    3466              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3467                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    3468                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    3469              $C$DW$351       .dwtag  DW_TAG_member
    3470                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$24)
    3471                      .dwattr $C$DW$351, DW_AT_name("version")
    3472                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_version")
    3473                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3474                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3475              
    3476              $C$DW$352       .dwtag  DW_TAG_member
    3477                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$26)
    3478                      .dwattr $C$DW$352, DW_AT_name("state")
    3479                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_state")
    3480                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3481                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3482              
    3483              $C$DW$353       .dwtag  DW_TAG_member
    3484                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$26)
    3485                      .dwattr $C$DW$353, DW_AT_name("prevState")
    3486                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_prevState")
    3487                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3488                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3489              
    3490              $C$DW$354       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   69

    3491                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$28)
    3492                      .dwattr $C$DW$354, DW_AT_name("errorCode")
    3493                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_errorCode")
    3494                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3495                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3496              
    3497              $C$DW$355       .dwtag  DW_TAG_member
    3498                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$30)
    3499                      .dwattr $C$DW$355, DW_AT_name("clarkeHandle_I")
    3500                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3501                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3502                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3503              
    3504              $C$DW$356       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$31)
    3506                      .dwattr $C$DW$356, DW_AT_name("clarke_I")
    3507                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_clarke_I")
    3508                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3509                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3510              
    3511              $C$DW$357       .dwtag  DW_TAG_member
    3512                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$30)
    3513                      .dwattr $C$DW$357, DW_AT_name("clarkeHandle_V")
    3514                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3515                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3516                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3517              
    3518              $C$DW$358       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$31)
    3520                      .dwattr $C$DW$358, DW_AT_name("clarke_V")
    3521                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_clarke_V")
    3522                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3523                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3524              
    3525              $C$DW$359       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$33)
    3527                      .dwattr $C$DW$359, DW_AT_name("estHandle")
    3528                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_estHandle")
    3529                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3530                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3531              
    3532              $C$DW$360       .dwtag  DW_TAG_member
    3533                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$35)
    3534                      .dwattr $C$DW$360, DW_AT_name("parkHandle")
    3535                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_parkHandle")
    3536                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3537                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3538              
    3539              $C$DW$361       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$36)
    3541                      .dwattr $C$DW$361, DW_AT_name("park")
    3542                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_park")
    3543                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3544                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3545              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   70

    3546              $C$DW$362       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$38)
    3548                      .dwattr $C$DW$362, DW_AT_name("pidHandle_Id")
    3549                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_pidHandle_Id")
    3550                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3551                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3552              
    3553              $C$DW$363       .dwtag  DW_TAG_member
    3554                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$39)
    3555                      .dwattr $C$DW$363, DW_AT_name("pid_Id")
    3556                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_pid_Id")
    3557                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3558                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3559              
    3560              $C$DW$364       .dwtag  DW_TAG_member
    3561                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$38)
    3562                      .dwattr $C$DW$364, DW_AT_name("pidHandle_Iq")
    3563                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3564                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3565                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3566              
    3567              $C$DW$365       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$39)
    3569                      .dwattr $C$DW$365, DW_AT_name("pid_Iq")
    3570                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_pid_Iq")
    3571                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3572                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3573              
    3574              $C$DW$366       .dwtag  DW_TAG_member
    3575                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$38)
    3576                      .dwattr $C$DW$366, DW_AT_name("pidHandle_spd")
    3577                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_pidHandle_spd")
    3578                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3579                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3580              
    3581              $C$DW$367       .dwtag  DW_TAG_member
    3582                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$39)
    3583                      .dwattr $C$DW$367, DW_AT_name("pid_spd")
    3584                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_pid_spd")
    3585                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3586                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3587              
    3588              $C$DW$368       .dwtag  DW_TAG_member
    3589                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$41)
    3590                      .dwattr $C$DW$368, DW_AT_name("iparkHandle")
    3591                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_iparkHandle")
    3592                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3593                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3594              
    3595              $C$DW$369       .dwtag  DW_TAG_member
    3596                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$42)
    3597                      .dwattr $C$DW$369, DW_AT_name("ipark")
    3598                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ipark")
    3599                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3600                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   71

    3601              
    3602              $C$DW$370       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$44)
    3604                      .dwattr $C$DW$370, DW_AT_name("svgenHandle")
    3605                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_svgenHandle")
    3606                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3607                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3608              
    3609              $C$DW$371       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$45)
    3611                      .dwattr $C$DW$371, DW_AT_name("svgen")
    3612                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_svgen")
    3613                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3614                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3615              
    3616              $C$DW$372       .dwtag  DW_TAG_member
    3617                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$47)
    3618                      .dwattr $C$DW$372, DW_AT_name("trajHandle_Id")
    3619                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_trajHandle_Id")
    3620                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3621                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3622              
    3623              $C$DW$373       .dwtag  DW_TAG_member
    3624                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$48)
    3625                      .dwattr $C$DW$373, DW_AT_name("traj_Id")
    3626                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_traj_Id")
    3627                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3628                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3629              
    3630              $C$DW$374       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$47)
    3632                      .dwattr $C$DW$374, DW_AT_name("trajHandle_spd")
    3633                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_trajHandle_spd")
    3634                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3635                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3636              
    3637              $C$DW$375       .dwtag  DW_TAG_member
    3638                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$48)
    3639                      .dwattr $C$DW$375, DW_AT_name("traj_spd")
    3640                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_traj_spd")
    3641                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3642                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3643              
    3644              $C$DW$376       .dwtag  DW_TAG_member
    3645                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$47)
    3646                      .dwattr $C$DW$376, DW_AT_name("trajHandle_spdMax")
    3647                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3648                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3649                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3650              
    3651              $C$DW$377       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$48)
    3653                      .dwattr $C$DW$377, DW_AT_name("traj_spdMax")
    3654                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_traj_spdMax")
    3655                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   72

    3656                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3657              
    3658              $C$DW$378       .dwtag  DW_TAG_member
    3659                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$49)
    3660                      .dwattr $C$DW$378, DW_AT_name("motorParams")
    3661                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_motorParams")
    3662                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3663                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3664              
    3665              $C$DW$379       .dwtag  DW_TAG_member
    3666                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$52)
    3667                      .dwattr $C$DW$379, DW_AT_name("waitTimes")
    3668                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_waitTimes")
    3669                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3670                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3671              
    3672              $C$DW$380       .dwtag  DW_TAG_member
    3673                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$51)
    3674                      .dwattr $C$DW$380, DW_AT_name("counter_state")
    3675                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_counter_state")
    3676                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3677                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3678              
    3679              $C$DW$381       .dwtag  DW_TAG_member
    3680                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$53)
    3681                      .dwattr $C$DW$381, DW_AT_name("numIsrTicksPerCtrlTick")
    3682                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3683                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3684                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3685              
    3686              $C$DW$382       .dwtag  DW_TAG_member
    3687                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$53)
    3688                      .dwattr $C$DW$382, DW_AT_name("numCtrlTicksPerCurrentTick")
    3689                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3690                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3691                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3692              
    3693              $C$DW$383       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$53)
    3695                      .dwattr $C$DW$383, DW_AT_name("numCtrlTicksPerSpeedTick")
    3696                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3697                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3698                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3699              
    3700              $C$DW$384       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$53)
    3702                      .dwattr $C$DW$384, DW_AT_name("numCtrlTicksPerTrajTick")
    3703                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3704                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3705                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3706              
    3707              $C$DW$385       .dwtag  DW_TAG_member
    3708                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$51)
    3709                      .dwattr $C$DW$385, DW_AT_name("ctrlFreq_Hz")
    3710                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   73

    3711                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3712                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3713              
    3714              $C$DW$386       .dwtag  DW_TAG_member
    3715                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$51)
    3716                      .dwattr $C$DW$386, DW_AT_name("trajFreq_Hz")
    3717                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3718                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3719                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3720              
    3721              $C$DW$387       .dwtag  DW_TAG_member
    3722                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    3723                      .dwattr $C$DW$387, DW_AT_name("trajPeriod_sec")
    3724                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3725                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3726                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3727              
    3728              $C$DW$388       .dwtag  DW_TAG_member
    3729                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$54)
    3730                      .dwattr $C$DW$388, DW_AT_name("ctrlPeriod_sec")
    3731                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3732                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3733                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3734              
    3735              $C$DW$389       .dwtag  DW_TAG_member
    3736                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    3737                      .dwattr $C$DW$389, DW_AT_name("maxVsMag_pu")
    3738                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3739                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3740                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3741              
    3742              $C$DW$390       .dwtag  DW_TAG_member
    3743                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$55)
    3744                      .dwattr $C$DW$390, DW_AT_name("Iab_in")
    3745                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_Iab_in")
    3746                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3747                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3748              
    3749              $C$DW$391       .dwtag  DW_TAG_member
    3750                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$55)
    3751                      .dwattr $C$DW$391, DW_AT_name("Iab_filt")
    3752                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_Iab_filt")
    3753                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3754                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3755              
    3756              $C$DW$392       .dwtag  DW_TAG_member
    3757                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$55)
    3758                      .dwattr $C$DW$392, DW_AT_name("Idq_in")
    3759                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_Idq_in")
    3760                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3761                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3762              
    3763              $C$DW$393       .dwtag  DW_TAG_member
    3764                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$55)
    3765                      .dwattr $C$DW$393, DW_AT_name("Vab_in")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   74

    3766                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Vab_in")
    3767                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3768                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3769              
    3770              $C$DW$394       .dwtag  DW_TAG_member
    3771                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    3772                      .dwattr $C$DW$394, DW_AT_name("spd_out")
    3773                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_spd_out")
    3774                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3775                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3776              
    3777              $C$DW$395       .dwtag  DW_TAG_member
    3778                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$55)
    3779                      .dwattr $C$DW$395, DW_AT_name("Vab_out")
    3780                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_Vab_out")
    3781                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3782                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3783              
    3784              $C$DW$396       .dwtag  DW_TAG_member
    3785                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$55)
    3786                      .dwattr $C$DW$396, DW_AT_name("Vdq_out")
    3787                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Vdq_out")
    3788                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3789                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3790              
    3791              $C$DW$397       .dwtag  DW_TAG_member
    3792                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$54)
    3793                      .dwattr $C$DW$397, DW_AT_name("Rhf")
    3794                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Rhf")
    3795                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3796                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3797              
    3798              $C$DW$398       .dwtag  DW_TAG_member
    3799                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$54)
    3800                      .dwattr $C$DW$398, DW_AT_name("Lhf")
    3801                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Lhf")
    3802                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3803                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3804              
    3805              $C$DW$399       .dwtag  DW_TAG_member
    3806                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$54)
    3807                      .dwattr $C$DW$399, DW_AT_name("RoverL")
    3808                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_RoverL")
    3809                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3810                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3811              
    3812              $C$DW$400       .dwtag  DW_TAG_member
    3813                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    3814                      .dwattr $C$DW$400, DW_AT_name("Kp_Id")
    3815                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Kp_Id")
    3816                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3817                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3818              
    3819              $C$DW$401       .dwtag  DW_TAG_member
    3820                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   75

    3821                      .dwattr $C$DW$401, DW_AT_name("Kp_Iq")
    3822                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_Kp_Iq")
    3823                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3824                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3825              
    3826              $C$DW$402       .dwtag  DW_TAG_member
    3827                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    3828                      .dwattr $C$DW$402, DW_AT_name("Kp_spd")
    3829                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_Kp_spd")
    3830                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3831                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3832              
    3833              $C$DW$403       .dwtag  DW_TAG_member
    3834                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    3835                      .dwattr $C$DW$403, DW_AT_name("Ki_Id")
    3836                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_Ki_Id")
    3837                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3838                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3839              
    3840              $C$DW$404       .dwtag  DW_TAG_member
    3841                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    3842                      .dwattr $C$DW$404, DW_AT_name("Ki_Iq")
    3843                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_Ki_Iq")
    3844                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3845                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3846              
    3847              $C$DW$405       .dwtag  DW_TAG_member
    3848                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3849                      .dwattr $C$DW$405, DW_AT_name("Ki_spd")
    3850                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Ki_spd")
    3851                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3852                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3853              
    3854              $C$DW$406       .dwtag  DW_TAG_member
    3855                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    3856                      .dwattr $C$DW$406, DW_AT_name("Kd_Id")
    3857                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Kd_Id")
    3858                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3859                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3860              
    3861              $C$DW$407       .dwtag  DW_TAG_member
    3862                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3863                      .dwattr $C$DW$407, DW_AT_name("Kd_Iq")
    3864                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Kd_Iq")
    3865                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3866                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3867              
    3868              $C$DW$408       .dwtag  DW_TAG_member
    3869                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    3870                      .dwattr $C$DW$408, DW_AT_name("Kd_spd")
    3871                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Kd_spd")
    3872                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3873                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3874              
    3875              $C$DW$409       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   76

    3876                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    3877                      .dwattr $C$DW$409, DW_AT_name("Ui_Id")
    3878                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Ui_Id")
    3879                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3880                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3881              
    3882              $C$DW$410       .dwtag  DW_TAG_member
    3883                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3884                      .dwattr $C$DW$410, DW_AT_name("Ui_Iq")
    3885                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Ui_Iq")
    3886                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3887                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3888              
    3889              $C$DW$411       .dwtag  DW_TAG_member
    3890                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3891                      .dwattr $C$DW$411, DW_AT_name("Ui_spd")
    3892                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Ui_spd")
    3893                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3894                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3895              
    3896              $C$DW$412       .dwtag  DW_TAG_member
    3897                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$55)
    3898                      .dwattr $C$DW$412, DW_AT_name("Idq_ref")
    3899                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Idq_ref")
    3900                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3901                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3902              
    3903              $C$DW$413       .dwtag  DW_TAG_member
    3904                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    3905                      .dwattr $C$DW$413, DW_AT_name("IdRated")
    3906                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_IdRated")
    3907                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3908                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3909              
    3910              $C$DW$414       .dwtag  DW_TAG_member
    3911                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3912                      .dwattr $C$DW$414, DW_AT_name("spd_ref")
    3913                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_spd_ref")
    3914                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3915                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3916              
    3917              $C$DW$415       .dwtag  DW_TAG_member
    3918                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    3919                      .dwattr $C$DW$415, DW_AT_name("spd_max")
    3920                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_spd_max")
    3921                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3922                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3923              
    3924              $C$DW$416       .dwtag  DW_TAG_member
    3925                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$53)
    3926                      .dwattr $C$DW$416, DW_AT_name("counter_current")
    3927                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_counter_current")
    3928                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3929                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3930              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   77

    3931              $C$DW$417       .dwtag  DW_TAG_member
    3932                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$53)
    3933                      .dwattr $C$DW$417, DW_AT_name("counter_isr")
    3934                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_counter_isr")
    3935                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3936                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3937              
    3938              $C$DW$418       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$53)
    3940                      .dwattr $C$DW$418, DW_AT_name("counter_speed")
    3941                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_counter_speed")
    3942                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3943                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3944              
    3945              $C$DW$419       .dwtag  DW_TAG_member
    3946                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$53)
    3947                      .dwattr $C$DW$419, DW_AT_name("counter_traj")
    3948                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_counter_traj")
    3949                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3950                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3951              
    3952              $C$DW$420       .dwtag  DW_TAG_member
    3953                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$56)
    3954                      .dwattr $C$DW$420, DW_AT_name("flag_enableCtrl")
    3955                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3956                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3957                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3958              
    3959              $C$DW$421       .dwtag  DW_TAG_member
    3960                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$56)
    3961                      .dwattr $C$DW$421, DW_AT_name("flag_enableDcBusComp")
    3962                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3963                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3964                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3965              
    3966              $C$DW$422       .dwtag  DW_TAG_member
    3967                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$56)
    3968                      .dwattr $C$DW$422, DW_AT_name("flag_enablePowerWarp")
    3969                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3970                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3971                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3972              
    3973              $C$DW$423       .dwtag  DW_TAG_member
    3974                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$56)
    3975                      .dwattr $C$DW$423, DW_AT_name("flag_enableOffset")
    3976                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_flag_enableOffset")
    3977                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3978                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3979              
    3980              $C$DW$424       .dwtag  DW_TAG_member
    3981                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$56)
    3982                      .dwattr $C$DW$424, DW_AT_name("flag_enableSpeedCtrl")
    3983                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3984                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3985                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   78

    3986              
    3987              $C$DW$425       .dwtag  DW_TAG_member
    3988                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$56)
    3989                      .dwattr $C$DW$425, DW_AT_name("flag_enableUserMotorParams")
    3990                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3991                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3992                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3993              
    3994              $C$DW$426       .dwtag  DW_TAG_member
    3995                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$55)
    3996                      .dwattr $C$DW$426, DW_AT_name("Idq_offset_pu")
    3997                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3998                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3999                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4000              
    4001              $C$DW$427       .dwtag  DW_TAG_member
    4002                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$55)
    4003                      .dwattr $C$DW$427, DW_AT_name("Vdq_offset_pu")
    4004                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4005                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4006                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4007              
    4008              $C$DW$428       .dwtag  DW_TAG_member
    4009                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    4010                      .dwattr $C$DW$428, DW_AT_name("angle_pu")
    4011                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_angle_pu")
    4012                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4013                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4014              
    4015              $C$DW$429       .dwtag  DW_TAG_member
    4016                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    4017                      .dwattr $C$DW$429, DW_AT_name("speed_ref_pu")
    4018                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_speed_ref_pu")
    4019                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4020                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4021              
    4022              $C$DW$430       .dwtag  DW_TAG_member
    4023                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    4024                      .dwattr $C$DW$430, DW_AT_name("speed_fb_pu")
    4025                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_speed_fb_pu")
    4026                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4027                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4028              
    4029              $C$DW$431       .dwtag  DW_TAG_member
    4030                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    4031                      .dwattr $C$DW$431, DW_AT_name("speed_outMax_pu")
    4032                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4033                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4034                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4035              
    4036              $C$DW$432       .dwtag  DW_TAG_member
    4037                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$56)
    4038                      .dwattr $C$DW$432, DW_AT_name("flag_enableCurrentCtrl")
    4039                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4040                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   79

    4041                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4042              
    4043                      .dwendtag $C$DW$T$57
    4044              
    4045              $C$DW$T$85      .dwtag  DW_TAG_typedef
    4046                      .dwattr $C$DW$T$85, DW_AT_name("CTRL_Obj")
    4047                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    4048                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4049              
    4050              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    4051                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    4052                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    4053              
    4054              $C$DW$T$87      .dwtag  DW_TAG_typedef
    4055                      .dwattr $C$DW$T$87, DW_AT_name("CTRL_Handle")
    4056                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4057                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4058              
    4059              $C$DW$433       .dwtag  DW_TAG_TI_far_type
    4060                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$87)
    4061              
    4062              $C$DW$T$88      .dwtag  DW_TAG_const_type
    4063                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$433)
    4064              
    4065              
    4066              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4067                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    4068                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    4069              $C$DW$434       .dwtag  DW_TAG_member
    4070                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    4071                      .dwattr $C$DW$434, DW_AT_name("rsvd")
    4072                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd")
    4073                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4074                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4075              
    4076              $C$DW$435       .dwtag  DW_TAG_member
    4077                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$59)
    4078                      .dwattr $C$DW$435, DW_AT_name("targetProc")
    4079                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_targetProc")
    4080                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4081                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4082              
    4083              $C$DW$436       .dwtag  DW_TAG_member
    4084                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$21)
    4085                      .dwattr $C$DW$436, DW_AT_name("major")
    4086                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_major")
    4087                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4088                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4089              
    4090              $C$DW$437       .dwtag  DW_TAG_member
    4091                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    4092                      .dwattr $C$DW$437, DW_AT_name("minor")
    4093                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_minor")
    4094                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4095                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   80

    4096              
    4097                      .dwendtag $C$DW$T$60
    4098              
    4099              $C$DW$T$24      .dwtag  DW_TAG_typedef
    4100                      .dwattr $C$DW$T$24, DW_AT_name("CTRL_Version")
    4101                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    4102                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4103              
    4104              
    4105              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4106                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4107                      .dwattr $C$DW$T$19, DW_AT_declaration
    4108                      .dwendtag $C$DW$T$19
    4109              
    4110              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4111                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    4112                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    4113              
    4114              $C$DW$T$33      .dwtag  DW_TAG_typedef
    4115                      .dwattr $C$DW$T$33, DW_AT_name("EST_Handle")
    4116                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4117                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4118              
    4119              
    4120              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4121                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    4122                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    4123              $C$DW$438       .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    4125                      .dwattr $C$DW$438, DW_AT_name("sinTh")
    4126                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_sinTh")
    4127                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4128                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4129              
    4130              $C$DW$439       .dwtag  DW_TAG_member
    4131                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    4132                      .dwattr $C$DW$439, DW_AT_name("cosTh")
    4133                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_cosTh")
    4134                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4135                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4136              
    4137                      .dwendtag $C$DW$T$61
    4138              
    4139              $C$DW$T$42      .dwtag  DW_TAG_typedef
    4140                      .dwattr $C$DW$T$42, DW_AT_name("IPARK_Obj")
    4141                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    4142                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4143              
    4144              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4145                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    4146                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    4147              
    4148              $C$DW$T$41      .dwtag  DW_TAG_typedef
    4149                      .dwattr $C$DW$T$41, DW_AT_name("IPARK_Handle")
    4150                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   81

    4151                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4152              
    4153              
    4154              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4155                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    4156                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    4157              $C$DW$440       .dwtag  DW_TAG_member
    4158                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$62)
    4159                      .dwattr $C$DW$440, DW_AT_name("value")
    4160                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_value")
    4161                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4162                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4163              
    4164                      .dwendtag $C$DW$T$63
    4165              
    4166              $C$DW$T$55      .dwtag  DW_TAG_typedef
    4167                      .dwattr $C$DW$T$55, DW_AT_name("MATH_vec2")
    4168                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    4169                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4170              
    4171              
    4172              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4173                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    4174                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    4175              $C$DW$441       .dwtag  DW_TAG_member
    4176                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$65)
    4177                      .dwattr $C$DW$441, DW_AT_name("type")
    4178                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_type")
    4179                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4180                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4181              
    4182              $C$DW$442       .dwtag  DW_TAG_member
    4183                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$53)
    4184                      .dwattr $C$DW$442, DW_AT_name("numPolePairs")
    4185                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_numPolePairs")
    4186                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4187                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4188              
    4189              $C$DW$443       .dwtag  DW_TAG_member
    4190                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$54)
    4191                      .dwattr $C$DW$443, DW_AT_name("Lr_H")
    4192                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_Lr_H")
    4193                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4194                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4195              
    4196              $C$DW$444       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$54)
    4198                      .dwattr $C$DW$444, DW_AT_name("Ls_d_H")
    4199                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_Ls_d_H")
    4200                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4201                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4202              
    4203              $C$DW$445       .dwtag  DW_TAG_member
    4204                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$54)
    4205                      .dwattr $C$DW$445, DW_AT_name("Ls_q_H")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   82

    4206                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_Ls_q_H")
    4207                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4208                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4209              
    4210              $C$DW$446       .dwtag  DW_TAG_member
    4211                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$54)
    4212                      .dwattr $C$DW$446, DW_AT_name("Rr_Ohm")
    4213                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_Rr_Ohm")
    4214                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4215                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4216              
    4217              $C$DW$447       .dwtag  DW_TAG_member
    4218                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$54)
    4219                      .dwattr $C$DW$447, DW_AT_name("Rs_Ohm")
    4220                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_Rs_Ohm")
    4221                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4222                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4223              
    4224              $C$DW$448       .dwtag  DW_TAG_member
    4225                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$54)
    4226                      .dwattr $C$DW$448, DW_AT_name("ratedFlux_VpHz")
    4227                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    4228                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4229                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4230              
    4231                      .dwendtag $C$DW$T$66
    4232              
    4233              $C$DW$T$49      .dwtag  DW_TAG_typedef
    4234                      .dwattr $C$DW$T$49, DW_AT_name("MOTOR_Params")
    4235                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    4236                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4237              
    4238              
    4239              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4240                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    4241                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    4242              $C$DW$449       .dwtag  DW_TAG_member
    4243                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    4244                      .dwattr $C$DW$449, DW_AT_name("sinTh")
    4245                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_sinTh")
    4246                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4247                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4248              
    4249              $C$DW$450       .dwtag  DW_TAG_member
    4250                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    4251                      .dwattr $C$DW$450, DW_AT_name("cosTh")
    4252                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_cosTh")
    4253                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4254                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4255              
    4256                      .dwendtag $C$DW$T$67
    4257              
    4258              $C$DW$T$36      .dwtag  DW_TAG_typedef
    4259                      .dwattr $C$DW$T$36, DW_AT_name("PARK_Obj")
    4260                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   83

    4261                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4262              
    4263              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4264                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    4265                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4266              
    4267              $C$DW$T$35      .dwtag  DW_TAG_typedef
    4268                      .dwattr $C$DW$T$35, DW_AT_name("PARK_Handle")
    4269                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4270                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4271              
    4272              
    4273              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    4274                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    4275                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    4276              $C$DW$451       .dwtag  DW_TAG_member
    4277                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    4278                      .dwattr $C$DW$451, DW_AT_name("Kp")
    4279                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_Kp")
    4280                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4281                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4282              
    4283              $C$DW$452       .dwtag  DW_TAG_member
    4284                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    4285                      .dwattr $C$DW$452, DW_AT_name("Ki")
    4286                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_Ki")
    4287                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4288                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4289              
    4290              $C$DW$453       .dwtag  DW_TAG_member
    4291                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    4292                      .dwattr $C$DW$453, DW_AT_name("Kd")
    4293                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_Kd")
    4294                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4295                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4296              
    4297              $C$DW$454       .dwtag  DW_TAG_member
    4298                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    4299                      .dwattr $C$DW$454, DW_AT_name("Ui")
    4300                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_Ui")
    4301                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4302                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4303              
    4304              $C$DW$455       .dwtag  DW_TAG_member
    4305                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    4306                      .dwattr $C$DW$455, DW_AT_name("refValue")
    4307                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_refValue")
    4308                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4309                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4310              
    4311              $C$DW$456       .dwtag  DW_TAG_member
    4312                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4313                      .dwattr $C$DW$456, DW_AT_name("fbackValue")
    4314                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_fbackValue")
    4315                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   84

    4316                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4317              
    4318              $C$DW$457       .dwtag  DW_TAG_member
    4319                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    4320                      .dwattr $C$DW$457, DW_AT_name("outMin")
    4321                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_outMin")
    4322                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4323                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4324              
    4325              $C$DW$458       .dwtag  DW_TAG_member
    4326                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    4327                      .dwattr $C$DW$458, DW_AT_name("outMax")
    4328                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_outMax")
    4329                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4330                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4331              
    4332                      .dwendtag $C$DW$T$68
    4333              
    4334              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4335                      .dwattr $C$DW$T$39, DW_AT_name("PID_Obj")
    4336                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    4337                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4338              
    4339              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4340                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    4341                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    4342              
    4343              $C$DW$T$38      .dwtag  DW_TAG_typedef
    4344                      .dwattr $C$DW$T$38, DW_AT_name("PID_Handle")
    4345                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4346                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4347              
    4348              
    4349              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    4350                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    4351                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    4352              $C$DW$459       .dwtag  DW_TAG_member
    4353                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    4354                      .dwattr $C$DW$459, DW_AT_name("maxModulation")
    4355                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_maxModulation")
    4356                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4357                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4358              
    4359                      .dwendtag $C$DW$T$69
    4360              
    4361              $C$DW$T$45      .dwtag  DW_TAG_typedef
    4362                      .dwattr $C$DW$T$45, DW_AT_name("SVGEN_Obj")
    4363                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    4364                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4365              
    4366              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4367                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    4368                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4369              
    4370              $C$DW$T$44      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   85

    4371                      .dwattr $C$DW$T$44, DW_AT_name("SVGEN_Handle")
    4372                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4373                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4374              
    4375              
    4376              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4377                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    4378                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4379              $C$DW$460       .dwtag  DW_TAG_member
    4380                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$20)
    4381                      .dwattr $C$DW$460, DW_AT_name("targetValue")
    4382                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_targetValue")
    4383                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4384                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4385              
    4386              $C$DW$461       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    4388                      .dwattr $C$DW$461, DW_AT_name("intValue")
    4389                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_intValue")
    4390                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4391                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4392              
    4393              $C$DW$462       .dwtag  DW_TAG_member
    4394                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    4395                      .dwattr $C$DW$462, DW_AT_name("minValue")
    4396                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_minValue")
    4397                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4398                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4399              
    4400              $C$DW$463       .dwtag  DW_TAG_member
    4401                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$20)
    4402                      .dwattr $C$DW$463, DW_AT_name("maxValue")
    4403                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_maxValue")
    4404                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4405                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4406              
    4407              $C$DW$464       .dwtag  DW_TAG_member
    4408                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    4409                      .dwattr $C$DW$464, DW_AT_name("maxDelta")
    4410                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_maxDelta")
    4411                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4412                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4413              
    4414                      .dwendtag $C$DW$T$70
    4415              
    4416              $C$DW$T$48      .dwtag  DW_TAG_typedef
    4417                      .dwattr $C$DW$T$48, DW_AT_name("TRAJ_Obj")
    4418                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    4419                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4420              
    4421              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4422                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    4423                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4424              
    4425              $C$DW$T$47      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   86

    4426                      .dwattr $C$DW$T$47, DW_AT_name("TRAJ_Handle")
    4427                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4428                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4429              
    4430              
    4431              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4432                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    4433                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    4434              $C$DW$465       .dwtag  DW_TAG_member
    4435                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    4436                      .dwattr $C$DW$465, DW_AT_name("iqFullScaleCurrent_A")
    4437                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    4438                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4439                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4440              
    4441              $C$DW$466       .dwtag  DW_TAG_member
    4442                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    4443                      .dwattr $C$DW$466, DW_AT_name("iqFullScaleVoltage_V")
    4444                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    4445                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4446                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4447              
    4448              $C$DW$467       .dwtag  DW_TAG_member
    4449                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    4450                      .dwattr $C$DW$467, DW_AT_name("iqFullScaleFreq_Hz")
    4451                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    4452                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4453                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4454              
    4455              $C$DW$468       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$53)
    4457                      .dwattr $C$DW$468, DW_AT_name("numIsrTicksPerCtrlTick")
    4458                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4459                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4460                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4461              
    4462              $C$DW$469       .dwtag  DW_TAG_member
    4463                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$53)
    4464                      .dwattr $C$DW$469, DW_AT_name("numCtrlTicksPerCurrentTick")
    4465                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4466                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4467                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4468              
    4469              $C$DW$470       .dwtag  DW_TAG_member
    4470                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$53)
    4471                      .dwattr $C$DW$470, DW_AT_name("numCtrlTicksPerEstTick")
    4472                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    4473                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4474                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4475              
    4476              $C$DW$471       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$53)
    4478                      .dwattr $C$DW$471, DW_AT_name("numCtrlTicksPerSpeedTick")
    4479                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4480                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   87

    4481                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4482              
    4483              $C$DW$472       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$53)
    4485                      .dwattr $C$DW$472, DW_AT_name("numCtrlTicksPerTrajTick")
    4486                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4487                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4488                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4489              
    4490              $C$DW$473       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$22)
    4492                      .dwattr $C$DW$473, DW_AT_name("numCurrentSensors")
    4493                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_numCurrentSensors")
    4494                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4495                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4496              
    4497              $C$DW$474       .dwtag  DW_TAG_member
    4498                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
    4499                      .dwattr $C$DW$474, DW_AT_name("numVoltageSensors")
    4500                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_numVoltageSensors")
    4501                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4502                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4503              
    4504              $C$DW$475       .dwtag  DW_TAG_member
    4505                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$54)
    4506                      .dwattr $C$DW$475, DW_AT_name("offsetPole_rps")
    4507                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_offsetPole_rps")
    4508                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4509                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4510              
    4511              $C$DW$476       .dwtag  DW_TAG_member
    4512                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$54)
    4513                      .dwattr $C$DW$476, DW_AT_name("fluxPole_rps")
    4514                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_fluxPole_rps")
    4515                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4516                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4517              
    4518              $C$DW$477       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$54)
    4520                      .dwattr $C$DW$477, DW_AT_name("zeroSpeedLimit")
    4521                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    4522                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4523                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4524              
    4525              $C$DW$478       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$54)
    4527                      .dwattr $C$DW$478, DW_AT_name("forceAngleFreq_Hz")
    4528                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    4529                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4530                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4531              
    4532              $C$DW$479       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$54)
    4534                      .dwattr $C$DW$479, DW_AT_name("maxAccel_Hzps")
    4535                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_maxAccel_Hzps")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   88

    4536                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4537                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4538              
    4539              $C$DW$480       .dwtag  DW_TAG_member
    4540                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$54)
    4541                      .dwattr $C$DW$480, DW_AT_name("maxAccel_est_Hzps")
    4542                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    4543                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4544                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4545              
    4546              $C$DW$481       .dwtag  DW_TAG_member
    4547                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$54)
    4548                      .dwattr $C$DW$481, DW_AT_name("directionPole_rps")
    4549                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_directionPole_rps")
    4550                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4551                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4552              
    4553              $C$DW$482       .dwtag  DW_TAG_member
    4554                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$54)
    4555                      .dwattr $C$DW$482, DW_AT_name("speedPole_rps")
    4556                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_speedPole_rps")
    4557                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4558                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4559              
    4560              $C$DW$483       .dwtag  DW_TAG_member
    4561                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$54)
    4562                      .dwattr $C$DW$483, DW_AT_name("dcBusPole_rps")
    4563                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4564                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4565                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4566              
    4567              $C$DW$484       .dwtag  DW_TAG_member
    4568                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    4569                      .dwattr $C$DW$484, DW_AT_name("fluxFraction")
    4570                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_fluxFraction")
    4571                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4572                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4573              
    4574              $C$DW$485       .dwtag  DW_TAG_member
    4575                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$54)
    4576                      .dwattr $C$DW$485, DW_AT_name("indEst_speedMaxFraction")
    4577                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4578                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4579                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4580              
    4581              $C$DW$486       .dwtag  DW_TAG_member
    4582                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$54)
    4583                      .dwattr $C$DW$486, DW_AT_name("powerWarpGain")
    4584                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_powerWarpGain")
    4585                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4586                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4587              
    4588              $C$DW$487       .dwtag  DW_TAG_member
    4589                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$53)
    4590                      .dwattr $C$DW$487, DW_AT_name("systemFreq_MHz")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   89

    4591                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4592                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4593                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4594              
    4595              $C$DW$488       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$54)
    4597                      .dwattr $C$DW$488, DW_AT_name("pwmPeriod_usec")
    4598                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4599                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4600                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4601              
    4602              $C$DW$489       .dwtag  DW_TAG_member
    4603                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$54)
    4604                      .dwattr $C$DW$489, DW_AT_name("voltage_sf")
    4605                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_voltage_sf")
    4606                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4607                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4608              
    4609              $C$DW$490       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$54)
    4611                      .dwattr $C$DW$490, DW_AT_name("current_sf")
    4612                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_current_sf")
    4613                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4614                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4615              
    4616              $C$DW$491       .dwtag  DW_TAG_member
    4617                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$54)
    4618                      .dwattr $C$DW$491, DW_AT_name("voltageFilterPole_rps")
    4619                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4620                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4621                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4622              
    4623              $C$DW$492       .dwtag  DW_TAG_member
    4624                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$54)
    4625                      .dwattr $C$DW$492, DW_AT_name("maxVsMag_pu")
    4626                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4627                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4628                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4629              
    4630              $C$DW$493       .dwtag  DW_TAG_member
    4631                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$54)
    4632                      .dwattr $C$DW$493, DW_AT_name("estKappa")
    4633                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_estKappa")
    4634                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4635                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4636              
    4637              $C$DW$494       .dwtag  DW_TAG_member
    4638                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$65)
    4639                      .dwattr $C$DW$494, DW_AT_name("motor_type")
    4640                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_motor_type")
    4641                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4642                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4643              
    4644              $C$DW$495       .dwtag  DW_TAG_member
    4645                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$53)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:27 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/992146qOlr8                                                     PAGE   90

    4646                      .dwattr $C$DW$495, DW_AT_name("motor_numPolePairs")
    4647                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4648                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4649                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4650              
    4651              $C$DW$496       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
    4653                      .dwattr $C$DW$496, DW_AT_name("motor_ratedFlux")
    4654                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4655                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4656                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4657              
    4658              $C$DW$497       .dwtag  DW_TAG_member
    4659                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$54)
    4660                      .dwattr $C$DW$497, DW_AT_name("motor_Rr")
    4661                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_motor_Rr")
    4662                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4663                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4664              
    4665              $C$DW$498       .dwtag  DW_TAG_member
    4666                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    4667                      .dwattr $C$DW$498, DW_AT_name("motor_Rs")
    4668                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_motor_Rs")
    4669                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4670                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4671              
    4672              $C$DW$499       .dwtag  DW_TAG_member
    4673                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    4674                      .dwattr $C$DW$499, DW_AT_name("motor_Ls_d")
    4675                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_motor_Ls_d")
    4676                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4677                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    4678              
    4679              $C$DW$500       .dwtag  DW_TAG_member
    4680                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    4681                      .dwattr $C$DW$500, DW_AT_name("motor_Ls_q")
    4682                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_motor_Ls_q")
    4683                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4684                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    4685              
    4686              $C$DW$501       .dwtag  DW_TAG_member
    4687                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    4688                      .dwattr $C$DW$501, DW_AT_name("maxCurrent")
    4689                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_maxCurrent")
    4690                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4691                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
