TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.3.LTS *
       3              ;* Date/Time created: Tue Jul  4 14:43:43 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("/home/wmj/Documents/my_motor/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.3.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/home/wmj/Documents/my_motor/sw/solutions/instaspin_foc/boards/hvki
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("PLL_disableClkDetect")

   12116              $C$DW$1580      .dwtag  DW_TAG_enumerator
   12117                      .dwattr $C$DW$1580, DW_AT_name("I2C_Status_NACK")
   12118                      .dwattr $C$DW$1580, DW_AT_const_value(0x02)
   12119              
   12120              $C$DW$1581      .dwtag  DW_TAG_enumerator
   12121                      .dwattr $C$DW$1581, DW_AT_name("I2C_Status_Reg_Rdy")
   12122                      .dwattr $C$DW$1581, DW_AT_const_value(0x04)
   12123              
   12124              $C$DW$1582      .dwtag  DW_TAG_enumerator
   12125                      .dwattr $C$DW$1582, DW_AT_name("I2C_Status_Rx_Rdy")
   12126                      .dwattr $C$DW$1582, DW_AT_const_value(0x08)
   12127              
   12128              $C$DW$1583      .dwtag  DW_TAG_enumerator
   12129                      .dwattr $C$DW$1583, DW_AT_name("I2C_Status_Tx_Rdy")
   12130                      .dwattr $C$DW$1583, DW_AT_const_value(0x10)
   12131              
   12132              $C$DW$1584      .dwtag  DW_TAG_enumerator
   12133                      .dwattr $C$DW$1584, DW_AT_name("I2C_Status_Stop")
   12134                      .dwattr $C$DW$1584, DW_AT_const_value(0x20)
   12135              
   12136              $C$DW$1585      .dwtag  DW_TAG_enumerator
   12137                      .dwattr $C$DW$1585, DW_AT_name("I2C_Status_AD0")
   12138                      .dwattr $C$DW$1585, DW_AT_const_value(0x100)
   12139              
   12140              $C$DW$1586      .dwtag  DW_TAG_enumerator
   12141                      .dwattr $C$DW$1586, DW_AT_name("I2C_Status_Slave_Addr")
   12142                      .dwattr $C$DW$1586, DW_AT_const_value(0x200)
   12143              
   12144              $C$DW$1587      .dwtag  DW_TAG_enumerator
   12145                      .dwattr $C$DW$1587, DW_AT_name("I2C_Status_Tx_Empty")
   12146                      .dwattr $C$DW$1587, DW_AT_const_value(0x400)
   12147              
   12148              $C$DW$1588      .dwtag  DW_TAG_enumerator
   12149                      .dwattr $C$DW$1588, DW_AT_name("I2C_Status_Rx_Full")
   12150                      .dwattr $C$DW$1588, DW_AT_const_value(0x800)
   12151              
   12152              $C$DW$1589      .dwtag  DW_TAG_enumerator
   12153                      .dwattr $C$DW$1589, DW_AT_name("I2C_Status_Busy")
   12154                      .dwattr $C$DW$1589, DW_AT_const_value(0x1000)
   12155              
   12156              $C$DW$1590      .dwtag  DW_TAG_enumerator
   12157                      .dwattr $C$DW$1590, DW_AT_name("I2C_Status_NACK_Sent")
   12158                      .dwattr $C$DW$1590, DW_AT_const_value(0x2000)
   12159              
   12160              $C$DW$1591      .dwtag  DW_TAG_enumerator
   12161                      .dwattr $C$DW$1591, DW_AT_name("I2C_Status_Slave_Dir")
   12162                      .dwattr $C$DW$1591, DW_AT_const_value(0x4000)
   12163              
   12164                      .dwendtag $C$DW$T$282
   12165              
   12166              $C$DW$T$283     .dwtag  DW_TAG_typedef
   12167                      .dwattr $C$DW$T$283, DW_AT_name("I2C_Status_e")
   12168                      .dwattr $C$DW$T$283, DW_AT_type(*$C$DW$T$282)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  231

   12169                      .dwattr $C$DW$T$283, DW_AT_language(DW_LANG_C)
   12170              
   12171              
   12172              $C$DW$T$287     .dwtag  DW_TAG_enumeration_type
   12173                      .dwattr $C$DW$T$287, DW_AT_byte_size(0x01)
   12174              $C$DW$1592      .dwtag  DW_TAG_enumerator
   12175                      .dwattr $C$DW$1592, DW_AT_name("HAL_SensorType_Current")
   12176                      .dwattr $C$DW$1592, DW_AT_const_value(0x00)
   12177              
   12178              $C$DW$1593      .dwtag  DW_TAG_enumerator
   12179                      .dwattr $C$DW$1593, DW_AT_name("HAL_SensorType_Voltage")
   12180                      .dwattr $C$DW$1593, DW_AT_const_value(0x01)
   12181              
   12182                      .dwendtag $C$DW$T$287
   12183              
   12184              $C$DW$T$288     .dwtag  DW_TAG_typedef
   12185                      .dwattr $C$DW$T$288, DW_AT_name("HAL_SensorType_e")
   12186                      .dwattr $C$DW$T$288, DW_AT_type(*$C$DW$T$287)
   12187                      .dwattr $C$DW$T$288, DW_AT_language(DW_LANG_C)
   12188              
   12189              
   12190              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   12191                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
   12192                      .dwattr $C$DW$T$19, DW_AT_declaration
   12193                      .dwendtag $C$DW$T$19
   12194              
   12195              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   12196                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
   12197                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
   12198              
   12199              $C$DW$T$80      .dwtag  DW_TAG_typedef
   12200                      .dwattr $C$DW$T$80, DW_AT_name("I2C_Handle")
   12201                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   12202                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   12203              
   12204              
   12205              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   12206                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   12207                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   12208              $C$DW$1594      .dwtag  DW_TAG_member
   12209                      .dwattr $C$DW$1594, DW_AT_type(*$C$DW$T$24)
   12210                      .dwattr $C$DW$1594, DW_AT_name("ADCRESULT")
   12211                      .dwattr $C$DW$1594, DW_AT_TI_symbol_name("_ADCRESULT")
   12212                      .dwattr $C$DW$1594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12213                      .dwattr $C$DW$1594, DW_AT_accessibility(DW_ACCESS_public)
   12214              
   12215              $C$DW$1595      .dwtag  DW_TAG_member
   12216                      .dwattr $C$DW$1595, DW_AT_type(*$C$DW$T$25)
   12217                      .dwattr $C$DW$1595, DW_AT_name("resvd_1")
   12218                      .dwattr $C$DW$1595, DW_AT_TI_symbol_name("_resvd_1")
   12219                      .dwattr $C$DW$1595, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12220                      .dwattr $C$DW$1595, DW_AT_accessibility(DW_ACCESS_public)
   12221              
   12222              $C$DW$1596      .dwtag  DW_TAG_member
   12223                      .dwattr $C$DW$1596, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  232

   12224                      .dwattr $C$DW$1596, DW_AT_name("ADCCTL1")
   12225                      .dwattr $C$DW$1596, DW_AT_TI_symbol_name("_ADCCTL1")
   12226                      .dwattr $C$DW$1596, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   12227                      .dwattr $C$DW$1596, DW_AT_accessibility(DW_ACCESS_public)
   12228              
   12229              $C$DW$1597      .dwtag  DW_TAG_member
   12230                      .dwattr $C$DW$1597, DW_AT_type(*$C$DW$T$23)
   12231                      .dwattr $C$DW$1597, DW_AT_name("ADCCTL2")
   12232                      .dwattr $C$DW$1597, DW_AT_TI_symbol_name("_ADCCTL2")
   12233                      .dwattr $C$DW$1597, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   12234                      .dwattr $C$DW$1597, DW_AT_accessibility(DW_ACCESS_public)
   12235              
   12236              $C$DW$1598      .dwtag  DW_TAG_member
   12237                      .dwattr $C$DW$1598, DW_AT_type(*$C$DW$T$26)
   12238                      .dwattr $C$DW$1598, DW_AT_name("rsvd_2")
   12239                      .dwattr $C$DW$1598, DW_AT_TI_symbol_name("_rsvd_2")
   12240                      .dwattr $C$DW$1598, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   12241                      .dwattr $C$DW$1598, DW_AT_accessibility(DW_ACCESS_public)
   12242              
   12243              $C$DW$1599      .dwtag  DW_TAG_member
   12244                      .dwattr $C$DW$1599, DW_AT_type(*$C$DW$T$23)
   12245                      .dwattr $C$DW$1599, DW_AT_name("ADCINTFLG")
   12246                      .dwattr $C$DW$1599, DW_AT_TI_symbol_name("_ADCINTFLG")
   12247                      .dwattr $C$DW$1599, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   12248                      .dwattr $C$DW$1599, DW_AT_accessibility(DW_ACCESS_public)
   12249              
   12250              $C$DW$1600      .dwtag  DW_TAG_member
   12251                      .dwattr $C$DW$1600, DW_AT_type(*$C$DW$T$23)
   12252                      .dwattr $C$DW$1600, DW_AT_name("ADCINTFLGCLR")
   12253                      .dwattr $C$DW$1600, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   12254                      .dwattr $C$DW$1600, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   12255                      .dwattr $C$DW$1600, DW_AT_accessibility(DW_ACCESS_public)
   12256              
   12257              $C$DW$1601      .dwtag  DW_TAG_member
   12258                      .dwattr $C$DW$1601, DW_AT_type(*$C$DW$T$23)
   12259                      .dwattr $C$DW$1601, DW_AT_name("ADCINTOVF")
   12260                      .dwattr $C$DW$1601, DW_AT_TI_symbol_name("_ADCINTOVF")
   12261                      .dwattr $C$DW$1601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   12262                      .dwattr $C$DW$1601, DW_AT_accessibility(DW_ACCESS_public)
   12263              
   12264              $C$DW$1602      .dwtag  DW_TAG_member
   12265                      .dwattr $C$DW$1602, DW_AT_type(*$C$DW$T$23)
   12266                      .dwattr $C$DW$1602, DW_AT_name("ADCINTOVFCLR")
   12267                      .dwattr $C$DW$1602, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   12268                      .dwattr $C$DW$1602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   12269                      .dwattr $C$DW$1602, DW_AT_accessibility(DW_ACCESS_public)
   12270              
   12271              $C$DW$1603      .dwtag  DW_TAG_member
   12272                      .dwattr $C$DW$1603, DW_AT_type(*$C$DW$T$27)
   12273                      .dwattr $C$DW$1603, DW_AT_name("INTSELxNy")
   12274                      .dwattr $C$DW$1603, DW_AT_TI_symbol_name("_INTSELxNy")
   12275                      .dwattr $C$DW$1603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   12276                      .dwattr $C$DW$1603, DW_AT_accessibility(DW_ACCESS_public)
   12277              
   12278              $C$DW$1604      .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  233

   12279                      .dwattr $C$DW$1604, DW_AT_type(*$C$DW$T$28)
   12280                      .dwattr $C$DW$1604, DW_AT_name("rsvd_3")
   12281                      .dwattr $C$DW$1604, DW_AT_TI_symbol_name("_rsvd_3")
   12282                      .dwattr $C$DW$1604, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   12283                      .dwattr $C$DW$1604, DW_AT_accessibility(DW_ACCESS_public)
   12284              
   12285              $C$DW$1605      .dwtag  DW_TAG_member
   12286                      .dwattr $C$DW$1605, DW_AT_type(*$C$DW$T$23)
   12287                      .dwattr $C$DW$1605, DW_AT_name("SOCPRICTRL")
   12288                      .dwattr $C$DW$1605, DW_AT_TI_symbol_name("_SOCPRICTRL")
   12289                      .dwattr $C$DW$1605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   12290                      .dwattr $C$DW$1605, DW_AT_accessibility(DW_ACCESS_public)
   12291              
   12292              $C$DW$1606      .dwtag  DW_TAG_member
   12293                      .dwattr $C$DW$1606, DW_AT_type(*$C$DW$T$23)
   12294                      .dwattr $C$DW$1606, DW_AT_name("rsvd_4")
   12295                      .dwattr $C$DW$1606, DW_AT_TI_symbol_name("_rsvd_4")
   12296                      .dwattr $C$DW$1606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   12297                      .dwattr $C$DW$1606, DW_AT_accessibility(DW_ACCESS_public)
   12298              
   12299              $C$DW$1607      .dwtag  DW_TAG_member
   12300                      .dwattr $C$DW$1607, DW_AT_type(*$C$DW$T$23)
   12301                      .dwattr $C$DW$1607, DW_AT_name("ADCSAMPLEMODE")
   12302                      .dwattr $C$DW$1607, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   12303                      .dwattr $C$DW$1607, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   12304                      .dwattr $C$DW$1607, DW_AT_accessibility(DW_ACCESS_public)
   12305              
   12306              $C$DW$1608      .dwtag  DW_TAG_member
   12307                      .dwattr $C$DW$1608, DW_AT_type(*$C$DW$T$23)
   12308                      .dwattr $C$DW$1608, DW_AT_name("rsvd_5")
   12309                      .dwattr $C$DW$1608, DW_AT_TI_symbol_name("_rsvd_5")
   12310                      .dwattr $C$DW$1608, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   12311                      .dwattr $C$DW$1608, DW_AT_accessibility(DW_ACCESS_public)
   12312              
   12313              $C$DW$1609      .dwtag  DW_TAG_member
   12314                      .dwattr $C$DW$1609, DW_AT_type(*$C$DW$T$23)
   12315                      .dwattr $C$DW$1609, DW_AT_name("ADCINTSOCSEL1")
   12316                      .dwattr $C$DW$1609, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   12317                      .dwattr $C$DW$1609, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   12318                      .dwattr $C$DW$1609, DW_AT_accessibility(DW_ACCESS_public)
   12319              
   12320              $C$DW$1610      .dwtag  DW_TAG_member
   12321                      .dwattr $C$DW$1610, DW_AT_type(*$C$DW$T$23)
   12322                      .dwattr $C$DW$1610, DW_AT_name("ADCINTSOCSEL2")
   12323                      .dwattr $C$DW$1610, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   12324                      .dwattr $C$DW$1610, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   12325                      .dwattr $C$DW$1610, DW_AT_accessibility(DW_ACCESS_public)
   12326              
   12327              $C$DW$1611      .dwtag  DW_TAG_member
   12328                      .dwattr $C$DW$1611, DW_AT_type(*$C$DW$T$26)
   12329                      .dwattr $C$DW$1611, DW_AT_name("rsvd_6")
   12330                      .dwattr $C$DW$1611, DW_AT_TI_symbol_name("_rsvd_6")
   12331                      .dwattr $C$DW$1611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   12332                      .dwattr $C$DW$1611, DW_AT_accessibility(DW_ACCESS_public)
   12333              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  234

   12334              $C$DW$1612      .dwtag  DW_TAG_member
   12335                      .dwattr $C$DW$1612, DW_AT_type(*$C$DW$T$23)
   12336                      .dwattr $C$DW$1612, DW_AT_name("ADCSOCFLG1")
   12337                      .dwattr $C$DW$1612, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   12338                      .dwattr $C$DW$1612, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   12339                      .dwattr $C$DW$1612, DW_AT_accessibility(DW_ACCESS_public)
   12340              
   12341              $C$DW$1613      .dwtag  DW_TAG_member
   12342                      .dwattr $C$DW$1613, DW_AT_type(*$C$DW$T$23)
   12343                      .dwattr $C$DW$1613, DW_AT_name("rsvd_7")
   12344                      .dwattr $C$DW$1613, DW_AT_TI_symbol_name("_rsvd_7")
   12345                      .dwattr $C$DW$1613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   12346                      .dwattr $C$DW$1613, DW_AT_accessibility(DW_ACCESS_public)
   12347              
   12348              $C$DW$1614      .dwtag  DW_TAG_member
   12349                      .dwattr $C$DW$1614, DW_AT_type(*$C$DW$T$23)
   12350                      .dwattr $C$DW$1614, DW_AT_name("ADCSOCFRC1")
   12351                      .dwattr $C$DW$1614, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   12352                      .dwattr $C$DW$1614, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   12353                      .dwattr $C$DW$1614, DW_AT_accessibility(DW_ACCESS_public)
   12354              
   12355              $C$DW$1615      .dwtag  DW_TAG_member
   12356                      .dwattr $C$DW$1615, DW_AT_type(*$C$DW$T$23)
   12357                      .dwattr $C$DW$1615, DW_AT_name("rsvd_8")
   12358                      .dwattr $C$DW$1615, DW_AT_TI_symbol_name("_rsvd_8")
   12359                      .dwattr $C$DW$1615, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   12360                      .dwattr $C$DW$1615, DW_AT_accessibility(DW_ACCESS_public)
   12361              
   12362              $C$DW$1616      .dwtag  DW_TAG_member
   12363                      .dwattr $C$DW$1616, DW_AT_type(*$C$DW$T$23)
   12364                      .dwattr $C$DW$1616, DW_AT_name("ADCSOCOVF1")
   12365                      .dwattr $C$DW$1616, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   12366                      .dwattr $C$DW$1616, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   12367                      .dwattr $C$DW$1616, DW_AT_accessibility(DW_ACCESS_public)
   12368              
   12369              $C$DW$1617      .dwtag  DW_TAG_member
   12370                      .dwattr $C$DW$1617, DW_AT_type(*$C$DW$T$23)
   12371                      .dwattr $C$DW$1617, DW_AT_name("rsvd_9")
   12372                      .dwattr $C$DW$1617, DW_AT_TI_symbol_name("_rsvd_9")
   12373                      .dwattr $C$DW$1617, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   12374                      .dwattr $C$DW$1617, DW_AT_accessibility(DW_ACCESS_public)
   12375              
   12376              $C$DW$1618      .dwtag  DW_TAG_member
   12377                      .dwattr $C$DW$1618, DW_AT_type(*$C$DW$T$23)
   12378                      .dwattr $C$DW$1618, DW_AT_name("ADCSOCOVFCLR1")
   12379                      .dwattr $C$DW$1618, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   12380                      .dwattr $C$DW$1618, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   12381                      .dwattr $C$DW$1618, DW_AT_accessibility(DW_ACCESS_public)
   12382              
   12383              $C$DW$1619      .dwtag  DW_TAG_member
   12384                      .dwattr $C$DW$1619, DW_AT_type(*$C$DW$T$23)
   12385                      .dwattr $C$DW$1619, DW_AT_name("rsvd_10")
   12386                      .dwattr $C$DW$1619, DW_AT_TI_symbol_name("_rsvd_10")
   12387                      .dwattr $C$DW$1619, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   12388                      .dwattr $C$DW$1619, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  235

   12389              
   12390              $C$DW$1620      .dwtag  DW_TAG_member
   12391                      .dwattr $C$DW$1620, DW_AT_type(*$C$DW$T$24)
   12392                      .dwattr $C$DW$1620, DW_AT_name("ADCSOCxCTL")
   12393                      .dwattr $C$DW$1620, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   12394                      .dwattr $C$DW$1620, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   12395                      .dwattr $C$DW$1620, DW_AT_accessibility(DW_ACCESS_public)
   12396              
   12397              $C$DW$1621      .dwtag  DW_TAG_member
   12398                      .dwattr $C$DW$1621, DW_AT_type(*$C$DW$T$24)
   12399                      .dwattr $C$DW$1621, DW_AT_name("rsvd_11")
   12400                      .dwattr $C$DW$1621, DW_AT_TI_symbol_name("_rsvd_11")
   12401                      .dwattr $C$DW$1621, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   12402                      .dwattr $C$DW$1621, DW_AT_accessibility(DW_ACCESS_public)
   12403              
   12404              $C$DW$1622      .dwtag  DW_TAG_member
   12405                      .dwattr $C$DW$1622, DW_AT_type(*$C$DW$T$23)
   12406                      .dwattr $C$DW$1622, DW_AT_name("ADCREFTRIM")
   12407                      .dwattr $C$DW$1622, DW_AT_TI_symbol_name("_ADCREFTRIM")
   12408                      .dwattr $C$DW$1622, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   12409                      .dwattr $C$DW$1622, DW_AT_accessibility(DW_ACCESS_public)
   12410              
   12411              $C$DW$1623      .dwtag  DW_TAG_member
   12412                      .dwattr $C$DW$1623, DW_AT_type(*$C$DW$T$23)
   12413                      .dwattr $C$DW$1623, DW_AT_name("ADCOFFTRIM")
   12414                      .dwattr $C$DW$1623, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   12415                      .dwattr $C$DW$1623, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   12416                      .dwattr $C$DW$1623, DW_AT_accessibility(DW_ACCESS_public)
   12417              
   12418              $C$DW$1624      .dwtag  DW_TAG_member
   12419                      .dwattr $C$DW$1624, DW_AT_type(*$C$DW$T$29)
   12420                      .dwattr $C$DW$1624, DW_AT_name("resvd_12")
   12421                      .dwattr $C$DW$1624, DW_AT_TI_symbol_name("_resvd_12")
   12422                      .dwattr $C$DW$1624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   12423                      .dwattr $C$DW$1624, DW_AT_accessibility(DW_ACCESS_public)
   12424              
   12425              $C$DW$1625      .dwtag  DW_TAG_member
   12426                      .dwattr $C$DW$1625, DW_AT_type(*$C$DW$T$23)
   12427                      .dwattr $C$DW$1625, DW_AT_name("ADCREV")
   12428                      .dwattr $C$DW$1625, DW_AT_TI_symbol_name("_ADCREV")
   12429                      .dwattr $C$DW$1625, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   12430                      .dwattr $C$DW$1625, DW_AT_accessibility(DW_ACCESS_public)
   12431              
   12432                      .dwendtag $C$DW$T$30
   12433              
   12434              $C$DW$T$295     .dwtag  DW_TAG_typedef
   12435                      .dwattr $C$DW$T$295, DW_AT_name("ADC_Obj")
   12436                      .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$30)
   12437                      .dwattr $C$DW$T$295, DW_AT_language(DW_LANG_C)
   12438              
   12439              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   12440                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
   12441                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
   12442              
   12443              $C$DW$T$51      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  236

   12444                      .dwattr $C$DW$T$51, DW_AT_name("ADC_Handle")
   12445                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
   12446                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
   12447              
   12448              
   12449              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   12450                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   12451                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   12452              $C$DW$1626      .dwtag  DW_TAG_member
   12453                      .dwattr $C$DW$1626, DW_AT_type(*$C$DW$T$23)
   12454                      .dwattr $C$DW$1626, DW_AT_name("XCLK")
   12455                      .dwattr $C$DW$1626, DW_AT_TI_symbol_name("_XCLK")
   12456                      .dwattr $C$DW$1626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12457                      .dwattr $C$DW$1626, DW_AT_accessibility(DW_ACCESS_public)
   12458              
   12459              $C$DW$1627      .dwtag  DW_TAG_member
   12460                      .dwattr $C$DW$1627, DW_AT_type(*$C$DW$T$23)
   12461                      .dwattr $C$DW$1627, DW_AT_name("rsvd_1")
   12462                      .dwattr $C$DW$1627, DW_AT_TI_symbol_name("_rsvd_1")
   12463                      .dwattr $C$DW$1627, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12464                      .dwattr $C$DW$1627, DW_AT_accessibility(DW_ACCESS_public)
   12465              
   12466              $C$DW$1628      .dwtag  DW_TAG_member
   12467                      .dwattr $C$DW$1628, DW_AT_type(*$C$DW$T$23)
   12468                      .dwattr $C$DW$1628, DW_AT_name("CLKCTL")
   12469                      .dwattr $C$DW$1628, DW_AT_TI_symbol_name("_CLKCTL")
   12470                      .dwattr $C$DW$1628, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12471                      .dwattr $C$DW$1628, DW_AT_accessibility(DW_ACCESS_public)
   12472              
   12473              $C$DW$1629      .dwtag  DW_TAG_member
   12474                      .dwattr $C$DW$1629, DW_AT_type(*$C$DW$T$31)
   12475                      .dwattr $C$DW$1629, DW_AT_name("rsvd_2")
   12476                      .dwattr $C$DW$1629, DW_AT_TI_symbol_name("_rsvd_2")
   12477                      .dwattr $C$DW$1629, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12478                      .dwattr $C$DW$1629, DW_AT_accessibility(DW_ACCESS_public)
   12479              
   12480              $C$DW$1630      .dwtag  DW_TAG_member
   12481                      .dwattr $C$DW$1630, DW_AT_type(*$C$DW$T$23)
   12482                      .dwattr $C$DW$1630, DW_AT_name("LOSPCP")
   12483                      .dwattr $C$DW$1630, DW_AT_TI_symbol_name("_LOSPCP")
   12484                      .dwattr $C$DW$1630, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   12485                      .dwattr $C$DW$1630, DW_AT_accessibility(DW_ACCESS_public)
   12486              
   12487              $C$DW$1631      .dwtag  DW_TAG_member
   12488                      .dwattr $C$DW$1631, DW_AT_type(*$C$DW$T$23)
   12489                      .dwattr $C$DW$1631, DW_AT_name("PCLKCR0")
   12490                      .dwattr $C$DW$1631, DW_AT_TI_symbol_name("_PCLKCR0")
   12491                      .dwattr $C$DW$1631, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12492                      .dwattr $C$DW$1631, DW_AT_accessibility(DW_ACCESS_public)
   12493              
   12494              $C$DW$1632      .dwtag  DW_TAG_member
   12495                      .dwattr $C$DW$1632, DW_AT_type(*$C$DW$T$23)
   12496                      .dwattr $C$DW$1632, DW_AT_name("PCLKCR1")
   12497                      .dwattr $C$DW$1632, DW_AT_TI_symbol_name("_PCLKCR1")
   12498                      .dwattr $C$DW$1632, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  237

   12499                      .dwattr $C$DW$1632, DW_AT_accessibility(DW_ACCESS_public)
   12500              
   12501              $C$DW$1633      .dwtag  DW_TAG_member
   12502                      .dwattr $C$DW$1633, DW_AT_type(*$C$DW$T$26)
   12503                      .dwattr $C$DW$1633, DW_AT_name("rsvd_3")
   12504                      .dwattr $C$DW$1633, DW_AT_TI_symbol_name("_rsvd_3")
   12505                      .dwattr $C$DW$1633, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12506                      .dwattr $C$DW$1633, DW_AT_accessibility(DW_ACCESS_public)
   12507              
   12508              $C$DW$1634      .dwtag  DW_TAG_member
   12509                      .dwattr $C$DW$1634, DW_AT_type(*$C$DW$T$23)
   12510                      .dwattr $C$DW$1634, DW_AT_name("PCLKCR3")
   12511                      .dwattr $C$DW$1634, DW_AT_TI_symbol_name("_PCLKCR3")
   12512                      .dwattr $C$DW$1634, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12513                      .dwattr $C$DW$1634, DW_AT_accessibility(DW_ACCESS_public)
   12514              
   12515                      .dwendtag $C$DW$T$32
   12516              
   12517              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
   12518                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
   12519                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
   12520              
   12521              $C$DW$T$53      .dwtag  DW_TAG_typedef
   12522                      .dwattr $C$DW$T$53, DW_AT_name("CLK_Handle")
   12523                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
   12524                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
   12525              
   12526              
   12527              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   12528                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   12529                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   12530              $C$DW$1635      .dwtag  DW_TAG_member
   12531                      .dwattr $C$DW$1635, DW_AT_type(*$C$DW$T$33)
   12532                      .dwattr $C$DW$1635, DW_AT_name("tmp")
   12533                      .dwattr $C$DW$1635, DW_AT_TI_symbol_name("_tmp")
   12534                      .dwattr $C$DW$1635, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12535                      .dwattr $C$DW$1635, DW_AT_accessibility(DW_ACCESS_public)
   12536              
   12537                      .dwendtag $C$DW$T$34
   12538              
   12539              $C$DW$T$302     .dwtag  DW_TAG_typedef
   12540                      .dwattr $C$DW$T$302, DW_AT_name("CPU_Obj")
   12541                      .dwattr $C$DW$T$302, DW_AT_type(*$C$DW$T$34)
   12542                      .dwattr $C$DW$T$302, DW_AT_language(DW_LANG_C)
   12543              
   12544              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
   12545                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
   12546                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
   12547              
   12548              $C$DW$T$55      .dwtag  DW_TAG_typedef
   12549                      .dwattr $C$DW$T$55, DW_AT_name("CPU_Handle")
   12550                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
   12551                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
   12552              
   12553              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  238

   12554              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   12555                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
   12556                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
   12557              $C$DW$1636      .dwtag  DW_TAG_member
   12558                      .dwattr $C$DW$1636, DW_AT_type(*$C$DW$T$35)
   12559                      .dwattr $C$DW$1636, DW_AT_name("a1")
   12560                      .dwattr $C$DW$1636, DW_AT_TI_symbol_name("_a1")
   12561                      .dwattr $C$DW$1636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12562                      .dwattr $C$DW$1636, DW_AT_accessibility(DW_ACCESS_public)
   12563              
   12564              $C$DW$1637      .dwtag  DW_TAG_member
   12565                      .dwattr $C$DW$1637, DW_AT_type(*$C$DW$T$35)
   12566                      .dwattr $C$DW$1637, DW_AT_name("b0")
   12567                      .dwattr $C$DW$1637, DW_AT_TI_symbol_name("_b0")
   12568                      .dwattr $C$DW$1637, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12569                      .dwattr $C$DW$1637, DW_AT_accessibility(DW_ACCESS_public)
   12570              
   12571              $C$DW$1638      .dwtag  DW_TAG_member
   12572                      .dwattr $C$DW$1638, DW_AT_type(*$C$DW$T$35)
   12573                      .dwattr $C$DW$1638, DW_AT_name("b1")
   12574                      .dwattr $C$DW$1638, DW_AT_TI_symbol_name("_b1")
   12575                      .dwattr $C$DW$1638, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12576                      .dwattr $C$DW$1638, DW_AT_accessibility(DW_ACCESS_public)
   12577              
   12578              $C$DW$1639      .dwtag  DW_TAG_member
   12579                      .dwattr $C$DW$1639, DW_AT_type(*$C$DW$T$35)
   12580                      .dwattr $C$DW$1639, DW_AT_name("x1")
   12581                      .dwattr $C$DW$1639, DW_AT_TI_symbol_name("_x1")
   12582                      .dwattr $C$DW$1639, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12583                      .dwattr $C$DW$1639, DW_AT_accessibility(DW_ACCESS_public)
   12584              
   12585              $C$DW$1640      .dwtag  DW_TAG_member
   12586                      .dwattr $C$DW$1640, DW_AT_type(*$C$DW$T$35)
   12587                      .dwattr $C$DW$1640, DW_AT_name("y1")
   12588                      .dwattr $C$DW$1640, DW_AT_TI_symbol_name("_y1")
   12589                      .dwattr $C$DW$1640, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12590                      .dwattr $C$DW$1640, DW_AT_accessibility(DW_ACCESS_public)
   12591              
   12592                      .dwendtag $C$DW$T$36
   12593              
   12594              $C$DW$T$87      .dwtag  DW_TAG_typedef
   12595                      .dwattr $C$DW$T$87, DW_AT_name("FILTER_FO_Obj")
   12596                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$36)
   12597                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   12598              
   12599              
   12600              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   12601                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
   12602                      .dwattr $C$DW$T$20, DW_AT_declaration
   12603                      .dwendtag $C$DW$T$20
   12604              
   12605              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
   12606                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$20)
   12607                      .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
   12608              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  239

   12609              $C$DW$T$89      .dwtag  DW_TAG_typedef
   12610                      .dwattr $C$DW$T$89, DW_AT_name("FILTER_FO_Handle")
   12611                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   12612                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   12613              
   12614              
   12615              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   12616                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
   12617                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
   12618              $C$DW$1641      .dwtag  DW_TAG_member
   12619                      .dwattr $C$DW$1641, DW_AT_type(*$C$DW$T$23)
   12620                      .dwattr $C$DW$1641, DW_AT_name("FOPT")
   12621                      .dwattr $C$DW$1641, DW_AT_TI_symbol_name("_FOPT")
   12622                      .dwattr $C$DW$1641, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12623                      .dwattr $C$DW$1641, DW_AT_accessibility(DW_ACCESS_public)
   12624              
   12625              $C$DW$1642      .dwtag  DW_TAG_member
   12626                      .dwattr $C$DW$1642, DW_AT_type(*$C$DW$T$23)
   12627                      .dwattr $C$DW$1642, DW_AT_name("rsvd_1")
   12628                      .dwattr $C$DW$1642, DW_AT_TI_symbol_name("_rsvd_1")
   12629                      .dwattr $C$DW$1642, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12630                      .dwattr $C$DW$1642, DW_AT_accessibility(DW_ACCESS_public)
   12631              
   12632              $C$DW$1643      .dwtag  DW_TAG_member
   12633                      .dwattr $C$DW$1643, DW_AT_type(*$C$DW$T$23)
   12634                      .dwattr $C$DW$1643, DW_AT_name("FPWR")
   12635                      .dwattr $C$DW$1643, DW_AT_TI_symbol_name("_FPWR")
   12636                      .dwattr $C$DW$1643, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12637                      .dwattr $C$DW$1643, DW_AT_accessibility(DW_ACCESS_public)
   12638              
   12639              $C$DW$1644      .dwtag  DW_TAG_member
   12640                      .dwattr $C$DW$1644, DW_AT_type(*$C$DW$T$23)
   12641                      .dwattr $C$DW$1644, DW_AT_name("FSTATUS")
   12642                      .dwattr $C$DW$1644, DW_AT_TI_symbol_name("_FSTATUS")
   12643                      .dwattr $C$DW$1644, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12644                      .dwattr $C$DW$1644, DW_AT_accessibility(DW_ACCESS_public)
   12645              
   12646              $C$DW$1645      .dwtag  DW_TAG_member
   12647                      .dwattr $C$DW$1645, DW_AT_type(*$C$DW$T$23)
   12648                      .dwattr $C$DW$1645, DW_AT_name("FSTDBYWAIT")
   12649                      .dwattr $C$DW$1645, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   12650                      .dwattr $C$DW$1645, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12651                      .dwattr $C$DW$1645, DW_AT_accessibility(DW_ACCESS_public)
   12652              
   12653              $C$DW$1646      .dwtag  DW_TAG_member
   12654                      .dwattr $C$DW$1646, DW_AT_type(*$C$DW$T$23)
   12655                      .dwattr $C$DW$1646, DW_AT_name("FACTIVEWAIT")
   12656                      .dwattr $C$DW$1646, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   12657                      .dwattr $C$DW$1646, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12658                      .dwattr $C$DW$1646, DW_AT_accessibility(DW_ACCESS_public)
   12659              
   12660              $C$DW$1647      .dwtag  DW_TAG_member
   12661                      .dwattr $C$DW$1647, DW_AT_type(*$C$DW$T$23)
   12662                      .dwattr $C$DW$1647, DW_AT_name("FBANKWAIT")
   12663                      .dwattr $C$DW$1647, DW_AT_TI_symbol_name("_FBANKWAIT")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  240

   12664                      .dwattr $C$DW$1647, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12665                      .dwattr $C$DW$1647, DW_AT_accessibility(DW_ACCESS_public)
   12666              
   12667              $C$DW$1648      .dwtag  DW_TAG_member
   12668                      .dwattr $C$DW$1648, DW_AT_type(*$C$DW$T$23)
   12669                      .dwattr $C$DW$1648, DW_AT_name("FOTPWAIT")
   12670                      .dwattr $C$DW$1648, DW_AT_TI_symbol_name("_FOTPWAIT")
   12671                      .dwattr $C$DW$1648, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12672                      .dwattr $C$DW$1648, DW_AT_accessibility(DW_ACCESS_public)
   12673              
   12674                      .dwendtag $C$DW$T$37
   12675              
   12676              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
   12677                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
   12678                      .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
   12679              
   12680              $C$DW$T$57      .dwtag  DW_TAG_typedef
   12681                      .dwattr $C$DW$T$57, DW_AT_name("FLASH_Handle")
   12682                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   12683                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   12684              
   12685              
   12686              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   12687                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
   12688                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
   12689              $C$DW$1649      .dwtag  DW_TAG_member
   12690                      .dwattr $C$DW$1649, DW_AT_type(*$C$DW$T$39)
   12691                      .dwattr $C$DW$1649, DW_AT_name("GPACTRL")
   12692                      .dwattr $C$DW$1649, DW_AT_TI_symbol_name("_GPACTRL")
   12693                      .dwattr $C$DW$1649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12694                      .dwattr $C$DW$1649, DW_AT_accessibility(DW_ACCESS_public)
   12695              
   12696              $C$DW$1650      .dwtag  DW_TAG_member
   12697                      .dwattr $C$DW$1650, DW_AT_type(*$C$DW$T$39)
   12698                      .dwattr $C$DW$1650, DW_AT_name("GPAQSEL1")
   12699                      .dwattr $C$DW$1650, DW_AT_TI_symbol_name("_GPAQSEL1")
   12700                      .dwattr $C$DW$1650, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12701                      .dwattr $C$DW$1650, DW_AT_accessibility(DW_ACCESS_public)
   12702              
   12703              $C$DW$1651      .dwtag  DW_TAG_member
   12704                      .dwattr $C$DW$1651, DW_AT_type(*$C$DW$T$39)
   12705                      .dwattr $C$DW$1651, DW_AT_name("GPAQSEL2")
   12706                      .dwattr $C$DW$1651, DW_AT_TI_symbol_name("_GPAQSEL2")
   12707                      .dwattr $C$DW$1651, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12708                      .dwattr $C$DW$1651, DW_AT_accessibility(DW_ACCESS_public)
   12709              
   12710              $C$DW$1652      .dwtag  DW_TAG_member
   12711                      .dwattr $C$DW$1652, DW_AT_type(*$C$DW$T$39)
   12712                      .dwattr $C$DW$1652, DW_AT_name("GPAMUX1")
   12713                      .dwattr $C$DW$1652, DW_AT_TI_symbol_name("_GPAMUX1")
   12714                      .dwattr $C$DW$1652, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12715                      .dwattr $C$DW$1652, DW_AT_accessibility(DW_ACCESS_public)
   12716              
   12717              $C$DW$1653      .dwtag  DW_TAG_member
   12718                      .dwattr $C$DW$1653, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  241

   12719                      .dwattr $C$DW$1653, DW_AT_name("GPAMUX2")
   12720                      .dwattr $C$DW$1653, DW_AT_TI_symbol_name("_GPAMUX2")
   12721                      .dwattr $C$DW$1653, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12722                      .dwattr $C$DW$1653, DW_AT_accessibility(DW_ACCESS_public)
   12723              
   12724              $C$DW$1654      .dwtag  DW_TAG_member
   12725                      .dwattr $C$DW$1654, DW_AT_type(*$C$DW$T$39)
   12726                      .dwattr $C$DW$1654, DW_AT_name("GPADIR")
   12727                      .dwattr $C$DW$1654, DW_AT_TI_symbol_name("_GPADIR")
   12728                      .dwattr $C$DW$1654, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12729                      .dwattr $C$DW$1654, DW_AT_accessibility(DW_ACCESS_public)
   12730              
   12731              $C$DW$1655      .dwtag  DW_TAG_member
   12732                      .dwattr $C$DW$1655, DW_AT_type(*$C$DW$T$39)
   12733                      .dwattr $C$DW$1655, DW_AT_name("GPAPUD")
   12734                      .dwattr $C$DW$1655, DW_AT_TI_symbol_name("_GPAPUD")
   12735                      .dwattr $C$DW$1655, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12736                      .dwattr $C$DW$1655, DW_AT_accessibility(DW_ACCESS_public)
   12737              
   12738              $C$DW$1656      .dwtag  DW_TAG_member
   12739                      .dwattr $C$DW$1656, DW_AT_type(*$C$DW$T$26)
   12740                      .dwattr $C$DW$1656, DW_AT_name("rsvd_1")
   12741                      .dwattr $C$DW$1656, DW_AT_TI_symbol_name("_rsvd_1")
   12742                      .dwattr $C$DW$1656, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12743                      .dwattr $C$DW$1656, DW_AT_accessibility(DW_ACCESS_public)
   12744              
   12745              $C$DW$1657      .dwtag  DW_TAG_member
   12746                      .dwattr $C$DW$1657, DW_AT_type(*$C$DW$T$39)
   12747                      .dwattr $C$DW$1657, DW_AT_name("GPBCTRL")
   12748                      .dwattr $C$DW$1657, DW_AT_TI_symbol_name("_GPBCTRL")
   12749                      .dwattr $C$DW$1657, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12750                      .dwattr $C$DW$1657, DW_AT_accessibility(DW_ACCESS_public)
   12751              
   12752              $C$DW$1658      .dwtag  DW_TAG_member
   12753                      .dwattr $C$DW$1658, DW_AT_type(*$C$DW$T$39)
   12754                      .dwattr $C$DW$1658, DW_AT_name("GPBQSEL1")
   12755                      .dwattr $C$DW$1658, DW_AT_TI_symbol_name("_GPBQSEL1")
   12756                      .dwattr $C$DW$1658, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   12757                      .dwattr $C$DW$1658, DW_AT_accessibility(DW_ACCESS_public)
   12758              
   12759              $C$DW$1659      .dwtag  DW_TAG_member
   12760                      .dwattr $C$DW$1659, DW_AT_type(*$C$DW$T$26)
   12761                      .dwattr $C$DW$1659, DW_AT_name("rsvd_2")
   12762                      .dwattr $C$DW$1659, DW_AT_TI_symbol_name("_rsvd_2")
   12763                      .dwattr $C$DW$1659, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   12764                      .dwattr $C$DW$1659, DW_AT_accessibility(DW_ACCESS_public)
   12765              
   12766              $C$DW$1660      .dwtag  DW_TAG_member
   12767                      .dwattr $C$DW$1660, DW_AT_type(*$C$DW$T$39)
   12768                      .dwattr $C$DW$1660, DW_AT_name("GPBMUX1")
   12769                      .dwattr $C$DW$1660, DW_AT_TI_symbol_name("_GPBMUX1")
   12770                      .dwattr $C$DW$1660, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12771                      .dwattr $C$DW$1660, DW_AT_accessibility(DW_ACCESS_public)
   12772              
   12773              $C$DW$1661      .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  242

   12774                      .dwattr $C$DW$1661, DW_AT_type(*$C$DW$T$26)
   12775                      .dwattr $C$DW$1661, DW_AT_name("rsvd_3")
   12776                      .dwattr $C$DW$1661, DW_AT_TI_symbol_name("_rsvd_3")
   12777                      .dwattr $C$DW$1661, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12778                      .dwattr $C$DW$1661, DW_AT_accessibility(DW_ACCESS_public)
   12779              
   12780              $C$DW$1662      .dwtag  DW_TAG_member
   12781                      .dwattr $C$DW$1662, DW_AT_type(*$C$DW$T$39)
   12782                      .dwattr $C$DW$1662, DW_AT_name("GPBDIR")
   12783                      .dwattr $C$DW$1662, DW_AT_TI_symbol_name("_GPBDIR")
   12784                      .dwattr $C$DW$1662, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   12785                      .dwattr $C$DW$1662, DW_AT_accessibility(DW_ACCESS_public)
   12786              
   12787              $C$DW$1663      .dwtag  DW_TAG_member
   12788                      .dwattr $C$DW$1663, DW_AT_type(*$C$DW$T$39)
   12789                      .dwattr $C$DW$1663, DW_AT_name("GPBPUD")
   12790                      .dwattr $C$DW$1663, DW_AT_TI_symbol_name("_GPBPUD")
   12791                      .dwattr $C$DW$1663, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   12792                      .dwattr $C$DW$1663, DW_AT_accessibility(DW_ACCESS_public)
   12793              
   12794              $C$DW$1664      .dwtag  DW_TAG_member
   12795                      .dwattr $C$DW$1664, DW_AT_type(*$C$DW$T$40)
   12796                      .dwattr $C$DW$1664, DW_AT_name("rsvd_4")
   12797                      .dwattr $C$DW$1664, DW_AT_TI_symbol_name("_rsvd_4")
   12798                      .dwattr $C$DW$1664, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   12799                      .dwattr $C$DW$1664, DW_AT_accessibility(DW_ACCESS_public)
   12800              
   12801              $C$DW$1665      .dwtag  DW_TAG_member
   12802                      .dwattr $C$DW$1665, DW_AT_type(*$C$DW$T$39)
   12803                      .dwattr $C$DW$1665, DW_AT_name("AIOMUX1")
   12804                      .dwattr $C$DW$1665, DW_AT_TI_symbol_name("_AIOMUX1")
   12805                      .dwattr $C$DW$1665, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   12806                      .dwattr $C$DW$1665, DW_AT_accessibility(DW_ACCESS_public)
   12807              
   12808              $C$DW$1666      .dwtag  DW_TAG_member
   12809                      .dwattr $C$DW$1666, DW_AT_type(*$C$DW$T$26)
   12810                      .dwattr $C$DW$1666, DW_AT_name("rsvd_5")
   12811                      .dwattr $C$DW$1666, DW_AT_TI_symbol_name("_rsvd_5")
   12812                      .dwattr $C$DW$1666, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   12813                      .dwattr $C$DW$1666, DW_AT_accessibility(DW_ACCESS_public)
   12814              
   12815              $C$DW$1667      .dwtag  DW_TAG_member
   12816                      .dwattr $C$DW$1667, DW_AT_type(*$C$DW$T$39)
   12817                      .dwattr $C$DW$1667, DW_AT_name("AIODIR")
   12818                      .dwattr $C$DW$1667, DW_AT_TI_symbol_name("_AIODIR")
   12819                      .dwattr $C$DW$1667, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   12820                      .dwattr $C$DW$1667, DW_AT_accessibility(DW_ACCESS_public)
   12821              
   12822              $C$DW$1668      .dwtag  DW_TAG_member
   12823                      .dwattr $C$DW$1668, DW_AT_type(*$C$DW$T$41)
   12824                      .dwattr $C$DW$1668, DW_AT_name("rsvd_6")
   12825                      .dwattr $C$DW$1668, DW_AT_TI_symbol_name("_rsvd_6")
   12826                      .dwattr $C$DW$1668, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   12827                      .dwattr $C$DW$1668, DW_AT_accessibility(DW_ACCESS_public)
   12828              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  243

   12829              $C$DW$1669      .dwtag  DW_TAG_member
   12830                      .dwattr $C$DW$1669, DW_AT_type(*$C$DW$T$39)
   12831                      .dwattr $C$DW$1669, DW_AT_name("GPADAT")
   12832                      .dwattr $C$DW$1669, DW_AT_TI_symbol_name("_GPADAT")
   12833                      .dwattr $C$DW$1669, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   12834                      .dwattr $C$DW$1669, DW_AT_accessibility(DW_ACCESS_public)
   12835              
   12836              $C$DW$1670      .dwtag  DW_TAG_member
   12837                      .dwattr $C$DW$1670, DW_AT_type(*$C$DW$T$39)
   12838                      .dwattr $C$DW$1670, DW_AT_name("GPASET")
   12839                      .dwattr $C$DW$1670, DW_AT_TI_symbol_name("_GPASET")
   12840                      .dwattr $C$DW$1670, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   12841                      .dwattr $C$DW$1670, DW_AT_accessibility(DW_ACCESS_public)
   12842              
   12843              $C$DW$1671      .dwtag  DW_TAG_member
   12844                      .dwattr $C$DW$1671, DW_AT_type(*$C$DW$T$39)
   12845                      .dwattr $C$DW$1671, DW_AT_name("GPACLEAR")
   12846                      .dwattr $C$DW$1671, DW_AT_TI_symbol_name("_GPACLEAR")
   12847                      .dwattr $C$DW$1671, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   12848                      .dwattr $C$DW$1671, DW_AT_accessibility(DW_ACCESS_public)
   12849              
   12850              $C$DW$1672      .dwtag  DW_TAG_member
   12851                      .dwattr $C$DW$1672, DW_AT_type(*$C$DW$T$39)
   12852                      .dwattr $C$DW$1672, DW_AT_name("GPATOGGLE")
   12853                      .dwattr $C$DW$1672, DW_AT_TI_symbol_name("_GPATOGGLE")
   12854                      .dwattr $C$DW$1672, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   12855                      .dwattr $C$DW$1672, DW_AT_accessibility(DW_ACCESS_public)
   12856              
   12857              $C$DW$1673      .dwtag  DW_TAG_member
   12858                      .dwattr $C$DW$1673, DW_AT_type(*$C$DW$T$39)
   12859                      .dwattr $C$DW$1673, DW_AT_name("GPBDAT")
   12860                      .dwattr $C$DW$1673, DW_AT_TI_symbol_name("_GPBDAT")
   12861                      .dwattr $C$DW$1673, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   12862                      .dwattr $C$DW$1673, DW_AT_accessibility(DW_ACCESS_public)
   12863              
   12864              $C$DW$1674      .dwtag  DW_TAG_member
   12865                      .dwattr $C$DW$1674, DW_AT_type(*$C$DW$T$39)
   12866                      .dwattr $C$DW$1674, DW_AT_name("GPBSET")
   12867                      .dwattr $C$DW$1674, DW_AT_TI_symbol_name("_GPBSET")
   12868                      .dwattr $C$DW$1674, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   12869                      .dwattr $C$DW$1674, DW_AT_accessibility(DW_ACCESS_public)
   12870              
   12871              $C$DW$1675      .dwtag  DW_TAG_member
   12872                      .dwattr $C$DW$1675, DW_AT_type(*$C$DW$T$39)
   12873                      .dwattr $C$DW$1675, DW_AT_name("GPBCLEAR")
   12874                      .dwattr $C$DW$1675, DW_AT_TI_symbol_name("_GPBCLEAR")
   12875                      .dwattr $C$DW$1675, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   12876                      .dwattr $C$DW$1675, DW_AT_accessibility(DW_ACCESS_public)
   12877              
   12878              $C$DW$1676      .dwtag  DW_TAG_member
   12879                      .dwattr $C$DW$1676, DW_AT_type(*$C$DW$T$39)
   12880                      .dwattr $C$DW$1676, DW_AT_name("GPBTOGGLE")
   12881                      .dwattr $C$DW$1676, DW_AT_TI_symbol_name("_GPBTOGGLE")
   12882                      .dwattr $C$DW$1676, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   12883                      .dwattr $C$DW$1676, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  244

   12884              
   12885              $C$DW$1677      .dwtag  DW_TAG_member
   12886                      .dwattr $C$DW$1677, DW_AT_type(*$C$DW$T$31)
   12887                      .dwattr $C$DW$1677, DW_AT_name("rsvd_7")
   12888                      .dwattr $C$DW$1677, DW_AT_TI_symbol_name("_rsvd_7")
   12889                      .dwattr $C$DW$1677, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   12890                      .dwattr $C$DW$1677, DW_AT_accessibility(DW_ACCESS_public)
   12891              
   12892              $C$DW$1678      .dwtag  DW_TAG_member
   12893                      .dwattr $C$DW$1678, DW_AT_type(*$C$DW$T$39)
   12894                      .dwattr $C$DW$1678, DW_AT_name("AIODAT")
   12895                      .dwattr $C$DW$1678, DW_AT_TI_symbol_name("_AIODAT")
   12896                      .dwattr $C$DW$1678, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   12897                      .dwattr $C$DW$1678, DW_AT_accessibility(DW_ACCESS_public)
   12898              
   12899              $C$DW$1679      .dwtag  DW_TAG_member
   12900                      .dwattr $C$DW$1679, DW_AT_type(*$C$DW$T$39)
   12901                      .dwattr $C$DW$1679, DW_AT_name("AIOSET")
   12902                      .dwattr $C$DW$1679, DW_AT_TI_symbol_name("_AIOSET")
   12903                      .dwattr $C$DW$1679, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   12904                      .dwattr $C$DW$1679, DW_AT_accessibility(DW_ACCESS_public)
   12905              
   12906              $C$DW$1680      .dwtag  DW_TAG_member
   12907                      .dwattr $C$DW$1680, DW_AT_type(*$C$DW$T$39)
   12908                      .dwattr $C$DW$1680, DW_AT_name("AIOCLEAR")
   12909                      .dwattr $C$DW$1680, DW_AT_TI_symbol_name("_AIOCLEAR")
   12910                      .dwattr $C$DW$1680, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   12911                      .dwattr $C$DW$1680, DW_AT_accessibility(DW_ACCESS_public)
   12912              
   12913              $C$DW$1681      .dwtag  DW_TAG_member
   12914                      .dwattr $C$DW$1681, DW_AT_type(*$C$DW$T$39)
   12915                      .dwattr $C$DW$1681, DW_AT_name("AIOTOGGLE")
   12916                      .dwattr $C$DW$1681, DW_AT_TI_symbol_name("_AIOTOGGLE")
   12917                      .dwattr $C$DW$1681, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   12918                      .dwattr $C$DW$1681, DW_AT_accessibility(DW_ACCESS_public)
   12919              
   12920              $C$DW$1682      .dwtag  DW_TAG_member
   12921                      .dwattr $C$DW$1682, DW_AT_type(*$C$DW$T$28)
   12922                      .dwattr $C$DW$1682, DW_AT_name("GPIOXINTnSEL")
   12923                      .dwattr $C$DW$1682, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   12924                      .dwattr $C$DW$1682, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   12925                      .dwattr $C$DW$1682, DW_AT_accessibility(DW_ACCESS_public)
   12926              
   12927              $C$DW$1683      .dwtag  DW_TAG_member
   12928                      .dwattr $C$DW$1683, DW_AT_type(*$C$DW$T$27)
   12929                      .dwattr $C$DW$1683, DW_AT_name("rsvd_8")
   12930                      .dwattr $C$DW$1683, DW_AT_TI_symbol_name("_rsvd_8")
   12931                      .dwattr $C$DW$1683, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   12932                      .dwattr $C$DW$1683, DW_AT_accessibility(DW_ACCESS_public)
   12933              
   12934              $C$DW$1684      .dwtag  DW_TAG_member
   12935                      .dwattr $C$DW$1684, DW_AT_type(*$C$DW$T$39)
   12936                      .dwattr $C$DW$1684, DW_AT_name("GPIOLPMSEL")
   12937                      .dwattr $C$DW$1684, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   12938                      .dwattr $C$DW$1684, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  245

   12939                      .dwattr $C$DW$1684, DW_AT_accessibility(DW_ACCESS_public)
   12940              
   12941                      .dwendtag $C$DW$T$42
   12942              
   12943              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
   12944                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
   12945                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
   12946              
   12947              $C$DW$T$59      .dwtag  DW_TAG_typedef
   12948                      .dwattr $C$DW$T$59, DW_AT_name("GPIO_Handle")
   12949                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   12950                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   12951              
   12952              
   12953              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   12954                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
   12955                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x0e)
   12956              $C$DW$1685      .dwtag  DW_TAG_member
   12957                      .dwattr $C$DW$1685, DW_AT_type(*$C$DW$T$43)
   12958                      .dwattr $C$DW$1685, DW_AT_name("I")
   12959                      .dwattr $C$DW$1685, DW_AT_TI_symbol_name("_I")
   12960                      .dwattr $C$DW$1685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12961                      .dwattr $C$DW$1685, DW_AT_accessibility(DW_ACCESS_public)
   12962              
   12963              $C$DW$1686      .dwtag  DW_TAG_member
   12964                      .dwattr $C$DW$1686, DW_AT_type(*$C$DW$T$43)
   12965                      .dwattr $C$DW$1686, DW_AT_name("V")
   12966                      .dwattr $C$DW$1686, DW_AT_TI_symbol_name("_V")
   12967                      .dwattr $C$DW$1686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12968                      .dwattr $C$DW$1686, DW_AT_accessibility(DW_ACCESS_public)
   12969              
   12970              $C$DW$1687      .dwtag  DW_TAG_member
   12971                      .dwattr $C$DW$1687, DW_AT_type(*$C$DW$T$35)
   12972                      .dwattr $C$DW$1687, DW_AT_name("dcBus")
   12973                      .dwattr $C$DW$1687, DW_AT_TI_symbol_name("_dcBus")
   12974                      .dwattr $C$DW$1687, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12975                      .dwattr $C$DW$1687, DW_AT_accessibility(DW_ACCESS_public)
   12976              
   12977                      .dwendtag $C$DW$T$44
   12978              
   12979              $C$DW$T$83      .dwtag  DW_TAG_typedef
   12980                      .dwattr $C$DW$T$83, DW_AT_name("HAL_AdcData_t")
   12981                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$44)
   12982                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
   12983              
   12984              
   12985              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   12986                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
   12987                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
   12988              $C$DW$1688      .dwtag  DW_TAG_member
   12989                      .dwattr $C$DW$1688, DW_AT_type(*$C$DW$T$22)
   12990                      .dwattr $C$DW$1688, DW_AT_name("PeriodMax")
   12991                      .dwattr $C$DW$1688, DW_AT_TI_symbol_name("_PeriodMax")
   12992                      .dwattr $C$DW$1688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12993                      .dwattr $C$DW$1688, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  246

   12994              
   12995              $C$DW$1689      .dwtag  DW_TAG_member
   12996                      .dwattr $C$DW$1689, DW_AT_type(*$C$DW$T$47)
   12997                      .dwattr $C$DW$1689, DW_AT_name("ptrData")
   12998                      .dwattr $C$DW$1689, DW_AT_TI_symbol_name("_ptrData")
   12999                      .dwattr $C$DW$1689, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13000                      .dwattr $C$DW$1689, DW_AT_accessibility(DW_ACCESS_public)
   13001              
   13002              $C$DW$1690      .dwtag  DW_TAG_member
   13003                      .dwattr $C$DW$1690, DW_AT_type(*$C$DW$T$48)
   13004                      .dwattr $C$DW$1690, DW_AT_name("value")
   13005                      .dwattr $C$DW$1690, DW_AT_TI_symbol_name("_value")
   13006                      .dwattr $C$DW$1690, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13007                      .dwattr $C$DW$1690, DW_AT_accessibility(DW_ACCESS_public)
   13008              
   13009              $C$DW$1691      .dwtag  DW_TAG_member
   13010                      .dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$48)
   13011                      .dwattr $C$DW$1691, DW_AT_name("offset")
   13012                      .dwattr $C$DW$1691, DW_AT_TI_symbol_name("_offset")
   13013                      .dwattr $C$DW$1691, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13014                      .dwattr $C$DW$1691, DW_AT_accessibility(DW_ACCESS_public)
   13015              
   13016              $C$DW$1692      .dwtag  DW_TAG_member
   13017                      .dwattr $C$DW$1692, DW_AT_type(*$C$DW$T$48)
   13018                      .dwattr $C$DW$1692, DW_AT_name("gain")
   13019                      .dwattr $C$DW$1692, DW_AT_TI_symbol_name("_gain")
   13020                      .dwattr $C$DW$1692, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13021                      .dwattr $C$DW$1692, DW_AT_accessibility(DW_ACCESS_public)
   13022              
   13023                      .dwendtag $C$DW$T$49
   13024              
   13025              $C$DW$T$312     .dwtag  DW_TAG_typedef
   13026                      .dwattr $C$DW$T$312, DW_AT_name("HAL_DacData_t")
   13027                      .dwattr $C$DW$T$312, DW_AT_type(*$C$DW$T$49)
   13028                      .dwattr $C$DW$T$312, DW_AT_language(DW_LANG_C)
   13029              
   13030              $C$DW$T$313     .dwtag  DW_TAG_pointer_type
   13031                      .dwattr $C$DW$T$313, DW_AT_type(*$C$DW$T$312)
   13032                      .dwattr $C$DW$T$313, DW_AT_address_class(0x20)
   13033              
   13034              $C$DW$1693      .dwtag  DW_TAG_TI_far_type
   13035                      .dwattr $C$DW$1693, DW_AT_type(*$C$DW$T$313)
   13036              
   13037              $C$DW$T$314     .dwtag  DW_TAG_const_type
   13038                      .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$1693)
   13039              
   13040              
   13041              $C$DW$T$84      .dwtag  DW_TAG_structure_type
   13042                      .dwattr $C$DW$T$84, DW_AT_name("_HAL_Obj_")
   13043                      .dwattr $C$DW$T$84, DW_AT_byte_size(0xa8)
   13044              $C$DW$1694      .dwtag  DW_TAG_member
   13045                      .dwattr $C$DW$1694, DW_AT_type(*$C$DW$T$51)
   13046                      .dwattr $C$DW$1694, DW_AT_name("adcHandle")
   13047                      .dwattr $C$DW$1694, DW_AT_TI_symbol_name("_adcHandle")
   13048                      .dwattr $C$DW$1694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  247

   13049                      .dwattr $C$DW$1694, DW_AT_accessibility(DW_ACCESS_public)
   13050              
   13051              $C$DW$1695      .dwtag  DW_TAG_member
   13052                      .dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$53)
   13053                      .dwattr $C$DW$1695, DW_AT_name("clkHandle")
   13054                      .dwattr $C$DW$1695, DW_AT_TI_symbol_name("_clkHandle")
   13055                      .dwattr $C$DW$1695, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13056                      .dwattr $C$DW$1695, DW_AT_accessibility(DW_ACCESS_public)
   13057              
   13058              $C$DW$1696      .dwtag  DW_TAG_member
   13059                      .dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$55)
   13060                      .dwattr $C$DW$1696, DW_AT_name("cpuHandle")
   13061                      .dwattr $C$DW$1696, DW_AT_TI_symbol_name("_cpuHandle")
   13062                      .dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13063                      .dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
   13064              
   13065              $C$DW$1697      .dwtag  DW_TAG_member
   13066                      .dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$57)
   13067                      .dwattr $C$DW$1697, DW_AT_name("flashHandle")
   13068                      .dwattr $C$DW$1697, DW_AT_TI_symbol_name("_flashHandle")
   13069                      .dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13070                      .dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
   13071              
   13072              $C$DW$1698      .dwtag  DW_TAG_member
   13073                      .dwattr $C$DW$1698, DW_AT_type(*$C$DW$T$59)
   13074                      .dwattr $C$DW$1698, DW_AT_name("gpioHandle")
   13075                      .dwattr $C$DW$1698, DW_AT_TI_symbol_name("_gpioHandle")
   13076                      .dwattr $C$DW$1698, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13077                      .dwattr $C$DW$1698, DW_AT_accessibility(DW_ACCESS_public)
   13078              
   13079              $C$DW$1699      .dwtag  DW_TAG_member
   13080                      .dwattr $C$DW$1699, DW_AT_type(*$C$DW$T$62)
   13081                      .dwattr $C$DW$1699, DW_AT_name("offsetHandle_I")
   13082                      .dwattr $C$DW$1699, DW_AT_TI_symbol_name("_offsetHandle_I")
   13083                      .dwattr $C$DW$1699, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13084                      .dwattr $C$DW$1699, DW_AT_accessibility(DW_ACCESS_public)
   13085              
   13086              $C$DW$1700      .dwtag  DW_TAG_member
   13087                      .dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$64)
   13088                      .dwattr $C$DW$1700, DW_AT_name("offset_I")
   13089                      .dwattr $C$DW$1700, DW_AT_TI_symbol_name("_offset_I")
   13090                      .dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13091                      .dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
   13092              
   13093              $C$DW$1701      .dwtag  DW_TAG_member
   13094                      .dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$62)
   13095                      .dwattr $C$DW$1701, DW_AT_name("offsetHandle_V")
   13096                      .dwattr $C$DW$1701, DW_AT_TI_symbol_name("_offsetHandle_V")
   13097                      .dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   13098                      .dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
   13099              
   13100              $C$DW$1702      .dwtag  DW_TAG_member
   13101                      .dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$64)
   13102                      .dwattr $C$DW$1702, DW_AT_name("offset_V")
   13103                      .dwattr $C$DW$1702, DW_AT_TI_symbol_name("_offset_V")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  248

   13104                      .dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   13105                      .dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
   13106              
   13107              $C$DW$1703      .dwtag  DW_TAG_member
   13108                      .dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$66)
   13109                      .dwattr $C$DW$1703, DW_AT_name("oscHandle")
   13110                      .dwattr $C$DW$1703, DW_AT_TI_symbol_name("_oscHandle")
   13111                      .dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   13112                      .dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
   13113              
   13114              $C$DW$1704      .dwtag  DW_TAG_member
   13115                      .dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$68)
   13116                      .dwattr $C$DW$1704, DW_AT_name("pieHandle")
   13117                      .dwattr $C$DW$1704, DW_AT_TI_symbol_name("_pieHandle")
   13118                      .dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   13119                      .dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
   13120              
   13121              $C$DW$1705      .dwtag  DW_TAG_member
   13122                      .dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$70)
   13123                      .dwattr $C$DW$1705, DW_AT_name("pllHandle")
   13124                      .dwattr $C$DW$1705, DW_AT_TI_symbol_name("_pllHandle")
   13125                      .dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   13126                      .dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
   13127              
   13128              $C$DW$1706      .dwtag  DW_TAG_member
   13129                      .dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$73)
   13130                      .dwattr $C$DW$1706, DW_AT_name("pwmHandle")
   13131                      .dwattr $C$DW$1706, DW_AT_TI_symbol_name("_pwmHandle")
   13132                      .dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   13133                      .dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
   13134              
   13135              $C$DW$1707      .dwtag  DW_TAG_member
   13136                      .dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$73)
   13137                      .dwattr $C$DW$1707, DW_AT_name("pwmDacHandle")
   13138                      .dwattr $C$DW$1707, DW_AT_TI_symbol_name("_pwmDacHandle")
   13139                      .dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   13140                      .dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
   13141              
   13142              $C$DW$1708      .dwtag  DW_TAG_member
   13143                      .dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$75)
   13144                      .dwattr $C$DW$1708, DW_AT_name("pwrHandle")
   13145                      .dwattr $C$DW$1708, DW_AT_TI_symbol_name("_pwrHandle")
   13146                      .dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   13147                      .dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
   13148              
   13149              $C$DW$1709      .dwtag  DW_TAG_member
   13150                      .dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$78)
   13151                      .dwattr $C$DW$1709, DW_AT_name("timerHandle")
   13152                      .dwattr $C$DW$1709, DW_AT_TI_symbol_name("_timerHandle")
   13153                      .dwattr $C$DW$1709, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   13154                      .dwattr $C$DW$1709, DW_AT_accessibility(DW_ACCESS_public)
   13155              
   13156              $C$DW$1710      .dwtag  DW_TAG_member
   13157                      .dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$80)
   13158                      .dwattr $C$DW$1710, DW_AT_name("i2cHandle")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  249

   13159                      .dwattr $C$DW$1710, DW_AT_TI_symbol_name("_i2cHandle")
   13160                      .dwattr $C$DW$1710, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   13161                      .dwattr $C$DW$1710, DW_AT_accessibility(DW_ACCESS_public)
   13162              
   13163              $C$DW$1711      .dwtag  DW_TAG_member
   13164                      .dwattr $C$DW$1711, DW_AT_type(*$C$DW$T$82)
   13165                      .dwattr $C$DW$1711, DW_AT_name("wdogHandle")
   13166                      .dwattr $C$DW$1711, DW_AT_TI_symbol_name("_wdogHandle")
   13167                      .dwattr $C$DW$1711, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   13168                      .dwattr $C$DW$1711, DW_AT_accessibility(DW_ACCESS_public)
   13169              
   13170              $C$DW$1712      .dwtag  DW_TAG_member
   13171                      .dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$83)
   13172                      .dwattr $C$DW$1712, DW_AT_name("adcBias")
   13173                      .dwattr $C$DW$1712, DW_AT_TI_symbol_name("_adcBias")
   13174                      .dwattr $C$DW$1712, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   13175                      .dwattr $C$DW$1712, DW_AT_accessibility(DW_ACCESS_public)
   13176              
   13177              $C$DW$1713      .dwtag  DW_TAG_member
   13178                      .dwattr $C$DW$1713, DW_AT_type(*$C$DW$T$35)
   13179                      .dwattr $C$DW$1713, DW_AT_name("current_sf")
   13180                      .dwattr $C$DW$1713, DW_AT_TI_symbol_name("_current_sf")
   13181                      .dwattr $C$DW$1713, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
   13182                      .dwattr $C$DW$1713, DW_AT_accessibility(DW_ACCESS_public)
   13183              
   13184              $C$DW$1714      .dwtag  DW_TAG_member
   13185                      .dwattr $C$DW$1714, DW_AT_type(*$C$DW$T$35)
   13186                      .dwattr $C$DW$1714, DW_AT_name("voltage_sf")
   13187                      .dwattr $C$DW$1714, DW_AT_TI_symbol_name("_voltage_sf")
   13188                      .dwattr $C$DW$1714, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
   13189                      .dwattr $C$DW$1714, DW_AT_accessibility(DW_ACCESS_public)
   13190              
   13191              $C$DW$1715      .dwtag  DW_TAG_member
   13192                      .dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$33)
   13193                      .dwattr $C$DW$1715, DW_AT_name("numCurrentSensors")
   13194                      .dwattr $C$DW$1715, DW_AT_TI_symbol_name("_numCurrentSensors")
   13195                      .dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
   13196                      .dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
   13197              
   13198              $C$DW$1716      .dwtag  DW_TAG_member
   13199                      .dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$33)
   13200                      .dwattr $C$DW$1716, DW_AT_name("numVoltageSensors")
   13201                      .dwattr $C$DW$1716, DW_AT_TI_symbol_name("_numVoltageSensors")
   13202                      .dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0xa7]
   13203                      .dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
   13204              
   13205                      .dwendtag $C$DW$T$84
   13206              
   13207              $C$DW$T$317     .dwtag  DW_TAG_typedef
   13208                      .dwattr $C$DW$T$317, DW_AT_name("HAL_Obj")
   13209                      .dwattr $C$DW$T$317, DW_AT_type(*$C$DW$T$84)
   13210                      .dwattr $C$DW$T$317, DW_AT_language(DW_LANG_C)
   13211              
   13212              $C$DW$T$318     .dwtag  DW_TAG_pointer_type
   13213                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$T$317)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  250

   13214                      .dwattr $C$DW$T$318, DW_AT_address_class(0x20)
   13215              
   13216              $C$DW$T$319     .dwtag  DW_TAG_pointer_type
   13217                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$T$84)
   13218                      .dwattr $C$DW$T$319, DW_AT_address_class(0x20)
   13219              
   13220              $C$DW$T$320     .dwtag  DW_TAG_typedef
   13221                      .dwattr $C$DW$T$320, DW_AT_name("HAL_Handle")
   13222                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$T$319)
   13223                      .dwattr $C$DW$T$320, DW_AT_language(DW_LANG_C)
   13224              
   13225              $C$DW$1717      .dwtag  DW_TAG_TI_far_type
   13226                      .dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$320)
   13227              
   13228              $C$DW$T$321     .dwtag  DW_TAG_const_type
   13229                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$1717)
   13230              
   13231              
   13232              $C$DW$T$86      .dwtag  DW_TAG_structure_type
   13233                      .dwattr $C$DW$T$86, DW_AT_name("_MATH_vec3_")
   13234                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x06)
   13235              $C$DW$1718      .dwtag  DW_TAG_member
   13236                      .dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$85)
   13237                      .dwattr $C$DW$1718, DW_AT_name("value")
   13238                      .dwattr $C$DW$1718, DW_AT_TI_symbol_name("_value")
   13239                      .dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13240                      .dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
   13241              
   13242                      .dwendtag $C$DW$T$86
   13243              
   13244              $C$DW$T$43      .dwtag  DW_TAG_typedef
   13245                      .dwattr $C$DW$T$43, DW_AT_name("MATH_vec3")
   13246                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$86)
   13247                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   13248              
   13249              
   13250              $C$DW$T$90      .dwtag  DW_TAG_structure_type
   13251                      .dwattr $C$DW$T$90, DW_AT_name("_OFFSET_")
   13252                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x10)
   13253              $C$DW$1719      .dwtag  DW_TAG_member
   13254                      .dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$35)
   13255                      .dwattr $C$DW$1719, DW_AT_name("value")
   13256                      .dwattr $C$DW$1719, DW_AT_TI_symbol_name("_value")
   13257                      .dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13258                      .dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
   13259              
   13260              $C$DW$1720      .dwtag  DW_TAG_member
   13261                      .dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$35)
   13262                      .dwattr $C$DW$1720, DW_AT_name("bias")
   13263                      .dwattr $C$DW$1720, DW_AT_TI_symbol_name("_bias")
   13264                      .dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13265                      .dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
   13266              
   13267              $C$DW$1721      .dwtag  DW_TAG_member
   13268                      .dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$87)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  251

   13269                      .dwattr $C$DW$1721, DW_AT_name("filter")
   13270                      .dwattr $C$DW$1721, DW_AT_TI_symbol_name("_filter")
   13271                      .dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13272                      .dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
   13273              
   13274              $C$DW$1722      .dwtag  DW_TAG_member
   13275                      .dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$89)
   13276                      .dwattr $C$DW$1722, DW_AT_name("filterHandle")
   13277                      .dwattr $C$DW$1722, DW_AT_TI_symbol_name("_filterHandle")
   13278                      .dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13279                      .dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
   13280              
   13281                      .dwendtag $C$DW$T$90
   13282              
   13283              $C$DW$T$63      .dwtag  DW_TAG_typedef
   13284                      .dwattr $C$DW$T$63, DW_AT_name("OFFSET_Obj")
   13285                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$90)
   13286                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   13287              
   13288              
   13289              $C$DW$T$64      .dwtag  DW_TAG_array_type
   13290                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   13291                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   13292                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   13293              $C$DW$1723      .dwtag  DW_TAG_subrange_type
   13294                      .dwattr $C$DW$1723, DW_AT_upper_bound(0x02)
   13295              
   13296                      .dwendtag $C$DW$T$64
   13297              
   13298              
   13299              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   13300                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   13301                      .dwattr $C$DW$T$21, DW_AT_declaration
   13302                      .dwendtag $C$DW$T$21
   13303              
   13304              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   13305                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   13306                      .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
   13307              
   13308              $C$DW$T$61      .dwtag  DW_TAG_typedef
   13309                      .dwattr $C$DW$T$61, DW_AT_name("OFFSET_Handle")
   13310                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   13311                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   13312              
   13313              
   13314              $C$DW$T$62      .dwtag  DW_TAG_array_type
   13315                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   13316                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   13317                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   13318              $C$DW$1724      .dwtag  DW_TAG_subrange_type
   13319                      .dwattr $C$DW$1724, DW_AT_upper_bound(0x02)
   13320              
   13321                      .dwendtag $C$DW$T$62
   13322              
   13323              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  252

   13324              $C$DW$T$91      .dwtag  DW_TAG_structure_type
   13325                      .dwattr $C$DW$T$91, DW_AT_name("_OSC_Obj_")
   13326                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x03)
   13327              $C$DW$1725      .dwtag  DW_TAG_member
   13328                      .dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$23)
   13329                      .dwattr $C$DW$1725, DW_AT_name("INTOSC1TRIM")
   13330                      .dwattr $C$DW$1725, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   13331                      .dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13332                      .dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
   13333              
   13334              $C$DW$1726      .dwtag  DW_TAG_member
   13335                      .dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$23)
   13336                      .dwattr $C$DW$1726, DW_AT_name("rsvd_1")
   13337                      .dwattr $C$DW$1726, DW_AT_TI_symbol_name("_rsvd_1")
   13338                      .dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13339                      .dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
   13340              
   13341              $C$DW$1727      .dwtag  DW_TAG_member
   13342                      .dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$23)
   13343                      .dwattr $C$DW$1727, DW_AT_name("INTOSC2TRIM")
   13344                      .dwattr $C$DW$1727, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   13345                      .dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13346                      .dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
   13347              
   13348                      .dwendtag $C$DW$T$91
   13349              
   13350              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   13351                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$91)
   13352                      .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
   13353              
   13354              $C$DW$T$66      .dwtag  DW_TAG_typedef
   13355                      .dwattr $C$DW$T$66, DW_AT_name("OSC_Handle")
   13356                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   13357                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   13358              
   13359              
   13360              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   13361                      .dwattr $C$DW$T$92, DW_AT_name("_PIE_IERIFR_t")
   13362                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
   13363              $C$DW$1728      .dwtag  DW_TAG_member
   13364                      .dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$23)
   13365                      .dwattr $C$DW$1728, DW_AT_name("IER")
   13366                      .dwattr $C$DW$1728, DW_AT_TI_symbol_name("_IER")
   13367                      .dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13368                      .dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
   13369              
   13370              $C$DW$1729      .dwtag  DW_TAG_member
   13371                      .dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$23)
   13372                      .dwattr $C$DW$1729, DW_AT_name("IFR")
   13373                      .dwattr $C$DW$1729, DW_AT_TI_symbol_name("_IFR")
   13374                      .dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13375                      .dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
   13376              
   13377                      .dwendtag $C$DW$T$92
   13378              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  253

   13379              $C$DW$T$93      .dwtag  DW_TAG_typedef
   13380                      .dwattr $C$DW$T$93, DW_AT_name("PIE_IERIFR_t")
   13381                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   13382                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   13383              
   13384              $C$DW$1730      .dwtag  DW_TAG_TI_far_type
   13385                      .dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$93)
   13386              
   13387              $C$DW$T$94      .dwtag  DW_TAG_volatile_type
   13388                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$1730)
   13389              
   13390              
   13391              $C$DW$T$95      .dwtag  DW_TAG_array_type
   13392                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   13393                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   13394                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x18)
   13395              $C$DW$1731      .dwtag  DW_TAG_subrange_type
   13396                      .dwattr $C$DW$1731, DW_AT_upper_bound(0x0b)
   13397              
   13398                      .dwendtag $C$DW$T$95
   13399              
   13400              
   13401              $C$DW$T$102     .dwtag  DW_TAG_structure_type
   13402                      .dwattr $C$DW$T$102, DW_AT_name("_PIE_Obj_")
   13403                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x639c)
   13404              $C$DW$1732      .dwtag  DW_TAG_member
   13405                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$23)
   13406                      .dwattr $C$DW$1732, DW_AT_name("PIECTRL")
   13407                      .dwattr $C$DW$1732, DW_AT_TI_symbol_name("_PIECTRL")
   13408                      .dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13409                      .dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
   13410              
   13411              $C$DW$1733      .dwtag  DW_TAG_member
   13412                      .dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$23)
   13413                      .dwattr $C$DW$1733, DW_AT_name("PIEACK")
   13414                      .dwattr $C$DW$1733, DW_AT_TI_symbol_name("_PIEACK")
   13415                      .dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13416                      .dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
   13417              
   13418              $C$DW$1734      .dwtag  DW_TAG_member
   13419                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$95)
   13420                      .dwattr $C$DW$1734, DW_AT_name("PIEIER_PIEIFR")
   13421                      .dwattr $C$DW$1734, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   13422                      .dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13423                      .dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
   13424              
   13425              $C$DW$1735      .dwtag  DW_TAG_member
   13426                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$96)
   13427                      .dwattr $C$DW$1735, DW_AT_name("rsvd_1")
   13428                      .dwattr $C$DW$1735, DW_AT_TI_symbol_name("_rsvd_1")
   13429                      .dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13430                      .dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
   13431              
   13432              $C$DW$1736      .dwtag  DW_TAG_member
   13433                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$100)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  254

   13434                      .dwattr $C$DW$1736, DW_AT_name("Reset")
   13435                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_Reset")
   13436                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   13437                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
   13438              
   13439              $C$DW$1737      .dwtag  DW_TAG_member
   13440                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$100)
   13441                      .dwattr $C$DW$1737, DW_AT_name("INT1")
   13442                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_INT1")
   13443                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   13444                      .dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
   13445              
   13446              $C$DW$1738      .dwtag  DW_TAG_member
   13447                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$100)
   13448                      .dwattr $C$DW$1738, DW_AT_name("INT2")
   13449                      .dwattr $C$DW$1738, DW_AT_TI_symbol_name("_INT2")
   13450                      .dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   13451                      .dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
   13452              
   13453              $C$DW$1739      .dwtag  DW_TAG_member
   13454                      .dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$100)
   13455                      .dwattr $C$DW$1739, DW_AT_name("INT3")
   13456                      .dwattr $C$DW$1739, DW_AT_TI_symbol_name("_INT3")
   13457                      .dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   13458                      .dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
   13459              
   13460              $C$DW$1740      .dwtag  DW_TAG_member
   13461                      .dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$100)
   13462                      .dwattr $C$DW$1740, DW_AT_name("INT4")
   13463                      .dwattr $C$DW$1740, DW_AT_TI_symbol_name("_INT4")
   13464                      .dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   13465                      .dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
   13466              
   13467              $C$DW$1741      .dwtag  DW_TAG_member
   13468                      .dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$100)
   13469                      .dwattr $C$DW$1741, DW_AT_name("INT5")
   13470                      .dwattr $C$DW$1741, DW_AT_TI_symbol_name("_INT5")
   13471                      .dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   13472                      .dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
   13473              
   13474              $C$DW$1742      .dwtag  DW_TAG_member
   13475                      .dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$100)
   13476                      .dwattr $C$DW$1742, DW_AT_name("INT6")
   13477                      .dwattr $C$DW$1742, DW_AT_TI_symbol_name("_INT6")
   13478                      .dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   13479                      .dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
   13480              
   13481              $C$DW$1743      .dwtag  DW_TAG_member
   13482                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$100)
   13483                      .dwattr $C$DW$1743, DW_AT_name("INT7")
   13484                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_INT7")
   13485                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   13486                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
   13487              
   13488              $C$DW$1744      .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05828FhhQTc                                                     PAGE  255

   13489                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$100)
