TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:23:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/050905etGEi                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.3.LTS *
       3              ;* Date/Time created: Tue Jul  4 14:23:07 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("/home/wmj/Documents/my_motor/sw/drivers/i2c/src/32b/f28x/f2802x/i2c.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.3.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/home/wmj/Documents/my_motor/sw/solutions/instaspin_foc/boards/hvki
      13              ;       /mnt/eda_tools/ti/ccsv6/tools/compiler/c2000_15.12.3.LTS/bin/opt2000 /tmp/05090DH9twI /tmp/05090VDYwy

    2139                      .dwattr $C$DW$188, DW_AT_name("I2C_Control_Burst_TX_Stop")
    2140                      .dwattr $C$DW$188, DW_AT_const_value(0xe00)
    2141              
    2142              $C$DW$189       .dwtag  DW_TAG_enumerator
    2143                      .dwattr $C$DW$189, DW_AT_name("I2C_Control_Burst_RX_Start")
    2144                      .dwattr $C$DW$189, DW_AT_const_value(0x2400)
    2145              
    2146              $C$DW$190       .dwtag  DW_TAG_enumerator
    2147                      .dwattr $C$DW$190, DW_AT_name("I2C_Control_Burst_RX_Stop")
    2148                      .dwattr $C$DW$190, DW_AT_const_value(0xc00)
    2149              
    2150                      .dwendtag $C$DW$T$38
    2151              
    2152              $C$DW$T$39      .dwtag  DW_TAG_typedef
    2153                      .dwattr $C$DW$T$39, DW_AT_name("I2C_Control_e")
    2154                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2155                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2156              
    2157              $C$DW$191       .dwtag  DW_TAG_TI_far_type
    2158                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:23:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/050905etGEi                                                     PAGE   41

    2159              
    2160              $C$DW$T$40      .dwtag  DW_TAG_const_type
    2161                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$191)
    2162              
    2163              
    2164              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    2165                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2166              $C$DW$192       .dwtag  DW_TAG_enumerator
    2167                      .dwattr $C$DW$192, DW_AT_name("I2C_BitCount_1_Bit")
    2168                      .dwattr $C$DW$192, DW_AT_const_value(0x01)
    2169              
    2170              $C$DW$193       .dwtag  DW_TAG_enumerator
    2171                      .dwattr $C$DW$193, DW_AT_name("I2C_BitCount_2_Bits")
    2172                      .dwattr $C$DW$193, DW_AT_const_value(0x02)
    2173              
    2174              $C$DW$194       .dwtag  DW_TAG_enumerator
    2175                      .dwattr $C$DW$194, DW_AT_name("I2C_BitCount_3_Bits")
    2176                      .dwattr $C$DW$194, DW_AT_const_value(0x03)
    2177              
    2178              $C$DW$195       .dwtag  DW_TAG_enumerator
    2179                      .dwattr $C$DW$195, DW_AT_name("I2C_BitCount_4_Bits")
    2180                      .dwattr $C$DW$195, DW_AT_const_value(0x04)
    2181              
    2182              $C$DW$196       .dwtag  DW_TAG_enumerator
    2183                      .dwattr $C$DW$196, DW_AT_name("I2C_BitCount_5_Bits")
    2184                      .dwattr $C$DW$196, DW_AT_const_value(0x05)
    2185              
    2186              $C$DW$197       .dwtag  DW_TAG_enumerator
    2187                      .dwattr $C$DW$197, DW_AT_name("I2C_BitCount_6_Bits")
    2188                      .dwattr $C$DW$197, DW_AT_const_value(0x06)
    2189              
    2190              $C$DW$198       .dwtag  DW_TAG_enumerator
    2191                      .dwattr $C$DW$198, DW_AT_name("I2C_BitCount_7_Bits")
    2192                      .dwattr $C$DW$198, DW_AT_const_value(0x07)
    2193              
    2194              $C$DW$199       .dwtag  DW_TAG_enumerator
    2195                      .dwattr $C$DW$199, DW_AT_name("I2C_BitCount_8_Bits")
    2196                      .dwattr $C$DW$199, DW_AT_const_value(0x00)
    2197              
    2198                      .dwendtag $C$DW$T$41
    2199              
    2200              $C$DW$T$42      .dwtag  DW_TAG_typedef
    2201                      .dwattr $C$DW$T$42, DW_AT_name("I2C_BitCount_e")
    2202                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2203                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2204              
    2205              
    2206              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2207                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    2208                      .dwattr $C$DW$T$19, DW_AT_declaration
    2209                      .dwendtag $C$DW$T$19
    2210              
    2211              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2212                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$19)
    2213                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:23:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/050905etGEi                                                     PAGE   42

    2214              
    2215              $C$DW$T$30      .dwtag  DW_TAG_typedef
    2216                      .dwattr $C$DW$T$30, DW_AT_name("I2C_Handle")
    2217                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2218                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2219              
    2220              $C$DW$200       .dwtag  DW_TAG_TI_far_type
    2221                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$30)
    2222              
    2223              $C$DW$T$44      .dwtag  DW_TAG_const_type
    2224                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$200)
    2225              
    2226              
    2227              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2228                      .dwattr $C$DW$T$23, DW_AT_name("_I2C_Obj_")
    2229                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x22)
    2230              $C$DW$201       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    2232                      .dwattr $C$DW$201, DW_AT_name("I2COAR")
    2233                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_I2COAR")
    2234                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2235                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2236              
    2237              $C$DW$202       .dwtag  DW_TAG_member
    2238                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    2239                      .dwattr $C$DW$202, DW_AT_name("I2CIER")
    2240                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_I2CIER")
    2241                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2242                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2243              
    2244              $C$DW$203       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$21)
    2246                      .dwattr $C$DW$203, DW_AT_name("I2CSTR")
    2247                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_I2CSTR")
    2248                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2249                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2250              
    2251              $C$DW$204       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$21)
    2253                      .dwattr $C$DW$204, DW_AT_name("I2CCLKL")
    2254                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_I2CCLKL")
    2255                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2256                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2257              
    2258              $C$DW$205       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    2260                      .dwattr $C$DW$205, DW_AT_name("I2CCLKH")
    2261                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_I2CCLKH")
    2262                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2263                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2264              
    2265              $C$DW$206       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$21)
    2267                      .dwattr $C$DW$206, DW_AT_name("I2CCNT")
    2268                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_I2CCNT")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:23:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/050905etGEi                                                     PAGE   43

    2269                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2270                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2271              
    2272              $C$DW$207       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$21)
    2274                      .dwattr $C$DW$207, DW_AT_name("I2CDRR")
    2275                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_I2CDRR")
    2276                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2277                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2278              
    2279              $C$DW$208       .dwtag  DW_TAG_member
    2280                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    2281                      .dwattr $C$DW$208, DW_AT_name("I2CSAR")
    2282                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_I2CSAR")
    2283                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2284                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2285              
    2286              $C$DW$209       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$21)
    2288                      .dwattr $C$DW$209, DW_AT_name("I2CDXR")
    2289                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_I2CDXR")
    2290                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2291                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2292              
    2293              $C$DW$210       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$21)
    2295                      .dwattr $C$DW$210, DW_AT_name("I2CMDR")
    2296                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_I2CMDR")
    2297                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2298                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2299              
    2300              $C$DW$211       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$21)
    2302                      .dwattr $C$DW$211, DW_AT_name("I2CISRC")
    2303                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_I2CISRC")
    2304                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2305                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2306              
    2307              $C$DW$212       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$21)
    2309                      .dwattr $C$DW$212, DW_AT_name("I2CEMDR")
    2310                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_I2CEMDR")
    2311                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2312                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2313              
    2314              $C$DW$213       .dwtag  DW_TAG_member
    2315                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$21)
    2316                      .dwattr $C$DW$213, DW_AT_name("I2CPSC")
    2317                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_I2CPSC")
    2318                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2319                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2320              
    2321              $C$DW$214       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$22)
    2323                      .dwattr $C$DW$214, DW_AT_name("rsvd_1")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:23:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/050905etGEi                                                     PAGE   44

    2324                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd_1")
    2325                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2326                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2327              
    2328              $C$DW$215       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$21)
    2330                      .dwattr $C$DW$215, DW_AT_name("I2CFFTX")
    2331                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_I2CFFTX")
    2332                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2333                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2334              
    2335              $C$DW$216       .dwtag  DW_TAG_member
    2336                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$21)
    2337                      .dwattr $C$DW$216, DW_AT_name("I2CFFRX")
    2338                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_I2CFFRX")
    2339                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2340                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2341              
    2342                      .dwendtag $C$DW$T$23
    2343              
    2344              $C$DW$T$50      .dwtag  DW_TAG_typedef
    2345                      .dwattr $C$DW$T$50, DW_AT_name("I2C_Obj")
    2346                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$23)
    2347                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2348              
    2349              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    2350                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2351                      .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    2352              
    2353              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2354                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2355              
    2356              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2357                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2358                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2359              
    2360              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2361                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2362                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2363                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2364              
    2365              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2366                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2367                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2368                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2369              
    2370              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2371                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2372                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2373                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2374              
    2375              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2376                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2377                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2378                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:23:07 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/050905etGEi                                                     PAGE   45

    2379              
    2380              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2381                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2382                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2383                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2384              
    2385              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2386                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2387                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2388                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2389              
    2390              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2391                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2392                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2393                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2394              
    2395              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2396                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2397                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2398                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    2399              
    2400              $C$DW$T$20      .dwtag  DW_TAG_typedef
