TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.3.LTS *
       3              ;* Date/Time created: Tue Jul  4 14:43:44 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("/home/wmj/Documents/my_motor/sw/solutions/instaspin_foc/src/proj_lab02b
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.3.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/home/wmj/Documents/my_motor/sw/solutions/instaspin_foc/boards/hvki
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3714              $C$DW$402       .dwtag  DW_TAG_enumerator
    3715                      .dwattr $C$DW$402, DW_AT_name("PIE_GroupNumber_7")
    3716                      .dwattr $C$DW$402, DW_AT_const_value(0x06)
    3717              
    3718              $C$DW$403       .dwtag  DW_TAG_enumerator
    3719                      .dwattr $C$DW$403, DW_AT_name("PIE_GroupNumber_8")
    3720                      .dwattr $C$DW$403, DW_AT_const_value(0x07)
    3721              
    3722              $C$DW$404       .dwtag  DW_TAG_enumerator
    3723                      .dwattr $C$DW$404, DW_AT_name("PIE_GroupNumber_9")
    3724                      .dwattr $C$DW$404, DW_AT_const_value(0x08)
    3725              
    3726              $C$DW$405       .dwtag  DW_TAG_enumerator
    3727                      .dwattr $C$DW$405, DW_AT_name("PIE_GroupNumber_10")
    3728                      .dwattr $C$DW$405, DW_AT_const_value(0x09)
    3729              
    3730              $C$DW$406       .dwtag  DW_TAG_enumerator
    3731                      .dwattr $C$DW$406, DW_AT_name("PIE_GroupNumber_11")
    3732                      .dwattr $C$DW$406, DW_AT_const_value(0x0a)
    3733              
    3734              $C$DW$407       .dwtag  DW_TAG_enumerator
    3735                      .dwattr $C$DW$407, DW_AT_name("PIE_GroupNumber_12")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   74

    3736                      .dwattr $C$DW$407, DW_AT_const_value(0x0b)
    3737              
    3738                      .dwendtag $C$DW$T$180
    3739              
    3740              $C$DW$T$181     .dwtag  DW_TAG_typedef
    3741                      .dwattr $C$DW$T$181, DW_AT_name("PIE_GroupNumber_e")
    3742                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$180)
    3743                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    3744              
    3745              
    3746              $C$DW$T$183     .dwtag  DW_TAG_enumeration_type
    3747                      .dwattr $C$DW$T$183, DW_AT_byte_size(0x01)
    3748              $C$DW$408       .dwtag  DW_TAG_enumerator
    3749                      .dwattr $C$DW$408, DW_AT_name("CTRL_Type_PID_spd")
    3750                      .dwattr $C$DW$408, DW_AT_const_value(0x00)
    3751              
    3752              $C$DW$409       .dwtag  DW_TAG_enumerator
    3753                      .dwattr $C$DW$409, DW_AT_name("CTRL_Type_PID_Id")
    3754                      .dwattr $C$DW$409, DW_AT_const_value(0x01)
    3755              
    3756              $C$DW$410       .dwtag  DW_TAG_enumerator
    3757                      .dwattr $C$DW$410, DW_AT_name("CTRL_Type_PID_Iq")
    3758                      .dwattr $C$DW$410, DW_AT_const_value(0x02)
    3759              
    3760                      .dwendtag $C$DW$T$183
    3761              
    3762              $C$DW$T$184     .dwtag  DW_TAG_typedef
    3763                      .dwattr $C$DW$T$184, DW_AT_name("CTRL_Type_e")
    3764                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
    3765                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    3766              
    3767              
    3768              $C$DW$T$186     .dwtag  DW_TAG_enumeration_type
    3769                      .dwattr $C$DW$T$186, DW_AT_byte_size(0x01)
    3770              $C$DW$411       .dwtag  DW_TAG_enumerator
    3771                      .dwattr $C$DW$411, DW_AT_name("HAL_SensorType_Current")
    3772                      .dwattr $C$DW$411, DW_AT_const_value(0x00)
    3773              
    3774              $C$DW$412       .dwtag  DW_TAG_enumerator
    3775                      .dwattr $C$DW$412, DW_AT_name("HAL_SensorType_Voltage")
    3776                      .dwattr $C$DW$412, DW_AT_const_value(0x01)
    3777              
    3778                      .dwendtag $C$DW$T$186
    3779              
    3780              $C$DW$T$187     .dwtag  DW_TAG_typedef
    3781                      .dwattr $C$DW$T$187, DW_AT_name("HAL_SensorType_e")
    3782                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$186)
    3783                      .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    3784              
    3785              
    3786              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3787                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3788                      .dwattr $C$DW$T$19, DW_AT_declaration
    3789                      .dwendtag $C$DW$T$19
    3790              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   75

    3791              $C$DW$T$112     .dwtag  DW_TAG_pointer_type
    3792                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$19)
    3793                      .dwattr $C$DW$T$112, DW_AT_address_class(0x20)
    3794              
    3795              $C$DW$T$113     .dwtag  DW_TAG_typedef
    3796                      .dwattr $C$DW$T$113, DW_AT_name("I2C_Handle")
    3797                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    3798                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3799              
    3800              
    3801              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3802                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3803                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3804              $C$DW$413       .dwtag  DW_TAG_member
    3805                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$25)
    3806                      .dwattr $C$DW$413, DW_AT_name("ADCRESULT")
    3807                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_ADCRESULT")
    3808                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3809                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3810              
    3811              $C$DW$414       .dwtag  DW_TAG_member
    3812                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$26)
    3813                      .dwattr $C$DW$414, DW_AT_name("resvd_1")
    3814                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_resvd_1")
    3815                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3816                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3817              
    3818              $C$DW$415       .dwtag  DW_TAG_member
    3819                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$24)
    3820                      .dwattr $C$DW$415, DW_AT_name("ADCCTL1")
    3821                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_ADCCTL1")
    3822                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3823                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3824              
    3825              $C$DW$416       .dwtag  DW_TAG_member
    3826                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$24)
    3827                      .dwattr $C$DW$416, DW_AT_name("ADCCTL2")
    3828                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_ADCCTL2")
    3829                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3830                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3831              
    3832              $C$DW$417       .dwtag  DW_TAG_member
    3833                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$27)
    3834                      .dwattr $C$DW$417, DW_AT_name("rsvd_2")
    3835                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_rsvd_2")
    3836                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3837                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3838              
    3839              $C$DW$418       .dwtag  DW_TAG_member
    3840                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$24)
    3841                      .dwattr $C$DW$418, DW_AT_name("ADCINTFLG")
    3842                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_ADCINTFLG")
    3843                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3844                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3845              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   76

    3846              $C$DW$419       .dwtag  DW_TAG_member
    3847                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$24)
    3848                      .dwattr $C$DW$419, DW_AT_name("ADCINTFLGCLR")
    3849                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3850                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3851                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3852              
    3853              $C$DW$420       .dwtag  DW_TAG_member
    3854                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$24)
    3855                      .dwattr $C$DW$420, DW_AT_name("ADCINTOVF")
    3856                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_ADCINTOVF")
    3857                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3858                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3859              
    3860              $C$DW$421       .dwtag  DW_TAG_member
    3861                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$24)
    3862                      .dwattr $C$DW$421, DW_AT_name("ADCINTOVFCLR")
    3863                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3864                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3865                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3866              
    3867              $C$DW$422       .dwtag  DW_TAG_member
    3868                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$28)
    3869                      .dwattr $C$DW$422, DW_AT_name("INTSELxNy")
    3870                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_INTSELxNy")
    3871                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3872                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3873              
    3874              $C$DW$423       .dwtag  DW_TAG_member
    3875                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$29)
    3876                      .dwattr $C$DW$423, DW_AT_name("rsvd_3")
    3877                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_rsvd_3")
    3878                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3879                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3880              
    3881              $C$DW$424       .dwtag  DW_TAG_member
    3882                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$24)
    3883                      .dwattr $C$DW$424, DW_AT_name("SOCPRICTRL")
    3884                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3885                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3886                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3887              
    3888              $C$DW$425       .dwtag  DW_TAG_member
    3889                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$24)
    3890                      .dwattr $C$DW$425, DW_AT_name("rsvd_4")
    3891                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_rsvd_4")
    3892                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3893                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3894              
    3895              $C$DW$426       .dwtag  DW_TAG_member
    3896                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$24)
    3897                      .dwattr $C$DW$426, DW_AT_name("ADCSAMPLEMODE")
    3898                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3899                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3900                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   77

    3901              
    3902              $C$DW$427       .dwtag  DW_TAG_member
    3903                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$24)
    3904                      .dwattr $C$DW$427, DW_AT_name("rsvd_5")
    3905                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_rsvd_5")
    3906                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3907                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3908              
    3909              $C$DW$428       .dwtag  DW_TAG_member
    3910                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$24)
    3911                      .dwattr $C$DW$428, DW_AT_name("ADCINTSOCSEL1")
    3912                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3913                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3914                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3915              
    3916              $C$DW$429       .dwtag  DW_TAG_member
    3917                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$24)
    3918                      .dwattr $C$DW$429, DW_AT_name("ADCINTSOCSEL2")
    3919                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3920                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3921                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3922              
    3923              $C$DW$430       .dwtag  DW_TAG_member
    3924                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$27)
    3925                      .dwattr $C$DW$430, DW_AT_name("rsvd_6")
    3926                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_rsvd_6")
    3927                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3928                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3929              
    3930              $C$DW$431       .dwtag  DW_TAG_member
    3931                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$24)
    3932                      .dwattr $C$DW$431, DW_AT_name("ADCSOCFLG1")
    3933                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3934                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3935                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3936              
    3937              $C$DW$432       .dwtag  DW_TAG_member
    3938                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$24)
    3939                      .dwattr $C$DW$432, DW_AT_name("rsvd_7")
    3940                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_rsvd_7")
    3941                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3942                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3943              
    3944              $C$DW$433       .dwtag  DW_TAG_member
    3945                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$24)
    3946                      .dwattr $C$DW$433, DW_AT_name("ADCSOCFRC1")
    3947                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3948                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3949                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3950              
    3951              $C$DW$434       .dwtag  DW_TAG_member
    3952                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$24)
    3953                      .dwattr $C$DW$434, DW_AT_name("rsvd_8")
    3954                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd_8")
    3955                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   78

    3956                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3957              
    3958              $C$DW$435       .dwtag  DW_TAG_member
    3959                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$24)
    3960                      .dwattr $C$DW$435, DW_AT_name("ADCSOCOVF1")
    3961                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3962                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3963                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3964              
    3965              $C$DW$436       .dwtag  DW_TAG_member
    3966                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$24)
    3967                      .dwattr $C$DW$436, DW_AT_name("rsvd_9")
    3968                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_rsvd_9")
    3969                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3970                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3971              
    3972              $C$DW$437       .dwtag  DW_TAG_member
    3973                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$24)
    3974                      .dwattr $C$DW$437, DW_AT_name("ADCSOCOVFCLR1")
    3975                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3976                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3977                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3978              
    3979              $C$DW$438       .dwtag  DW_TAG_member
    3980                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$24)
    3981                      .dwattr $C$DW$438, DW_AT_name("rsvd_10")
    3982                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_rsvd_10")
    3983                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3984                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3985              
    3986              $C$DW$439       .dwtag  DW_TAG_member
    3987                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$25)
    3988                      .dwattr $C$DW$439, DW_AT_name("ADCSOCxCTL")
    3989                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3990                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3991                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3992              
    3993              $C$DW$440       .dwtag  DW_TAG_member
    3994                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$25)
    3995                      .dwattr $C$DW$440, DW_AT_name("rsvd_11")
    3996                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_rsvd_11")
    3997                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3998                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3999              
    4000              $C$DW$441       .dwtag  DW_TAG_member
    4001                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$24)
    4002                      .dwattr $C$DW$441, DW_AT_name("ADCREFTRIM")
    4003                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4004                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4005                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4006              
    4007              $C$DW$442       .dwtag  DW_TAG_member
    4008                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    4009                      .dwattr $C$DW$442, DW_AT_name("ADCOFFTRIM")
    4010                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_ADCOFFTRIM")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   79

    4011                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4012                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4013              
    4014              $C$DW$443       .dwtag  DW_TAG_member
    4015                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$30)
    4016                      .dwattr $C$DW$443, DW_AT_name("resvd_12")
    4017                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_resvd_12")
    4018                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4019                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4020              
    4021              $C$DW$444       .dwtag  DW_TAG_member
    4022                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
    4023                      .dwattr $C$DW$444, DW_AT_name("ADCREV")
    4024                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_ADCREV")
    4025                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4026                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4027              
    4028                      .dwendtag $C$DW$T$31
    4029              
    4030              $C$DW$T$189     .dwtag  DW_TAG_typedef
    4031                      .dwattr $C$DW$T$189, DW_AT_name("ADC_Obj")
    4032                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$31)
    4033                      .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    4034              
    4035              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    4036                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$31)
    4037                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
    4038              
    4039              $C$DW$T$84      .dwtag  DW_TAG_typedef
    4040                      .dwattr $C$DW$T$84, DW_AT_name("ADC_Handle")
    4041                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    4042                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    4043              
    4044              
    4045              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4046                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    4047                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    4048              $C$DW$445       .dwtag  DW_TAG_member
    4049                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$32)
    4050                      .dwattr $C$DW$445, DW_AT_name("alpha_sf")
    4051                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_alpha_sf")
    4052                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4053                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4054              
    4055              $C$DW$446       .dwtag  DW_TAG_member
    4056                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$32)
    4057                      .dwattr $C$DW$446, DW_AT_name("beta_sf")
    4058                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_beta_sf")
    4059                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4060                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4061              
    4062              $C$DW$447       .dwtag  DW_TAG_member
    4063                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$33)
    4064                      .dwattr $C$DW$447, DW_AT_name("numSensors")
    4065                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_numSensors")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   80

    4066                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4067                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4068              
    4069                      .dwendtag $C$DW$T$34
    4070              
    4071              $C$DW$T$45      .dwtag  DW_TAG_typedef
    4072                      .dwattr $C$DW$T$45, DW_AT_name("CLARKE_Obj")
    4073                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    4074                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4075              
    4076              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4077                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    4078                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4079              
    4080              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4081                      .dwattr $C$DW$T$44, DW_AT_name("CLARKE_Handle")
    4082                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4083                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4084              
    4085              
    4086              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4087                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    4088                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    4089              $C$DW$448       .dwtag  DW_TAG_member
    4090                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$24)
    4091                      .dwattr $C$DW$448, DW_AT_name("XCLK")
    4092                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_XCLK")
    4093                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4094                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4095              
    4096              $C$DW$449       .dwtag  DW_TAG_member
    4097                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$24)
    4098                      .dwattr $C$DW$449, DW_AT_name("rsvd_1")
    4099                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_rsvd_1")
    4100                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4101                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4102              
    4103              $C$DW$450       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$24)
    4105                      .dwattr $C$DW$450, DW_AT_name("CLKCTL")
    4106                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_CLKCTL")
    4107                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4108                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4109              
    4110              $C$DW$451       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$35)
    4112                      .dwattr $C$DW$451, DW_AT_name("rsvd_2")
    4113                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_rsvd_2")
    4114                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4115                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4116              
    4117              $C$DW$452       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$24)
    4119                      .dwattr $C$DW$452, DW_AT_name("LOSPCP")
    4120                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_LOSPCP")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   81

    4121                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4122                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4123              
    4124              $C$DW$453       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$24)
    4126                      .dwattr $C$DW$453, DW_AT_name("PCLKCR0")
    4127                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_PCLKCR0")
    4128                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4129                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4130              
    4131              $C$DW$454       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$24)
    4133                      .dwattr $C$DW$454, DW_AT_name("PCLKCR1")
    4134                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_PCLKCR1")
    4135                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4136                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4137              
    4138              $C$DW$455       .dwtag  DW_TAG_member
    4139                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$27)
    4140                      .dwattr $C$DW$455, DW_AT_name("rsvd_3")
    4141                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_rsvd_3")
    4142                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4143                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4144              
    4145              $C$DW$456       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$24)
    4147                      .dwattr $C$DW$456, DW_AT_name("PCLKCR3")
    4148                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_PCLKCR3")
    4149                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4150                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4151              
    4152                      .dwendtag $C$DW$T$36
    4153              
    4154              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    4155                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$36)
    4156                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
    4157              
    4158              $C$DW$T$86      .dwtag  DW_TAG_typedef
    4159                      .dwattr $C$DW$T$86, DW_AT_name("CLK_Handle")
    4160                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    4161                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    4162              
    4163              
    4164              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4165                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    4166                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4167              $C$DW$457       .dwtag  DW_TAG_member
    4168                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$33)
    4169                      .dwattr $C$DW$457, DW_AT_name("tmp")
    4170                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_tmp")
    4171                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4172                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4173              
    4174                      .dwendtag $C$DW$T$37
    4175              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   82

    4176              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    4177                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$37)
    4178                      .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
    4179              
    4180              $C$DW$T$88      .dwtag  DW_TAG_typedef
    4181                      .dwattr $C$DW$T$88, DW_AT_name("CPU_Handle")
    4182                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    4183                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    4184              
    4185              
    4186              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    4187                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    4188                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    4189              $C$DW$458       .dwtag  DW_TAG_member
    4190                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$38)
    4191                      .dwattr $C$DW$458, DW_AT_name("version")
    4192                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_version")
    4193                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4194                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4195              
    4196              $C$DW$459       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$40)
    4198                      .dwattr $C$DW$459, DW_AT_name("state")
    4199                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_state")
    4200                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4201                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4202              
    4203              $C$DW$460       .dwtag  DW_TAG_member
    4204                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$40)
    4205                      .dwattr $C$DW$460, DW_AT_name("prevState")
    4206                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_prevState")
    4207                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4208                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4209              
    4210              $C$DW$461       .dwtag  DW_TAG_member
    4211                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$42)
    4212                      .dwattr $C$DW$461, DW_AT_name("errorCode")
    4213                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_errorCode")
    4214                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4215                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4216              
    4217              $C$DW$462       .dwtag  DW_TAG_member
    4218                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$44)
    4219                      .dwattr $C$DW$462, DW_AT_name("clarkeHandle_I")
    4220                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4221                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4222                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4223              
    4224              $C$DW$463       .dwtag  DW_TAG_member
    4225                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$45)
    4226                      .dwattr $C$DW$463, DW_AT_name("clarke_I")
    4227                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_clarke_I")
    4228                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4229                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4230              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   83

    4231              $C$DW$464       .dwtag  DW_TAG_member
    4232                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$44)
    4233                      .dwattr $C$DW$464, DW_AT_name("clarkeHandle_V")
    4234                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4235                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4236                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4237              
    4238              $C$DW$465       .dwtag  DW_TAG_member
    4239                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$45)
    4240                      .dwattr $C$DW$465, DW_AT_name("clarke_V")
    4241                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_clarke_V")
    4242                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4243                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4244              
    4245              $C$DW$466       .dwtag  DW_TAG_member
    4246                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$47)
    4247                      .dwattr $C$DW$466, DW_AT_name("estHandle")
    4248                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_estHandle")
    4249                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4250                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4251              
    4252              $C$DW$467       .dwtag  DW_TAG_member
    4253                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$49)
    4254                      .dwattr $C$DW$467, DW_AT_name("parkHandle")
    4255                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_parkHandle")
    4256                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4257                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4258              
    4259              $C$DW$468       .dwtag  DW_TAG_member
    4260                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$50)
    4261                      .dwattr $C$DW$468, DW_AT_name("park")
    4262                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_park")
    4263                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4264                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4265              
    4266              $C$DW$469       .dwtag  DW_TAG_member
    4267                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$52)
    4268                      .dwattr $C$DW$469, DW_AT_name("pidHandle_Id")
    4269                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_pidHandle_Id")
    4270                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4271                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4272              
    4273              $C$DW$470       .dwtag  DW_TAG_member
    4274                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$53)
    4275                      .dwattr $C$DW$470, DW_AT_name("pid_Id")
    4276                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_pid_Id")
    4277                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4278                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4279              
    4280              $C$DW$471       .dwtag  DW_TAG_member
    4281                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$52)
    4282                      .dwattr $C$DW$471, DW_AT_name("pidHandle_Iq")
    4283                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4284                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4285                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   84

    4286              
    4287              $C$DW$472       .dwtag  DW_TAG_member
    4288                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$53)
    4289                      .dwattr $C$DW$472, DW_AT_name("pid_Iq")
    4290                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_pid_Iq")
    4291                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4292                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4293              
    4294              $C$DW$473       .dwtag  DW_TAG_member
    4295                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$52)
    4296                      .dwattr $C$DW$473, DW_AT_name("pidHandle_spd")
    4297                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_pidHandle_spd")
    4298                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4299                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4300              
    4301              $C$DW$474       .dwtag  DW_TAG_member
    4302                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$53)
    4303                      .dwattr $C$DW$474, DW_AT_name("pid_spd")
    4304                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_pid_spd")
    4305                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4306                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4307              
    4308              $C$DW$475       .dwtag  DW_TAG_member
    4309                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$55)
    4310                      .dwattr $C$DW$475, DW_AT_name("iparkHandle")
    4311                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_iparkHandle")
    4312                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4313                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4314              
    4315              $C$DW$476       .dwtag  DW_TAG_member
    4316                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$56)
    4317                      .dwattr $C$DW$476, DW_AT_name("ipark")
    4318                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_ipark")
    4319                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4320                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4321              
    4322              $C$DW$477       .dwtag  DW_TAG_member
    4323                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$58)
    4324                      .dwattr $C$DW$477, DW_AT_name("svgenHandle")
    4325                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_svgenHandle")
    4326                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4327                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4328              
    4329              $C$DW$478       .dwtag  DW_TAG_member
    4330                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$59)
    4331                      .dwattr $C$DW$478, DW_AT_name("svgen")
    4332                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_svgen")
    4333                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4334                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4335              
    4336              $C$DW$479       .dwtag  DW_TAG_member
    4337                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$61)
    4338                      .dwattr $C$DW$479, DW_AT_name("trajHandle_Id")
    4339                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_trajHandle_Id")
    4340                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   85

    4341                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4342              
    4343              $C$DW$480       .dwtag  DW_TAG_member
    4344                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$62)
    4345                      .dwattr $C$DW$480, DW_AT_name("traj_Id")
    4346                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_traj_Id")
    4347                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4348                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4349              
    4350              $C$DW$481       .dwtag  DW_TAG_member
    4351                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$61)
    4352                      .dwattr $C$DW$481, DW_AT_name("trajHandle_spd")
    4353                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_trajHandle_spd")
    4354                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4355                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4356              
    4357              $C$DW$482       .dwtag  DW_TAG_member
    4358                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$62)
    4359                      .dwattr $C$DW$482, DW_AT_name("traj_spd")
    4360                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_traj_spd")
    4361                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4362                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4363              
    4364              $C$DW$483       .dwtag  DW_TAG_member
    4365                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$61)
    4366                      .dwattr $C$DW$483, DW_AT_name("trajHandle_spdMax")
    4367                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4368                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4369                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4370              
    4371              $C$DW$484       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$62)
    4373                      .dwattr $C$DW$484, DW_AT_name("traj_spdMax")
    4374                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_traj_spdMax")
    4375                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4376                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4377              
    4378              $C$DW$485       .dwtag  DW_TAG_member
    4379                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$63)
    4380                      .dwattr $C$DW$485, DW_AT_name("motorParams")
    4381                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_motorParams")
    4382                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4383                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4384              
    4385              $C$DW$486       .dwtag  DW_TAG_member
    4386                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$66)
    4387                      .dwattr $C$DW$486, DW_AT_name("waitTimes")
    4388                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_waitTimes")
    4389                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4390                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4391              
    4392              $C$DW$487       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$65)
    4394                      .dwattr $C$DW$487, DW_AT_name("counter_state")
    4395                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_counter_state")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   86

    4396                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4397                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4398              
    4399              $C$DW$488       .dwtag  DW_TAG_member
    4400                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$67)
    4401                      .dwattr $C$DW$488, DW_AT_name("numIsrTicksPerCtrlTick")
    4402                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4403                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4404                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4405              
    4406              $C$DW$489       .dwtag  DW_TAG_member
    4407                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$67)
    4408                      .dwattr $C$DW$489, DW_AT_name("numCtrlTicksPerCurrentTick")
    4409                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4410                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4411                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4412              
    4413              $C$DW$490       .dwtag  DW_TAG_member
    4414                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$67)
    4415                      .dwattr $C$DW$490, DW_AT_name("numCtrlTicksPerSpeedTick")
    4416                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4417                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4418                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4419              
    4420              $C$DW$491       .dwtag  DW_TAG_member
    4421                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$67)
    4422                      .dwattr $C$DW$491, DW_AT_name("numCtrlTicksPerTrajTick")
    4423                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4424                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4425                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4426              
    4427              $C$DW$492       .dwtag  DW_TAG_member
    4428                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$65)
    4429                      .dwattr $C$DW$492, DW_AT_name("ctrlFreq_Hz")
    4430                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4431                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4432                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4433              
    4434              $C$DW$493       .dwtag  DW_TAG_member
    4435                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$65)
    4436                      .dwattr $C$DW$493, DW_AT_name("trajFreq_Hz")
    4437                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4438                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4439                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4440              
    4441              $C$DW$494       .dwtag  DW_TAG_member
    4442                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$32)
    4443                      .dwattr $C$DW$494, DW_AT_name("trajPeriod_sec")
    4444                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4445                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4446                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4447              
    4448              $C$DW$495       .dwtag  DW_TAG_member
    4449                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$68)
    4450                      .dwattr $C$DW$495, DW_AT_name("ctrlPeriod_sec")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   87

    4451                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4452                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4453                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4454              
    4455              $C$DW$496       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$32)
    4457                      .dwattr $C$DW$496, DW_AT_name("maxVsMag_pu")
    4458                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4459                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4460                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4461              
    4462              $C$DW$497       .dwtag  DW_TAG_member
    4463                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$69)
    4464                      .dwattr $C$DW$497, DW_AT_name("Iab_in")
    4465                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_Iab_in")
    4466                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4467                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4468              
    4469              $C$DW$498       .dwtag  DW_TAG_member
    4470                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$69)
    4471                      .dwattr $C$DW$498, DW_AT_name("Iab_filt")
    4472                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_Iab_filt")
    4473                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4474                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4475              
    4476              $C$DW$499       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$69)
    4478                      .dwattr $C$DW$499, DW_AT_name("Idq_in")
    4479                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_Idq_in")
    4480                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4481                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    4482              
    4483              $C$DW$500       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$69)
    4485                      .dwattr $C$DW$500, DW_AT_name("Vab_in")
    4486                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_Vab_in")
    4487                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4488                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    4489              
    4490              $C$DW$501       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$32)
    4492                      .dwattr $C$DW$501, DW_AT_name("spd_out")
    4493                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_spd_out")
    4494                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4495                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    4496              
    4497              $C$DW$502       .dwtag  DW_TAG_member
    4498                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$69)
    4499                      .dwattr $C$DW$502, DW_AT_name("Vab_out")
    4500                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_Vab_out")
    4501                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4502                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    4503              
    4504              $C$DW$503       .dwtag  DW_TAG_member
    4505                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   88

    4506                      .dwattr $C$DW$503, DW_AT_name("Vdq_out")
    4507                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_Vdq_out")
    4508                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4509                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    4510              
    4511              $C$DW$504       .dwtag  DW_TAG_member
    4512                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$68)
    4513                      .dwattr $C$DW$504, DW_AT_name("Rhf")
    4514                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_Rhf")
    4515                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4516                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    4517              
    4518              $C$DW$505       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$68)
    4520                      .dwattr $C$DW$505, DW_AT_name("Lhf")
    4521                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_Lhf")
    4522                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4523                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    4524              
    4525              $C$DW$506       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$68)
    4527                      .dwattr $C$DW$506, DW_AT_name("RoverL")
    4528                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_RoverL")
    4529                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4530                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    4531              
    4532              $C$DW$507       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$32)
    4534                      .dwattr $C$DW$507, DW_AT_name("Kp_Id")
    4535                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_Kp_Id")
    4536                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4537                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    4538              
    4539              $C$DW$508       .dwtag  DW_TAG_member
    4540                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$32)
    4541                      .dwattr $C$DW$508, DW_AT_name("Kp_Iq")
    4542                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_Kp_Iq")
    4543                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4544                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    4545              
    4546              $C$DW$509       .dwtag  DW_TAG_member
    4547                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$32)
    4548                      .dwattr $C$DW$509, DW_AT_name("Kp_spd")
    4549                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_Kp_spd")
    4550                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4551                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    4552              
    4553              $C$DW$510       .dwtag  DW_TAG_member
    4554                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$32)
    4555                      .dwattr $C$DW$510, DW_AT_name("Ki_Id")
    4556                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_Ki_Id")
    4557                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4558                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    4559              
    4560              $C$DW$511       .dwtag  DW_TAG_member
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   89

    4561                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$32)
    4562                      .dwattr $C$DW$511, DW_AT_name("Ki_Iq")
    4563                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_Ki_Iq")
    4564                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4565                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    4566              
    4567              $C$DW$512       .dwtag  DW_TAG_member
    4568                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$32)
    4569                      .dwattr $C$DW$512, DW_AT_name("Ki_spd")
    4570                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_Ki_spd")
    4571                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4572                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    4573              
    4574              $C$DW$513       .dwtag  DW_TAG_member
    4575                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$32)
    4576                      .dwattr $C$DW$513, DW_AT_name("Kd_Id")
    4577                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_Kd_Id")
    4578                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4579                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    4580              
    4581              $C$DW$514       .dwtag  DW_TAG_member
    4582                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$32)
    4583                      .dwattr $C$DW$514, DW_AT_name("Kd_Iq")
    4584                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_Kd_Iq")
    4585                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4586                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    4587              
    4588              $C$DW$515       .dwtag  DW_TAG_member
    4589                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$32)
    4590                      .dwattr $C$DW$515, DW_AT_name("Kd_spd")
    4591                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_Kd_spd")
    4592                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4593                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    4594              
    4595              $C$DW$516       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$32)
    4597                      .dwattr $C$DW$516, DW_AT_name("Ui_Id")
    4598                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_Ui_Id")
    4599                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4600                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    4601              
    4602              $C$DW$517       .dwtag  DW_TAG_member
    4603                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$32)
    4604                      .dwattr $C$DW$517, DW_AT_name("Ui_Iq")
    4605                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_Ui_Iq")
    4606                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4607                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    4608              
    4609              $C$DW$518       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$32)
    4611                      .dwattr $C$DW$518, DW_AT_name("Ui_spd")
    4612                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_Ui_spd")
    4613                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4614                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    4615              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   90

    4616              $C$DW$519       .dwtag  DW_TAG_member
    4617                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$69)
    4618                      .dwattr $C$DW$519, DW_AT_name("Idq_ref")
    4619                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_Idq_ref")
    4620                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4621                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    4622              
    4623              $C$DW$520       .dwtag  DW_TAG_member
    4624                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$32)
    4625                      .dwattr $C$DW$520, DW_AT_name("IdRated")
    4626                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_IdRated")
    4627                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4628                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4629              
    4630              $C$DW$521       .dwtag  DW_TAG_member
    4631                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$32)
    4632                      .dwattr $C$DW$521, DW_AT_name("spd_ref")
    4633                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_spd_ref")
    4634                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4635                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4636              
    4637              $C$DW$522       .dwtag  DW_TAG_member
    4638                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$32)
    4639                      .dwattr $C$DW$522, DW_AT_name("spd_max")
    4640                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_spd_max")
    4641                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4642                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4643              
    4644              $C$DW$523       .dwtag  DW_TAG_member
    4645                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$67)
    4646                      .dwattr $C$DW$523, DW_AT_name("counter_current")
    4647                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_counter_current")
    4648                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4649                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4650              
    4651              $C$DW$524       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$67)
    4653                      .dwattr $C$DW$524, DW_AT_name("counter_isr")
    4654                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_counter_isr")
    4655                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4656                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4657              
    4658              $C$DW$525       .dwtag  DW_TAG_member
    4659                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$67)
    4660                      .dwattr $C$DW$525, DW_AT_name("counter_speed")
    4661                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_counter_speed")
    4662                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4663                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4664              
    4665              $C$DW$526       .dwtag  DW_TAG_member
    4666                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$67)
    4667                      .dwattr $C$DW$526, DW_AT_name("counter_traj")
    4668                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_counter_traj")
    4669                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4670                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   91

    4671              
    4672              $C$DW$527       .dwtag  DW_TAG_member
    4673                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$70)
    4674                      .dwattr $C$DW$527, DW_AT_name("flag_enableCtrl")
    4675                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4676                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4677                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4678              
    4679              $C$DW$528       .dwtag  DW_TAG_member
    4680                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$70)
    4681                      .dwattr $C$DW$528, DW_AT_name("flag_enableDcBusComp")
    4682                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4683                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4684                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4685              
    4686              $C$DW$529       .dwtag  DW_TAG_member
    4687                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$70)
    4688                      .dwattr $C$DW$529, DW_AT_name("flag_enablePowerWarp")
    4689                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4690                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4691                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4692              
    4693              $C$DW$530       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$70)
    4695                      .dwattr $C$DW$530, DW_AT_name("flag_enableOffset")
    4696                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_flag_enableOffset")
    4697                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4698                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4699              
    4700              $C$DW$531       .dwtag  DW_TAG_member
    4701                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$70)
    4702                      .dwattr $C$DW$531, DW_AT_name("flag_enableSpeedCtrl")
    4703                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4704                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4705                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4706              
    4707              $C$DW$532       .dwtag  DW_TAG_member
    4708                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$70)
    4709                      .dwattr $C$DW$532, DW_AT_name("flag_enableUserMotorParams")
    4710                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4711                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4712                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4713              
    4714              $C$DW$533       .dwtag  DW_TAG_member
    4715                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$69)
    4716                      .dwattr $C$DW$533, DW_AT_name("Idq_offset_pu")
    4717                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4718                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4719                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4720              
    4721              $C$DW$534       .dwtag  DW_TAG_member
    4722                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$69)
    4723                      .dwattr $C$DW$534, DW_AT_name("Vdq_offset_pu")
    4724                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4725                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   92

    4726                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4727              
    4728              $C$DW$535       .dwtag  DW_TAG_member
    4729                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$32)
    4730                      .dwattr $C$DW$535, DW_AT_name("angle_pu")
    4731                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_angle_pu")
    4732                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4733                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    4734              
    4735              $C$DW$536       .dwtag  DW_TAG_member
    4736                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$32)
    4737                      .dwattr $C$DW$536, DW_AT_name("speed_ref_pu")
    4738                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_speed_ref_pu")
    4739                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4740                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    4741              
    4742              $C$DW$537       .dwtag  DW_TAG_member
    4743                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$32)
    4744                      .dwattr $C$DW$537, DW_AT_name("speed_fb_pu")
    4745                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_speed_fb_pu")
    4746                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4747                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    4748              
    4749              $C$DW$538       .dwtag  DW_TAG_member
    4750                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$32)
    4751                      .dwattr $C$DW$538, DW_AT_name("speed_outMax_pu")
    4752                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4753                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4754                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    4755              
    4756              $C$DW$539       .dwtag  DW_TAG_member
    4757                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$70)
    4758                      .dwattr $C$DW$539, DW_AT_name("flag_enableCurrentCtrl")
    4759                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4760                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4761                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    4762              
    4763                      .dwendtag $C$DW$T$71
    4764              
    4765              $C$DW$T$190     .dwtag  DW_TAG_typedef
    4766                      .dwattr $C$DW$T$190, DW_AT_name("CTRL_Obj")
    4767                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$71)
    4768                      .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    4769              
    4770              $C$DW$T$191     .dwtag  DW_TAG_pointer_type
    4771                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    4772                      .dwattr $C$DW$T$191, DW_AT_address_class(0x20)
    4773              
    4774              $C$DW$T$162     .dwtag  DW_TAG_pointer_type
    4775                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$71)
    4776                      .dwattr $C$DW$T$162, DW_AT_address_class(0x20)
    4777              
    4778              $C$DW$T$163     .dwtag  DW_TAG_typedef
    4779                      .dwattr $C$DW$T$163, DW_AT_name("CTRL_Handle")
    4780                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   93

    4781                      .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    4782              
    4783              $C$DW$540       .dwtag  DW_TAG_TI_far_type
    4784                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$163)
    4785              
    4786              $C$DW$T$192     .dwtag  DW_TAG_const_type
    4787                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$540)
    4788              
    4789              
    4790              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    4791                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    4792                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    4793              $C$DW$541       .dwtag  DW_TAG_member
    4794                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$23)
    4795                      .dwattr $C$DW$541, DW_AT_name("rsvd")
    4796                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_rsvd")
    4797                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4798                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    4799              
    4800              $C$DW$542       .dwtag  DW_TAG_member
    4801                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$73)
    4802                      .dwattr $C$DW$542, DW_AT_name("targetProc")
    4803                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_targetProc")
    4804                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4805                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    4806              
    4807              $C$DW$543       .dwtag  DW_TAG_member
    4808                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$23)
    4809                      .dwattr $C$DW$543, DW_AT_name("major")
    4810                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_major")
    4811                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4812                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4813              
    4814              $C$DW$544       .dwtag  DW_TAG_member
    4815                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$23)
    4816                      .dwattr $C$DW$544, DW_AT_name("minor")
    4817                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_minor")
    4818                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4819                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4820              
    4821                      .dwendtag $C$DW$T$74
    4822              
    4823              $C$DW$T$38      .dwtag  DW_TAG_typedef
    4824                      .dwattr $C$DW$T$38, DW_AT_name("CTRL_Version")
    4825                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    4826                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4827              
    4828              $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    4829                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$38)
    4830                      .dwattr $C$DW$T$200, DW_AT_address_class(0x20)
    4831              
    4832              
    4833              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4834                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    4835                      .dwattr $C$DW$T$20, DW_AT_declaration
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   94

    4836                      .dwendtag $C$DW$T$20
    4837              
    4838              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4839                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
    4840                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4841              
    4842              $C$DW$T$47      .dwtag  DW_TAG_typedef
    4843                      .dwattr $C$DW$T$47, DW_AT_name("EST_Handle")
    4844                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4845                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4846              
    4847              
    4848              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4849                      .dwattr $C$DW$T$75, DW_AT_name("_FILTER_FO_")
    4850                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x0a)
    4851              $C$DW$545       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$32)
    4853                      .dwattr $C$DW$545, DW_AT_name("a1")
    4854                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_a1")
    4855                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4856                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    4857              
    4858              $C$DW$546       .dwtag  DW_TAG_member
    4859                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$32)
    4860                      .dwattr $C$DW$546, DW_AT_name("b0")
    4861                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_b0")
    4862                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4863                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4864              
    4865              $C$DW$547       .dwtag  DW_TAG_member
    4866                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$32)
    4867                      .dwattr $C$DW$547, DW_AT_name("b1")
    4868                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_b1")
    4869                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4870                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4871              
    4872              $C$DW$548       .dwtag  DW_TAG_member
    4873                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$32)
    4874                      .dwattr $C$DW$548, DW_AT_name("x1")
    4875                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_x1")
    4876                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4877                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4878              
    4879              $C$DW$549       .dwtag  DW_TAG_member
    4880                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$32)
    4881                      .dwattr $C$DW$549, DW_AT_name("y1")
    4882                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_y1")
    4883                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4884                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4885              
    4886                      .dwendtag $C$DW$T$75
    4887              
    4888              $C$DW$T$132     .dwtag  DW_TAG_typedef
    4889                      .dwattr $C$DW$T$132, DW_AT_name("FILTER_FO_Obj")
    4890                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$75)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   95

    4891                      .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    4892              
    4893              
    4894              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4895                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    4896                      .dwattr $C$DW$T$21, DW_AT_declaration
    4897                      .dwendtag $C$DW$T$21
    4898              
    4899              $C$DW$T$133     .dwtag  DW_TAG_pointer_type
    4900                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$21)
    4901                      .dwattr $C$DW$T$133, DW_AT_address_class(0x20)
    4902              
    4903              $C$DW$T$134     .dwtag  DW_TAG_typedef
    4904                      .dwattr $C$DW$T$134, DW_AT_name("FILTER_FO_Handle")
    4905                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$133)
    4906                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    4907              
    4908              
    4909              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4910                      .dwattr $C$DW$T$76, DW_AT_name("_FLASH_Obj_")
    4911                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    4912              $C$DW$550       .dwtag  DW_TAG_member
    4913                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$24)
    4914                      .dwattr $C$DW$550, DW_AT_name("FOPT")
    4915                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_FOPT")
    4916                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4917                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4918              
    4919              $C$DW$551       .dwtag  DW_TAG_member
    4920                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$24)
    4921                      .dwattr $C$DW$551, DW_AT_name("rsvd_1")
    4922                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_rsvd_1")
    4923                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4924                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4925              
    4926              $C$DW$552       .dwtag  DW_TAG_member
    4927                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$24)
    4928                      .dwattr $C$DW$552, DW_AT_name("FPWR")
    4929                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_FPWR")
    4930                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4931                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    4932              
    4933              $C$DW$553       .dwtag  DW_TAG_member
    4934                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$24)
    4935                      .dwattr $C$DW$553, DW_AT_name("FSTATUS")
    4936                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_FSTATUS")
    4937                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4938                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4939              
    4940              $C$DW$554       .dwtag  DW_TAG_member
    4941                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$24)
    4942                      .dwattr $C$DW$554, DW_AT_name("FSTDBYWAIT")
    4943                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4944                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4945                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   96

    4946              
    4947              $C$DW$555       .dwtag  DW_TAG_member
    4948                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$24)
    4949                      .dwattr $C$DW$555, DW_AT_name("FACTIVEWAIT")
    4950                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4951                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4952                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4953              
    4954              $C$DW$556       .dwtag  DW_TAG_member
    4955                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$24)
    4956                      .dwattr $C$DW$556, DW_AT_name("FBANKWAIT")
    4957                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_FBANKWAIT")
    4958                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4959                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4960              
    4961              $C$DW$557       .dwtag  DW_TAG_member
    4962                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$24)
    4963                      .dwattr $C$DW$557, DW_AT_name("FOTPWAIT")
    4964                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_FOTPWAIT")
    4965                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4966                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4967              
    4968                      .dwendtag $C$DW$T$76
    4969              
    4970              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    4971                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$76)
    4972                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    4973              
    4974              $C$DW$T$90      .dwtag  DW_TAG_typedef
    4975                      .dwattr $C$DW$T$90, DW_AT_name("FLASH_Handle")
    4976                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    4977                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    4978              
    4979              
    4980              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    4981                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
    4982                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
    4983              $C$DW$558       .dwtag  DW_TAG_member
    4984                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$77)
    4985                      .dwattr $C$DW$558, DW_AT_name("GPACTRL")
    4986                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_GPACTRL")
    4987                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4988                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4989              
    4990              $C$DW$559       .dwtag  DW_TAG_member
    4991                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$77)
    4992                      .dwattr $C$DW$559, DW_AT_name("GPAQSEL1")
    4993                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_GPAQSEL1")
    4994                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4995                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4996              
    4997              $C$DW$560       .dwtag  DW_TAG_member
    4998                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$77)
    4999                      .dwattr $C$DW$560, DW_AT_name("GPAQSEL2")
    5000                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_GPAQSEL2")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   97

    5001                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5002                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    5003              
    5004              $C$DW$561       .dwtag  DW_TAG_member
    5005                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$77)
    5006                      .dwattr $C$DW$561, DW_AT_name("GPAMUX1")
    5007                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_GPAMUX1")
    5008                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5009                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    5010              
    5011              $C$DW$562       .dwtag  DW_TAG_member
    5012                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$77)
    5013                      .dwattr $C$DW$562, DW_AT_name("GPAMUX2")
    5014                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_GPAMUX2")
    5015                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5016                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    5017              
    5018              $C$DW$563       .dwtag  DW_TAG_member
    5019                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$77)
    5020                      .dwattr $C$DW$563, DW_AT_name("GPADIR")
    5021                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_GPADIR")
    5022                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5023                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    5024              
    5025              $C$DW$564       .dwtag  DW_TAG_member
    5026                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$77)
    5027                      .dwattr $C$DW$564, DW_AT_name("GPAPUD")
    5028                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_GPAPUD")
    5029                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5030                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    5031              
    5032              $C$DW$565       .dwtag  DW_TAG_member
    5033                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$27)
    5034                      .dwattr $C$DW$565, DW_AT_name("rsvd_1")
    5035                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_rsvd_1")
    5036                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5037                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    5038              
    5039              $C$DW$566       .dwtag  DW_TAG_member
    5040                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$77)
    5041                      .dwattr $C$DW$566, DW_AT_name("GPBCTRL")
    5042                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_GPBCTRL")
    5043                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5044                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    5045              
    5046              $C$DW$567       .dwtag  DW_TAG_member
    5047                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$77)
    5048                      .dwattr $C$DW$567, DW_AT_name("GPBQSEL1")
    5049                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_GPBQSEL1")
    5050                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5051                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    5052              
    5053              $C$DW$568       .dwtag  DW_TAG_member
    5054                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$27)
    5055                      .dwattr $C$DW$568, DW_AT_name("rsvd_2")
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 14:43:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/05838yZoz4z                                                     PAGE   98

    5056                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_rsvd_2")
    5057                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5058                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    5059              
    5060              $C$DW$569       .dwtag  DW_TAG_member
    5061                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$77)
    5062                      .dwattr $C$DW$569, DW_AT_name("GPBMUX1")
    5063                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_GPBMUX1")
    5064                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5065                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    5066              
    5067              $C$DW$570       .dwtag  DW_TAG_member
    5068                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$27)
    5069                      .dwattr $C$DW$570, DW_AT_name("rsvd_3")
