TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 16:18:00 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Jul 10 16:18:00 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/drivers/drvic/decoder.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

C:\Users\wmj\AppData\Local\Temp\0868810                              PAGE   13

     647              $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
     648              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_39"), DW_AT_const_value(0x27)
     649              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_40"), DW_AT_const_value(0x28)
     650              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_41"), DW_AT_const_value(0x29)
     651              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_42"), DW_AT_const_value(0x2a)
     652              $C$DW$100       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_43"), DW_AT_const_value(0x2b)
     653              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_44"), DW_AT_const_value(0x2c)
     654              $C$DW$102       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_50"), DW_AT_const_value(0x32)
     655              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_51"), DW_AT_const_value(0x33)
     656              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_52"), DW_AT_const_value(0x34)
     657              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_53"), DW_AT_const_value(0x35)
     658              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_54"), DW_AT_const_value(0x36)
     659              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_55"), DW_AT_const_value(0x37)
     660              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_56"), DW_AT_const_value(0x38)
     661              $C$DW$109       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_57"), DW_AT_const_value(0x39)
     662              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_58"), DW_AT_const_value(0x3a)
     663              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x3b)
     664                      .dwendtag $C$DW$T$26
     665              
     666              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
     667                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     668                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     669              $C$DW$112       .dwtag  DW_TAG_TI_far_type
     670                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$27)
     671              $C$DW$T$42      .dwtag  DW_TAG_const_type
     672                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$112)
     673              
     674              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
     675                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
     676              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_Empty"), DW_AT_const_value(0x00)
     677              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_1_Word"), DW_AT_const_value(0x100)
     678              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_2_Words"), DW_AT_const_value(0x200)
     679              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_3_Words"), DW_AT_const_value(0x300)
     680              $C$DW$117       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_4_Words"), DW_AT_const_value(0x400)
     681                      .dwendtag $C$DW$T$43
     682              
     683              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FifoStatus_e")
     684                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
     685                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
     686              $C$DW$118       .dwtag  DW_TAG_TI_far_type
     687                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$44)
     688              $C$DW$T$45      .dwtag  DW_TAG_volatile_type
     689                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$118)
     690              
     691              $C$DW$T$49      .dwtag  DW_TAG_enumeration_type
     692                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
     693              $C$DW$119       .dwtag  DW_TAG_enumerator, DW_AT_name("DECODER_CycReg"), DW_AT_const_value(0x00)
     694              $C$DW$120       .dwtag  DW_TAG_enumerator, DW_AT_name("DECODER_PosReg"), DW_AT_const_value(0x0f)
     695                      .dwendtag $C$DW$T$49
     696              
     697              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_RegName_e")
     698                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
     699                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
     700              $C$DW$121       .dwtag  DW_TAG_TI_far_type
     701                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$50)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 16:18:00 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868810                              PAGE   14

     702              $C$DW$T$51      .dwtag  DW_TAG_const_type
     703                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$121)
     704              $C$DW$122       .dwtag  DW_TAG_TI_far_type
     705                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$50)
     706              $C$DW$T$52      .dwtag  DW_TAG_volatile_type
     707                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$122)
     708              
     709              $C$DW$T$21      .dwtag  DW_TAG_union_type
     710                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
     711              $C$DW$123       .dwtag  DW_TAG_member
     712                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
     713                      .dwattr $C$DW$123, DW_AT_name("data_uint")
     714                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_data_uint")
     715                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     716                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     717              $C$DW$124       .dwtag  DW_TAG_member
     718                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
     719                      .dwattr $C$DW$124, DW_AT_name("drvRegData")
     720                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_drvRegData")
     721                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     722                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     723                      .dwendtag $C$DW$T$21
     724              
     725              
     726              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     727                      .dwattr $C$DW$T$29, DW_AT_name("_DECODER_Obj_")
     728                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x06)
     729              $C$DW$125       .dwtag  DW_TAG_member
     730                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$23)
     731                      .dwattr $C$DW$125, DW_AT_name("spiHandle")
     732                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_spiHandle")
     733                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     734                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     735              $C$DW$126       .dwtag  DW_TAG_member
     736                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$25)
     737                      .dwattr $C$DW$126, DW_AT_name("gpioHandle")
     738                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_gpioHandle")
     739                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     740                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     741              $C$DW$127       .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$27)
     743                      .dwattr $C$DW$127, DW_AT_name("gpioNumber")
     744                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_gpioNumber")
     745                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     746                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     747              $C$DW$128       .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$28)
     749                      .dwattr $C$DW$128, DW_AT_name("RxTimeOut")
     750                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_RxTimeOut")
     751                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     752                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
     753                      .dwendtag $C$DW$T$29
     754              
     755              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
     756                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 16:18:00 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868810                              PAGE   15

     757                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     758              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
     759                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$29)
     760                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
     761              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
     762                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
     763                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
     764              $C$DW$129       .dwtag  DW_TAG_TI_far_type
     765                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$55)
     766              $C$DW$T$56      .dwtag  DW_TAG_const_type
     767                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$129)
     768              
     769              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     770                      .dwattr $C$DW$T$31, DW_AT_name("_DECODER_Vars_t_")
     771                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     772              $C$DW$130       .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$30)
     774                      .dwattr $C$DW$130, DW_AT_name("Pos_Reg")
     775                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_Pos_Reg")
     776                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     777                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
     778              $C$DW$131       .dwtag  DW_TAG_member
     779                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$30)
     780                      .dwattr $C$DW$131, DW_AT_name("Cyc_Reg")
     781                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_Cyc_Reg")
     782                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     783                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
     784                      .dwendtag $C$DW$T$31
     785              
     786              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Vars_t")
     787                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$31)
     788                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     789              
     790              $C$DW$T$40      .dwtag  DW_TAG_structure_type
     791                      .dwattr $C$DW$T$40, DW_AT_name("_GPIO_Obj_")
     792                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x6a)
     793              $C$DW$132       .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$32)
     795                      .dwattr $C$DW$132, DW_AT_name("GPACTRL")
     796                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPACTRL")
     797                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
     799              $C$DW$133       .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$32)
     801                      .dwattr $C$DW$133, DW_AT_name("GPAQSEL1")
     802                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPAQSEL1")
     803                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     804                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
     805              $C$DW$134       .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$32)
     807                      .dwattr $C$DW$134, DW_AT_name("GPAQSEL2")
     808                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPAQSEL2")
     809                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     810                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$135       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 16:18:00 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868810                              PAGE   16

     812                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$32)
     813                      .dwattr $C$DW$135, DW_AT_name("GPAMUX1")
     814                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPAMUX1")
     815                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     816                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
     817              $C$DW$136       .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$32)
     819                      .dwattr $C$DW$136, DW_AT_name("GPAMUX2")
     820                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPAMUX2")
     821                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     822                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
     823              $C$DW$137       .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$32)
     825                      .dwattr $C$DW$137, DW_AT_name("GPADIR")
     826                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPADIR")
     827                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     828                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
     829              $C$DW$138       .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$32)
     831                      .dwattr $C$DW$138, DW_AT_name("GPAPUD")
     832                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPAPUD")
     833                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     834                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
     835              $C$DW$139       .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$34)
     837                      .dwattr $C$DW$139, DW_AT_name("rsvd_1")
     838                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd_1")
     839                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     840                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
     841              $C$DW$140       .dwtag  DW_TAG_member
     842                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$32)
     843                      .dwattr $C$DW$140, DW_AT_name("GPBCTRL")
     844                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPBCTRL")
     845                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     846                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
     847              $C$DW$141       .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$32)
     849                      .dwattr $C$DW$141, DW_AT_name("GPBQSEL1")
     850                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPBQSEL1")
     851                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     852                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
     853              $C$DW$142       .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$32)
     855                      .dwattr $C$DW$142, DW_AT_name("GPBQSEL2")
     856                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPBQSEL2")
     857                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     858                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
     859              $C$DW$143       .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$32)
     861                      .dwattr $C$DW$143, DW_AT_name("GPBMUX1")
     862                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPBMUX1")
     863                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     864                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
     865              $C$DW$144       .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 16:18:00 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868810                              PAGE   17

     867                      .dwattr $C$DW$144, DW_AT_name("GPBMUX2")
     868                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPBMUX2")
     869                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     870                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
     871              $C$DW$145       .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$32)
     873                      .dwattr $C$DW$145, DW_AT_name("GPBDIR")
     874                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPBDIR")
     875                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     876                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
     877              $C$DW$146       .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$32)
     879                      .dwattr $C$DW$146, DW_AT_name("GPBPUD")
     880                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPBPUD")
     881                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     882                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
     883              $C$DW$147       .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$35)
     885                      .dwattr $C$DW$147, DW_AT_name("rsvd_4")
     886                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd_4")
     887                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     888                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
     889              $C$DW$148       .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$32)
     891                      .dwattr $C$DW$148, DW_AT_name("AIOMUX1")
     892                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_AIOMUX1")
     893                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     894                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
     895              $C$DW$149       .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$34)
     897                      .dwattr $C$DW$149, DW_AT_name("rsvd_5")
     898                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd_5")
     899                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     900                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
     901              $C$DW$150       .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$32)
     903                      .dwattr $C$DW$150, DW_AT_name("AIODIR")
     904                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_AIODIR")
     905                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     906                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
     907              $C$DW$151       .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$36)
     909                      .dwattr $C$DW$151, DW_AT_name("rsvd_6")
     910                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd_6")
     911                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     912                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
     913              $C$DW$152       .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$32)
     915                      .dwattr $C$DW$152, DW_AT_name("GPADAT")
     916                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPADAT")
     917                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     918                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
     919              $C$DW$153       .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$32)
     921                      .dwattr $C$DW$153, DW_AT_name("GPASET")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 16:18:00 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868810                              PAGE   18

     922                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPASET")
     923                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     924                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
     925              $C$DW$154       .dwtag  DW_TAG_member
     926                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$32)
     927                      .dwattr $C$DW$154, DW_AT_name("GPACLEAR")
     928                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPACLEAR")
     929                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     930                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
     931              $C$DW$155       .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$32)
     933                      .dwattr $C$DW$155, DW_AT_name("GPATOGGLE")
     934                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPATOGGLE")
     935                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     936                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
     937              $C$DW$156       .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$32)
     939                      .dwattr $C$DW$156, DW_AT_name("GPBDAT")
     940                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPBDAT")
     941                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     942                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
     943              $C$DW$157       .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$32)
     945                      .dwattr $C$DW$157, DW_AT_name("GPBSET")
     946                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPBSET")
     947                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
     948                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$158       .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$32)
     951                      .dwattr $C$DW$158, DW_AT_name("GPBCLEAR")
     952                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPBCLEAR")
     953                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     954                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
     955              $C$DW$159       .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$32)
     957                      .dwattr $C$DW$159, DW_AT_name("GPBTOGGLE")
     958                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPBTOGGLE")
     959                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
     960                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
     961              $C$DW$160       .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$37)
     963                      .dwattr $C$DW$160, DW_AT_name("rsvd_7")
     964                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd_7")
     965                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     966                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
     967              $C$DW$161       .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$32)
     969                      .dwattr $C$DW$161, DW_AT_name("AIODAT")
     970                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_AIODAT")
     971                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     972                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
     973              $C$DW$162       .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$32)
     975                      .dwattr $C$DW$162, DW_AT_name("AIOSET")
     976                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_AIOSET")
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 16:18:00 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868810                              PAGE   19

     977                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
     978                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
     979              $C$DW$163       .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$32)
     981                      .dwattr $C$DW$163, DW_AT_name("AIOCLEAR")
     982                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_AIOCLEAR")
     983                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     984                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
     985              $C$DW$164       .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$32)
     987                      .dwattr $C$DW$164, DW_AT_name("AIOTOGGLE")
     988                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_AIOTOGGLE")
     989                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
     990                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
     991              $C$DW$165       .dwtag  DW_TAG_member
     992                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$38)
     993                      .dwattr $C$DW$165, DW_AT_name("GPIOXINTnSEL")
     994                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
     995                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     996                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
     997              $C$DW$166       .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$39)
     999                      .dwattr $C$DW$166, DW_AT_name("rsvd_8")
    1000                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd_8")
    1001                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    1002                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$167       .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    1005                      .dwattr $C$DW$167, DW_AT_name("GPIOLPMSEL")
    1006                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    1007                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1008                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1009                      .dwendtag $C$DW$T$40
    1010              
    1011              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    1012                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$40)
    1013                      .dwattr $C$DW$T$24, DW_AT_address_class(0x16)
    1014              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1015                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1016                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1017              $C$DW$168       .dwtag  DW_TAG_TI_far_type
    1018                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$25)
    1019              $C$DW$T$62      .dwtag  DW_TAG_const_type
    1020                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$168)
    1021              
    1022              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1023                      .dwattr $C$DW$T$41, DW_AT_name("_SPI_Obj_")
    1024                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x10)
    1025              $C$DW$169       .dwtag  DW_TAG_member
    1026                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$33)
    1027                      .dwattr $C$DW$169, DW_AT_name("SPICCR")
    1028                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_SPICCR")
    1029                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1030                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1031              $C$DW$170       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 16:18:00 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868810                              PAGE   20

    1032                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$33)
    1033                      .dwattr $C$DW$170, DW_AT_name("SPICTL")
    1034                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SPICTL")
    1035                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1036                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1037              $C$DW$171       .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$33)
    1039                      .dwattr $C$DW$171, DW_AT_name("SPIST")
    1040                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_SPIST")
    1041                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1042                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1043              $C$DW$172       .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$33)
    1045                      .dwattr $C$DW$172, DW_AT_name("rsvd_1")
    1046                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd_1")
    1047                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1048                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1049              $C$DW$173       .dwtag  DW_TAG_member
    1050                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$33)
    1051                      .dwattr $C$DW$173, DW_AT_name("SPIBRR")
    1052                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_SPIBRR")
    1053                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1054                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1055              $C$DW$174       .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$33)
    1057                      .dwattr $C$DW$174, DW_AT_name("rsvd_2")
    1058                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd_2")
    1059                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1060                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1061              $C$DW$175       .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$33)
    1063                      .dwattr $C$DW$175, DW_AT_name("SPIEMU")
    1064                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_SPIEMU")
    1065                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1066                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1067              $C$DW$176       .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$33)
    1069                      .dwattr $C$DW$176, DW_AT_name("SPIRXBUF")
    1070                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_SPIRXBUF")
    1071                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1072                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1073              $C$DW$177       .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$33)
    1075                      .dwattr $C$DW$177, DW_AT_name("SPITXBUF")
    1076                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_SPITXBUF")
    1077                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1078                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1079              $C$DW$178       .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$33)
    1081                      .dwattr $C$DW$178, DW_AT_name("SPIDAT")
    1082                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_SPIDAT")
    1083                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1084                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1085              $C$DW$179       .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 16:18:00 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868810                              PAGE   21

    1087                      .dwattr $C$DW$179, DW_AT_name("SPIFFTX")
    1088                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_SPIFFTX")
    1089                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1090                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1091              $C$DW$180       .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$33)
    1093                      .dwattr $C$DW$180, DW_AT_name("SPIFFRX")
    1094                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_SPIFFRX")
    1095                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1096                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1097              $C$DW$181       .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$33)
    1099                      .dwattr $C$DW$181, DW_AT_name("SPIFFCT")
    1100                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_SPIFFCT")
    1101                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1102                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1103              $C$DW$182       .dwtag  DW_TAG_member
    1104                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$34)
    1105                      .dwattr $C$DW$182, DW_AT_name("rsvd_3")
    1106                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd_3")
    1107                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1108                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1109              $C$DW$183       .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$33)
    1111                      .dwattr $C$DW$183, DW_AT_name("SPIPRI")
    1112                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_SPIPRI")
    1113                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1114                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1115                      .dwendtag $C$DW$T$41
    1116              
    1117              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Obj")
    1118                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$41)
    1119                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1120              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    1121                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$41)
    1122                      .dwattr $C$DW$T$22, DW_AT_address_class(0x16)
    1123              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Handle")
    1124                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1125                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1126              $C$DW$184       .dwtag  DW_TAG_TI_far_type
    1127                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$23)
    1128              $C$DW$T$65      .dwtag  DW_TAG_const_type
    1129                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$184)
    1130              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1131                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    1132              $C$DW$185       .dwtag  DW_TAG_TI_far_type
    1133                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$3)
    1134              $C$DW$T$67      .dwtag  DW_TAG_const_type
    1135                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$185)
    1136              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1137                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1138                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1139                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1140              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1141                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
TMS320C2000 Assembler PC v6.2.5 Mon Jul 10 16:18:00 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868810                              PAGE   22

    1142                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1143                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1144              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1145                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1146                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1147                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1148              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    1149                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$6)
    1150                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1151              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1152                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1153                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1154                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1155              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1156                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1157                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1158                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1159              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1160                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1161                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1162                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1163              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1164                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$9)
    1165                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
