TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jul 11 19:10:05 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/drivers/drvic/ldc1612.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    5866              $C$DW$647       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_RESET_DEV"), DW_AT_const_value(0x1c)
    5867              $C$DW$648       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch0DrvCurrent"), DW_AT_const_value(0x1
    5868              $C$DW$649       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch1DrvCurrent"), DW_AT_const_value(0x1
    5869              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch2DrvCurrent"), DW_AT_const_value(0x2
    5870              $C$DW$651       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_Ch3DrvCurrent"), DW_AT_const_value(0x2
    5871              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_MANUFACTURER_ID"), DW_AT_const_value(0
    5872              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_RegName_DEVICE_ID"), DW_AT_const_value(0x7f)
    5873                      .dwendtag $C$DW$T$94
    5874              
    5875              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_RegName_e")
    5876                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    5877                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    5878              $C$DW$654       .dwtag  DW_TAG_TI_far_type
    5879                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$95)
    5880              $C$DW$T$96      .dwtag  DW_TAG_const_type
    5881                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$654)
    5882              
    5883              $C$DW$T$97      .dwtag  DW_TAG_enumeration_type
    5884                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x01)
    5885              $C$DW$655       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH0"), DW_AT_const_value(0x00)
    5886              $C$DW$656       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH1"), DW_AT_const_value(0x01)
    5887              $C$DW$657       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH2"), DW_AT_const_value(0x02)
    5888              $C$DW$658       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH3"), DW_AT_const_value(0x03)
    5889                      .dwendtag $C$DW$T$97
    5890              
    5891              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ChNum_e")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  112

    5892                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    5893                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    5894              $C$DW$659       .dwtag  DW_TAG_TI_far_type
    5895                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$98)
    5896              $C$DW$T$99      .dwtag  DW_TAG_const_type
    5897                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$659)
    5898              $C$DW$660       .dwtag  DW_TAG_TI_far_type
    5899                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$98)
    5900              $C$DW$T$100     .dwtag  DW_TAG_const_type
    5901                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$660)
    5902              $C$DW$661       .dwtag  DW_TAG_TI_far_type
    5903                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$98)
    5904              $C$DW$T$101     .dwtag  DW_TAG_const_type
    5905                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$661)
    5906              $C$DW$662       .dwtag  DW_TAG_TI_far_type
    5907                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$98)
    5908              $C$DW$T$102     .dwtag  DW_TAG_const_type
    5909                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$662)
    5910              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    5911                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$98)
    5912              $C$DW$T$103     .dwtag  DW_TAG_const_type
    5913                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$663)
    5914              $C$DW$664       .dwtag  DW_TAG_TI_far_type
    5915                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$98)
    5916              $C$DW$T$104     .dwtag  DW_TAG_const_type
    5917                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$664)
    5918              $C$DW$665       .dwtag  DW_TAG_TI_far_type
    5919                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$98)
    5920              $C$DW$T$105     .dwtag  DW_TAG_const_type
    5921                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$665)
    5922              $C$DW$666       .dwtag  DW_TAG_TI_far_type
    5923                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$98)
    5924              $C$DW$T$106     .dwtag  DW_TAG_const_type
    5925                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$666)
    5926              $C$DW$667       .dwtag  DW_TAG_TI_far_type
    5927                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$98)
    5928              $C$DW$T$107     .dwtag  DW_TAG_const_type
    5929                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$667)
    5930              $C$DW$668       .dwtag  DW_TAG_TI_far_type
    5931                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$98)
    5932              $C$DW$T$108     .dwtag  DW_TAG_const_type
    5933                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$668)
    5934              
    5935              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5936                      .dwattr $C$DW$T$22, DW_AT_name("Data")
    5937                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    5938              $C$DW$669       .dwtag  DW_TAG_member
    5939                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$21)
    5940                      .dwattr $C$DW$669, DW_AT_name("LSB")
    5941                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_LSB")
    5942                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5943                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    5944              $C$DW$670       .dwtag  DW_TAG_member
    5945                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$21)
    5946                      .dwattr $C$DW$670, DW_AT_name("MSB")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  113

    5947                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_MSB")
    5948                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5949                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5950                      .dwendtag $C$DW$T$22
    5951              
    5952              
    5953              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5954                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    5955                      .dwattr $C$DW$T$19, DW_AT_declaration
    5956                      .dwendtag $C$DW$T$19
    5957              
    5958              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    5959                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$19)
    5960                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    5961              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    5962                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    5963                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5964              $C$DW$671       .dwtag  DW_TAG_TI_far_type
    5965                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$44)
    5966              $C$DW$T$109     .dwtag  DW_TAG_const_type
    5967                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$671)
    5968              
    5969              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5970                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    5971                      .dwattr $C$DW$T$20, DW_AT_declaration
    5972                      .dwendtag $C$DW$T$20
    5973              
    5974              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    5975                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$20)
    5976                      .dwattr $C$DW$T$47, DW_AT_address_class(0x16)
    5977              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    5978                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    5979                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    5980              $C$DW$672       .dwtag  DW_TAG_TI_far_type
    5981                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$48)
    5982              $C$DW$T$111     .dwtag  DW_TAG_const_type
    5983                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$672)
    5984              
    5985              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5986                      .dwattr $C$DW$T$23, DW_AT_name("_CLK_DIV_t_")
    5987                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    5988              $C$DW$673       .dwtag  DW_TAG_member
    5989                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$21)
    5990                      .dwattr $C$DW$673, DW_AT_name("FREF_DIVIDER")
    5991                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    5992                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5993                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5994              $C$DW$674       .dwtag  DW_TAG_member
    5995                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$21)
    5996                      .dwattr $C$DW$674, DW_AT_name("FIN_DIVIDER")
    5997                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    5998                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5999                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6000                      .dwendtag $C$DW$T$23
    6001              
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  114

    6002              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    6003                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$23)
    6004                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    6005              
    6006              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    6007                      .dwattr $C$DW$T$24, DW_AT_name("_DRIVE_CURRENT_t_")
    6008                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    6009              $C$DW$675       .dwtag  DW_TAG_member
    6010                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$21)
    6011                      .dwattr $C$DW$675, DW_AT_name("IDRIVE")
    6012                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_IDRIVE")
    6013                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6014                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6015              $C$DW$676       .dwtag  DW_TAG_member
    6016                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$21)
    6017                      .dwattr $C$DW$676, DW_AT_name("INIT_IDRIVE")
    6018                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_INIT_IDRIVE")
    6019                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6020                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6021                      .dwendtag $C$DW$T$24
    6022              
    6023              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("DRIVE_CURRENT_t_")
    6024                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$24)
    6025                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    6026              
    6027              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6028                      .dwattr $C$DW$T$34, DW_AT_name("_GPIO_Obj_")
    6029                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6a)
    6030              $C$DW$677       .dwtag  DW_TAG_member
    6031                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$26)
    6032                      .dwattr $C$DW$677, DW_AT_name("GPACTRL")
    6033                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_GPACTRL")
    6034                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6035                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6036              $C$DW$678       .dwtag  DW_TAG_member
    6037                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$26)
    6038                      .dwattr $C$DW$678, DW_AT_name("GPAQSEL1")
    6039                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_GPAQSEL1")
    6040                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6041                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6042              $C$DW$679       .dwtag  DW_TAG_member
    6043                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$26)
    6044                      .dwattr $C$DW$679, DW_AT_name("GPAQSEL2")
    6045                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_GPAQSEL2")
    6046                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6047                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6048              $C$DW$680       .dwtag  DW_TAG_member
    6049                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$26)
    6050                      .dwattr $C$DW$680, DW_AT_name("GPAMUX1")
    6051                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_GPAMUX1")
    6052                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6053                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6054              $C$DW$681       .dwtag  DW_TAG_member
    6055                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$26)
    6056                      .dwattr $C$DW$681, DW_AT_name("GPAMUX2")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  115

    6057                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_GPAMUX2")
    6058                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6059                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6060              $C$DW$682       .dwtag  DW_TAG_member
    6061                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$26)
    6062                      .dwattr $C$DW$682, DW_AT_name("GPADIR")
    6063                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_GPADIR")
    6064                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6065                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6066              $C$DW$683       .dwtag  DW_TAG_member
    6067                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$26)
    6068                      .dwattr $C$DW$683, DW_AT_name("GPAPUD")
    6069                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_GPAPUD")
    6070                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6071                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6072              $C$DW$684       .dwtag  DW_TAG_member
    6073                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$28)
    6074                      .dwattr $C$DW$684, DW_AT_name("rsvd_1")
    6075                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_rsvd_1")
    6076                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6077                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6078              $C$DW$685       .dwtag  DW_TAG_member
    6079                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$26)
    6080                      .dwattr $C$DW$685, DW_AT_name("GPBCTRL")
    6081                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_GPBCTRL")
    6082                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6083                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6084              $C$DW$686       .dwtag  DW_TAG_member
    6085                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$26)
    6086                      .dwattr $C$DW$686, DW_AT_name("GPBQSEL1")
    6087                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_GPBQSEL1")
    6088                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6089                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6090              $C$DW$687       .dwtag  DW_TAG_member
    6091                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$28)
    6092                      .dwattr $C$DW$687, DW_AT_name("rsvd_2")
    6093                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_rsvd_2")
    6094                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6095                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6096              $C$DW$688       .dwtag  DW_TAG_member
    6097                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$26)
    6098                      .dwattr $C$DW$688, DW_AT_name("GPBMUX1")
    6099                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_GPBMUX1")
    6100                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6101                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6102              $C$DW$689       .dwtag  DW_TAG_member
    6103                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$28)
    6104                      .dwattr $C$DW$689, DW_AT_name("rsvd_3")
    6105                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_3")
    6106                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6107                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6108              $C$DW$690       .dwtag  DW_TAG_member
    6109                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$26)
    6110                      .dwattr $C$DW$690, DW_AT_name("GPBDIR")
    6111                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_GPBDIR")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  116

    6112                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6113                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6114              $C$DW$691       .dwtag  DW_TAG_member
    6115                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$26)
    6116                      .dwattr $C$DW$691, DW_AT_name("GPBPUD")
    6117                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_GPBPUD")
    6118                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6119                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6120              $C$DW$692       .dwtag  DW_TAG_member
    6121                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$29)
    6122                      .dwattr $C$DW$692, DW_AT_name("rsvd_4")
    6123                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_rsvd_4")
    6124                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6125                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6126              $C$DW$693       .dwtag  DW_TAG_member
    6127                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$26)
    6128                      .dwattr $C$DW$693, DW_AT_name("AIOMUX1")
    6129                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_AIOMUX1")
    6130                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    6131                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6132              $C$DW$694       .dwtag  DW_TAG_member
    6133                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$28)
    6134                      .dwattr $C$DW$694, DW_AT_name("rsvd_5")
    6135                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_rsvd_5")
    6136                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6137                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6138              $C$DW$695       .dwtag  DW_TAG_member
    6139                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$26)
    6140                      .dwattr $C$DW$695, DW_AT_name("AIODIR")
    6141                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_AIODIR")
    6142                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6143                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6144              $C$DW$696       .dwtag  DW_TAG_member
    6145                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$30)
    6146                      .dwattr $C$DW$696, DW_AT_name("rsvd_6")
    6147                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_6")
    6148                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6149                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6150              $C$DW$697       .dwtag  DW_TAG_member
    6151                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$26)
    6152                      .dwattr $C$DW$697, DW_AT_name("GPADAT")
    6153                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_GPADAT")
    6154                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6155                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6156              $C$DW$698       .dwtag  DW_TAG_member
    6157                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$26)
    6158                      .dwattr $C$DW$698, DW_AT_name("GPASET")
    6159                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_GPASET")
    6160                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    6161                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6162              $C$DW$699       .dwtag  DW_TAG_member
    6163                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$26)
    6164                      .dwattr $C$DW$699, DW_AT_name("GPACLEAR")
    6165                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_GPACLEAR")
    6166                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  117

    6167                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6168              $C$DW$700       .dwtag  DW_TAG_member
    6169                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$26)
    6170                      .dwattr $C$DW$700, DW_AT_name("GPATOGGLE")
    6171                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_GPATOGGLE")
    6172                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6173                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6174              $C$DW$701       .dwtag  DW_TAG_member
    6175                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$26)
    6176                      .dwattr $C$DW$701, DW_AT_name("GPBDAT")
    6177                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_GPBDAT")
    6178                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6179                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6180              $C$DW$702       .dwtag  DW_TAG_member
    6181                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$26)
    6182                      .dwattr $C$DW$702, DW_AT_name("GPBSET")
    6183                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_GPBSET")
    6184                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    6185                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6186              $C$DW$703       .dwtag  DW_TAG_member
    6187                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$26)
    6188                      .dwattr $C$DW$703, DW_AT_name("GPBCLEAR")
    6189                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_GPBCLEAR")
    6190                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6191                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6192              $C$DW$704       .dwtag  DW_TAG_member
    6193                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$26)
    6194                      .dwattr $C$DW$704, DW_AT_name("GPBTOGGLE")
    6195                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_GPBTOGGLE")
    6196                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    6197                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6198              $C$DW$705       .dwtag  DW_TAG_member
    6199                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$31)
    6200                      .dwattr $C$DW$705, DW_AT_name("rsvd_7")
    6201                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd_7")
    6202                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6203                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6204              $C$DW$706       .dwtag  DW_TAG_member
    6205                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$26)
    6206                      .dwattr $C$DW$706, DW_AT_name("AIODAT")
    6207                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_AIODAT")
    6208                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6209                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6210              $C$DW$707       .dwtag  DW_TAG_member
    6211                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$26)
    6212                      .dwattr $C$DW$707, DW_AT_name("AIOSET")
    6213                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_AIOSET")
    6214                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    6215                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6216              $C$DW$708       .dwtag  DW_TAG_member
    6217                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$26)
    6218                      .dwattr $C$DW$708, DW_AT_name("AIOCLEAR")
    6219                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_AIOCLEAR")
    6220                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6221                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  118

    6222              $C$DW$709       .dwtag  DW_TAG_member
    6223                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$26)
    6224                      .dwattr $C$DW$709, DW_AT_name("AIOTOGGLE")
    6225                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_AIOTOGGLE")
    6226                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6227                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6228              $C$DW$710       .dwtag  DW_TAG_member
    6229                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$32)
    6230                      .dwattr $C$DW$710, DW_AT_name("GPIOXINTnSEL")
    6231                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    6232                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6233                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6234              $C$DW$711       .dwtag  DW_TAG_member
    6235                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$33)
    6236                      .dwattr $C$DW$711, DW_AT_name("rsvd_8")
    6237                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_rsvd_8")
    6238                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    6239                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6240              $C$DW$712       .dwtag  DW_TAG_member
    6241                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$26)
    6242                      .dwattr $C$DW$712, DW_AT_name("GPIOLPMSEL")
    6243                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    6244                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    6245                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6246                      .dwendtag $C$DW$T$34
    6247              
    6248              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    6249                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    6250                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    6251              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    6252                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    6253                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6254              $C$DW$713       .dwtag  DW_TAG_TI_far_type
    6255                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$46)
    6256              $C$DW$T$118     .dwtag  DW_TAG_const_type
    6257                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$713)
    6258              
    6259              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6260                      .dwattr $C$DW$T$36, DW_AT_name("_LDC1612_CONFIG_t_")
    6261                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x09)
    6262              $C$DW$714       .dwtag  DW_TAG_member
    6263                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$35)
    6264                      .dwattr $C$DW$714, DW_AT_name("ACTIVE_CHAN_0")
    6265                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_ACTIVE_CHAN_0")
    6266                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6267                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6268              $C$DW$715       .dwtag  DW_TAG_member
    6269                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$35)
    6270                      .dwattr $C$DW$715, DW_AT_name("ACTIVE_CHAN_1")
    6271                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_ACTIVE_CHAN_1")
    6272                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6273                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6274              $C$DW$716       .dwtag  DW_TAG_member
    6275                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$35)
    6276                      .dwattr $C$DW$716, DW_AT_name("SLEEP_MODE_EN")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  119

    6277                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_SLEEP_MODE_EN")
    6278                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6279                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6280              $C$DW$717       .dwtag  DW_TAG_member
    6281                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$35)
    6282                      .dwattr $C$DW$717, DW_AT_name("RP_OVERRIDE_EN")
    6283                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_RP_OVERRIDE_EN")
    6284                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6285                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6286              $C$DW$718       .dwtag  DW_TAG_member
    6287                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$35)
    6288                      .dwattr $C$DW$718, DW_AT_name("SENSOR_ACTV_SEL")
    6289                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_SENSOR_ACTV_SEL")
    6290                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6291                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6292              $C$DW$719       .dwtag  DW_TAG_member
    6293                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$35)
    6294                      .dwattr $C$DW$719, DW_AT_name("AUTO_AMP_DIS")
    6295                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_AUTO_AMP_DIS")
    6296                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6297                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6298              $C$DW$720       .dwtag  DW_TAG_member
    6299                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$35)
    6300                      .dwattr $C$DW$720, DW_AT_name("REF_CLK_SRC")
    6301                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_REF_CLK_SRC")
    6302                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6303                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6304              $C$DW$721       .dwtag  DW_TAG_member
    6305                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$35)
    6306                      .dwattr $C$DW$721, DW_AT_name("INTB_DIS")
    6307                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_INTB_DIS")
    6308                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6309                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6310              $C$DW$722       .dwtag  DW_TAG_member
    6311                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$35)
    6312                      .dwattr $C$DW$722, DW_AT_name("HIGH_CURRENT_DRV")
    6313                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_HIGH_CURRENT_DRV")
    6314                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6315                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6316                      .dwendtag $C$DW$T$36
    6317              
    6318              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("LDC1612_CONFIG_t_")
    6319                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$36)
    6320                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6321              
    6322              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6323                      .dwattr $C$DW$T$38, DW_AT_name("_LDC161x_CLK_DIVS_t_")
    6324                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    6325              $C$DW$723       .dwtag  DW_TAG_member
    6326                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$37)
    6327                      .dwattr $C$DW$723, DW_AT_name("CLK_DIVS_CH0")
    6328                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_CLK_DIVS_CH0")
    6329                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6330                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6331              $C$DW$724       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  120

    6332                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$37)
    6333                      .dwattr $C$DW$724, DW_AT_name("CLK_DIVS_CH1")
    6334                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_CLK_DIVS_CH1")
    6335                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6336                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6337              $C$DW$725       .dwtag  DW_TAG_member
    6338                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$37)
    6339                      .dwattr $C$DW$725, DW_AT_name("CLK_DIVS_CH2")
    6340                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_CLK_DIVS_CH2")
    6341                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6342                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6343              $C$DW$726       .dwtag  DW_TAG_member
    6344                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$37)
    6345                      .dwattr $C$DW$726, DW_AT_name("CLK_DIVS_CH3")
    6346                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_CLK_DIVS_CH3")
    6347                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6348                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6349                      .dwendtag $C$DW$T$38
    6350              
    6351              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_CLK_DIVS_t_")
    6352                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$38)
    6353                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    6354              
    6355              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6356                      .dwattr $C$DW$T$39, DW_AT_name("_LDC161x_ERROR_CONFIG_t_")
    6357                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0c)
    6358              $C$DW$727       .dwtag  DW_TAG_member
    6359                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$35)
    6360                      .dwattr $C$DW$727, DW_AT_name("UR_ERR2OUT")
    6361                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_UR_ERR2OUT")
    6362                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6363                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6364              $C$DW$728       .dwtag  DW_TAG_member
    6365                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$35)
    6366                      .dwattr $C$DW$728, DW_AT_name("OR_ERR2OUT")
    6367                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_OR_ERR2OUT")
    6368                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6369                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6370              $C$DW$729       .dwtag  DW_TAG_member
    6371                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$35)
    6372                      .dwattr $C$DW$729, DW_AT_name("WD_ERR2OUT")
    6373                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_WD_ERR2OUT")
    6374                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6375                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6376              $C$DW$730       .dwtag  DW_TAG_member
    6377                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$35)
    6378                      .dwattr $C$DW$730, DW_AT_name("AH_ERR2OUT")
    6379                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_AH_ERR2OUT")
    6380                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6381                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6382              $C$DW$731       .dwtag  DW_TAG_member
    6383                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$35)
    6384                      .dwattr $C$DW$731, DW_AT_name("AL_ERR2OUT")
    6385                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_AL_ERR2OUT")
    6386                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  121

    6387                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6388              $C$DW$732       .dwtag  DW_TAG_member
    6389                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$35)
    6390                      .dwattr $C$DW$732, DW_AT_name("UR_ERR2INT")
    6391                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_UR_ERR2INT")
    6392                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6393                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6394              $C$DW$733       .dwtag  DW_TAG_member
    6395                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$35)
    6396                      .dwattr $C$DW$733, DW_AT_name("OR_ERR2INT")
    6397                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_OR_ERR2INT")
    6398                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6399                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6400              $C$DW$734       .dwtag  DW_TAG_member
    6401                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$35)
    6402                      .dwattr $C$DW$734, DW_AT_name("WD_ERR2INT")
    6403                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_WD_ERR2INT")
    6404                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6405                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6406              $C$DW$735       .dwtag  DW_TAG_member
    6407                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$35)
    6408                      .dwattr $C$DW$735, DW_AT_name("AH_ERR2INT")
    6409                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_AH_ERR2INT")
    6410                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6411                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6412              $C$DW$736       .dwtag  DW_TAG_member
    6413                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$35)
    6414                      .dwattr $C$DW$736, DW_AT_name("AL_ERR2INT")
    6415                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_AL_ERR2INT")
    6416                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6417                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6418              $C$DW$737       .dwtag  DW_TAG_member
    6419                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$35)
    6420                      .dwattr $C$DW$737, DW_AT_name("ZC_ERR2INT")
    6421                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_ZC_ERR2INT")
    6422                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6423                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6424              $C$DW$738       .dwtag  DW_TAG_member
    6425                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$35)
    6426                      .dwattr $C$DW$738, DW_AT_name("DRDY_2INT")
    6427                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_DRDY_2INT")
    6428                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6429                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6430                      .dwendtag $C$DW$T$39
    6431              
    6432              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ERROR_CONFIG_t_")
    6433                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$39)
    6434                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    6435              
    6436              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6437                      .dwattr $C$DW$T$40, DW_AT_name("_LDC161x_Kalman_t_")
    6438                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x06)
    6439              $C$DW$739       .dwtag  DW_TAG_member
    6440                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$25)
    6441                      .dwattr $C$DW$739, DW_AT_name("x_Last")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  122

    6442                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_x_Last")
    6443                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6444                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6445              $C$DW$740       .dwtag  DW_TAG_member
    6446                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$25)
    6447                      .dwattr $C$DW$740, DW_AT_name("p_Last")
    6448                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_p_Last")
    6449                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6450                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6451              $C$DW$741       .dwtag  DW_TAG_member
    6452                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$25)
    6453                      .dwattr $C$DW$741, DW_AT_name("data_Last")
    6454                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_data_Last")
    6455                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6456                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6457                      .dwendtag $C$DW$T$40
    6458              
    6459              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_Kalman_t_")
    6460                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$40)
    6461                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    6462              
    6463              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6464                      .dwattr $C$DW$T$41, DW_AT_name("_LDC161x_MUX_CONFIG_t_")
    6465                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x06)
    6466              $C$DW$742       .dwtag  DW_TAG_member
    6467                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$35)
    6468                      .dwattr $C$DW$742, DW_AT_name("AUTOSCAN_EN")
    6469                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_AUTOSCAN_EN")
    6470                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6471                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6472              $C$DW$743       .dwtag  DW_TAG_member
    6473                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$35)
    6474                      .dwattr $C$DW$743, DW_AT_name("RR_SEQUENCE_0")
    6475                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_RR_SEQUENCE_0")
    6476                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6477                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6478              $C$DW$744       .dwtag  DW_TAG_member
    6479                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$35)
    6480                      .dwattr $C$DW$744, DW_AT_name("RR_SEQUENCE_1")
    6481                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_RR_SEQUENCE_1")
    6482                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6483                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6484              $C$DW$745       .dwtag  DW_TAG_member
    6485                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$35)
    6486                      .dwattr $C$DW$745, DW_AT_name("DEGLITCH_0")
    6487                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_DEGLITCH_0")
    6488                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6489                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    6490              $C$DW$746       .dwtag  DW_TAG_member
    6491                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$35)
    6492                      .dwattr $C$DW$746, DW_AT_name("DEGLITCH_1")
    6493                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_DEGLITCH_1")
    6494                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6495                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    6496              $C$DW$747       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  123

    6497                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$35)
    6498                      .dwattr $C$DW$747, DW_AT_name("DEGLITCH_2")
    6499                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_DEGLITCH_2")
    6500                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6501                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    6502                      .dwendtag $C$DW$T$41
    6503              
    6504              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_MUX_CONFIG_t_")
    6505                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$41)
    6506                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    6507              
    6508              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6509                      .dwattr $C$DW$T$42, DW_AT_name("_LDC161x_OFFSET_t_")
    6510                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    6511              $C$DW$748       .dwtag  DW_TAG_member
    6512                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$21)
    6513                      .dwattr $C$DW$748, DW_AT_name("OFFSET_CH0")
    6514                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_OFFSET_CH0")
    6515                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6516                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    6517              $C$DW$749       .dwtag  DW_TAG_member
    6518                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$21)
    6519                      .dwattr $C$DW$749, DW_AT_name("OFFSET_CH1")
    6520                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_OFFSET_CH1")
    6521                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6522                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    6523              $C$DW$750       .dwtag  DW_TAG_member
    6524                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$21)
    6525                      .dwattr $C$DW$750, DW_AT_name("OFFSET_CH2")
    6526                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_OFFSET_CH2")
    6527                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6528                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    6529              $C$DW$751       .dwtag  DW_TAG_member
    6530                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$21)
    6531                      .dwattr $C$DW$751, DW_AT_name("OFFSET_CH3")
    6532                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_OFFSET_CH3")
    6533                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6534                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    6535                      .dwendtag $C$DW$T$42
    6536              
    6537              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_OFFSET_t_")
    6538                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$42)
    6539                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    6540              
    6541              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    6542                      .dwattr $C$DW$T$50, DW_AT_name("_LDC161x_Obj_")
    6543                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x66)
    6544              $C$DW$752       .dwtag  DW_TAG_member
    6545                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$44)
    6546                      .dwattr $C$DW$752, DW_AT_name("i2cHandle")
    6547                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_i2cHandle")
    6548                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6549                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    6550              $C$DW$753       .dwtag  DW_TAG_member
    6551                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$46)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  124

    6552                      .dwattr $C$DW$753, DW_AT_name("gpioHandle")
    6553                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_gpioHandle")
    6554                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6555                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    6556              $C$DW$754       .dwtag  DW_TAG_member
    6557                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$48)
    6558                      .dwattr $C$DW$754, DW_AT_name("ldcHandle")
    6559                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_ldcHandle")
    6560                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6561                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    6562              $C$DW$755       .dwtag  DW_TAG_member
    6563                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$49)
    6564                      .dwattr $C$DW$755, DW_AT_name("ldc161x")
    6565                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_ldc161x")
    6566                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6567                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    6568              $C$DW$756       .dwtag  DW_TAG_member
    6569                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$35)
    6570                      .dwattr $C$DW$756, DW_AT_name("RxTimeOut")
    6571                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_RxTimeOut")
    6572                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    6573                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    6574              $C$DW$757       .dwtag  DW_TAG_member
    6575                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$35)
    6576                      .dwattr $C$DW$757, DW_AT_name("TxTimeOut")
    6577                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_TxTimeOut")
    6578                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    6579                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    6580                      .dwendtag $C$DW$T$50
    6581              
    6582              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_Obj")
    6583                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$50)
    6584                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    6585              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    6586                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$50)
    6587                      .dwattr $C$DW$T$121, DW_AT_address_class(0x16)
    6588              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_Handle")
    6589                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    6590                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    6591              $C$DW$758       .dwtag  DW_TAG_TI_far_type
    6592                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$122)
    6593              $C$DW$T$123     .dwtag  DW_TAG_const_type
    6594                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$758)
    6595              
    6596              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    6597                      .dwattr $C$DW$T$51, DW_AT_name("_LDC161x_RCOUNT_t_")
    6598                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
    6599              $C$DW$759       .dwtag  DW_TAG_member
    6600                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$21)
    6601                      .dwattr $C$DW$759, DW_AT_name("RCOUNT_CH0")
    6602                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_RCOUNT_CH0")
    6603                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6604                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    6605              $C$DW$760       .dwtag  DW_TAG_member
    6606                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  125

    6607                      .dwattr $C$DW$760, DW_AT_name("RCOUNT_CH1")
    6608                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_RCOUNT_CH1")
    6609                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6610                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    6611              $C$DW$761       .dwtag  DW_TAG_member
    6612                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$21)
    6613                      .dwattr $C$DW$761, DW_AT_name("RCOUNT_CH2")
    6614                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_RCOUNT_CH2")
    6615                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6616                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    6617              $C$DW$762       .dwtag  DW_TAG_member
    6618                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$21)
    6619                      .dwattr $C$DW$762, DW_AT_name("RCOUNT_CH3")
    6620                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_RCOUNT_CH3")
    6621                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6622                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    6623                      .dwendtag $C$DW$T$51
    6624              
    6625              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_RCOUNT_t_")
    6626                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$51)
    6627                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    6628              
    6629              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    6630                      .dwattr $C$DW$T$67, DW_AT_name("_LDC161x_REG_Obj_")
    6631                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x5e)
    6632              $C$DW$763       .dwtag  DW_TAG_member
    6633                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$52)
    6634                      .dwattr $C$DW$763, DW_AT_name("LdcChData")
    6635                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_LdcChData")
    6636                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6637                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    6638              $C$DW$764       .dwtag  DW_TAG_member
    6639                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$53)
    6640                      .dwattr $C$DW$764, DW_AT_name("LdcRcount")
    6641                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_LdcRcount")
    6642                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6643                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    6644              $C$DW$765       .dwtag  DW_TAG_member
    6645                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$54)
    6646                      .dwattr $C$DW$765, DW_AT_name("LdcOffset")
    6647                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_LdcOffset")
    6648                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6649                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    6650              $C$DW$766       .dwtag  DW_TAG_member
    6651                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$55)
    6652                      .dwattr $C$DW$766, DW_AT_name("LdcSettleCnt")
    6653                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_LdcSettleCnt")
    6654                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6655                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    6656              $C$DW$767       .dwtag  DW_TAG_member
    6657                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$56)
    6658                      .dwattr $C$DW$767, DW_AT_name("LdcClkDiv")
    6659                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_LdcClkDiv")
    6660                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6661                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  126

    6662              $C$DW$768       .dwtag  DW_TAG_member
    6663                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$57)
    6664                      .dwattr $C$DW$768, DW_AT_name("LdcStatus")
    6665                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_LdcStatus")
    6666                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6667                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    6668              $C$DW$769       .dwtag  DW_TAG_member
    6669                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$58)
    6670                      .dwattr $C$DW$769, DW_AT_name("LdcError")
    6671                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_LdcError")
    6672                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    6673                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    6674              $C$DW$770       .dwtag  DW_TAG_member
    6675                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$59)
    6676                      .dwattr $C$DW$770, DW_AT_name("LdcConfig")
    6677                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_LdcConfig")
    6678                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    6679                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    6680              $C$DW$771       .dwtag  DW_TAG_member
    6681                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$60)
    6682                      .dwattr $C$DW$771, DW_AT_name("LdcMuxConf")
    6683                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_LdcMuxConf")
    6684                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    6685                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    6686              $C$DW$772       .dwtag  DW_TAG_member
    6687                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$61)
    6688                      .dwattr $C$DW$772, DW_AT_name("LdcDriveCurrent")
    6689                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_LdcDriveCurrent")
    6690                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6691                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    6692              $C$DW$773       .dwtag  DW_TAG_member
    6693                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$62)
    6694                      .dwattr $C$DW$773, DW_AT_name("LdcKalman")
    6695                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_LdcKalman")
    6696                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6697                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    6698              $C$DW$774       .dwtag  DW_TAG_member
    6699                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$64)
    6700                      .dwattr $C$DW$774, DW_AT_name("LdcType")
    6701                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_LdcType")
    6702                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6703                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    6704              $C$DW$775       .dwtag  DW_TAG_member
    6705                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$66)
    6706                      .dwattr $C$DW$775, DW_AT_name("LdcSerial")
    6707                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_LdcSerial")
    6708                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    6709                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    6710                      .dwendtag $C$DW$T$67
    6711              
    6712              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_REG_Obj")
    6713                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$67)
    6714                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    6715              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    6716                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$49)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  127

    6717                      .dwattr $C$DW$T$127, DW_AT_address_class(0x16)
    6718              
    6719              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    6720                      .dwattr $C$DW$T$68, DW_AT_name("_LDC161x_SETTLECOUNT_t_")
    6721                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x04)
    6722              $C$DW$776       .dwtag  DW_TAG_member
    6723                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$21)
    6724                      .dwattr $C$DW$776, DW_AT_name("SETTLECOUNT_CH0")
    6725                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_SETTLECOUNT_CH0")
    6726                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6727                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    6728              $C$DW$777       .dwtag  DW_TAG_member
    6729                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$21)
    6730                      .dwattr $C$DW$777, DW_AT_name("SETTLECOUNT_CH1")
    6731                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_SETTLECOUNT_CH1")
    6732                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6733                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    6734              $C$DW$778       .dwtag  DW_TAG_member
    6735                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$21)
    6736                      .dwattr $C$DW$778, DW_AT_name("SETTLECOUNT_CH2")
    6737                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_SETTLECOUNT_CH2")
    6738                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6739                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    6740              $C$DW$779       .dwtag  DW_TAG_member
    6741                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$21)
    6742                      .dwattr $C$DW$779, DW_AT_name("SETTLECOUNT_CH3")
    6743                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_SETTLECOUNT_CH3")
    6744                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6745                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    6746                      .dwendtag $C$DW$T$68
    6747              
    6748              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_SETTLECOUNT_t_")
    6749                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$68)
    6750                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    6751              
    6752              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    6753                      .dwattr $C$DW$T$69, DW_AT_name("_LDC161x_STATUS_t_")
    6754                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x0d)
    6755              $C$DW$780       .dwtag  DW_TAG_member
    6756                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$35)
    6757                      .dwattr $C$DW$780, DW_AT_name("UNRDCONV_CH3")
    6758                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_UNRDCONV_CH3")
    6759                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6760                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    6761              $C$DW$781       .dwtag  DW_TAG_member
    6762                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$35)
    6763                      .dwattr $C$DW$781, DW_AT_name("UNRDCONV_CH2")
    6764                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_UNRDCONV_CH2")
    6765                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6766                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    6767              $C$DW$782       .dwtag  DW_TAG_member
    6768                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$35)
    6769                      .dwattr $C$DW$782, DW_AT_name("UNRDCONV_CH1")
    6770                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_UNRDCONV_CH1")
    6771                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  128

    6772                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    6773              $C$DW$783       .dwtag  DW_TAG_member
    6774                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$35)
    6775                      .dwattr $C$DW$783, DW_AT_name("UNRDCONV_CH0")
    6776                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_UNRDCONV_CH0")
    6777                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6778                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    6779              $C$DW$784       .dwtag  DW_TAG_member
    6780                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$35)
    6781                      .dwattr $C$DW$784, DW_AT_name("DRDY")
    6782                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_DRDY")
    6783                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6784                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    6785              $C$DW$785       .dwtag  DW_TAG_member
    6786                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$35)
    6787                      .dwattr $C$DW$785, DW_AT_name("ERR_ZC")
    6788                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_ERR_ZC")
    6789                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6790                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    6791              $C$DW$786       .dwtag  DW_TAG_member
    6792                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$35)
    6793                      .dwattr $C$DW$786, DW_AT_name("ERR_ALE")
    6794                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_ERR_ALE")
    6795                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6796                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    6797              $C$DW$787       .dwtag  DW_TAG_member
    6798                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$35)
    6799                      .dwattr $C$DW$787, DW_AT_name("ERR_AHE")
    6800                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_ERR_AHE")
    6801                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6802                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    6803              $C$DW$788       .dwtag  DW_TAG_member
    6804                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$35)
    6805                      .dwattr $C$DW$788, DW_AT_name("ERR_WD")
    6806                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_ERR_WD")
    6807                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6808                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    6809              $C$DW$789       .dwtag  DW_TAG_member
    6810                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$35)
    6811                      .dwattr $C$DW$789, DW_AT_name("ERR_OR")
    6812                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_ERR_OR")
    6813                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6814                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    6815              $C$DW$790       .dwtag  DW_TAG_member
    6816                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$35)
    6817                      .dwattr $C$DW$790, DW_AT_name("ERR_UR")
    6818                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_ERR_UR")
    6819                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6820                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    6821              $C$DW$791       .dwtag  DW_TAG_member
    6822                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$35)
    6823                      .dwattr $C$DW$791, DW_AT_name("ERR_CHAN_0")
    6824                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_ERR_CHAN_0")
    6825                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6826                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  129

    6827              $C$DW$792       .dwtag  DW_TAG_member
    6828                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$35)
    6829                      .dwattr $C$DW$792, DW_AT_name("ERR_CHAN_1")
    6830                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_ERR_CHAN_1")
    6831                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6832                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    6833                      .dwendtag $C$DW$T$69
    6834              
    6835              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_STATUS_t_")
    6836                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$69)
    6837                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    6838              
    6839              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    6840                      .dwattr $C$DW$T$70, DW_AT_name("_LDC_161x_CHDATA_MSB_t_")
    6841                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x05)
    6842              $C$DW$793       .dwtag  DW_TAG_member
    6843                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$35)
    6844                      .dwattr $C$DW$793, DW_AT_name("ERR_UR")
    6845                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_ERR_UR")
    6846                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6847                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    6848              $C$DW$794       .dwtag  DW_TAG_member
    6849                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$35)
    6850                      .dwattr $C$DW$794, DW_AT_name("ERR_OR")
    6851                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_ERR_OR")
    6852                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6853                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    6854              $C$DW$795       .dwtag  DW_TAG_member
    6855                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$35)
    6856                      .dwattr $C$DW$795, DW_AT_name("ERR_WD")
    6857                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_ERR_WD")
    6858                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6859                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    6860              $C$DW$796       .dwtag  DW_TAG_member
    6861                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$35)
    6862                      .dwattr $C$DW$796, DW_AT_name("ERR_AE")
    6863                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_ERR_AE")
    6864                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6865                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    6866              $C$DW$797       .dwtag  DW_TAG_member
    6867                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$21)
    6868                      .dwattr $C$DW$797, DW_AT_name("DAT_MB")
    6869                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_DAT_MB")
    6870                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6871                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    6872                      .dwendtag $C$DW$T$70
    6873              
    6874              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_161x_CHDATA_MSB_t_")
    6875                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    6876                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    6877              
    6878              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    6879                      .dwattr $C$DW$T$72, DW_AT_name("_LDC_161x_CHDATA_t_")
    6880                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x06)
    6881              $C$DW$798       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  130

    6882                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$71)
    6883                      .dwattr $C$DW$798, DW_AT_name("MSB")
    6884                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_MSB")
    6885                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6886                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    6887              $C$DW$799       .dwtag  DW_TAG_member
    6888                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$21)
    6889                      .dwattr $C$DW$799, DW_AT_name("LSB")
    6890                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_LSB")
    6891                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6892                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    6893                      .dwendtag $C$DW$T$72
    6894              
    6895              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_161x_CHDATA_t_")
    6896                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    6897                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6898              
    6899              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    6900                      .dwattr $C$DW$T$74, DW_AT_name("_LDC_161x_DATA_t_")
    6901                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x18)
    6902              $C$DW$800       .dwtag  DW_TAG_member
    6903                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$73)
    6904                      .dwattr $C$DW$800, DW_AT_name("CH0_DATA")
    6905                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_CH0_DATA")
    6906                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6907                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    6908              $C$DW$801       .dwtag  DW_TAG_member
    6909                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$73)
    6910                      .dwattr $C$DW$801, DW_AT_name("CH1_DATA")
    6911                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_CH1_DATA")
    6912                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6913                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    6914              $C$DW$802       .dwtag  DW_TAG_member
    6915                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$73)
    6916                      .dwattr $C$DW$802, DW_AT_name("CH2_DATA")
    6917                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_CH2_DATA")
    6918                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6919                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    6920              $C$DW$803       .dwtag  DW_TAG_member
    6921                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$73)
    6922                      .dwattr $C$DW$803, DW_AT_name("CH3_DATA")
    6923                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_CH3_DATA")
    6924                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6925                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    6926                      .dwendtag $C$DW$T$74
    6927              
    6928              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("LDC_161x_DATA_t_")
    6929                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$74)
    6930                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    6931              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    6932                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    6933              $C$DW$804       .dwtag  DW_TAG_TI_far_type
    6934                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$3)
    6935              $C$DW$T$129     .dwtag  DW_TAG_const_type
    6936                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$804)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  131

    6937              $C$DW$T$4       .dwtag  DW_TAG_base_type
    6938                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    6939                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    6940                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    6941              $C$DW$T$5       .dwtag  DW_TAG_base_type
    6942                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    6943                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    6944                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    6945              $C$DW$T$6       .dwtag  DW_TAG_base_type
    6946                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6947                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    6948                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    6949              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    6950                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$6)
    6951                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    6952              $C$DW$T$7       .dwtag  DW_TAG_base_type
    6953                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    6954                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    6955                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    6956              $C$DW$T$8       .dwtag  DW_TAG_base_type
    6957                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    6958                      .dwattr $C$DW$T$8, DW_AT_name("short")
    6959                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    6960              $C$DW$T$9       .dwtag  DW_TAG_base_type
    6961                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    6962                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    6963                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    6964              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    6965                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    6966                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    6967              $C$DW$T$157     .dwtag  DW_TAG_pointer_type
    6968                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$21)
    6969                      .dwattr $C$DW$T$157, DW_AT_address_class(0x16)
    6970              $C$DW$805       .dwtag  DW_TAG_TI_far_type
    6971                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$157)
    6972              $C$DW$T$169     .dwtag  DW_TAG_const_type
    6973                      .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$805)
    6974              $C$DW$806       .dwtag  DW_TAG_TI_far_type
    6975                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$21)
    6976              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    6977                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$806)
    6978              
    6979              $C$DW$T$28      .dwtag  DW_TAG_array_type
    6980                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    6981                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    6982                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    6983              $C$DW$807       .dwtag  DW_TAG_subrange_type
    6984                      .dwattr $C$DW$807, DW_AT_upper_bound(0x01)
    6985                      .dwendtag $C$DW$T$28
    6986              
    6987              
    6988              $C$DW$T$29      .dwtag  DW_TAG_array_type
    6989                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$27)
    6990                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    6991                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x18)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  132

    6992              $C$DW$808       .dwtag  DW_TAG_subrange_type
    6993                      .dwattr $C$DW$808, DW_AT_upper_bound(0x17)
    6994                      .dwendtag $C$DW$T$29
    6995              
    6996              
    6997              $C$DW$T$30      .dwtag  DW_TAG_array_type
    6998                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    6999                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    7000                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    7001              $C$DW$809       .dwtag  DW_TAG_subrange_type
    7002                      .dwattr $C$DW$809, DW_AT_upper_bound(0x03)
    7003                      .dwendtag $C$DW$T$30
    7004              
    7005              
    7006              $C$DW$T$31      .dwtag  DW_TAG_array_type
    7007                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    7008                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    7009                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    7010              $C$DW$810       .dwtag  DW_TAG_subrange_type
    7011                      .dwattr $C$DW$810, DW_AT_upper_bound(0x07)
    7012                      .dwendtag $C$DW$T$31
    7013              
    7014              
    7015              $C$DW$T$32      .dwtag  DW_TAG_array_type
    7016                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
    7017                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    7018                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x03)
    7019              $C$DW$811       .dwtag  DW_TAG_subrange_type
    7020                      .dwattr $C$DW$811, DW_AT_upper_bound(0x02)
    7021                      .dwendtag $C$DW$T$32
    7022              
    7023              
    7024              $C$DW$T$33      .dwtag  DW_TAG_array_type
    7025                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$27)
    7026                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    7027                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x05)
    7028              $C$DW$812       .dwtag  DW_TAG_subrange_type
    7029                      .dwattr $C$DW$812, DW_AT_upper_bound(0x04)
    7030                      .dwendtag $C$DW$T$33
    7031              
    7032              $C$DW$813       .dwtag  DW_TAG_TI_far_type
    7033                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$21)
    7034              $C$DW$T$138     .dwtag  DW_TAG_const_type
    7035                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$813)
    7036              $C$DW$T$10      .dwtag  DW_TAG_base_type
    7037                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    7038                      .dwattr $C$DW$T$10, DW_AT_name("int")
    7039                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    7040              $C$DW$T$11      .dwtag  DW_TAG_base_type
    7041                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    7042                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    7043                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    7044              $C$DW$T$12      .dwtag  DW_TAG_base_type
    7045                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    7046                      .dwattr $C$DW$T$12, DW_AT_name("long")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  133

    7047                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    7048              $C$DW$T$13      .dwtag  DW_TAG_base_type
    7049                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    7050                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    7051                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    7052              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    7053                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$13)
    7054                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    7055              $C$DW$814       .dwtag  DW_TAG_TI_far_type
    7056                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$112)
    7057              $C$DW$T$113     .dwtag  DW_TAG_const_type
    7058                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$814)
    7059              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    7060                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    7061                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    7062              $C$DW$T$160     .dwtag  DW_TAG_pointer_type
    7063                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$25)
    7064                      .dwattr $C$DW$T$160, DW_AT_address_class(0x16)
    7065              $C$DW$815       .dwtag  DW_TAG_TI_far_type
    7066                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$160)
    7067              $C$DW$T$184     .dwtag  DW_TAG_const_type
    7068                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$815)
    7069              $C$DW$816       .dwtag  DW_TAG_TI_far_type
    7070                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$25)
    7071              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    7072                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$816)
    7073              $C$DW$T$14      .dwtag  DW_TAG_base_type
    7074                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    7075                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    7076                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    7077              $C$DW$T$15      .dwtag  DW_TAG_base_type
    7078                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7079                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7080                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7081              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7082                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7083                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7084                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7085              $C$DW$T$17      .dwtag  DW_TAG_base_type
    7086                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    7087                      .dwattr $C$DW$T$17, DW_AT_name("double")
    7088                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    7089              $C$DW$T$18      .dwtag  DW_TAG_base_type
    7090                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    7091                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    7092                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    7093              
    7094              $C$DW$T$75      .dwtag  DW_TAG_union_type
    7095                      .dwattr $C$DW$T$75, DW_AT_name("data_u")
    7096                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x02)
    7097              $C$DW$817       .dwtag  DW_TAG_member
    7098                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$22)
    7099                      .dwattr $C$DW$817, DW_AT_name("Data_t")
    7100                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_Data_t")
    7101                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:06 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1046411                              PAGE  134

    7102                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7103              $C$DW$818       .dwtag  DW_TAG_member
    7104                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$25)
    7105                      .dwattr $C$DW$818, DW_AT_name("Data_u32")
    7106                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_Data_u32")
    7107                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7108                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7109                      .dwendtag $C$DW$T$75
    7110              
    7111                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    7112              
    7113              ;***************************************************************
    7114              ;* DWARF CIE ENTRIES                                           *
    7115              ;***************************************************************
    7116              
    7117              $C$DW$CIE       .dwcie 78
    7118                      .dwcfi  cfa_register, 20
    7119                      .dwcfi  cfa_offset, 0
    7120                      .dwcfi  undefined, 0
    7121                      .dwcfi  undefined, 1
    7122                      .dwcfi  undefined, 2
    7123                      .dwcfi  undefined, 3
