TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jul 11 19:10:04 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/drivers/drvic/process_ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;       c:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\132082 C

     114                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_numBytes")
     115                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$120)
     116                      .dwattr $C$DW$10, DW_AT_location[DW_OP_reg16]
     117              ;* AR4   assigned to _pMemory
     118              $C$DW$11        .dwtag  DW_TAG_variable, DW_AT_name("pMemory")
     119                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_pMemory")
     120                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$124)
     121                      .dwattr $C$DW$11, DW_AT_location[DW_OP_reg12]
     122                      .dwcfi  cfa_offset, -2
     123                      .dwcfi  save_reg_to_mem, 26, 0
     124                      .dwcfi  save_reg_to_reg, 78, 26
     125 00000002 1EA6          MOVL      XAR6,ACC              ; [CPU_] |15| 
     126                      .dwpsn  file "D:/Foc/my_motor/sw/drivers/drvic/process_ctrl.c",line 20,column 6,is_stmt
     127 00000003 021A          MOVB      ACC,#26               ; [CPU_] |20| 
     128 00000004 0FA6          CMPL      ACC,XAR6              ; [CPU_] |20| 
     129 00000005 6902          B         $C$L1,LOS             ; [CPU_] |20| 
     130                      ; branchcc occurs ; [] |20| 
     131 00000006 D400          MOVB      XAR4,#0               ; [CPU_] |20| 
     132              $C$L1:    
     133              $C$DW$12        .dwtag  DW_TAG_TI_branch
     134                      .dwattr $C$DW$12, DW_AT_low_pc(0x00)
     135                      .dwattr $C$DW$12, DW_AT_TI_return
     136 00000007 0006          LRETR     ; [CPU_] 
     137                      ; return occurs ; [] 
     138                      .dwattr $C$DW$7, DW_AT_TI_end_file("D:/Foc/my_motor/sw/drivers/drvic/process_ctrl.c")
     139                      .dwattr $C$DW$7, DW_AT_TI_end_line(0x1a)
     140                      .dwattr $C$DW$7, DW_AT_TI_end_column(0x01)
     141                      .dwendentry
     142                      .dwendtag $C$DW$7
     143              
     144              
     145              ;***************************************************************
     146              ;* TYPE INFORMATION                                            *
     147              ;***************************************************************
     148              
     149              $C$DW$T$103     .dwtag  DW_TAG_enumeration_type
     150                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x01)
     151              $C$DW$13        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_IDLE"), DW_AT_const_value(0x00)
     152              $C$DW$14        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_EditLow"), DW_AT_const_value(0x01)
     153              $C$DW$15        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_EditHigh"), DW_AT_const_value(0x02)
     154              $C$DW$16        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_EditReturn"), DW_AT_const_value(0x03)
     155              $C$DW$17        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormalLow"), DW_AT_const_value(0x04)
     156              $C$DW$18        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormHiSped"), DW_AT_const_value(0x05)
     157              $C$DW$19        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormDecle"), DW_AT_const_value(0x06)
     158              $C$DW$20        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormSlow"), DW_AT_const_value(0x07)
     159              $C$DW$21        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormAccele"), DW_AT_const_value(0x08)
     160              $C$DW$22        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormSate"), DW_AT_const_value(0x09)
     161              $C$DW$23        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormReturn"), DW_AT_const_value(0x0a)
     162              $C$DW$24        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormSlow2"), DW_AT_const_value(0x0b)
     163              $C$DW$25        .dwtag  DW_TAG_enumerator, DW_AT_name("PROCTRL_State_NormStop"), DW_AT_const_value(0x0c)
     164                      .dwendtag $C$DW$T$103
     165              
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE    4

     166              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("PROCTRL_State_e")
     167                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
     168                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
     169              
     170              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     171                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
     172                      .dwattr $C$DW$T$19, DW_AT_declaration
     173                      .dwendtag $C$DW$T$19
     174              
     175              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
     176                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$19)
     177                      .dwattr $C$DW$T$74, DW_AT_address_class(0x16)
     178              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
     179                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
     180                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
     181              
     182              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     183                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
     184                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
     185              $C$DW$26        .dwtag  DW_TAG_member
     186                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$24)
     187                      .dwattr $C$DW$26, DW_AT_name("ADCRESULT")
     188                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_ADCRESULT")
     189                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     190                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     191              $C$DW$27        .dwtag  DW_TAG_member
     192                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$25)
     193                      .dwattr $C$DW$27, DW_AT_name("resvd_1")
     194                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_resvd_1")
     195                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     196                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     197              $C$DW$28        .dwtag  DW_TAG_member
     198                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$23)
     199                      .dwattr $C$DW$28, DW_AT_name("ADCCTL1")
     200                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_ADCCTL1")
     201                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
     202                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     203              $C$DW$29        .dwtag  DW_TAG_member
     204                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$23)
     205                      .dwattr $C$DW$29, DW_AT_name("ADCCTL2")
     206                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_ADCCTL2")
     207                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
     208                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     209              $C$DW$30        .dwtag  DW_TAG_member
     210                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$26)
     211                      .dwattr $C$DW$30, DW_AT_name("rsvd_2")
     212                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd_2")
     213                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
     214                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     215              $C$DW$31        .dwtag  DW_TAG_member
     216                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$23)
     217                      .dwattr $C$DW$31, DW_AT_name("ADCINTFLG")
     218                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_ADCINTFLG")
     219                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
     220                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE    5

     221              $C$DW$32        .dwtag  DW_TAG_member
     222                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$23)
     223                      .dwattr $C$DW$32, DW_AT_name("ADCINTFLGCLR")
     224                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
     225                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
     226                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     227              $C$DW$33        .dwtag  DW_TAG_member
     228                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$23)
     229                      .dwattr $C$DW$33, DW_AT_name("ADCINTOVF")
     230                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_ADCINTOVF")
     231                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
     232                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     233              $C$DW$34        .dwtag  DW_TAG_member
     234                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$23)
     235                      .dwattr $C$DW$34, DW_AT_name("ADCINTOVFCLR")
     236                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
     237                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
     238                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     239              $C$DW$35        .dwtag  DW_TAG_member
     240                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$27)
     241                      .dwattr $C$DW$35, DW_AT_name("INTSELxNy")
     242                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_INTSELxNy")
     243                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
     244                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     245              $C$DW$36        .dwtag  DW_TAG_member
     246                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$28)
     247                      .dwattr $C$DW$36, DW_AT_name("rsvd_3")
     248                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd_3")
     249                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
     250                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     251              $C$DW$37        .dwtag  DW_TAG_member
     252                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$23)
     253                      .dwattr $C$DW$37, DW_AT_name("SOCPRICTRL")
     254                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_SOCPRICTRL")
     255                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
     256                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     257              $C$DW$38        .dwtag  DW_TAG_member
     258                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$23)
     259                      .dwattr $C$DW$38, DW_AT_name("rsvd_4")
     260                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd_4")
     261                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
     262                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     263              $C$DW$39        .dwtag  DW_TAG_member
     264                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$23)
     265                      .dwattr $C$DW$39, DW_AT_name("ADCSAMPLEMODE")
     266                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
     267                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
     268                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     269              $C$DW$40        .dwtag  DW_TAG_member
     270                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$23)
     271                      .dwattr $C$DW$40, DW_AT_name("rsvd_5")
     272                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd_5")
     273                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
     274                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     275              $C$DW$41        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE    6

     276                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$23)
     277                      .dwattr $C$DW$41, DW_AT_name("ADCINTSOCSEL1")
     278                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
     279                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
     280                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     281              $C$DW$42        .dwtag  DW_TAG_member
     282                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$23)
     283                      .dwattr $C$DW$42, DW_AT_name("ADCINTSOCSEL2")
     284                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
     285                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
     286                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     287              $C$DW$43        .dwtag  DW_TAG_member
     288                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$26)
     289                      .dwattr $C$DW$43, DW_AT_name("rsvd_6")
     290                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_rsvd_6")
     291                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
     292                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     293              $C$DW$44        .dwtag  DW_TAG_member
     294                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$23)
     295                      .dwattr $C$DW$44, DW_AT_name("ADCSOCFLG1")
     296                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_ADCSOCFLG1")
     297                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
     298                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     299              $C$DW$45        .dwtag  DW_TAG_member
     300                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$23)
     301                      .dwattr $C$DW$45, DW_AT_name("rsvd_7")
     302                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd_7")
     303                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
     304                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     305              $C$DW$46        .dwtag  DW_TAG_member
     306                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$23)
     307                      .dwattr $C$DW$46, DW_AT_name("ADCSOCFRC1")
     308                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_ADCSOCFRC1")
     309                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
     310                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     311              $C$DW$47        .dwtag  DW_TAG_member
     312                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$23)
     313                      .dwattr $C$DW$47, DW_AT_name("rsvd_8")
     314                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd_8")
     315                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
     316                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     317              $C$DW$48        .dwtag  DW_TAG_member
     318                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$23)
     319                      .dwattr $C$DW$48, DW_AT_name("ADCSOCOVF1")
     320                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_ADCSOCOVF1")
     321                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
     322                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     323              $C$DW$49        .dwtag  DW_TAG_member
     324                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$23)
     325                      .dwattr $C$DW$49, DW_AT_name("rsvd_9")
     326                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd_9")
     327                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
     328                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     329              $C$DW$50        .dwtag  DW_TAG_member
     330                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE    7

     331                      .dwattr $C$DW$50, DW_AT_name("ADCSOCOVFCLR1")
     332                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
     333                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
     334                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     335              $C$DW$51        .dwtag  DW_TAG_member
     336                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$23)
     337                      .dwattr $C$DW$51, DW_AT_name("rsvd_10")
     338                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd_10")
     339                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
     340                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     341              $C$DW$52        .dwtag  DW_TAG_member
     342                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$24)
     343                      .dwattr $C$DW$52, DW_AT_name("ADCSOCxCTL")
     344                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_ADCSOCxCTL")
     345                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
     346                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     347              $C$DW$53        .dwtag  DW_TAG_member
     348                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$24)
     349                      .dwattr $C$DW$53, DW_AT_name("rsvd_11")
     350                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rsvd_11")
     351                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
     352                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     353              $C$DW$54        .dwtag  DW_TAG_member
     354                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$23)
     355                      .dwattr $C$DW$54, DW_AT_name("ADCREFTRIM")
     356                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_ADCREFTRIM")
     357                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
     358                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     359              $C$DW$55        .dwtag  DW_TAG_member
     360                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$23)
     361                      .dwattr $C$DW$55, DW_AT_name("ADCOFFTRIM")
     362                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_ADCOFFTRIM")
     363                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
     364                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     365              $C$DW$56        .dwtag  DW_TAG_member
     366                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$29)
     367                      .dwattr $C$DW$56, DW_AT_name("resvd_12")
     368                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_resvd_12")
     369                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
     370                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     371              $C$DW$57        .dwtag  DW_TAG_member
     372                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$23)
     373                      .dwattr $C$DW$57, DW_AT_name("ADCREV")
     374                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_ADCREV")
     375                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
     376                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     377                      .dwendtag $C$DW$T$30
     378              
     379              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
     380                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$30)
     381                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
     382              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
     383                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
     384                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
     385              
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE    8

     386              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     387                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
     388                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
     389              $C$DW$58        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$23)
     391                      .dwattr $C$DW$58, DW_AT_name("XCLK")
     392                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_XCLK")
     393                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     394                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     395              $C$DW$59        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$23)
     397                      .dwattr $C$DW$59, DW_AT_name("rsvd_1")
     398                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd_1")
     399                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     400                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     401              $C$DW$60        .dwtag  DW_TAG_member
     402                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$23)
     403                      .dwattr $C$DW$60, DW_AT_name("CLKCTL")
     404                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_CLKCTL")
     405                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     406                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     407              $C$DW$61        .dwtag  DW_TAG_member
     408                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$31)
     409                      .dwattr $C$DW$61, DW_AT_name("rsvd_2")
     410                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd_2")
     411                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     412                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     413              $C$DW$62        .dwtag  DW_TAG_member
     414                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$23)
     415                      .dwattr $C$DW$62, DW_AT_name("LOSPCP")
     416                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_LOSPCP")
     417                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     418                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     419              $C$DW$63        .dwtag  DW_TAG_member
     420                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$23)
     421                      .dwattr $C$DW$63, DW_AT_name("PCLKCR0")
     422                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PCLKCR0")
     423                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     424                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     425              $C$DW$64        .dwtag  DW_TAG_member
     426                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$23)
     427                      .dwattr $C$DW$64, DW_AT_name("PCLKCR1")
     428                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PCLKCR1")
     429                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     430                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     431              $C$DW$65        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$26)
     433                      .dwattr $C$DW$65, DW_AT_name("rsvd_3")
     434                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_rsvd_3")
     435                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     436                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     437              $C$DW$66        .dwtag  DW_TAG_member
     438                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$23)
     439                      .dwattr $C$DW$66, DW_AT_name("PCLKCR3")
     440                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PCLKCR3")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE    9

     441                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     442                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     443                      .dwendtag $C$DW$T$32
     444              
     445              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
     446                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$32)
     447                      .dwattr $C$DW$T$47, DW_AT_address_class(0x16)
     448              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
     449                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
     450                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
     451              
     452              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     453                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
     454                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     455              $C$DW$67        .dwtag  DW_TAG_member
     456                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$33)
     457                      .dwattr $C$DW$67, DW_AT_name("tmp")
     458                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_tmp")
     459                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     460                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     461                      .dwendtag $C$DW$T$34
     462              
     463              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
     464                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$34)
     465                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
     466              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
     467                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
     468                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
     469              
     470              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     471                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
     472                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
     473              $C$DW$68        .dwtag  DW_TAG_member
     474                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$35)
     475                      .dwattr $C$DW$68, DW_AT_name("a1")
     476                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_a1")
     477                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     478                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     479              $C$DW$69        .dwtag  DW_TAG_member
     480                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$35)
     481                      .dwattr $C$DW$69, DW_AT_name("b0")
     482                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_b0")
     483                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     484                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     485              $C$DW$70        .dwtag  DW_TAG_member
     486                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$35)
     487                      .dwattr $C$DW$70, DW_AT_name("b1")
     488                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_b1")
     489                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     490                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     491              $C$DW$71        .dwtag  DW_TAG_member
     492                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$35)
     493                      .dwattr $C$DW$71, DW_AT_name("x1")
     494                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_x1")
     495                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   10

     496                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     497              $C$DW$72        .dwtag  DW_TAG_member
     498                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$35)
     499                      .dwattr $C$DW$72, DW_AT_name("y1")
     500                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_y1")
     501                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     502                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     503                      .dwendtag $C$DW$T$36
     504              
     505              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
     506                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$36)
     507                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
     508              
     509              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     510                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
     511                      .dwattr $C$DW$T$20, DW_AT_declaration
     512                      .dwendtag $C$DW$T$20
     513              
     514              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
     515                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$20)
     516                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
     517              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
     518                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
     519                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
     520              
     521              $C$DW$T$37      .dwtag  DW_TAG_structure_type
     522                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
     523                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
     524              $C$DW$73        .dwtag  DW_TAG_member
     525                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$23)
     526                      .dwattr $C$DW$73, DW_AT_name("FOPT")
     527                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_FOPT")
     528                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     529                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     530              $C$DW$74        .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$23)
     532                      .dwattr $C$DW$74, DW_AT_name("rsvd_1")
     533                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd_1")
     534                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     535                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     536              $C$DW$75        .dwtag  DW_TAG_member
     537                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$23)
     538                      .dwattr $C$DW$75, DW_AT_name("FPWR")
     539                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_FPWR")
     540                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     541                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     542              $C$DW$76        .dwtag  DW_TAG_member
     543                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$23)
     544                      .dwattr $C$DW$76, DW_AT_name("FSTATUS")
     545                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_FSTATUS")
     546                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     547                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     548              $C$DW$77        .dwtag  DW_TAG_member
     549                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$23)
     550                      .dwattr $C$DW$77, DW_AT_name("FSTDBYWAIT")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   11

     551                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_FSTDBYWAIT")
     552                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     553                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     554              $C$DW$78        .dwtag  DW_TAG_member
     555                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$23)
     556                      .dwattr $C$DW$78, DW_AT_name("FACTIVEWAIT")
     557                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_FACTIVEWAIT")
     558                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     559                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     560              $C$DW$79        .dwtag  DW_TAG_member
     561                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$23)
     562                      .dwattr $C$DW$79, DW_AT_name("FBANKWAIT")
     563                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_FBANKWAIT")
     564                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     565                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     566              $C$DW$80        .dwtag  DW_TAG_member
     567                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$23)
     568                      .dwattr $C$DW$80, DW_AT_name("FOTPWAIT")
     569                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_FOTPWAIT")
     570                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     571                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     572                      .dwendtag $C$DW$T$37
     573              
     574              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
     575                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$37)
     576                      .dwattr $C$DW$T$51, DW_AT_address_class(0x16)
     577              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
     578                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
     579                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
     580              
     581              $C$DW$T$42      .dwtag  DW_TAG_structure_type
     582                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
     583                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
     584              $C$DW$81        .dwtag  DW_TAG_member
     585                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$39)
     586                      .dwattr $C$DW$81, DW_AT_name("GPACTRL")
     587                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPACTRL")
     588                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     589                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     590              $C$DW$82        .dwtag  DW_TAG_member
     591                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$39)
     592                      .dwattr $C$DW$82, DW_AT_name("GPAQSEL1")
     593                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPAQSEL1")
     594                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     595                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     596              $C$DW$83        .dwtag  DW_TAG_member
     597                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$39)
     598                      .dwattr $C$DW$83, DW_AT_name("GPAQSEL2")
     599                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPAQSEL2")
     600                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     601                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     602              $C$DW$84        .dwtag  DW_TAG_member
     603                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$39)
     604                      .dwattr $C$DW$84, DW_AT_name("GPAMUX1")
     605                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPAMUX1")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   12

     606                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     607                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     608              $C$DW$85        .dwtag  DW_TAG_member
     609                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$39)
     610                      .dwattr $C$DW$85, DW_AT_name("GPAMUX2")
     611                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPAMUX2")
     612                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     613                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     614              $C$DW$86        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$39)
     616                      .dwattr $C$DW$86, DW_AT_name("GPADIR")
     617                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPADIR")
     618                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     619                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     620              $C$DW$87        .dwtag  DW_TAG_member
     621                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$39)
     622                      .dwattr $C$DW$87, DW_AT_name("GPAPUD")
     623                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPAPUD")
     624                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     625                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     626              $C$DW$88        .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$26)
     628                      .dwattr $C$DW$88, DW_AT_name("rsvd_1")
     629                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd_1")
     630                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     631                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     632              $C$DW$89        .dwtag  DW_TAG_member
     633                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$39)
     634                      .dwattr $C$DW$89, DW_AT_name("GPBCTRL")
     635                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPBCTRL")
     636                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     637                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     638              $C$DW$90        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$39)
     640                      .dwattr $C$DW$90, DW_AT_name("GPBQSEL1")
     641                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPBQSEL1")
     642                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     643                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     644              $C$DW$91        .dwtag  DW_TAG_member
     645                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$26)
     646                      .dwattr $C$DW$91, DW_AT_name("rsvd_2")
     647                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd_2")
     648                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     649                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     650              $C$DW$92        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$39)
     652                      .dwattr $C$DW$92, DW_AT_name("GPBMUX1")
     653                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPBMUX1")
     654                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     655                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     656              $C$DW$93        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$26)
     658                      .dwattr $C$DW$93, DW_AT_name("rsvd_3")
     659                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd_3")
     660                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   13

     661                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     662              $C$DW$94        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$39)
     664                      .dwattr $C$DW$94, DW_AT_name("GPBDIR")
     665                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPBDIR")
     666                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     667                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     668              $C$DW$95        .dwtag  DW_TAG_member
     669                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$39)
     670                      .dwattr $C$DW$95, DW_AT_name("GPBPUD")
     671                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPBPUD")
     672                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     673                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     674              $C$DW$96        .dwtag  DW_TAG_member
     675                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$40)
     676                      .dwattr $C$DW$96, DW_AT_name("rsvd_4")
     677                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd_4")
     678                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     679                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     680              $C$DW$97        .dwtag  DW_TAG_member
     681                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$39)
     682                      .dwattr $C$DW$97, DW_AT_name("AIOMUX1")
     683                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_AIOMUX1")
     684                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     685                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     686              $C$DW$98        .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$26)
     688                      .dwattr $C$DW$98, DW_AT_name("rsvd_5")
     689                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd_5")
     690                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     691                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     692              $C$DW$99        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$39)
     694                      .dwattr $C$DW$99, DW_AT_name("AIODIR")
     695                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_AIODIR")
     696                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     697                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     698              $C$DW$100       .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$41)
     700                      .dwattr $C$DW$100, DW_AT_name("rsvd_6")
     701                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd_6")
     702                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     703                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     704              $C$DW$101       .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$39)
     706                      .dwattr $C$DW$101, DW_AT_name("GPADAT")
     707                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPADAT")
     708                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     709                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     710              $C$DW$102       .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$39)
     712                      .dwattr $C$DW$102, DW_AT_name("GPASET")
     713                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPASET")
     714                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     715                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   14

     716              $C$DW$103       .dwtag  DW_TAG_member
     717                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$39)
     718                      .dwattr $C$DW$103, DW_AT_name("GPACLEAR")
     719                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPACLEAR")
     720                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     721                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     722              $C$DW$104       .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$39)
     724                      .dwattr $C$DW$104, DW_AT_name("GPATOGGLE")
     725                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPATOGGLE")
     726                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     727                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     728              $C$DW$105       .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$39)
     730                      .dwattr $C$DW$105, DW_AT_name("GPBDAT")
     731                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPBDAT")
     732                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     733                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     734              $C$DW$106       .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$39)
     736                      .dwattr $C$DW$106, DW_AT_name("GPBSET")
     737                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPBSET")
     738                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
     739                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     740              $C$DW$107       .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$39)
     742                      .dwattr $C$DW$107, DW_AT_name("GPBCLEAR")
     743                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPBCLEAR")
     744                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     745                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     746              $C$DW$108       .dwtag  DW_TAG_member
     747                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$39)
     748                      .dwattr $C$DW$108, DW_AT_name("GPBTOGGLE")
     749                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPBTOGGLE")
     750                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
     751                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     752              $C$DW$109       .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$31)
     754                      .dwattr $C$DW$109, DW_AT_name("rsvd_7")
     755                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd_7")
     756                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     757                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     758              $C$DW$110       .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$39)
     760                      .dwattr $C$DW$110, DW_AT_name("AIODAT")
     761                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_AIODAT")
     762                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     763                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     764              $C$DW$111       .dwtag  DW_TAG_member
     765                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$39)
     766                      .dwattr $C$DW$111, DW_AT_name("AIOSET")
     767                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_AIOSET")
     768                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
     769                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     770              $C$DW$112       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   15

     771                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$39)
     772                      .dwattr $C$DW$112, DW_AT_name("AIOCLEAR")
     773                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_AIOCLEAR")
     774                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     775                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     776              $C$DW$113       .dwtag  DW_TAG_member
     777                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$39)
     778                      .dwattr $C$DW$113, DW_AT_name("AIOTOGGLE")
     779                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_AIOTOGGLE")
     780                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
     781                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     782              $C$DW$114       .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$28)
     784                      .dwattr $C$DW$114, DW_AT_name("GPIOXINTnSEL")
     785                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
     786                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     787                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     788              $C$DW$115       .dwtag  DW_TAG_member
     789                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$27)
     790                      .dwattr $C$DW$115, DW_AT_name("rsvd_8")
     791                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd_8")
     792                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
     793                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     794              $C$DW$116       .dwtag  DW_TAG_member
     795                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$39)
     796                      .dwattr $C$DW$116, DW_AT_name("GPIOLPMSEL")
     797                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIOLPMSEL")
     798                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
     799                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     800                      .dwendtag $C$DW$T$42
     801              
     802              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
     803                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$42)
     804                      .dwattr $C$DW$T$53, DW_AT_address_class(0x16)
     805              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
     806                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
     807                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
     808              
     809              $C$DW$T$44      .dwtag  DW_TAG_structure_type
     810                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
     811                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
     812              $C$DW$117       .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$43)
     814                      .dwattr $C$DW$117, DW_AT_name("I")
     815                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_I")
     816                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     818              $C$DW$118       .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$43)
     820                      .dwattr $C$DW$118, DW_AT_name("V")
     821                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_V")
     822                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     823                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     824              $C$DW$119       .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   16

     826                      .dwattr $C$DW$119, DW_AT_name("dcBus")
     827                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_dcBus")
     828                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     829                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     830              $C$DW$120       .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$35)
     832                      .dwattr $C$DW$120, DW_AT_name("analogSensor1")
     833                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_analogSensor1")
     834                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     835                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     836              $C$DW$121       .dwtag  DW_TAG_member
     837                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$35)
     838                      .dwattr $C$DW$121, DW_AT_name("analogSensor2")
     839                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_analogSensor2")
     840                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     841                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     842              $C$DW$122       .dwtag  DW_TAG_member
     843                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$35)
     844                      .dwattr $C$DW$122, DW_AT_name("igbtNTC")
     845                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_igbtNTC")
     846                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     847                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     848              $C$DW$123       .dwtag  DW_TAG_member
     849                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$35)
     850                      .dwattr $C$DW$123, DW_AT_name("boardAddr")
     851                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_boardAddr")
     852                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     853                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     854                      .dwendtag $C$DW$T$44
     855              
     856              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
     857                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$44)
     858                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
     859              
     860              $C$DW$T$81      .dwtag  DW_TAG_structure_type
     861                      .dwattr $C$DW$T$81, DW_AT_name("_HAL_Obj_")
     862                      .dwattr $C$DW$T$81, DW_AT_byte_size(0xb2)
     863              $C$DW$124       .dwtag  DW_TAG_member
     864                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$46)
     865                      .dwattr $C$DW$124, DW_AT_name("adcHandle")
     866                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_adcHandle")
     867                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     868                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     869              $C$DW$125       .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$48)
     871                      .dwattr $C$DW$125, DW_AT_name("clkHandle")
     872                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_clkHandle")
     873                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     874                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     875              $C$DW$126       .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$50)
     877                      .dwattr $C$DW$126, DW_AT_name("cpuHandle")
     878                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_cpuHandle")
     879                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     880                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   17

     881              $C$DW$127       .dwtag  DW_TAG_member
     882                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$52)
     883                      .dwattr $C$DW$127, DW_AT_name("flashHandle")
     884                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_flashHandle")
     885                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     886                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     887              $C$DW$128       .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$54)
     889                      .dwattr $C$DW$128, DW_AT_name("gpioHandle")
     890                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_gpioHandle")
     891                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     892                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
     893              $C$DW$129       .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$57)
     895                      .dwattr $C$DW$129, DW_AT_name("offsetHandle_I")
     896                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_offsetHandle_I")
     897                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     898                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
     899              $C$DW$130       .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$59)
     901                      .dwattr $C$DW$130, DW_AT_name("offset_I")
     902                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_offset_I")
     903                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     904                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
     905              $C$DW$131       .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$57)
     907                      .dwattr $C$DW$131, DW_AT_name("offsetHandle_V")
     908                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_offsetHandle_V")
     909                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     910                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
     911              $C$DW$132       .dwtag  DW_TAG_member
     912                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$59)
     913                      .dwattr $C$DW$132, DW_AT_name("offset_V")
     914                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_offset_V")
     915                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     916                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
     917              $C$DW$133       .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$61)
     919                      .dwattr $C$DW$133, DW_AT_name("oscHandle")
     920                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_oscHandle")
     921                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
     922                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
     923              $C$DW$134       .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$63)
     925                      .dwattr $C$DW$134, DW_AT_name("pieHandle")
     926                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_pieHandle")
     927                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
     928                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
     929              $C$DW$135       .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$65)
     931                      .dwattr $C$DW$135, DW_AT_name("pllHandle")
     932                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_pllHandle")
     933                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
     934                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$136       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   18

     936                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$68)
     937                      .dwattr $C$DW$136, DW_AT_name("pwmHandle")
     938                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_pwmHandle")
     939                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
     940                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
     941              $C$DW$137       .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$68)
     943                      .dwattr $C$DW$137, DW_AT_name("pwmDacHandle")
     944                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_pwmDacHandle")
     945                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
     946                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
     947              $C$DW$138       .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$70)
     949                      .dwattr $C$DW$138, DW_AT_name("pwrHandle")
     950                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_pwrHandle")
     951                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
     952                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
     953              $C$DW$139       .dwtag  DW_TAG_member
     954                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$73)
     955                      .dwattr $C$DW$139, DW_AT_name("timerHandle")
     956                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_timerHandle")
     957                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
     958                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
     959              $C$DW$140       .dwtag  DW_TAG_member
     960                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$75)
     961                      .dwattr $C$DW$140, DW_AT_name("i2cHandle")
     962                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_i2cHandle")
     963                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
     964                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
     965              $C$DW$141       .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$77)
     967                      .dwattr $C$DW$141, DW_AT_name("spiAHandle")
     968                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_spiAHandle")
     969                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
     970                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
     971              $C$DW$142       .dwtag  DW_TAG_member
     972                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$79)
     973                      .dwattr $C$DW$142, DW_AT_name("wdogHandle")
     974                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_wdogHandle")
     975                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
     976                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
     977              $C$DW$143       .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$80)
     979                      .dwattr $C$DW$143, DW_AT_name("adcBias")
     980                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_adcBias")
     981                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
     982                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
     983              $C$DW$144       .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$35)
     985                      .dwattr $C$DW$144, DW_AT_name("current_sf")
     986                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_current_sf")
     987                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
     988                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
     989              $C$DW$145       .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   19

     991                      .dwattr $C$DW$145, DW_AT_name("voltage_sf")
     992                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_voltage_sf")
     993                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
     994                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
     995              $C$DW$146       .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$33)
     997                      .dwattr $C$DW$146, DW_AT_name("numCurrentSensors")
     998                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_numCurrentSensors")
     999                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1000                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1001              $C$DW$147       .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$33)
    1003                      .dwattr $C$DW$147, DW_AT_name("numVoltageSensors")
    1004                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_numVoltageSensors")
    1005                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
    1006                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1007                      .dwendtag $C$DW$T$81
    1008              
    1009              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    1010                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$81)
    1011                      .dwattr $C$DW$T$101, DW_AT_address_class(0x16)
    1012              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    1013                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    1014                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    1015              $C$DW$148       .dwtag  DW_TAG_TI_far_type
    1016                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$102)
    1017              $C$DW$T$113     .dwtag  DW_TAG_const_type
    1018                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$148)
    1019              
    1020              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    1021                      .dwattr $C$DW$T$83, DW_AT_name("_MATH_vec3_")
    1022                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x06)
    1023              $C$DW$149       .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$82)
    1025                      .dwattr $C$DW$149, DW_AT_name("value")
    1026                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_value")
    1027                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1029                      .dwendtag $C$DW$T$83
    1030              
    1031              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    1032                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$83)
    1033                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1034              
    1035              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    1036                      .dwattr $C$DW$T$87, DW_AT_name("_OFFSET_")
    1037                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x10)
    1038              $C$DW$150       .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$35)
    1040                      .dwattr $C$DW$150, DW_AT_name("value")
    1041                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_value")
    1042                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1044              $C$DW$151       .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   20

    1046                      .dwattr $C$DW$151, DW_AT_name("bias")
    1047                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_bias")
    1048                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1049                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1050              $C$DW$152       .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$84)
    1052                      .dwattr $C$DW$152, DW_AT_name("filter")
    1053                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_filter")
    1054                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1055                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1056              $C$DW$153       .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$86)
    1058                      .dwattr $C$DW$153, DW_AT_name("filterHandle")
    1059                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_filterHandle")
    1060                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1061                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1062                      .dwendtag $C$DW$T$87
    1063              
    1064              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
    1065                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$87)
    1066                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1067              
    1068              $C$DW$T$59      .dwtag  DW_TAG_array_type
    1069                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1070                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1071                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x30)
    1072              $C$DW$154       .dwtag  DW_TAG_subrange_type
    1073                      .dwattr $C$DW$154, DW_AT_upper_bound(0x02)
    1074                      .dwendtag $C$DW$T$59
    1075              
    1076              
    1077              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1078                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
    1079                      .dwattr $C$DW$T$21, DW_AT_declaration
    1080                      .dwendtag $C$DW$T$21
    1081              
    1082              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    1083                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$21)
    1084                      .dwattr $C$DW$T$55, DW_AT_address_class(0x16)
    1085              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
    1086                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    1087                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1088              
    1089              $C$DW$T$57      .dwtag  DW_TAG_array_type
    1090                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1091                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1092                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x06)
    1093              $C$DW$155       .dwtag  DW_TAG_subrange_type
    1094                      .dwattr $C$DW$155, DW_AT_upper_bound(0x02)
    1095                      .dwendtag $C$DW$T$57
    1096              
    1097              
    1098              $C$DW$T$88      .dwtag  DW_TAG_structure_type
    1099                      .dwattr $C$DW$T$88, DW_AT_name("_OSC_Obj_")
    1100                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x03)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   21

    1101              $C$DW$156       .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$23)
    1103                      .dwattr $C$DW$156, DW_AT_name("INTOSC1TRIM")
    1104                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    1105                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1107              $C$DW$157       .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$23)
    1109                      .dwattr $C$DW$157, DW_AT_name("rsvd_1")
    1110                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd_1")
    1111                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1112                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1113              $C$DW$158       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$23)
    1115                      .dwattr $C$DW$158, DW_AT_name("INTOSC2TRIM")
    1116                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    1117                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1118                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1119                      .dwendtag $C$DW$T$88
    1120              
    1121              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    1122                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$88)
    1123                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
    1124              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
    1125                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    1126                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1127              
    1128              $C$DW$T$89      .dwtag  DW_TAG_structure_type
    1129                      .dwattr $C$DW$T$89, DW_AT_name("_PIE_IERIFR_t")
    1130                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x02)
    1131              $C$DW$159       .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$23)
    1133                      .dwattr $C$DW$159, DW_AT_name("IER")
    1134                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_IER")
    1135                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1137              $C$DW$160       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$23)
    1139                      .dwattr $C$DW$160, DW_AT_name("IFR")
    1140                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_IFR")
    1141                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1142                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1143                      .dwendtag $C$DW$T$89
    1144              
    1145              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
    1146                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    1147                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1148              $C$DW$161       .dwtag  DW_TAG_TI_far_type
    1149                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$90)
    1150              $C$DW$T$91      .dwtag  DW_TAG_volatile_type
    1151                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$161)
    1152              
    1153              $C$DW$T$92      .dwtag  DW_TAG_array_type
    1154                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    1155                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   22

    1156                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x18)
    1157              $C$DW$162       .dwtag  DW_TAG_subrange_type
    1158                      .dwattr $C$DW$162, DW_AT_upper_bound(0x0b)
    1159                      .dwendtag $C$DW$T$92
    1160              
    1161              
    1162              $C$DW$T$99      .dwtag  DW_TAG_structure_type
    1163                      .dwattr $C$DW$T$99, DW_AT_name("_PIE_Obj_")
    1164                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x639c)
    1165              $C$DW$163       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$23)
    1167                      .dwattr $C$DW$163, DW_AT_name("PIECTRL")
    1168                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PIECTRL")
    1169                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1170                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1171              $C$DW$164       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
    1173                      .dwattr $C$DW$164, DW_AT_name("PIEACK")
    1174                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PIEACK")
    1175                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1176                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1177              $C$DW$165       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$92)
    1179                      .dwattr $C$DW$165, DW_AT_name("PIEIER_PIEIFR")
    1180                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
    1181                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1182                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1183              $C$DW$166       .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$93)
    1185                      .dwattr $C$DW$166, DW_AT_name("rsvd_1")
    1186                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd_1")
    1187                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1188                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1189              $C$DW$167       .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$97)
    1191                      .dwattr $C$DW$167, DW_AT_name("Reset")
    1192                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_Reset")
    1193                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1194                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1195              $C$DW$168       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$97)
    1197                      .dwattr $C$DW$168, DW_AT_name("INT1")
    1198                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_INT1")
    1199                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1200                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1201              $C$DW$169       .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$97)
    1203                      .dwattr $C$DW$169, DW_AT_name("INT2")
    1204                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_INT2")
    1205                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1206                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1207              $C$DW$170       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$97)
    1209                      .dwattr $C$DW$170, DW_AT_name("INT3")
    1210                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_INT3")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   23

    1211                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1212                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1213              $C$DW$171       .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$97)
    1215                      .dwattr $C$DW$171, DW_AT_name("INT4")
    1216                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_INT4")
    1217                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1218                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1219              $C$DW$172       .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$97)
    1221                      .dwattr $C$DW$172, DW_AT_name("INT5")
    1222                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INT5")
    1223                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1224                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1225              $C$DW$173       .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$97)
    1227                      .dwattr $C$DW$173, DW_AT_name("INT6")
    1228                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_INT6")
    1229                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1230                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1231              $C$DW$174       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$97)
    1233                      .dwattr $C$DW$174, DW_AT_name("INT7")
    1234                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_INT7")
    1235                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1236                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1237              $C$DW$175       .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$97)
    1239                      .dwattr $C$DW$175, DW_AT_name("INT8")
    1240                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INT8")
    1241                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1242                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1243              $C$DW$176       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$97)
    1245                      .dwattr $C$DW$176, DW_AT_name("INT9")
    1246                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_INT9")
    1247                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1248                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1249              $C$DW$177       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$97)
    1251                      .dwattr $C$DW$177, DW_AT_name("INT10")
    1252                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_INT10")
    1253                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1254                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1255              $C$DW$178       .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$97)
    1257                      .dwattr $C$DW$178, DW_AT_name("INT11")
    1258                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_INT11")
    1259                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1260                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1261              $C$DW$179       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$97)
    1263                      .dwattr $C$DW$179, DW_AT_name("INT12")
    1264                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_INT12")
    1265                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   24

    1266                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1267              $C$DW$180       .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$97)
    1269                      .dwattr $C$DW$180, DW_AT_name("TINT1")
    1270                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_TINT1")
    1271                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1272                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1273              $C$DW$181       .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$97)
    1275                      .dwattr $C$DW$181, DW_AT_name("TINT2")
    1276                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_TINT2")
    1277                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1278                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1279              $C$DW$182       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$97)
    1281                      .dwattr $C$DW$182, DW_AT_name("DATALOG")
    1282                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DATALOG")
    1283                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1284                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$183       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$97)
    1287                      .dwattr $C$DW$183, DW_AT_name("RTOSINT")
    1288                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_RTOSINT")
    1289                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1290                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1291              $C$DW$184       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$97)
    1293                      .dwattr $C$DW$184, DW_AT_name("EMUINT")
    1294                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_EMUINT")
    1295                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1296                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1297              $C$DW$185       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$97)
    1299                      .dwattr $C$DW$185, DW_AT_name("NMI")
    1300                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_NMI")
    1301                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1302                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1303              $C$DW$186       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$97)
    1305                      .dwattr $C$DW$186, DW_AT_name("ILLEGAL")
    1306                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ILLEGAL")
    1307                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1308                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1309              $C$DW$187       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$97)
    1311                      .dwattr $C$DW$187, DW_AT_name("USER1")
    1312                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_USER1")
    1313                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1314                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1315              $C$DW$188       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$97)
    1317                      .dwattr $C$DW$188, DW_AT_name("USER2")
    1318                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_USER2")
    1319                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1320                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:04 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1320810                              PAGE   25

    1321              $C$DW$189       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$97)
    1323                      .dwattr $C$DW$189, DW_AT_name("USER3")
    1324                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_USER3")
    1325                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1326                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$190       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$97)
    1329                      .dwattr $C$DW$190, DW_AT_name("USER4")
    1330                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_USER4")
    1331                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1332                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$191       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$97)
    1335                      .dwattr $C$DW$191, DW_AT_name("USER5")
    1336                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_USER5")
    1337                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1338                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1339              $C$DW$192       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$97)
    1341                      .dwattr $C$DW$192, DW_AT_name("USER6")
    1342                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_USER6")
    1343                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    1344                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1345              $C$DW$193       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$97)
    1347                      .dwattr $C$DW$193, DW_AT_name("USER7")
    1348                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_USER7")
    1349                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1350                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1351              $C$DW$194       .dwtag  DW_TAG_member
