TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jul 11 19:10:06 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/solutions/instaspin_foc/src/proj_lab05b.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    2848              $C$DW$417       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    2849              $C$DW$418       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    2850              $C$DW$419       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    2851              $C$DW$420       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    2852              $C$DW$421       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    2853                      .dwendtag $C$DW$T$184
    2854              
    2855              $C$DW$T$185     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    2856                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    2857                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    2858              
    2859              $C$DW$T$187     .dwtag  DW_TAG_enumeration_type
    2860                      .dwattr $C$DW$T$187, DW_AT_byte_size(0x01)
    2861              $C$DW$422       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    2862              $C$DW$423       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    2863              $C$DW$424       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    2864              $C$DW$425       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    2865              $C$DW$426       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    2866              $C$DW$427       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    2867              $C$DW$428       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    2868              $C$DW$429       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    2869              $C$DW$430       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    2870              $C$DW$431       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    2871              $C$DW$432       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    2872              $C$DW$433       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    2873                      .dwendtag $C$DW$T$187
    2874              
    2875              $C$DW$T$188     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    2876                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
    2877                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    2878              
    2879              $C$DW$T$190     .dwtag  DW_TAG_enumeration_type
    2880                      .dwattr $C$DW$T$190, DW_AT_byte_size(0x01)
    2881              $C$DW$434       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    2882              $C$DW$435       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   58

    2883              $C$DW$436       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    2884                      .dwendtag $C$DW$T$190
    2885              
    2886              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    2887                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    2888                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    2889              
    2890              $C$DW$T$193     .dwtag  DW_TAG_enumeration_type
    2891                      .dwattr $C$DW$T$193, DW_AT_byte_size(0x01)
    2892              $C$DW$437       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    2893              $C$DW$438       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    2894                      .dwendtag $C$DW$T$193
    2895              
    2896              $C$DW$T$194     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    2897                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$193)
    2898                      .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    2899              
    2900              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2901                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    2902                      .dwattr $C$DW$T$19, DW_AT_declaration
    2903                      .dwendtag $C$DW$T$19
    2904              
    2905              $C$DW$T$112     .dwtag  DW_TAG_pointer_type
    2906                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$19)
    2907                      .dwattr $C$DW$T$112, DW_AT_address_class(0x16)
    2908              $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    2909                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    2910                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    2911              
    2912              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2913                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    2914                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    2915              $C$DW$439       .dwtag  DW_TAG_member
    2916                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$25)
    2917                      .dwattr $C$DW$439, DW_AT_name("ADCRESULT")
    2918                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_ADCRESULT")
    2919                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2920                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    2921              $C$DW$440       .dwtag  DW_TAG_member
    2922                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$26)
    2923                      .dwattr $C$DW$440, DW_AT_name("resvd_1")
    2924                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_resvd_1")
    2925                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2926                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    2927              $C$DW$441       .dwtag  DW_TAG_member
    2928                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$24)
    2929                      .dwattr $C$DW$441, DW_AT_name("ADCCTL1")
    2930                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_ADCCTL1")
    2931                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    2932                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    2933              $C$DW$442       .dwtag  DW_TAG_member
    2934                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    2935                      .dwattr $C$DW$442, DW_AT_name("ADCCTL2")
    2936                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_ADCCTL2")
    2937                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   59

    2938                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    2939              $C$DW$443       .dwtag  DW_TAG_member
    2940                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$27)
    2941                      .dwattr $C$DW$443, DW_AT_name("rsvd_2")
    2942                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_rsvd_2")
    2943                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    2944                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    2945              $C$DW$444       .dwtag  DW_TAG_member
    2946                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
    2947                      .dwattr $C$DW$444, DW_AT_name("ADCINTFLG")
    2948                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_ADCINTFLG")
    2949                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    2950                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    2951              $C$DW$445       .dwtag  DW_TAG_member
    2952                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$24)
    2953                      .dwattr $C$DW$445, DW_AT_name("ADCINTFLGCLR")
    2954                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    2955                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    2956                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    2957              $C$DW$446       .dwtag  DW_TAG_member
    2958                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$24)
    2959                      .dwattr $C$DW$446, DW_AT_name("ADCINTOVF")
    2960                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_ADCINTOVF")
    2961                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    2962                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    2963              $C$DW$447       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$24)
    2965                      .dwattr $C$DW$447, DW_AT_name("ADCINTOVFCLR")
    2966                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    2967                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    2968                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    2969              $C$DW$448       .dwtag  DW_TAG_member
    2970                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$28)
    2971                      .dwattr $C$DW$448, DW_AT_name("INTSELxNy")
    2972                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_INTSELxNy")
    2973                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    2974                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    2975              $C$DW$449       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$29)
    2977                      .dwattr $C$DW$449, DW_AT_name("rsvd_3")
    2978                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_rsvd_3")
    2979                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    2980                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    2981              $C$DW$450       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$24)
    2983                      .dwattr $C$DW$450, DW_AT_name("SOCPRICTRL")
    2984                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_SOCPRICTRL")
    2985                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    2986                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    2987              $C$DW$451       .dwtag  DW_TAG_member
    2988                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$24)
    2989                      .dwattr $C$DW$451, DW_AT_name("rsvd_4")
    2990                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_rsvd_4")
    2991                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    2992                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   60

    2993              $C$DW$452       .dwtag  DW_TAG_member
    2994                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$24)
    2995                      .dwattr $C$DW$452, DW_AT_name("ADCSAMPLEMODE")
    2996                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    2997                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    2998                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    2999              $C$DW$453       .dwtag  DW_TAG_member
    3000                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$24)
    3001                      .dwattr $C$DW$453, DW_AT_name("rsvd_5")
    3002                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_rsvd_5")
    3003                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3004                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3005              $C$DW$454       .dwtag  DW_TAG_member
    3006                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$24)
    3007                      .dwattr $C$DW$454, DW_AT_name("ADCINTSOCSEL1")
    3008                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3009                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3010                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3011              $C$DW$455       .dwtag  DW_TAG_member
    3012                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$24)
    3013                      .dwattr $C$DW$455, DW_AT_name("ADCINTSOCSEL2")
    3014                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3015                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3016                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3017              $C$DW$456       .dwtag  DW_TAG_member
    3018                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$27)
    3019                      .dwattr $C$DW$456, DW_AT_name("rsvd_6")
    3020                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_rsvd_6")
    3021                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3022                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3023              $C$DW$457       .dwtag  DW_TAG_member
    3024                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$24)
    3025                      .dwattr $C$DW$457, DW_AT_name("ADCSOCFLG1")
    3026                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3027                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3028                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3029              $C$DW$458       .dwtag  DW_TAG_member
    3030                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$24)
    3031                      .dwattr $C$DW$458, DW_AT_name("rsvd_7")
    3032                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_rsvd_7")
    3033                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3034                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3035              $C$DW$459       .dwtag  DW_TAG_member
    3036                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$24)
    3037                      .dwattr $C$DW$459, DW_AT_name("ADCSOCFRC1")
    3038                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3039                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3040                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3041              $C$DW$460       .dwtag  DW_TAG_member
    3042                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$24)
    3043                      .dwattr $C$DW$460, DW_AT_name("rsvd_8")
    3044                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_rsvd_8")
    3045                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3046                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3047              $C$DW$461       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   61

    3048                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$24)
    3049                      .dwattr $C$DW$461, DW_AT_name("ADCSOCOVF1")
    3050                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3051                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3052                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3053              $C$DW$462       .dwtag  DW_TAG_member
    3054                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$24)
    3055                      .dwattr $C$DW$462, DW_AT_name("rsvd_9")
    3056                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_rsvd_9")
    3057                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3058                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3059              $C$DW$463       .dwtag  DW_TAG_member
    3060                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$24)
    3061                      .dwattr $C$DW$463, DW_AT_name("ADCSOCOVFCLR1")
    3062                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3063                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3064                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3065              $C$DW$464       .dwtag  DW_TAG_member
    3066                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$24)
    3067                      .dwattr $C$DW$464, DW_AT_name("rsvd_10")
    3068                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_rsvd_10")
    3069                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3070                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3071              $C$DW$465       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$25)
    3073                      .dwattr $C$DW$465, DW_AT_name("ADCSOCxCTL")
    3074                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3075                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3076                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3077              $C$DW$466       .dwtag  DW_TAG_member
    3078                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$25)
    3079                      .dwattr $C$DW$466, DW_AT_name("rsvd_11")
    3080                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_rsvd_11")
    3081                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3082                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3083              $C$DW$467       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$24)
    3085                      .dwattr $C$DW$467, DW_AT_name("ADCREFTRIM")
    3086                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3087                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3088                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3089              $C$DW$468       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$24)
    3091                      .dwattr $C$DW$468, DW_AT_name("ADCOFFTRIM")
    3092                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3093                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3094                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3095              $C$DW$469       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$30)
    3097                      .dwattr $C$DW$469, DW_AT_name("resvd_12")
    3098                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_resvd_12")
    3099                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3100                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3101              $C$DW$470       .dwtag  DW_TAG_member
    3102                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   62

    3103                      .dwattr $C$DW$470, DW_AT_name("ADCREV")
    3104                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_ADCREV")
    3105                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3106                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3107                      .dwendtag $C$DW$T$31
    3108              
    3109              $C$DW$T$196     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3110                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$31)
    3111                      .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    3112              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    3113                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$31)
    3114                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    3115              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3116                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3117                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3118              
    3119              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3120                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    3121                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    3122              $C$DW$471       .dwtag  DW_TAG_member
    3123                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$32)
    3124                      .dwattr $C$DW$471, DW_AT_name("alpha_sf")
    3125                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_alpha_sf")
    3126                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3127                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3128              $C$DW$472       .dwtag  DW_TAG_member
    3129                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$32)
    3130                      .dwattr $C$DW$472, DW_AT_name("beta_sf")
    3131                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_beta_sf")
    3132                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3133                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3134              $C$DW$473       .dwtag  DW_TAG_member
    3135                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$33)
    3136                      .dwattr $C$DW$473, DW_AT_name("numSensors")
    3137                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_numSensors")
    3138                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3139                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3140                      .dwendtag $C$DW$T$34
    3141              
    3142              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3143                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    3144                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3145              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3146                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    3147                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    3148              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3149                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3150                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3151              
    3152              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3153                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    3154                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    3155              $C$DW$474       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$24)
    3157                      .dwattr $C$DW$474, DW_AT_name("XCLK")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   63

    3158                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_XCLK")
    3159                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3160                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3161              $C$DW$475       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$24)
    3163                      .dwattr $C$DW$475, DW_AT_name("rsvd_1")
    3164                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_rsvd_1")
    3165                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3166                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3167              $C$DW$476       .dwtag  DW_TAG_member
    3168                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$24)
    3169                      .dwattr $C$DW$476, DW_AT_name("CLKCTL")
    3170                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_CLKCTL")
    3171                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3172                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3173              $C$DW$477       .dwtag  DW_TAG_member
    3174                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$35)
    3175                      .dwattr $C$DW$477, DW_AT_name("rsvd_2")
    3176                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_rsvd_2")
    3177                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3178                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3179              $C$DW$478       .dwtag  DW_TAG_member
    3180                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$24)
    3181                      .dwattr $C$DW$478, DW_AT_name("LOSPCP")
    3182                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_LOSPCP")
    3183                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3184                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3185              $C$DW$479       .dwtag  DW_TAG_member
    3186                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$24)
    3187                      .dwattr $C$DW$479, DW_AT_name("PCLKCR0")
    3188                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_PCLKCR0")
    3189                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3190                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3191              $C$DW$480       .dwtag  DW_TAG_member
    3192                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$24)
    3193                      .dwattr $C$DW$480, DW_AT_name("PCLKCR1")
    3194                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_PCLKCR1")
    3195                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3196                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3197              $C$DW$481       .dwtag  DW_TAG_member
    3198                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$27)
    3199                      .dwattr $C$DW$481, DW_AT_name("rsvd_3")
    3200                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_rsvd_3")
    3201                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3202                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3203              $C$DW$482       .dwtag  DW_TAG_member
    3204                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$24)
    3205                      .dwattr $C$DW$482, DW_AT_name("PCLKCR3")
    3206                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_PCLKCR3")
    3207                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3208                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3209                      .dwendtag $C$DW$T$36
    3210              
    3211              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    3212                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$36)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   64

    3213                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    3214              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3215                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3216                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3217              
    3218              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3219                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    3220                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3221              $C$DW$483       .dwtag  DW_TAG_member
    3222                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$33)
    3223                      .dwattr $C$DW$483, DW_AT_name("tmp")
    3224                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_tmp")
    3225                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3226                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3227                      .dwendtag $C$DW$T$37
    3228              
    3229              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    3230                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$37)
    3231                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    3232              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3233                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    3234                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3235              
    3236              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    3237                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    3238                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    3239              $C$DW$484       .dwtag  DW_TAG_member
    3240                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$38)
    3241                      .dwattr $C$DW$484, DW_AT_name("version")
    3242                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_version")
    3243                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3244                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3245              $C$DW$485       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$40)
    3247                      .dwattr $C$DW$485, DW_AT_name("state")
    3248                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_state")
    3249                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3250                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3251              $C$DW$486       .dwtag  DW_TAG_member
    3252                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$40)
    3253                      .dwattr $C$DW$486, DW_AT_name("prevState")
    3254                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_prevState")
    3255                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3256                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3257              $C$DW$487       .dwtag  DW_TAG_member
    3258                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$42)
    3259                      .dwattr $C$DW$487, DW_AT_name("errorCode")
    3260                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_errorCode")
    3261                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3262                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3263              $C$DW$488       .dwtag  DW_TAG_member
    3264                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$44)
    3265                      .dwattr $C$DW$488, DW_AT_name("clarkeHandle_I")
    3266                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3267                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   65

    3268                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3269              $C$DW$489       .dwtag  DW_TAG_member
    3270                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$45)
    3271                      .dwattr $C$DW$489, DW_AT_name("clarke_I")
    3272                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_clarke_I")
    3273                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3274                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3275              $C$DW$490       .dwtag  DW_TAG_member
    3276                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$44)
    3277                      .dwattr $C$DW$490, DW_AT_name("clarkeHandle_V")
    3278                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3279                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3280                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3281              $C$DW$491       .dwtag  DW_TAG_member
    3282                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$45)
    3283                      .dwattr $C$DW$491, DW_AT_name("clarke_V")
    3284                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_clarke_V")
    3285                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3286                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3287              $C$DW$492       .dwtag  DW_TAG_member
    3288                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$47)
    3289                      .dwattr $C$DW$492, DW_AT_name("estHandle")
    3290                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_estHandle")
    3291                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3292                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3293              $C$DW$493       .dwtag  DW_TAG_member
    3294                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$49)
    3295                      .dwattr $C$DW$493, DW_AT_name("parkHandle")
    3296                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_parkHandle")
    3297                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3298                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3299              $C$DW$494       .dwtag  DW_TAG_member
    3300                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$50)
    3301                      .dwattr $C$DW$494, DW_AT_name("park")
    3302                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_park")
    3303                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3304                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3305              $C$DW$495       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$52)
    3307                      .dwattr $C$DW$495, DW_AT_name("pidHandle_Id")
    3308                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_pidHandle_Id")
    3309                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3310                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3311              $C$DW$496       .dwtag  DW_TAG_member
    3312                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$53)
    3313                      .dwattr $C$DW$496, DW_AT_name("pid_Id")
    3314                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_pid_Id")
    3315                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3316                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3317              $C$DW$497       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$52)
    3319                      .dwattr $C$DW$497, DW_AT_name("pidHandle_Iq")
    3320                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3321                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3322                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   66

    3323              $C$DW$498       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$53)
    3325                      .dwattr $C$DW$498, DW_AT_name("pid_Iq")
    3326                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_pid_Iq")
    3327                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3328                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3329              $C$DW$499       .dwtag  DW_TAG_member
    3330                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$52)
    3331                      .dwattr $C$DW$499, DW_AT_name("pidHandle_spd")
    3332                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_pidHandle_spd")
    3333                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3334                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3335              $C$DW$500       .dwtag  DW_TAG_member
    3336                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$53)
    3337                      .dwattr $C$DW$500, DW_AT_name("pid_spd")
    3338                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_pid_spd")
    3339                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3340                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3341              $C$DW$501       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$55)
    3343                      .dwattr $C$DW$501, DW_AT_name("iparkHandle")
    3344                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_iparkHandle")
    3345                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3346                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3347              $C$DW$502       .dwtag  DW_TAG_member
    3348                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$56)
    3349                      .dwattr $C$DW$502, DW_AT_name("ipark")
    3350                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_ipark")
    3351                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3352                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3353              $C$DW$503       .dwtag  DW_TAG_member
    3354                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$58)
    3355                      .dwattr $C$DW$503, DW_AT_name("svgenHandle")
    3356                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_svgenHandle")
    3357                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3358                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3359              $C$DW$504       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$59)
    3361                      .dwattr $C$DW$504, DW_AT_name("svgen")
    3362                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_svgen")
    3363                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3364                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3365              $C$DW$505       .dwtag  DW_TAG_member
    3366                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$61)
    3367                      .dwattr $C$DW$505, DW_AT_name("trajHandle_Id")
    3368                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_trajHandle_Id")
    3369                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3370                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3371              $C$DW$506       .dwtag  DW_TAG_member
    3372                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$62)
    3373                      .dwattr $C$DW$506, DW_AT_name("traj_Id")
    3374                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_traj_Id")
    3375                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3376                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3377              $C$DW$507       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   67

    3378                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$61)
    3379                      .dwattr $C$DW$507, DW_AT_name("trajHandle_spd")
    3380                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_trajHandle_spd")
    3381                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3382                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3383              $C$DW$508       .dwtag  DW_TAG_member
    3384                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$62)
    3385                      .dwattr $C$DW$508, DW_AT_name("traj_spd")
    3386                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_traj_spd")
    3387                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3388                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3389              $C$DW$509       .dwtag  DW_TAG_member
    3390                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$61)
    3391                      .dwattr $C$DW$509, DW_AT_name("trajHandle_spdMax")
    3392                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3393                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3394                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3395              $C$DW$510       .dwtag  DW_TAG_member
    3396                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$62)
    3397                      .dwattr $C$DW$510, DW_AT_name("traj_spdMax")
    3398                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_traj_spdMax")
    3399                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3400                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3401              $C$DW$511       .dwtag  DW_TAG_member
    3402                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$63)
    3403                      .dwattr $C$DW$511, DW_AT_name("motorParams")
    3404                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_motorParams")
    3405                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3406                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3407              $C$DW$512       .dwtag  DW_TAG_member
    3408                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$66)
    3409                      .dwattr $C$DW$512, DW_AT_name("waitTimes")
    3410                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_waitTimes")
    3411                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3412                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3413              $C$DW$513       .dwtag  DW_TAG_member
    3414                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$65)
    3415                      .dwattr $C$DW$513, DW_AT_name("counter_state")
    3416                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_counter_state")
    3417                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3418                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3419              $C$DW$514       .dwtag  DW_TAG_member
    3420                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$67)
    3421                      .dwattr $C$DW$514, DW_AT_name("numIsrTicksPerCtrlTick")
    3422                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3423                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3424                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3425              $C$DW$515       .dwtag  DW_TAG_member
    3426                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$67)
    3427                      .dwattr $C$DW$515, DW_AT_name("numCtrlTicksPerCurrentTick")
    3428                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3429                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3430                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3431              $C$DW$516       .dwtag  DW_TAG_member
    3432                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$67)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   68

    3433                      .dwattr $C$DW$516, DW_AT_name("numCtrlTicksPerSpeedTick")
    3434                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3435                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3436                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3437              $C$DW$517       .dwtag  DW_TAG_member
    3438                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$67)
    3439                      .dwattr $C$DW$517, DW_AT_name("numCtrlTicksPerTrajTick")
    3440                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3441                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3442                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3443              $C$DW$518       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$65)
    3445                      .dwattr $C$DW$518, DW_AT_name("ctrlFreq_Hz")
    3446                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3447                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3448                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3449              $C$DW$519       .dwtag  DW_TAG_member
    3450                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$65)
    3451                      .dwattr $C$DW$519, DW_AT_name("trajFreq_Hz")
    3452                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3453                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3454                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    3455              $C$DW$520       .dwtag  DW_TAG_member
    3456                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$32)
    3457                      .dwattr $C$DW$520, DW_AT_name("trajPeriod_sec")
    3458                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3459                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3460                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    3461              $C$DW$521       .dwtag  DW_TAG_member
    3462                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$68)
    3463                      .dwattr $C$DW$521, DW_AT_name("ctrlPeriod_sec")
    3464                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3465                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3466                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    3467              $C$DW$522       .dwtag  DW_TAG_member
    3468                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$32)
    3469                      .dwattr $C$DW$522, DW_AT_name("maxVsMag_pu")
    3470                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3471                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3472                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    3473              $C$DW$523       .dwtag  DW_TAG_member
    3474                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$69)
    3475                      .dwattr $C$DW$523, DW_AT_name("Iab_in")
    3476                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_Iab_in")
    3477                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3478                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    3479              $C$DW$524       .dwtag  DW_TAG_member
    3480                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$69)
    3481                      .dwattr $C$DW$524, DW_AT_name("Iab_filt")
    3482                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_Iab_filt")
    3483                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3484                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    3485              $C$DW$525       .dwtag  DW_TAG_member
    3486                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$69)
    3487                      .dwattr $C$DW$525, DW_AT_name("Idq_in")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   69

    3488                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_Idq_in")
    3489                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3490                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    3491              $C$DW$526       .dwtag  DW_TAG_member
    3492                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$69)
    3493                      .dwattr $C$DW$526, DW_AT_name("Vab_in")
    3494                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_Vab_in")
    3495                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3496                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    3497              $C$DW$527       .dwtag  DW_TAG_member
    3498                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$32)
    3499                      .dwattr $C$DW$527, DW_AT_name("spd_out")
    3500                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_spd_out")
    3501                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3502                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    3503              $C$DW$528       .dwtag  DW_TAG_member
    3504                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$69)
    3505                      .dwattr $C$DW$528, DW_AT_name("Vab_out")
    3506                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_Vab_out")
    3507                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3508                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    3509              $C$DW$529       .dwtag  DW_TAG_member
    3510                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$69)
    3511                      .dwattr $C$DW$529, DW_AT_name("Vdq_out")
    3512                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_Vdq_out")
    3513                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3514                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    3515              $C$DW$530       .dwtag  DW_TAG_member
    3516                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$68)
    3517                      .dwattr $C$DW$530, DW_AT_name("Rhf")
    3518                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_Rhf")
    3519                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3520                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    3521              $C$DW$531       .dwtag  DW_TAG_member
    3522                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$68)
    3523                      .dwattr $C$DW$531, DW_AT_name("Lhf")
    3524                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_Lhf")
    3525                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3526                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    3527              $C$DW$532       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$68)
    3529                      .dwattr $C$DW$532, DW_AT_name("RoverL")
    3530                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_RoverL")
    3531                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3532                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    3533              $C$DW$533       .dwtag  DW_TAG_member
    3534                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$32)
    3535                      .dwattr $C$DW$533, DW_AT_name("Kp_Id")
    3536                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_Kp_Id")
    3537                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3538                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    3539              $C$DW$534       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$32)
    3541                      .dwattr $C$DW$534, DW_AT_name("Kp_Iq")
    3542                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_Kp_Iq")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   70

    3543                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3544                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    3545              $C$DW$535       .dwtag  DW_TAG_member
    3546                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$32)
    3547                      .dwattr $C$DW$535, DW_AT_name("Kp_spd")
    3548                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_Kp_spd")
    3549                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3550                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    3551              $C$DW$536       .dwtag  DW_TAG_member
    3552                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$32)
    3553                      .dwattr $C$DW$536, DW_AT_name("Ki_Id")
    3554                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_Ki_Id")
    3555                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3556                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    3557              $C$DW$537       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$32)
    3559                      .dwattr $C$DW$537, DW_AT_name("Ki_Iq")
    3560                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_Ki_Iq")
    3561                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3562                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    3563              $C$DW$538       .dwtag  DW_TAG_member
    3564                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$32)
    3565                      .dwattr $C$DW$538, DW_AT_name("Ki_spd")
    3566                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_Ki_spd")
    3567                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3568                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    3569              $C$DW$539       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$32)
    3571                      .dwattr $C$DW$539, DW_AT_name("Kd_Id")
    3572                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_Kd_Id")
    3573                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3574                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    3575              $C$DW$540       .dwtag  DW_TAG_member
    3576                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$32)
    3577                      .dwattr $C$DW$540, DW_AT_name("Kd_Iq")
    3578                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_Kd_Iq")
    3579                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3580                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    3581              $C$DW$541       .dwtag  DW_TAG_member
    3582                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$32)
    3583                      .dwattr $C$DW$541, DW_AT_name("Kd_spd")
    3584                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_Kd_spd")
    3585                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3586                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3587              $C$DW$542       .dwtag  DW_TAG_member
    3588                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$32)
    3589                      .dwattr $C$DW$542, DW_AT_name("Ui_Id")
    3590                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_Ui_Id")
    3591                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3592                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3593              $C$DW$543       .dwtag  DW_TAG_member
    3594                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$32)
    3595                      .dwattr $C$DW$543, DW_AT_name("Ui_Iq")
    3596                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_Ui_Iq")
    3597                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   71

    3598                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3599              $C$DW$544       .dwtag  DW_TAG_member
    3600                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$32)
    3601                      .dwattr $C$DW$544, DW_AT_name("Ui_spd")
    3602                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_Ui_spd")
    3603                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3604                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3605              $C$DW$545       .dwtag  DW_TAG_member
    3606                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$69)
    3607                      .dwattr $C$DW$545, DW_AT_name("Idq_ref")
    3608                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_Idq_ref")
    3609                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3610                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3611              $C$DW$546       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$32)
    3613                      .dwattr $C$DW$546, DW_AT_name("IdRated")
    3614                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_IdRated")
    3615                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3616                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    3617              $C$DW$547       .dwtag  DW_TAG_member
    3618                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$32)
    3619                      .dwattr $C$DW$547, DW_AT_name("spd_ref")
    3620                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_spd_ref")
    3621                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3622                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3623              $C$DW$548       .dwtag  DW_TAG_member
    3624                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$32)
    3625                      .dwattr $C$DW$548, DW_AT_name("spd_max")
    3626                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_spd_max")
    3627                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3628                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    3629              $C$DW$549       .dwtag  DW_TAG_member
    3630                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$67)
    3631                      .dwattr $C$DW$549, DW_AT_name("counter_current")
    3632                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_counter_current")
    3633                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3634                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3635              $C$DW$550       .dwtag  DW_TAG_member
    3636                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$67)
    3637                      .dwattr $C$DW$550, DW_AT_name("counter_isr")
    3638                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_counter_isr")
    3639                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3640                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3641              $C$DW$551       .dwtag  DW_TAG_member
    3642                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$67)
    3643                      .dwattr $C$DW$551, DW_AT_name("counter_speed")
    3644                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_counter_speed")
    3645                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3646                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3647              $C$DW$552       .dwtag  DW_TAG_member
    3648                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$67)
    3649                      .dwattr $C$DW$552, DW_AT_name("counter_traj")
    3650                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_counter_traj")
    3651                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3652                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   72

    3653              $C$DW$553       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$70)
    3655                      .dwattr $C$DW$553, DW_AT_name("flag_enableCtrl")
    3656                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3657                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3658                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3659              $C$DW$554       .dwtag  DW_TAG_member
    3660                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$70)
    3661                      .dwattr $C$DW$554, DW_AT_name("flag_enableDcBusComp")
    3662                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3663                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3664                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3665              $C$DW$555       .dwtag  DW_TAG_member
    3666                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$70)
    3667                      .dwattr $C$DW$555, DW_AT_name("flag_enablePowerWarp")
    3668                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3669                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3670                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3671              $C$DW$556       .dwtag  DW_TAG_member
    3672                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$70)
    3673                      .dwattr $C$DW$556, DW_AT_name("flag_enableOffset")
    3674                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_flag_enableOffset")
    3675                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3676                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3677              $C$DW$557       .dwtag  DW_TAG_member
    3678                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$70)
    3679                      .dwattr $C$DW$557, DW_AT_name("flag_enableSpeedCtrl")
    3680                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3681                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3682                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3683              $C$DW$558       .dwtag  DW_TAG_member
    3684                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$70)
    3685                      .dwattr $C$DW$558, DW_AT_name("flag_enableUserMotorParams")
    3686                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3687                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3688                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3689              $C$DW$559       .dwtag  DW_TAG_member
    3690                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$69)
    3691                      .dwattr $C$DW$559, DW_AT_name("Idq_offset_pu")
    3692                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3693                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3694                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3695              $C$DW$560       .dwtag  DW_TAG_member
    3696                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$69)
    3697                      .dwattr $C$DW$560, DW_AT_name("Vdq_offset_pu")
    3698                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3699                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3700                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3701              $C$DW$561       .dwtag  DW_TAG_member
    3702                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$32)
    3703                      .dwattr $C$DW$561, DW_AT_name("angle_pu")
    3704                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_angle_pu")
    3705                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3706                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3707              $C$DW$562       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   73

    3708                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$32)
    3709                      .dwattr $C$DW$562, DW_AT_name("speed_ref_pu")
    3710                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_speed_ref_pu")
    3711                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3712                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3713              $C$DW$563       .dwtag  DW_TAG_member
    3714                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$32)
    3715                      .dwattr $C$DW$563, DW_AT_name("speed_fb_pu")
    3716                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_speed_fb_pu")
    3717                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3718                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3719              $C$DW$564       .dwtag  DW_TAG_member
    3720                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$32)
    3721                      .dwattr $C$DW$564, DW_AT_name("speed_outMax_pu")
    3722                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3723                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3724                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3725              $C$DW$565       .dwtag  DW_TAG_member
    3726                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$70)
    3727                      .dwattr $C$DW$565, DW_AT_name("flag_enableCurrentCtrl")
    3728                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3729                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3730                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3731                      .dwendtag $C$DW$T$71
    3732              
    3733              $C$DW$T$197     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3734                      .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$71)
    3735                      .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    3736              $C$DW$T$198     .dwtag  DW_TAG_pointer_type
    3737                      .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$197)
    3738                      .dwattr $C$DW$T$198, DW_AT_address_class(0x16)
    3739              $C$DW$T$170     .dwtag  DW_TAG_pointer_type
    3740                      .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$71)
    3741                      .dwattr $C$DW$T$170, DW_AT_address_class(0x16)
    3742              $C$DW$T$171     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3743                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$170)
    3744                      .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    3745              $C$DW$566       .dwtag  DW_TAG_TI_far_type
    3746                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$171)
    3747              $C$DW$T$199     .dwtag  DW_TAG_const_type
    3748                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$566)
    3749              
    3750              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    3751                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    3752                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    3753              $C$DW$567       .dwtag  DW_TAG_member
    3754                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$23)
    3755                      .dwattr $C$DW$567, DW_AT_name("rsvd")
    3756                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_rsvd")
    3757                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3758                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3759              $C$DW$568       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$73)
    3761                      .dwattr $C$DW$568, DW_AT_name("targetProc")
    3762                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_targetProc")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   74

    3763                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3764                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3765              $C$DW$569       .dwtag  DW_TAG_member
    3766                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$23)
    3767                      .dwattr $C$DW$569, DW_AT_name("major")
    3768                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_major")
    3769                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3770                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3771              $C$DW$570       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$23)
    3773                      .dwattr $C$DW$570, DW_AT_name("minor")
    3774                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_minor")
    3775                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3776                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3777                      .dwendtag $C$DW$T$74
    3778              
    3779              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3780                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    3781                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3782              $C$DW$T$207     .dwtag  DW_TAG_pointer_type
    3783                      .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$38)
    3784                      .dwattr $C$DW$T$207, DW_AT_address_class(0x16)
    3785              
    3786              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3787                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    3788                      .dwattr $C$DW$T$20, DW_AT_declaration
    3789                      .dwendtag $C$DW$T$20
    3790              
    3791              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3792                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
    3793                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3794              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3795                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3796                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3797              
    3798              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    3799                      .dwattr $C$DW$T$75, DW_AT_name("_FILTER_FO_")
    3800                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x0a)
    3801              $C$DW$571       .dwtag  DW_TAG_member
    3802                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$32)
    3803                      .dwattr $C$DW$571, DW_AT_name("a1")
    3804                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_a1")
    3805                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3806                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3807              $C$DW$572       .dwtag  DW_TAG_member
    3808                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$32)
    3809                      .dwattr $C$DW$572, DW_AT_name("b0")
    3810                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_b0")
    3811                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3812                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3813              $C$DW$573       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$32)
    3815                      .dwattr $C$DW$573, DW_AT_name("b1")
    3816                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_b1")
    3817                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   75

    3818                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3819              $C$DW$574       .dwtag  DW_TAG_member
    3820                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$32)
    3821                      .dwattr $C$DW$574, DW_AT_name("x1")
    3822                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_x1")
    3823                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3824                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3825              $C$DW$575       .dwtag  DW_TAG_member
    3826                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$32)
    3827                      .dwattr $C$DW$575, DW_AT_name("y1")
    3828                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_y1")
    3829                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3830                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3831                      .dwendtag $C$DW$T$75
    3832              
    3833              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    3834                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$75)
    3835                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    3836              
    3837              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3838                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    3839                      .dwattr $C$DW$T$21, DW_AT_declaration
    3840                      .dwendtag $C$DW$T$21
    3841              
    3842              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    3843                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$21)
    3844                      .dwattr $C$DW$T$135, DW_AT_address_class(0x16)
    3845              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    3846                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
    3847                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    3848              
    3849              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3850                      .dwattr $C$DW$T$76, DW_AT_name("_FLASH_Obj_")
    3851                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    3852              $C$DW$576       .dwtag  DW_TAG_member
    3853                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$24)
    3854                      .dwattr $C$DW$576, DW_AT_name("FOPT")
    3855                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_FOPT")
    3856                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3857                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3858              $C$DW$577       .dwtag  DW_TAG_member
    3859                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$24)
    3860                      .dwattr $C$DW$577, DW_AT_name("rsvd_1")
    3861                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_rsvd_1")
    3862                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3863                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3864              $C$DW$578       .dwtag  DW_TAG_member
    3865                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$24)
    3866                      .dwattr $C$DW$578, DW_AT_name("FPWR")
    3867                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_FPWR")
    3868                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3869                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3870              $C$DW$579       .dwtag  DW_TAG_member
    3871                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$24)
    3872                      .dwattr $C$DW$579, DW_AT_name("FSTATUS")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   76

    3873                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_FSTATUS")
    3874                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3875                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3876              $C$DW$580       .dwtag  DW_TAG_member
    3877                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$24)
    3878                      .dwattr $C$DW$580, DW_AT_name("FSTDBYWAIT")
    3879                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    3880                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3881                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3882              $C$DW$581       .dwtag  DW_TAG_member
    3883                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$24)
    3884                      .dwattr $C$DW$581, DW_AT_name("FACTIVEWAIT")
    3885                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    3886                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3887                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3888              $C$DW$582       .dwtag  DW_TAG_member
    3889                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$24)
    3890                      .dwattr $C$DW$582, DW_AT_name("FBANKWAIT")
    3891                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_FBANKWAIT")
    3892                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3893                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3894              $C$DW$583       .dwtag  DW_TAG_member
    3895                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$24)
    3896                      .dwattr $C$DW$583, DW_AT_name("FOTPWAIT")
    3897                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_FOTPWAIT")
    3898                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3899                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3900                      .dwendtag $C$DW$T$76
    3901              
    3902              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    3903                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$76)
    3904                      .dwattr $C$DW$T$89, DW_AT_address_class(0x16)
    3905              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    3906                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    3907                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    3908              
    3909              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    3910                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
    3911                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
    3912              $C$DW$584       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$77)
    3914                      .dwattr $C$DW$584, DW_AT_name("GPACTRL")
    3915                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_GPACTRL")
    3916                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3917                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3918              $C$DW$585       .dwtag  DW_TAG_member
    3919                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$77)
    3920                      .dwattr $C$DW$585, DW_AT_name("GPAQSEL1")
    3921                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_GPAQSEL1")
    3922                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3923                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3924              $C$DW$586       .dwtag  DW_TAG_member
    3925                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$77)
    3926                      .dwattr $C$DW$586, DW_AT_name("GPAQSEL2")
    3927                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_GPAQSEL2")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   77

    3928                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3929                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3930              $C$DW$587       .dwtag  DW_TAG_member
    3931                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$77)
    3932                      .dwattr $C$DW$587, DW_AT_name("GPAMUX1")
    3933                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_GPAMUX1")
    3934                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3935                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3936              $C$DW$588       .dwtag  DW_TAG_member
    3937                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$77)
    3938                      .dwattr $C$DW$588, DW_AT_name("GPAMUX2")
    3939                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_GPAMUX2")
    3940                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3941                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3942              $C$DW$589       .dwtag  DW_TAG_member
    3943                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$77)
    3944                      .dwattr $C$DW$589, DW_AT_name("GPADIR")
    3945                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_GPADIR")
    3946                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3947                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3948              $C$DW$590       .dwtag  DW_TAG_member
    3949                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$77)
    3950                      .dwattr $C$DW$590, DW_AT_name("GPAPUD")
    3951                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_GPAPUD")
    3952                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3953                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3954              $C$DW$591       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$27)
    3956                      .dwattr $C$DW$591, DW_AT_name("rsvd_1")
    3957                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_rsvd_1")
    3958                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3959                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3960              $C$DW$592       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$77)
    3962                      .dwattr $C$DW$592, DW_AT_name("GPBCTRL")
    3963                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_GPBCTRL")
    3964                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3965                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3966              $C$DW$593       .dwtag  DW_TAG_member
    3967                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$77)
    3968                      .dwattr $C$DW$593, DW_AT_name("GPBQSEL1")
    3969                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_GPBQSEL1")
    3970                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3971                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3972              $C$DW$594       .dwtag  DW_TAG_member
    3973                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$27)
    3974                      .dwattr $C$DW$594, DW_AT_name("rsvd_2")
    3975                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_rsvd_2")
    3976                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3977                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3978              $C$DW$595       .dwtag  DW_TAG_member
    3979                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$77)
    3980                      .dwattr $C$DW$595, DW_AT_name("GPBMUX1")
    3981                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_GPBMUX1")
    3982                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   78

    3983                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3984              $C$DW$596       .dwtag  DW_TAG_member
    3985                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$27)
    3986                      .dwattr $C$DW$596, DW_AT_name("rsvd_3")
    3987                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_rsvd_3")
    3988                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3989                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    3990              $C$DW$597       .dwtag  DW_TAG_member
    3991                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$77)
    3992                      .dwattr $C$DW$597, DW_AT_name("GPBDIR")
    3993                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_GPBDIR")
    3994                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3995                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    3996              $C$DW$598       .dwtag  DW_TAG_member
    3997                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$77)
    3998                      .dwattr $C$DW$598, DW_AT_name("GPBPUD")
    3999                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_GPBPUD")
    4000                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4001                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4002              $C$DW$599       .dwtag  DW_TAG_member
    4003                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$78)
    4004                      .dwattr $C$DW$599, DW_AT_name("rsvd_4")
    4005                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_rsvd_4")
    4006                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4007                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4008              $C$DW$600       .dwtag  DW_TAG_member
    4009                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$77)
    4010                      .dwattr $C$DW$600, DW_AT_name("AIOMUX1")
    4011                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_AIOMUX1")
    4012                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4013                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4014              $C$DW$601       .dwtag  DW_TAG_member
    4015                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$27)
    4016                      .dwattr $C$DW$601, DW_AT_name("rsvd_5")
    4017                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_rsvd_5")
    4018                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4019                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4020              $C$DW$602       .dwtag  DW_TAG_member
    4021                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$77)
    4022                      .dwattr $C$DW$602, DW_AT_name("AIODIR")
    4023                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_AIODIR")
    4024                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4025                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4026              $C$DW$603       .dwtag  DW_TAG_member
    4027                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$79)
    4028                      .dwattr $C$DW$603, DW_AT_name("rsvd_6")
    4029                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_rsvd_6")
    4030                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4031                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4032              $C$DW$604       .dwtag  DW_TAG_member
    4033                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$77)
    4034                      .dwattr $C$DW$604, DW_AT_name("GPADAT")
    4035                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_GPADAT")
    4036                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4037                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:10:07 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0792810                              PAGE   79

    4038              $C$DW$605       .dwtag  DW_TAG_member
    4039                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$77)
    4040                      .dwattr $C$DW$605, DW_AT_name("GPASET")
    4041                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_GPASET")
    4042                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4043                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4044              $C$DW$606       .dwtag  DW_TAG_member
    4045                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$77)
    4046                      .dwattr $C$DW$606, DW_AT_name("GPACLEAR")
    4047                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_GPACLEAR")
    4048                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4049                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4050              $C$DW$607       .dwtag  DW_TAG_member
    4051                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$77)
    4052                      .dwattr $C$DW$607, DW_AT_name("GPATOGGLE")
    4053                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_GPATOGGLE")
    4054                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
