TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 19:06:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1655610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Jun 19 19:06:58 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/drivers/flash/src/32b/f28x/f280
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;       c:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\165562 C

    1060              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_1"), DW_AT_const_value(0x01)
    1061              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_2"), DW_AT_const_value(0x02)
    1062              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_3"), DW_AT_const_value(0x03)
    1063              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_4"), DW_AT_const_value(0x04)
    1064              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_5"), DW_AT_const_value(0x05)
    1065              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_6"), DW_AT_const_value(0x06)
    1066              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_7"), DW_AT_const_value(0x07)
    1067              $C$DW$117       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_8"), DW_AT_const_value(0x08)
    1068              $C$DW$118       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_9"), DW_AT_const_value(0x09)
    1069              $C$DW$119       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_10"), DW_AT_const_value(0x0a
    1070              $C$DW$120       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_11"), DW_AT_const_value(0x0b
    1071              $C$DW$121       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_12"), DW_AT_const_value(0x0c
    1072              $C$DW$122       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_13"), DW_AT_const_value(0x0d
    1073              $C$DW$123       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_14"), DW_AT_const_value(0x0e
    1074              $C$DW$124       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_15"), DW_AT_const_value(0x0f
    1075                      .dwendtag $C$DW$T$40
    1076              
    1077              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_NumRandomWaitStates_e")
    1078                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1079                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1080              $C$DW$125       .dwtag  DW_TAG_TI_far_type
    1081                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$41)
    1082              $C$DW$T$42      .dwtag  DW_TAG_const_type
    1083                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$125)
    1084              
    1085              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    1086                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1087              $C$DW$126       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_1"), DW_AT_const_value(0x01)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 19:06:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1655610                              PAGE   21

    1088              $C$DW$127       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_2"), DW_AT_const_value(0x02)
    1089              $C$DW$128       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_3"), DW_AT_const_value(0x03)
    1090              $C$DW$129       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_4"), DW_AT_const_value(0x04)
    1091              $C$DW$130       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_5"), DW_AT_const_value(0x05)
    1092              $C$DW$131       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_6"), DW_AT_const_value(0x06)
    1093              $C$DW$132       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_7"), DW_AT_const_value(0x07)
    1094              $C$DW$133       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_8"), DW_AT_const_value(0x08)
    1095              $C$DW$134       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_9"), DW_AT_const_value(0x09)
    1096              $C$DW$135       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_10"), DW_AT_const_value(0x0a)
    1097              $C$DW$136       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_11"), DW_AT_const_value(0x0b)
    1098              $C$DW$137       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_12"), DW_AT_const_value(0x0c)
    1099              $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_13"), DW_AT_const_value(0x0d)
    1100              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_14"), DW_AT_const_value(0x0e)
    1101              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_15"), DW_AT_const_value(0x0f)
    1102                      .dwendtag $C$DW$T$43
    1103              
    1104              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_NumOtpWaitStates_e")
    1105                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1106                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1107              $C$DW$141       .dwtag  DW_TAG_TI_far_type
    1108                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$44)
    1109              $C$DW$T$45      .dwtag  DW_TAG_const_type
    1110                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$141)
    1111              
    1112              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1113                      .dwattr $C$DW$T$21, DW_AT_name("_FLASH_Obj_")
    1114                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    1115              $C$DW$142       .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1117                      .dwattr $C$DW$142, DW_AT_name("FOPT")
    1118                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_FOPT")
    1119                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1120                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1121              $C$DW$143       .dwtag  DW_TAG_member
    1122                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1123                      .dwattr $C$DW$143, DW_AT_name("rsvd_1")
    1124                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd_1")
    1125                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1126                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1127              $C$DW$144       .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1129                      .dwattr $C$DW$144, DW_AT_name("FPWR")
    1130                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_FPWR")
    1131                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1132                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1133              $C$DW$145       .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1135                      .dwattr $C$DW$145, DW_AT_name("FSTATUS")
    1136                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_FSTATUS")
    1137                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1138                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1139              $C$DW$146       .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1141                      .dwattr $C$DW$146, DW_AT_name("FSTDBYWAIT")
    1142                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_FSTDBYWAIT")
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 19:06:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1655610                              PAGE   22

    1143                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1144                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1145              $C$DW$147       .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    1147                      .dwattr $C$DW$147, DW_AT_name("FACTIVEWAIT")
    1148                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    1149                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1150                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1151              $C$DW$148       .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    1153                      .dwattr $C$DW$148, DW_AT_name("FBANKWAIT")
    1154                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_FBANKWAIT")
    1155                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1156                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1157              $C$DW$149       .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    1159                      .dwattr $C$DW$149, DW_AT_name("FOTPWAIT")
    1160                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_FOTPWAIT")
    1161                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1162                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1163                      .dwendtag $C$DW$T$21
    1164              
    1165              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Obj")
    1166                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$21)
    1167                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1168              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    1169                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
    1170                      .dwattr $C$DW$T$24, DW_AT_address_class(0x16)
    1171              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    1172                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1173                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1174              $C$DW$150       .dwtag  DW_TAG_TI_far_type
    1175                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$25)
    1176              $C$DW$T$47      .dwtag  DW_TAG_const_type
    1177                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$150)
    1178              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1179                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    1180              $C$DW$151       .dwtag  DW_TAG_TI_far_type
    1181                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$3)
    1182              $C$DW$T$53      .dwtag  DW_TAG_const_type
    1183                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$151)
    1184              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1185                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1186                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1187                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1188              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1189                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1190                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1191                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1192              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1193                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1194                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1195                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1196              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1197                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 19:06:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1655610                              PAGE   23

    1198                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1199                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1200              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1201                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1202                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1203                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1204              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1205                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1206                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1207                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1208              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1209                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1210                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1211              $C$DW$152       .dwtag  DW_TAG_TI_far_type
    1212                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1213              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
