TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 08:44:24 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4075                      .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    4076              
    4077              $C$DW$T$147     .dwtag  DW_TAG_enumeration_type
    4078                      .dwattr $C$DW$T$147, DW_AT_byte_size(0x01)
    4079              $C$DW$505       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_0"), DW_AT_const_value(0x00)
    4080              $C$DW$506       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_1"), DW_AT_const_value(0x01)
    4081              $C$DW$507       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_2"), DW_AT_const_value(0x02)
    4082              $C$DW$508       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_3"), DW_AT_const_value(0x03)
    4083              $C$DW$509       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_4"), DW_AT_const_value(0x04)
    4084              $C$DW$510       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_5"), DW_AT_const_value(0x05)
    4085              $C$DW$511       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    4086              $C$DW$512       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    4087              $C$DW$513       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    4088              $C$DW$514       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    4089              $C$DW$515       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    4090              $C$DW$516       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    4091              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    4092              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    4093              $C$DW$519       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    4094              $C$DW$520       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    4095                      .dwendtag $C$DW$T$147
    4096              
    4097              $C$DW$T$148     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    4098                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    4099                      .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    4100              
    4101              $C$DW$T$150     .dwtag  DW_TAG_enumeration_type
    4102                      .dwattr $C$DW$T$150, DW_AT_byte_size(0x01)
    4103              $C$DW$521       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    4104              $C$DW$522       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   84

    4105              $C$DW$523       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    4106              $C$DW$524       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    4107              $C$DW$525       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    4108              $C$DW$526       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    4109              $C$DW$527       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    4110              $C$DW$528       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    4111              $C$DW$529       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    4112              $C$DW$530       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    4113              $C$DW$531       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    4114              $C$DW$532       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    4115                      .dwendtag $C$DW$T$150
    4116              
    4117              $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    4118                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
    4119                      .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    4120              
    4121              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4122                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    4123                      .dwattr $C$DW$T$19, DW_AT_declaration
    4124                      .dwendtag $C$DW$T$19
    4125              
    4126              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    4127                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
    4128                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
    4129              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    4130                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    4131                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    4132              
    4133              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4134                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    4135                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    4136              $C$DW$533       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$25)
    4138                      .dwattr $C$DW$533, DW_AT_name("ADCRESULT")
    4139                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_ADCRESULT")
    4140                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4141                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4142              $C$DW$534       .dwtag  DW_TAG_member
    4143                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$26)
    4144                      .dwattr $C$DW$534, DW_AT_name("resvd_1")
    4145                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_resvd_1")
    4146                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4147                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4148              $C$DW$535       .dwtag  DW_TAG_member
    4149                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$24)
    4150                      .dwattr $C$DW$535, DW_AT_name("ADCCTL1")
    4151                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_ADCCTL1")
    4152                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4153                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    4154              $C$DW$536       .dwtag  DW_TAG_member
    4155                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$24)
    4156                      .dwattr $C$DW$536, DW_AT_name("ADCCTL2")
    4157                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_ADCCTL2")
    4158                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4159                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   85

    4160              $C$DW$537       .dwtag  DW_TAG_member
    4161                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$27)
    4162                      .dwattr $C$DW$537, DW_AT_name("rsvd_2")
    4163                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_rsvd_2")
    4164                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4165                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    4166              $C$DW$538       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$24)
    4168                      .dwattr $C$DW$538, DW_AT_name("ADCINTFLG")
    4169                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_ADCINTFLG")
    4170                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4171                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    4172              $C$DW$539       .dwtag  DW_TAG_member
    4173                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$24)
    4174                      .dwattr $C$DW$539, DW_AT_name("ADCINTFLGCLR")
    4175                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4176                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4177                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    4178              $C$DW$540       .dwtag  DW_TAG_member
    4179                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$24)
    4180                      .dwattr $C$DW$540, DW_AT_name("ADCINTOVF")
    4181                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_ADCINTOVF")
    4182                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4183                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    4184              $C$DW$541       .dwtag  DW_TAG_member
    4185                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$24)
    4186                      .dwattr $C$DW$541, DW_AT_name("ADCINTOVFCLR")
    4187                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4188                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4189                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    4190              $C$DW$542       .dwtag  DW_TAG_member
    4191                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$28)
    4192                      .dwattr $C$DW$542, DW_AT_name("INTSELxNy")
    4193                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_INTSELxNy")
    4194                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4195                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    4196              $C$DW$543       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$29)
    4198                      .dwattr $C$DW$543, DW_AT_name("rsvd_3")
    4199                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_rsvd_3")
    4200                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4201                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    4202              $C$DW$544       .dwtag  DW_TAG_member
    4203                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$24)
    4204                      .dwattr $C$DW$544, DW_AT_name("SOCPRICTRL")
    4205                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4206                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4207                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    4208              $C$DW$545       .dwtag  DW_TAG_member
    4209                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$24)
    4210                      .dwattr $C$DW$545, DW_AT_name("rsvd_4")
    4211                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_rsvd_4")
    4212                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4213                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    4214              $C$DW$546       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   86

    4215                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$24)
    4216                      .dwattr $C$DW$546, DW_AT_name("ADCSAMPLEMODE")
    4217                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4218                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4219                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    4220              $C$DW$547       .dwtag  DW_TAG_member
    4221                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$24)
    4222                      .dwattr $C$DW$547, DW_AT_name("rsvd_5")
    4223                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_rsvd_5")
    4224                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4225                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    4226              $C$DW$548       .dwtag  DW_TAG_member
    4227                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$24)
    4228                      .dwattr $C$DW$548, DW_AT_name("ADCINTSOCSEL1")
    4229                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4230                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4231                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    4232              $C$DW$549       .dwtag  DW_TAG_member
    4233                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$24)
    4234                      .dwattr $C$DW$549, DW_AT_name("ADCINTSOCSEL2")
    4235                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4236                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4237                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    4238              $C$DW$550       .dwtag  DW_TAG_member
    4239                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$27)
    4240                      .dwattr $C$DW$550, DW_AT_name("rsvd_6")
    4241                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_rsvd_6")
    4242                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4243                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    4244              $C$DW$551       .dwtag  DW_TAG_member
    4245                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$24)
    4246                      .dwattr $C$DW$551, DW_AT_name("ADCSOCFLG1")
    4247                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4248                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4249                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    4250              $C$DW$552       .dwtag  DW_TAG_member
    4251                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$24)
    4252                      .dwattr $C$DW$552, DW_AT_name("rsvd_7")
    4253                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_rsvd_7")
    4254                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4255                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    4256              $C$DW$553       .dwtag  DW_TAG_member
    4257                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$24)
    4258                      .dwattr $C$DW$553, DW_AT_name("ADCSOCFRC1")
    4259                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4260                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4261                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    4262              $C$DW$554       .dwtag  DW_TAG_member
    4263                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$24)
    4264                      .dwattr $C$DW$554, DW_AT_name("rsvd_8")
    4265                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_rsvd_8")
    4266                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4267                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    4268              $C$DW$555       .dwtag  DW_TAG_member
    4269                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   87

    4270                      .dwattr $C$DW$555, DW_AT_name("ADCSOCOVF1")
    4271                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4272                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4273                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    4274              $C$DW$556       .dwtag  DW_TAG_member
    4275                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$24)
    4276                      .dwattr $C$DW$556, DW_AT_name("rsvd_9")
    4277                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_rsvd_9")
    4278                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4279                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    4280              $C$DW$557       .dwtag  DW_TAG_member
    4281                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$24)
    4282                      .dwattr $C$DW$557, DW_AT_name("ADCSOCOVFCLR1")
    4283                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4284                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4285                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    4286              $C$DW$558       .dwtag  DW_TAG_member
    4287                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$24)
    4288                      .dwattr $C$DW$558, DW_AT_name("rsvd_10")
    4289                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_rsvd_10")
    4290                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4291                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    4292              $C$DW$559       .dwtag  DW_TAG_member
    4293                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$25)
    4294                      .dwattr $C$DW$559, DW_AT_name("ADCSOCxCTL")
    4295                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4296                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4297                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    4298              $C$DW$560       .dwtag  DW_TAG_member
    4299                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$25)
    4300                      .dwattr $C$DW$560, DW_AT_name("rsvd_11")
    4301                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_rsvd_11")
    4302                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4303                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    4304              $C$DW$561       .dwtag  DW_TAG_member
    4305                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$24)
    4306                      .dwattr $C$DW$561, DW_AT_name("ADCREFTRIM")
    4307                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4308                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4309                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    4310              $C$DW$562       .dwtag  DW_TAG_member
    4311                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$24)
    4312                      .dwattr $C$DW$562, DW_AT_name("ADCOFFTRIM")
    4313                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4314                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4315                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    4316              $C$DW$563       .dwtag  DW_TAG_member
    4317                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$30)
    4318                      .dwattr $C$DW$563, DW_AT_name("resvd_12")
    4319                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_resvd_12")
    4320                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4321                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    4322              $C$DW$564       .dwtag  DW_TAG_member
    4323                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$24)
    4324                      .dwattr $C$DW$564, DW_AT_name("ADCREV")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   88

    4325                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_ADCREV")
    4326                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4327                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    4328                      .dwendtag $C$DW$T$31
    4329              
    4330              $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    4331                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$31)
    4332                      .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    4333              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    4334                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$31)
    4335                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
    4336              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4337                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    4338                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4339              
    4340              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4341                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    4342                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    4343              $C$DW$565       .dwtag  DW_TAG_member
    4344                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$32)
    4345                      .dwattr $C$DW$565, DW_AT_name("alpha_sf")
    4346                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_alpha_sf")
    4347                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4348                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    4349              $C$DW$566       .dwtag  DW_TAG_member
    4350                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$32)
    4351                      .dwattr $C$DW$566, DW_AT_name("beta_sf")
    4352                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_beta_sf")
    4353                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4354                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    4355              $C$DW$567       .dwtag  DW_TAG_member
    4356                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$33)
    4357                      .dwattr $C$DW$567, DW_AT_name("numSensors")
    4358                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_numSensors")
    4359                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4360                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    4361                      .dwendtag $C$DW$T$34
    4362              
    4363              $C$DW$T$154     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    4364                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$34)
    4365                      .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    4366              $C$DW$T$155     .dwtag  DW_TAG_pointer_type
    4367                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$34)
    4368                      .dwattr $C$DW$T$155, DW_AT_address_class(0x16)
    4369              $C$DW$T$156     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    4370                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$155)
    4371                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    4372              $C$DW$568       .dwtag  DW_TAG_TI_far_type
    4373                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$156)
    4374              $C$DW$T$157     .dwtag  DW_TAG_const_type
    4375                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$568)
    4376              
    4377              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4378                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    4379                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   89

    4380              $C$DW$569       .dwtag  DW_TAG_member
    4381                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$24)
    4382                      .dwattr $C$DW$569, DW_AT_name("XCLK")
    4383                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_XCLK")
    4384                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4385                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    4386              $C$DW$570       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$24)
    4388                      .dwattr $C$DW$570, DW_AT_name("rsvd_1")
    4389                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_rsvd_1")
    4390                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4391                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    4392              $C$DW$571       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$24)
    4394                      .dwattr $C$DW$571, DW_AT_name("CLKCTL")
    4395                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_CLKCTL")
    4396                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4397                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    4398              $C$DW$572       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$35)
    4400                      .dwattr $C$DW$572, DW_AT_name("rsvd_2")
    4401                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_rsvd_2")
    4402                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4403                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    4404              $C$DW$573       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$24)
    4406                      .dwattr $C$DW$573, DW_AT_name("LOSPCP")
    4407                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_LOSPCP")
    4408                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4409                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    4410              $C$DW$574       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$24)
    4412                      .dwattr $C$DW$574, DW_AT_name("PCLKCR0")
    4413                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_PCLKCR0")
    4414                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4415                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    4416              $C$DW$575       .dwtag  DW_TAG_member
    4417                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$24)
    4418                      .dwattr $C$DW$575, DW_AT_name("PCLKCR1")
    4419                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_PCLKCR1")
    4420                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4421                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    4422              $C$DW$576       .dwtag  DW_TAG_member
    4423                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$27)
    4424                      .dwattr $C$DW$576, DW_AT_name("rsvd_3")
    4425                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_rsvd_3")
    4426                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4427                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    4428              $C$DW$577       .dwtag  DW_TAG_member
    4429                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$24)
    4430                      .dwattr $C$DW$577, DW_AT_name("PCLKCR3")
    4431                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_PCLKCR3")
    4432                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4433                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4434                      .dwendtag $C$DW$T$36
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   90

    4435              
    4436              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    4437                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$36)
    4438                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
    4439              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4440                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    4441                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4442              
    4443              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4444                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    4445                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4446              $C$DW$578       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$33)
    4448                      .dwattr $C$DW$578, DW_AT_name("tmp")
    4449                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_tmp")
    4450                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4451                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    4452                      .dwendtag $C$DW$T$37
    4453              
    4454              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    4455                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$37)
    4456                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
    4457              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4458                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4459                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4460              
    4461              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4462                      .dwattr $C$DW$T$40, DW_AT_name("_CTRL_Version_")
    4463                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    4464              $C$DW$579       .dwtag  DW_TAG_member
    4465                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$23)
    4466                      .dwattr $C$DW$579, DW_AT_name("rsvd")
    4467                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_rsvd")
    4468                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4469                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    4470              $C$DW$580       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$39)
    4472                      .dwattr $C$DW$580, DW_AT_name("targetProc")
    4473                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_targetProc")
    4474                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4475                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    4476              $C$DW$581       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$23)
    4478                      .dwattr $C$DW$581, DW_AT_name("major")
    4479                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_major")
    4480                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4481                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    4482              $C$DW$582       .dwtag  DW_TAG_member
    4483                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$23)
    4484                      .dwattr $C$DW$582, DW_AT_name("minor")
    4485                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_minor")
    4486                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4487                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    4488                      .dwendtag $C$DW$T$40
    4489              
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   91

    4490              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4491                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$40)
    4492                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    4493              
    4494              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4495                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    4496                      .dwattr $C$DW$T$20, DW_AT_declaration
    4497                      .dwendtag $C$DW$T$20
    4498              
    4499              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
    4500                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$20)
    4501                      .dwattr $C$DW$T$134, DW_AT_address_class(0x16)
    4502              $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4503                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    4504                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    4505              $C$DW$583       .dwtag  DW_TAG_TI_far_type
    4506                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$135)
    4507              $C$DW$T$164     .dwtag  DW_TAG_const_type
    4508                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$583)
    4509              
    4510              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4511                      .dwattr $C$DW$T$41, DW_AT_name("_FILTER_FO_")
    4512                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0a)
    4513              $C$DW$584       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$32)
    4515                      .dwattr $C$DW$584, DW_AT_name("a1")
    4516                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_a1")
    4517                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4518                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    4519              $C$DW$585       .dwtag  DW_TAG_member
    4520                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$32)
    4521                      .dwattr $C$DW$585, DW_AT_name("b0")
    4522                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_b0")
    4523                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4524                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    4525              $C$DW$586       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$32)
    4527                      .dwattr $C$DW$586, DW_AT_name("b1")
    4528                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_b1")
    4529                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4530                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    4531              $C$DW$587       .dwtag  DW_TAG_member
    4532                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$32)
    4533                      .dwattr $C$DW$587, DW_AT_name("x1")
    4534                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_x1")
    4535                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4536                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    4537              $C$DW$588       .dwtag  DW_TAG_member
    4538                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$32)
    4539                      .dwattr $C$DW$588, DW_AT_name("y1")
    4540                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_y1")
    4541                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4542                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    4543                      .dwendtag $C$DW$T$41
    4544              
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   92

    4545              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4546                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$41)
    4547                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    4548              
    4549              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4550                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    4551                      .dwattr $C$DW$T$21, DW_AT_declaration
    4552                      .dwendtag $C$DW$T$21
    4553              
    4554              $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    4555                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$21)
    4556                      .dwattr $C$DW$T$102, DW_AT_address_class(0x16)
    4557              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4558                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    4559                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    4560              
    4561              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    4562                      .dwattr $C$DW$T$42, DW_AT_name("_FLASH_Obj_")
    4563                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
    4564              $C$DW$589       .dwtag  DW_TAG_member
    4565                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$24)
    4566                      .dwattr $C$DW$589, DW_AT_name("FOPT")
    4567                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_FOPT")
    4568                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4569                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4570              $C$DW$590       .dwtag  DW_TAG_member
    4571                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$24)
    4572                      .dwattr $C$DW$590, DW_AT_name("rsvd_1")
    4573                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_rsvd_1")
    4574                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4575                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    4576              $C$DW$591       .dwtag  DW_TAG_member
    4577                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$24)
    4578                      .dwattr $C$DW$591, DW_AT_name("FPWR")
    4579                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_FPWR")
    4580                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4581                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4582              $C$DW$592       .dwtag  DW_TAG_member
    4583                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$24)
    4584                      .dwattr $C$DW$592, DW_AT_name("FSTATUS")
    4585                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_FSTATUS")
    4586                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4587                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4588              $C$DW$593       .dwtag  DW_TAG_member
    4589                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$24)
    4590                      .dwattr $C$DW$593, DW_AT_name("FSTDBYWAIT")
    4591                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4592                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4593                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    4594              $C$DW$594       .dwtag  DW_TAG_member
    4595                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$24)
    4596                      .dwattr $C$DW$594, DW_AT_name("FACTIVEWAIT")
    4597                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4598                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4599                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   93

    4600              $C$DW$595       .dwtag  DW_TAG_member
    4601                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$24)
    4602                      .dwattr $C$DW$595, DW_AT_name("FBANKWAIT")
    4603                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_FBANKWAIT")
    4604                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4605                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    4606              $C$DW$596       .dwtag  DW_TAG_member
    4607                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$24)
    4608                      .dwattr $C$DW$596, DW_AT_name("FOTPWAIT")
    4609                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_FOTPWAIT")
    4610                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4611                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4612                      .dwendtag $C$DW$T$42
    4613              
    4614              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    4615                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$42)
    4616                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
    4617              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4618                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    4619                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4620              
    4621              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    4622                      .dwattr $C$DW$T$47, DW_AT_name("_GPIO_Obj_")
    4623                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x6a)
    4624              $C$DW$597       .dwtag  DW_TAG_member
    4625                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$44)
    4626                      .dwattr $C$DW$597, DW_AT_name("GPACTRL")
    4627                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_GPACTRL")
    4628                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4629                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4630              $C$DW$598       .dwtag  DW_TAG_member
    4631                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$44)
    4632                      .dwattr $C$DW$598, DW_AT_name("GPAQSEL1")
    4633                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_GPAQSEL1")
    4634                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4635                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4636              $C$DW$599       .dwtag  DW_TAG_member
    4637                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$44)
    4638                      .dwattr $C$DW$599, DW_AT_name("GPAQSEL2")
    4639                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_GPAQSEL2")
    4640                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4641                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4642              $C$DW$600       .dwtag  DW_TAG_member
    4643                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$44)
    4644                      .dwattr $C$DW$600, DW_AT_name("GPAMUX1")
    4645                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_GPAMUX1")
    4646                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4647                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4648              $C$DW$601       .dwtag  DW_TAG_member
    4649                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$44)
    4650                      .dwattr $C$DW$601, DW_AT_name("GPAMUX2")
    4651                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_GPAMUX2")
    4652                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4653                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4654              $C$DW$602       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   94

    4655                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$44)
    4656                      .dwattr $C$DW$602, DW_AT_name("GPADIR")
    4657                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_GPADIR")
    4658                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4659                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4660              $C$DW$603       .dwtag  DW_TAG_member
    4661                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$44)
    4662                      .dwattr $C$DW$603, DW_AT_name("GPAPUD")
    4663                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_GPAPUD")
    4664                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4665                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4666              $C$DW$604       .dwtag  DW_TAG_member
    4667                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$27)
    4668                      .dwattr $C$DW$604, DW_AT_name("rsvd_1")
    4669                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_rsvd_1")
    4670                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4671                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4672              $C$DW$605       .dwtag  DW_TAG_member
    4673                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$44)
    4674                      .dwattr $C$DW$605, DW_AT_name("GPBCTRL")
    4675                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_GPBCTRL")
    4676                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4677                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4678              $C$DW$606       .dwtag  DW_TAG_member
    4679                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$44)
    4680                      .dwattr $C$DW$606, DW_AT_name("GPBQSEL1")
    4681                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_GPBQSEL1")
    4682                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4683                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4684              $C$DW$607       .dwtag  DW_TAG_member
    4685                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$27)
    4686                      .dwattr $C$DW$607, DW_AT_name("rsvd_2")
    4687                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_rsvd_2")
    4688                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4689                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4690              $C$DW$608       .dwtag  DW_TAG_member
    4691                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$44)
    4692                      .dwattr $C$DW$608, DW_AT_name("GPBMUX1")
    4693                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_GPBMUX1")
    4694                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4695                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4696              $C$DW$609       .dwtag  DW_TAG_member
    4697                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$27)
    4698                      .dwattr $C$DW$609, DW_AT_name("rsvd_3")
    4699                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_rsvd_3")
    4700                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4701                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4702              $C$DW$610       .dwtag  DW_TAG_member
    4703                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$44)
    4704                      .dwattr $C$DW$610, DW_AT_name("GPBDIR")
    4705                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_GPBDIR")
    4706                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4707                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4708              $C$DW$611       .dwtag  DW_TAG_member
    4709                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$44)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   95

    4710                      .dwattr $C$DW$611, DW_AT_name("GPBPUD")
    4711                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_GPBPUD")
    4712                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4713                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4714              $C$DW$612       .dwtag  DW_TAG_member
    4715                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$45)
    4716                      .dwattr $C$DW$612, DW_AT_name("rsvd_4")
    4717                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_rsvd_4")
    4718                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4719                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4720              $C$DW$613       .dwtag  DW_TAG_member
    4721                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$44)
    4722                      .dwattr $C$DW$613, DW_AT_name("AIOMUX1")
    4723                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_AIOMUX1")
    4724                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4725                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4726              $C$DW$614       .dwtag  DW_TAG_member
    4727                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$27)
    4728                      .dwattr $C$DW$614, DW_AT_name("rsvd_5")
    4729                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_rsvd_5")
    4730                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4731                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4732              $C$DW$615       .dwtag  DW_TAG_member
    4733                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$44)
    4734                      .dwattr $C$DW$615, DW_AT_name("AIODIR")
    4735                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_AIODIR")
    4736                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4737                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4738              $C$DW$616       .dwtag  DW_TAG_member
    4739                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$46)
    4740                      .dwattr $C$DW$616, DW_AT_name("rsvd_6")
    4741                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_rsvd_6")
    4742                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4743                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4744              $C$DW$617       .dwtag  DW_TAG_member
    4745                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$44)
    4746                      .dwattr $C$DW$617, DW_AT_name("GPADAT")
    4747                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_GPADAT")
    4748                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4749                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4750              $C$DW$618       .dwtag  DW_TAG_member
    4751                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$44)
    4752                      .dwattr $C$DW$618, DW_AT_name("GPASET")
    4753                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_GPASET")
    4754                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4755                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4756              $C$DW$619       .dwtag  DW_TAG_member
    4757                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$44)
    4758                      .dwattr $C$DW$619, DW_AT_name("GPACLEAR")
    4759                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_GPACLEAR")
    4760                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4761                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4762              $C$DW$620       .dwtag  DW_TAG_member
    4763                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$44)
    4764                      .dwattr $C$DW$620, DW_AT_name("GPATOGGLE")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   96

    4765                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_GPATOGGLE")
    4766                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4767                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4768              $C$DW$621       .dwtag  DW_TAG_member
    4769                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$44)
    4770                      .dwattr $C$DW$621, DW_AT_name("GPBDAT")
    4771                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_GPBDAT")
    4772                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4773                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4774              $C$DW$622       .dwtag  DW_TAG_member
    4775                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$44)
    4776                      .dwattr $C$DW$622, DW_AT_name("GPBSET")
    4777                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_GPBSET")
    4778                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4779                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4780              $C$DW$623       .dwtag  DW_TAG_member
    4781                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$44)
    4782                      .dwattr $C$DW$623, DW_AT_name("GPBCLEAR")
    4783                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_GPBCLEAR")
    4784                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4785                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4786              $C$DW$624       .dwtag  DW_TAG_member
    4787                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$44)
    4788                      .dwattr $C$DW$624, DW_AT_name("GPBTOGGLE")
    4789                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_GPBTOGGLE")
    4790                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4791                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4792              $C$DW$625       .dwtag  DW_TAG_member
    4793                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$35)
    4794                      .dwattr $C$DW$625, DW_AT_name("rsvd_7")
    4795                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_rsvd_7")
    4796                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4797                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4798              $C$DW$626       .dwtag  DW_TAG_member
    4799                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$44)
    4800                      .dwattr $C$DW$626, DW_AT_name("AIODAT")
    4801                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_AIODAT")
    4802                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4803                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4804              $C$DW$627       .dwtag  DW_TAG_member
    4805                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$44)
    4806                      .dwattr $C$DW$627, DW_AT_name("AIOSET")
    4807                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_AIOSET")
    4808                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    4809                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4810              $C$DW$628       .dwtag  DW_TAG_member
    4811                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$44)
    4812                      .dwattr $C$DW$628, DW_AT_name("AIOCLEAR")
    4813                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_AIOCLEAR")
    4814                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4815                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4816              $C$DW$629       .dwtag  DW_TAG_member
    4817                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$44)
    4818                      .dwattr $C$DW$629, DW_AT_name("AIOTOGGLE")
    4819                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_AIOTOGGLE")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   97

    4820                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4821                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4822              $C$DW$630       .dwtag  DW_TAG_member
    4823                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$29)
    4824                      .dwattr $C$DW$630, DW_AT_name("GPIOXINTnSEL")
    4825                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    4826                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4827                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4828              $C$DW$631       .dwtag  DW_TAG_member
    4829                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$28)
    4830                      .dwattr $C$DW$631, DW_AT_name("rsvd_8")
    4831                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_rsvd_8")
    4832                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4833                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4834              $C$DW$632       .dwtag  DW_TAG_member
    4835                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$44)
    4836                      .dwattr $C$DW$632, DW_AT_name("GPIOLPMSEL")
    4837                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    4838                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4839                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4840                      .dwendtag $C$DW$T$47
    4841              
    4842              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    4843                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$47)
    4844                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    4845              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    4846                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    4847                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4848              
    4849              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4850                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_AdcData_t_")
    4851                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x0e)
    4852              $C$DW$633       .dwtag  DW_TAG_member
    4853                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$48)
    4854                      .dwattr $C$DW$633, DW_AT_name("I")
    4855                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_I")
    4856                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4857                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4858              $C$DW$634       .dwtag  DW_TAG_member
    4859                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$48)
    4860                      .dwattr $C$DW$634, DW_AT_name("V")
    4861                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_V")
    4862                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4863                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4864              $C$DW$635       .dwtag  DW_TAG_member
    4865                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$32)
    4866                      .dwattr $C$DW$635, DW_AT_name("dcBus")
    4867                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_dcBus")
    4868                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4869                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4870                      .dwendtag $C$DW$T$49
    4871              
    4872              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    4873                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$49)
    4874                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   98

    4875              
    4876              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    4877                      .dwattr $C$DW$T$84, DW_AT_name("_HAL_Obj_")
    4878                      .dwattr $C$DW$T$84, DW_AT_byte_size(0xa8)
    4879              $C$DW$636       .dwtag  DW_TAG_member
    4880                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$51)
    4881                      .dwattr $C$DW$636, DW_AT_name("adcHandle")
    4882                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_adcHandle")
    4883                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4884                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4885              $C$DW$637       .dwtag  DW_TAG_member
    4886                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$53)
    4887                      .dwattr $C$DW$637, DW_AT_name("clkHandle")
    4888                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_clkHandle")
    4889                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4890                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4891              $C$DW$638       .dwtag  DW_TAG_member
    4892                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$55)
    4893                      .dwattr $C$DW$638, DW_AT_name("cpuHandle")
    4894                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_cpuHandle")
    4895                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4896                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4897              $C$DW$639       .dwtag  DW_TAG_member
    4898                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$57)
    4899                      .dwattr $C$DW$639, DW_AT_name("flashHandle")
    4900                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_flashHandle")
    4901                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4902                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4903              $C$DW$640       .dwtag  DW_TAG_member
    4904                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$59)
    4905                      .dwattr $C$DW$640, DW_AT_name("gpioHandle")
    4906                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_gpioHandle")
    4907                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4908                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4909              $C$DW$641       .dwtag  DW_TAG_member
    4910                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$62)
    4911                      .dwattr $C$DW$641, DW_AT_name("offsetHandle_I")
    4912                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_offsetHandle_I")
    4913                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4914                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4915              $C$DW$642       .dwtag  DW_TAG_member
    4916                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$64)
    4917                      .dwattr $C$DW$642, DW_AT_name("offset_I")
    4918                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_offset_I")
    4919                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4920                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4921              $C$DW$643       .dwtag  DW_TAG_member
    4922                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$62)
    4923                      .dwattr $C$DW$643, DW_AT_name("offsetHandle_V")
    4924                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_offsetHandle_V")
    4925                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4926                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4927              $C$DW$644       .dwtag  DW_TAG_member
    4928                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$64)
    4929                      .dwattr $C$DW$644, DW_AT_name("offset_V")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE   99

    4930                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_offset_V")
    4931                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4932                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4933              $C$DW$645       .dwtag  DW_TAG_member
    4934                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$66)
    4935                      .dwattr $C$DW$645, DW_AT_name("oscHandle")
    4936                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_oscHandle")
    4937                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    4938                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4939              $C$DW$646       .dwtag  DW_TAG_member
    4940                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$68)
    4941                      .dwattr $C$DW$646, DW_AT_name("pieHandle")
    4942                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_pieHandle")
    4943                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4944                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4945              $C$DW$647       .dwtag  DW_TAG_member
    4946                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$70)
    4947                      .dwattr $C$DW$647, DW_AT_name("pllHandle")
    4948                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_pllHandle")
    4949                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4950                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4951              $C$DW$648       .dwtag  DW_TAG_member
    4952                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$73)
    4953                      .dwattr $C$DW$648, DW_AT_name("pwmHandle")
    4954                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_pwmHandle")
    4955                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    4956                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4957              $C$DW$649       .dwtag  DW_TAG_member
    4958                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$73)
    4959                      .dwattr $C$DW$649, DW_AT_name("pwmDacHandle")
    4960                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_pwmDacHandle")
    4961                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    4962                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4963              $C$DW$650       .dwtag  DW_TAG_member
    4964                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$75)
    4965                      .dwattr $C$DW$650, DW_AT_name("pwrHandle")
    4966                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_pwrHandle")
    4967                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    4968                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4969              $C$DW$651       .dwtag  DW_TAG_member
    4970                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$78)
    4971                      .dwattr $C$DW$651, DW_AT_name("timerHandle")
    4972                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_timerHandle")
    4973                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    4974                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4975              $C$DW$652       .dwtag  DW_TAG_member
    4976                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$80)
    4977                      .dwattr $C$DW$652, DW_AT_name("i2cHandle")
    4978                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_i2cHandle")
    4979                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    4980                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4981              $C$DW$653       .dwtag  DW_TAG_member
    4982                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$82)
    4983                      .dwattr $C$DW$653, DW_AT_name("wdogHandle")
    4984                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_wdogHandle")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE  100

    4985                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4986                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4987              $C$DW$654       .dwtag  DW_TAG_member
    4988                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$83)
    4989                      .dwattr $C$DW$654, DW_AT_name("adcBias")
    4990                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_adcBias")
    4991                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    4992                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4993              $C$DW$655       .dwtag  DW_TAG_member
    4994                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$32)
    4995                      .dwattr $C$DW$655, DW_AT_name("current_sf")
    4996                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_current_sf")
    4997                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4998                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4999              $C$DW$656       .dwtag  DW_TAG_member
    5000                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$32)
    5001                      .dwattr $C$DW$656, DW_AT_name("voltage_sf")
    5002                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_voltage_sf")
    5003                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    5004                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    5005              $C$DW$657       .dwtag  DW_TAG_member
    5006                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$33)
    5007                      .dwattr $C$DW$657, DW_AT_name("numCurrentSensors")
    5008                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_numCurrentSensors")
    5009                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    5010                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    5011              $C$DW$658       .dwtag  DW_TAG_member
    5012                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$33)
    5013                      .dwattr $C$DW$658, DW_AT_name("numVoltageSensors")
    5014                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_numVoltageSensors")
    5015                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xa7]
    5016                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    5017                      .dwendtag $C$DW$T$84
    5018              
    5019              $C$DW$T$171     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    5020                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$84)
    5021                      .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    5022              $C$DW$T$172     .dwtag  DW_TAG_pointer_type
    5023                      .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
    5024                      .dwattr $C$DW$T$172, DW_AT_address_class(0x16)
    5025              $C$DW$T$173     .dwtag  DW_TAG_pointer_type
    5026                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$84)
    5027                      .dwattr $C$DW$T$173, DW_AT_address_class(0x16)
    5028              $C$DW$T$174     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    5029                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
    5030                      .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    5031              
    5032              $C$DW$T$85      .dwtag  DW_TAG_structure_type
    5033                      .dwattr $C$DW$T$85, DW_AT_name("_HAL_PwmData_t_")
    5034                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x06)
    5035              $C$DW$659       .dwtag  DW_TAG_member
    5036                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$48)
    5037                      .dwattr $C$DW$659, DW_AT_name("Tabc")
    5038                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_Tabc")
    5039                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE  101

    5040                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    5041                      .dwendtag $C$DW$T$85
    5042              
    5043              $C$DW$T$178     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_PwmData_t")
    5044                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$85)
    5045                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    5046              
    5047              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    5048                      .dwattr $C$DW$T$86, DW_AT_name("_IPARK_Obj_")
    5049                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x04)
    5050              $C$DW$660       .dwtag  DW_TAG_member
    5051                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$32)
    5052                      .dwattr $C$DW$660, DW_AT_name("sinTh")
    5053                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_sinTh")
    5054                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5055                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    5056              $C$DW$661       .dwtag  DW_TAG_member
    5057                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$32)
    5058                      .dwattr $C$DW$661, DW_AT_name("cosTh")
    5059                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_cosTh")
    5060                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5061                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    5062                      .dwendtag $C$DW$T$86
    5063              
    5064              $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    5065                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$86)
    5066                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    5067              $C$DW$T$182     .dwtag  DW_TAG_pointer_type
    5068                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$181)
    5069                      .dwattr $C$DW$T$182, DW_AT_address_class(0x16)
    5070              $C$DW$T$183     .dwtag  DW_TAG_pointer_type
    5071                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$86)
    5072                      .dwattr $C$DW$T$183, DW_AT_address_class(0x16)
    5073              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    5074                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
    5075                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    5076              
    5077              $C$DW$T$88      .dwtag  DW_TAG_structure_type
    5078                      .dwattr $C$DW$T$88, DW_AT_name("_MATH_vec2_")
    5079                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x04)
    5080              $C$DW$662       .dwtag  DW_TAG_member
    5081                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$87)
    5082                      .dwattr $C$DW$662, DW_AT_name("value")
    5083                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_value")
    5084                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5085                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    5086                      .dwendtag $C$DW$T$88
    5087              
    5088              $C$DW$T$188     .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    5089                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$88)
    5090                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    5091              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    5092                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$188)
    5093              $C$DW$T$189     .dwtag  DW_TAG_const_type
    5094                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$663)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE  102

    5095              $C$DW$T$190     .dwtag  DW_TAG_pointer_type
    5096                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$189)
    5097                      .dwattr $C$DW$T$190, DW_AT_address_class(0x16)
    5098              $C$DW$T$191     .dwtag  DW_TAG_pointer_type
    5099                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$188)
    5100                      .dwattr $C$DW$T$191, DW_AT_address_class(0x16)
    5101              
    5102              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    5103                      .dwattr $C$DW$T$90, DW_AT_name("_MATH_vec3_")
    5104                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x06)
    5105              $C$DW$664       .dwtag  DW_TAG_member
    5106                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$89)
    5107                      .dwattr $C$DW$664, DW_AT_name("value")
    5108                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_value")
    5109                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5110                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    5111                      .dwendtag $C$DW$T$90
    5112              
    5113              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    5114                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$90)
    5115                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    5116              
    5117              $C$DW$T$100     .dwtag  DW_TAG_structure_type
    5118                      .dwattr $C$DW$T$100, DW_AT_name("_MOTOR_Vars_t_")
    5119                      .dwattr $C$DW$T$100, DW_AT_byte_size(0x80)
    5120              $C$DW$665       .dwtag  DW_TAG_member
    5121                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$91)
    5122                      .dwattr $C$DW$665, DW_AT_name("Flag_enableSys")
    5123                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_Flag_enableSys")
    5124                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5125                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    5126              $C$DW$666       .dwtag  DW_TAG_member
    5127                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$91)
    5128                      .dwattr $C$DW$666, DW_AT_name("Flag_Run_Identify")
    5129                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_Flag_Run_Identify")
    5130                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5131                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    5132              $C$DW$667       .dwtag  DW_TAG_member
    5133                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$91)
    5134                      .dwattr $C$DW$667, DW_AT_name("Flag_MotorIdentified")
    5135                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_Flag_MotorIdentified")
    5136                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5137                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    5138              $C$DW$668       .dwtag  DW_TAG_member
    5139                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$91)
    5140                      .dwattr $C$DW$668, DW_AT_name("Flag_enableForceAngle")
    5141                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_Flag_enableForceAngle")
    5142                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5143                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    5144              $C$DW$669       .dwtag  DW_TAG_member
    5145                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$91)
    5146                      .dwattr $C$DW$669, DW_AT_name("Flag_enableFieldWeakening")
    5147                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_Flag_enableFieldWeakening")
    5148                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5149                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE  103

    5150              $C$DW$670       .dwtag  DW_TAG_member
    5151                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$91)
    5152                      .dwattr $C$DW$670, DW_AT_name("Flag_enableRsRecalc")
    5153                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_Flag_enableRsRecalc")
    5154                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5155                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    5156              $C$DW$671       .dwtag  DW_TAG_member
    5157                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$91)
    5158                      .dwattr $C$DW$671, DW_AT_name("Flag_enableUserParams")
    5159                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_Flag_enableUserParams")
    5160                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5161                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    5162              $C$DW$672       .dwtag  DW_TAG_member
    5163                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$91)
    5164                      .dwattr $C$DW$672, DW_AT_name("Flag_enableOffsetcalc")
    5165                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_Flag_enableOffsetcalc")
    5166                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5167                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    5168              $C$DW$673       .dwtag  DW_TAG_member
    5169                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$91)
    5170                      .dwattr $C$DW$673, DW_AT_name("Flag_enablePowerWarp")
    5171                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_Flag_enablePowerWarp")
    5172                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5173                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    5174              $C$DW$674       .dwtag  DW_TAG_member
    5175                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$91)
    5176                      .dwattr $C$DW$674, DW_AT_name("Flag_enableSpeedCtrl")
    5177                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_Flag_enableSpeedCtrl")
    5178                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5179                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    5180              $C$DW$675       .dwtag  DW_TAG_member
    5181                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$91)
    5182                      .dwattr $C$DW$675, DW_AT_name("Flag_enableRun")
    5183                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_Flag_enableRun")
    5184                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5185                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    5186              $C$DW$676       .dwtag  DW_TAG_member
    5187                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$91)
    5188                      .dwattr $C$DW$676, DW_AT_name("Flag_RunState")
    5189                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_Flag_RunState")
    5190                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5191                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    5192              $C$DW$677       .dwtag  DW_TAG_member
    5193                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$91)
    5194                      .dwattr $C$DW$677, DW_AT_name("Flag_enableFlyingStart")
    5195                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_Flag_enableFlyingStart")
    5196                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5197                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    5198              $C$DW$678       .dwtag  DW_TAG_member
    5199                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$93)
    5200                      .dwattr $C$DW$678, DW_AT_name("CtrlState")
    5201                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_CtrlState")
    5202                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5203                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    5204              $C$DW$679       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE  104

    5205                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$95)
    5206                      .dwattr $C$DW$679, DW_AT_name("EstState")
    5207                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_EstState")
    5208                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5209                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    5210              $C$DW$680       .dwtag  DW_TAG_member
    5211                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$97)
    5212                      .dwattr $C$DW$680, DW_AT_name("UserErrorCode")
    5213                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_UserErrorCode")
    5214                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5215                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    5216              $C$DW$681       .dwtag  DW_TAG_member
    5217                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$98)
    5218                      .dwattr $C$DW$681, DW_AT_name("CtrlVersion")
    5219                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_CtrlVersion")
    5220                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5221                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    5222              $C$DW$682       .dwtag  DW_TAG_member
    5223                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$32)
    5224                      .dwattr $C$DW$682, DW_AT_name("IdRef_A")
    5225                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_IdRef_A")
    5226                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5227                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    5228              $C$DW$683       .dwtag  DW_TAG_member
    5229                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$32)
    5230                      .dwattr $C$DW$683, DW_AT_name("IqRef_A")
    5231                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_IqRef_A")
    5232                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5233                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    5234              $C$DW$684       .dwtag  DW_TAG_member
    5235                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$32)
    5236                      .dwattr $C$DW$684, DW_AT_name("SpeedRef_pu")
    5237                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_SpeedRef_pu")
    5238                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5239                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    5240              $C$DW$685       .dwtag  DW_TAG_member
    5241                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$32)
    5242                      .dwattr $C$DW$685, DW_AT_name("SpeedRef_krpm")
    5243                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_SpeedRef_krpm")
    5244                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5245                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5246              $C$DW$686       .dwtag  DW_TAG_member
    5247                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$32)
    5248                      .dwattr $C$DW$686, DW_AT_name("SpeedTraj_krpm")
    5249                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_SpeedTraj_krpm")
    5250                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5251                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5252              $C$DW$687       .dwtag  DW_TAG_member
    5253                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$32)
    5254                      .dwattr $C$DW$687, DW_AT_name("MaxAccel_krpmps")
    5255                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_MaxAccel_krpmps")
    5256                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5257                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5258              $C$DW$688       .dwtag  DW_TAG_member
    5259                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0846811                              PAGE  105

    5260                      .dwattr $C$DW$688, DW_AT_name("Speed_krpm")
    5261                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_Speed_krpm")
    5262                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5263                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5264              $C$DW$689       .dwtag  DW_TAG_member
    5265                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$32)
    5266                      .dwattr $C$DW$689, DW_AT_name("OverModulation")
    5267                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_OverModulation")
    5268                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5269                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5270              $C$DW$690       .dwtag  DW_TAG_member
    5271                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$32)
    5272                      .dwattr $C$DW$690, DW_AT_name("RsOnLineCurrent_A")
    5273                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_RsOnLineCurrent_A")
    5274                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5275                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5276              $C$DW$691       .dwtag  DW_TAG_member
    5277                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$32)
    5278                      .dwattr $C$DW$691, DW_AT_name("SvgenMaxModulation_ticks")
    5279                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_SvgenMaxModulation_ticks")
    5280                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5281                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    5282              $C$DW$692       .dwtag  DW_TAG_member
    5283                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$32)
    5284                      .dwattr $C$DW$692, DW_AT_name("Flux_Wb")
    5285                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Flux_Wb")
    5286                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5287                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    5288              $C$DW$693       .dwtag  DW_TAG_member
