TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 08:44:25 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_d_pu")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_d_pu")

    2418              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_d_Low"), DW_AT_const_value(0x4
    2419              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_High"), DW_AT_const_value(0x
    2420              $C$DW$275       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_Low"), DW_AT_const_value(0x4
    2421              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_High"), DW_AT_const_value(0x
    2422              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_Low"), DW_AT_const_value(0x4
    2423              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_High"), DW_AT_const_v
    2424              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_Low"), DW_AT_const_va
    2425              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_High"), DW_AT_const_v
    2426              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_Low"), DW_AT_const_va
    2427              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    2428              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    2429              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    2430              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    2431              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    2432              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    2433              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    2434              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    2435              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    2436              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    2437              $C$DW$292       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    2438              $C$DW$293       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    2439              $C$DW$294       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    2440              $C$DW$295       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    2441              $C$DW$296       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    2442              $C$DW$297       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    2443              $C$DW$298       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    2444              $C$DW$299       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    2445              $C$DW$300       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    2446              $C$DW$301       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    2447              $C$DW$302       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    2448              $C$DW$303       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    2449              $C$DW$304       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    2450              $C$DW$305       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    2451              $C$DW$306       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    2452              $C$DW$307       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    2453              $C$DW$308       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    2454                      .dwendtag $C$DW$T$74
    2455              
    2456              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    2457                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2458                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2459              $C$DW$309       .dwtag  DW_TAG_TI_far_type
    2460                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$75)
    2461              $C$DW$T$77      .dwtag  DW_TAG_const_type
    2462                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$309)
    2463              
    2464              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2465                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    2466                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    2467              $C$DW$310       .dwtag  DW_TAG_member
    2468                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   50

    2469                      .dwattr $C$DW$310, DW_AT_name("alpha_sf")
    2470                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_alpha_sf")
    2471                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2473              $C$DW$311       .dwtag  DW_TAG_member
    2474                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
    2475                      .dwattr $C$DW$311, DW_AT_name("beta_sf")
    2476                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_beta_sf")
    2477                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2478                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2479              $C$DW$312       .dwtag  DW_TAG_member
    2480                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$22)
    2481                      .dwattr $C$DW$312, DW_AT_name("numSensors")
    2482                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_numSensors")
    2483                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2484                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2485                      .dwendtag $C$DW$T$23
    2486              
    2487              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    2488                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    2489                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2490              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2491                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    2492                      .dwattr $C$DW$T$29, DW_AT_address_class(0x16)
    2493              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    2494                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2495                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2496              
    2497              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2498                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    2499                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    2500              $C$DW$313       .dwtag  DW_TAG_member
    2501                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$24)
    2502                      .dwattr $C$DW$313, DW_AT_name("version")
    2503                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_version")
    2504                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2505                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2506              $C$DW$314       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$26)
    2508                      .dwattr $C$DW$314, DW_AT_name("state")
    2509                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_state")
    2510                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2511                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2512              $C$DW$315       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$26)
    2514                      .dwattr $C$DW$315, DW_AT_name("prevState")
    2515                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_prevState")
    2516                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2517                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2518              $C$DW$316       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$28)
    2520                      .dwattr $C$DW$316, DW_AT_name("errorCode")
    2521                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_errorCode")
    2522                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2523                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   51

    2524              $C$DW$317       .dwtag  DW_TAG_member
    2525                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$30)
    2526                      .dwattr $C$DW$317, DW_AT_name("clarkeHandle_I")
    2527                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_clarkeHandle_I")
    2528                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2529                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2530              $C$DW$318       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$31)
    2532                      .dwattr $C$DW$318, DW_AT_name("clarke_I")
    2533                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_clarke_I")
    2534                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2535                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2536              $C$DW$319       .dwtag  DW_TAG_member
    2537                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$30)
    2538                      .dwattr $C$DW$319, DW_AT_name("clarkeHandle_V")
    2539                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_clarkeHandle_V")
    2540                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2541                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2542              $C$DW$320       .dwtag  DW_TAG_member
    2543                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$31)
    2544                      .dwattr $C$DW$320, DW_AT_name("clarke_V")
    2545                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_clarke_V")
    2546                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2547                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2548              $C$DW$321       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$33)
    2550                      .dwattr $C$DW$321, DW_AT_name("estHandle")
    2551                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_estHandle")
    2552                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2553                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2554              $C$DW$322       .dwtag  DW_TAG_member
    2555                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$35)
    2556                      .dwattr $C$DW$322, DW_AT_name("parkHandle")
    2557                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_parkHandle")
    2558                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2559                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2560              $C$DW$323       .dwtag  DW_TAG_member
    2561                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$36)
    2562                      .dwattr $C$DW$323, DW_AT_name("park")
    2563                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_park")
    2564                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2565                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2566              $C$DW$324       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$38)
    2568                      .dwattr $C$DW$324, DW_AT_name("pidHandle_Id")
    2569                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_pidHandle_Id")
    2570                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2571                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2572              $C$DW$325       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$39)
    2574                      .dwattr $C$DW$325, DW_AT_name("pid_Id")
    2575                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_pid_Id")
    2576                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2577                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2578              $C$DW$326       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   52

    2579                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$38)
    2580                      .dwattr $C$DW$326, DW_AT_name("pidHandle_Iq")
    2581                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_pidHandle_Iq")
    2582                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2583                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2584              $C$DW$327       .dwtag  DW_TAG_member
    2585                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$39)
    2586                      .dwattr $C$DW$327, DW_AT_name("pid_Iq")
    2587                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_pid_Iq")
    2588                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2589                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2590              $C$DW$328       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$38)
    2592                      .dwattr $C$DW$328, DW_AT_name("pidHandle_spd")
    2593                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_pidHandle_spd")
    2594                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2595                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2596              $C$DW$329       .dwtag  DW_TAG_member
    2597                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$39)
    2598                      .dwattr $C$DW$329, DW_AT_name("pid_spd")
    2599                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_pid_spd")
    2600                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2601                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2602              $C$DW$330       .dwtag  DW_TAG_member
    2603                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$41)
    2604                      .dwattr $C$DW$330, DW_AT_name("iparkHandle")
    2605                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_iparkHandle")
    2606                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2607                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2608              $C$DW$331       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$42)
    2610                      .dwattr $C$DW$331, DW_AT_name("ipark")
    2611                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_ipark")
    2612                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2613                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2614              $C$DW$332       .dwtag  DW_TAG_member
    2615                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$44)
    2616                      .dwattr $C$DW$332, DW_AT_name("svgenHandle")
    2617                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_svgenHandle")
    2618                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2619                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2620              $C$DW$333       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$45)
    2622                      .dwattr $C$DW$333, DW_AT_name("svgen")
    2623                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_svgen")
    2624                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2625                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2626              $C$DW$334       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$47)
    2628                      .dwattr $C$DW$334, DW_AT_name("trajHandle_Id")
    2629                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_trajHandle_Id")
    2630                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2631                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2632              $C$DW$335       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$48)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   53

    2634                      .dwattr $C$DW$335, DW_AT_name("traj_Id")
    2635                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_traj_Id")
    2636                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2637                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2638              $C$DW$336       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$47)
    2640                      .dwattr $C$DW$336, DW_AT_name("trajHandle_spd")
    2641                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_trajHandle_spd")
    2642                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2643                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2644              $C$DW$337       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$48)
    2646                      .dwattr $C$DW$337, DW_AT_name("traj_spd")
    2647                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_traj_spd")
    2648                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2649                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2650              $C$DW$338       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$47)
    2652                      .dwattr $C$DW$338, DW_AT_name("trajHandle_spdMax")
    2653                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    2654                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2655                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2656              $C$DW$339       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$48)
    2658                      .dwattr $C$DW$339, DW_AT_name("traj_spdMax")
    2659                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_traj_spdMax")
    2660                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2661                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2662              $C$DW$340       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$49)
    2664                      .dwattr $C$DW$340, DW_AT_name("motorParams")
    2665                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_motorParams")
    2666                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2667                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2668              $C$DW$341       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$52)
    2670                      .dwattr $C$DW$341, DW_AT_name("waitTimes")
    2671                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_waitTimes")
    2672                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2673                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2674              $C$DW$342       .dwtag  DW_TAG_member
    2675                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$51)
    2676                      .dwattr $C$DW$342, DW_AT_name("counter_state")
    2677                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_counter_state")
    2678                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2679                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2680              $C$DW$343       .dwtag  DW_TAG_member
    2681                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$53)
    2682                      .dwattr $C$DW$343, DW_AT_name("numIsrTicksPerCtrlTick")
    2683                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    2684                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2685                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2686              $C$DW$344       .dwtag  DW_TAG_member
    2687                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$53)
    2688                      .dwattr $C$DW$344, DW_AT_name("numCtrlTicksPerCurrentTick")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   54

    2689                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    2690                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    2691                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2692              $C$DW$345       .dwtag  DW_TAG_member
    2693                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$53)
    2694                      .dwattr $C$DW$345, DW_AT_name("numCtrlTicksPerSpeedTick")
    2695                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    2696                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2697                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2698              $C$DW$346       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$53)
    2700                      .dwattr $C$DW$346, DW_AT_name("numCtrlTicksPerTrajTick")
    2701                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    2702                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    2703                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2704              $C$DW$347       .dwtag  DW_TAG_member
    2705                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$51)
    2706                      .dwattr $C$DW$347, DW_AT_name("ctrlFreq_Hz")
    2707                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    2708                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2709                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2710              $C$DW$348       .dwtag  DW_TAG_member
    2711                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$51)
    2712                      .dwattr $C$DW$348, DW_AT_name("trajFreq_Hz")
    2713                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_trajFreq_Hz")
    2714                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2715                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2716              $C$DW$349       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    2718                      .dwattr $C$DW$349, DW_AT_name("trajPeriod_sec")
    2719                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_trajPeriod_sec")
    2720                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2721                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2722              $C$DW$350       .dwtag  DW_TAG_member
    2723                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$54)
    2724                      .dwattr $C$DW$350, DW_AT_name("ctrlPeriod_sec")
    2725                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    2726                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2727                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2728              $C$DW$351       .dwtag  DW_TAG_member
    2729                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    2730                      .dwattr $C$DW$351, DW_AT_name("maxVsMag_pu")
    2731                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_maxVsMag_pu")
    2732                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2733                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2734              $C$DW$352       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$55)
    2736                      .dwattr $C$DW$352, DW_AT_name("Iab_in")
    2737                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_Iab_in")
    2738                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2739                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2740              $C$DW$353       .dwtag  DW_TAG_member
    2741                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$55)
    2742                      .dwattr $C$DW$353, DW_AT_name("Iab_filt")
    2743                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_Iab_filt")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   55

    2744                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2745                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2746              $C$DW$354       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$55)
    2748                      .dwattr $C$DW$354, DW_AT_name("Idq_in")
    2749                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_Idq_in")
    2750                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2751                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2752              $C$DW$355       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$55)
    2754                      .dwattr $C$DW$355, DW_AT_name("Vab_in")
    2755                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_Vab_in")
    2756                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2757                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2758              $C$DW$356       .dwtag  DW_TAG_member
    2759                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    2760                      .dwattr $C$DW$356, DW_AT_name("spd_out")
    2761                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_spd_out")
    2762                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2763                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2764              $C$DW$357       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$55)
    2766                      .dwattr $C$DW$357, DW_AT_name("Vab_out")
    2767                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_Vab_out")
    2768                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2769                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2770              $C$DW$358       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$55)
    2772                      .dwattr $C$DW$358, DW_AT_name("Vdq_out")
    2773                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_Vdq_out")
    2774                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2775                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2776              $C$DW$359       .dwtag  DW_TAG_member
    2777                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$54)
    2778                      .dwattr $C$DW$359, DW_AT_name("Rhf")
    2779                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_Rhf")
    2780                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2781                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2782              $C$DW$360       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$54)
    2784                      .dwattr $C$DW$360, DW_AT_name("Lhf")
    2785                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_Lhf")
    2786                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2787                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2788              $C$DW$361       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$54)
    2790                      .dwattr $C$DW$361, DW_AT_name("RoverL")
    2791                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_RoverL")
    2792                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2793                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2794              $C$DW$362       .dwtag  DW_TAG_member
    2795                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    2796                      .dwattr $C$DW$362, DW_AT_name("Kp_Id")
    2797                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_Kp_Id")
    2798                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   56

    2799                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2800              $C$DW$363       .dwtag  DW_TAG_member
    2801                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    2802                      .dwattr $C$DW$363, DW_AT_name("Kp_Iq")
    2803                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_Kp_Iq")
    2804                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2805                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2806              $C$DW$364       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    2808                      .dwattr $C$DW$364, DW_AT_name("Kp_spd")
    2809                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_Kp_spd")
    2810                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2811                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2812              $C$DW$365       .dwtag  DW_TAG_member
    2813                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    2814                      .dwattr $C$DW$365, DW_AT_name("Ki_Id")
    2815                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_Ki_Id")
    2816                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2817                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2818              $C$DW$366       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    2820                      .dwattr $C$DW$366, DW_AT_name("Ki_Iq")
    2821                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_Ki_Iq")
    2822                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2823                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2824              $C$DW$367       .dwtag  DW_TAG_member
    2825                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2826                      .dwattr $C$DW$367, DW_AT_name("Ki_spd")
    2827                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_Ki_spd")
    2828                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2829                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2830              $C$DW$368       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2832                      .dwattr $C$DW$368, DW_AT_name("Kd_Id")
    2833                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_Kd_Id")
    2834                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    2835                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2836              $C$DW$369       .dwtag  DW_TAG_member
    2837                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    2838                      .dwattr $C$DW$369, DW_AT_name("Kd_Iq")
    2839                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_Kd_Iq")
    2840                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2841                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2842              $C$DW$370       .dwtag  DW_TAG_member
    2843                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    2844                      .dwattr $C$DW$370, DW_AT_name("Kd_spd")
    2845                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_Kd_spd")
    2846                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    2847                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2848              $C$DW$371       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    2850                      .dwattr $C$DW$371, DW_AT_name("Ui_Id")
    2851                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_Ui_Id")
    2852                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2853                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   57

    2854              $C$DW$372       .dwtag  DW_TAG_member
    2855                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    2856                      .dwattr $C$DW$372, DW_AT_name("Ui_Iq")
    2857                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_Ui_Iq")
    2858                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2859                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2860              $C$DW$373       .dwtag  DW_TAG_member
    2861                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    2862                      .dwattr $C$DW$373, DW_AT_name("Ui_spd")
    2863                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_Ui_spd")
    2864                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2865                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2866              $C$DW$374       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$55)
    2868                      .dwattr $C$DW$374, DW_AT_name("Idq_ref")
    2869                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_Idq_ref")
    2870                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2871                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2872              $C$DW$375       .dwtag  DW_TAG_member
    2873                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    2874                      .dwattr $C$DW$375, DW_AT_name("IdRated")
    2875                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_IdRated")
    2876                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2877                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2878              $C$DW$376       .dwtag  DW_TAG_member
    2879                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    2880                      .dwattr $C$DW$376, DW_AT_name("spd_ref")
    2881                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_spd_ref")
    2882                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2883                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2884              $C$DW$377       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    2886                      .dwattr $C$DW$377, DW_AT_name("spd_max")
    2887                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_spd_max")
    2888                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    2889                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2890              $C$DW$378       .dwtag  DW_TAG_member
    2891                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$53)
    2892                      .dwattr $C$DW$378, DW_AT_name("counter_current")
    2893                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_counter_current")
    2894                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    2895                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2896              $C$DW$379       .dwtag  DW_TAG_member
    2897                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$53)
    2898                      .dwattr $C$DW$379, DW_AT_name("counter_isr")
    2899                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_counter_isr")
    2900                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    2901                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2902              $C$DW$380       .dwtag  DW_TAG_member
    2903                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$53)
    2904                      .dwattr $C$DW$380, DW_AT_name("counter_speed")
    2905                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_counter_speed")
    2906                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    2907                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2908              $C$DW$381       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   58

    2909                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$53)
    2910                      .dwattr $C$DW$381, DW_AT_name("counter_traj")
    2911                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_counter_traj")
    2912                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    2913                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2914              $C$DW$382       .dwtag  DW_TAG_member
    2915                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$56)
    2916                      .dwattr $C$DW$382, DW_AT_name("flag_enableCtrl")
    2917                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_flag_enableCtrl")
    2918                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    2919                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2920              $C$DW$383       .dwtag  DW_TAG_member
    2921                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$56)
    2922                      .dwattr $C$DW$383, DW_AT_name("flag_enableDcBusComp")
    2923                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    2924                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    2925                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2926              $C$DW$384       .dwtag  DW_TAG_member
    2927                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$56)
    2928                      .dwattr $C$DW$384, DW_AT_name("flag_enablePowerWarp")
    2929                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    2930                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    2931                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2932              $C$DW$385       .dwtag  DW_TAG_member
    2933                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$56)
    2934                      .dwattr $C$DW$385, DW_AT_name("flag_enableOffset")
    2935                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_flag_enableOffset")
    2936                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    2937                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2938              $C$DW$386       .dwtag  DW_TAG_member
    2939                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$56)
    2940                      .dwattr $C$DW$386, DW_AT_name("flag_enableSpeedCtrl")
    2941                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    2942                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    2943                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2944              $C$DW$387       .dwtag  DW_TAG_member
    2945                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$56)
    2946                      .dwattr $C$DW$387, DW_AT_name("flag_enableUserMotorParams")
    2947                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    2948                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    2949                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2950              $C$DW$388       .dwtag  DW_TAG_member
    2951                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$55)
    2952                      .dwattr $C$DW$388, DW_AT_name("Idq_offset_pu")
    2953                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_Idq_offset_pu")
    2954                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    2955                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2956              $C$DW$389       .dwtag  DW_TAG_member
    2957                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$55)
    2958                      .dwattr $C$DW$389, DW_AT_name("Vdq_offset_pu")
    2959                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    2960                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    2961                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2962              $C$DW$390       .dwtag  DW_TAG_member
    2963                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   59

    2964                      .dwattr $C$DW$390, DW_AT_name("angle_pu")
    2965                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_angle_pu")
    2966                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    2967                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2968              $C$DW$391       .dwtag  DW_TAG_member
    2969                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    2970                      .dwattr $C$DW$391, DW_AT_name("speed_ref_pu")
    2971                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_speed_ref_pu")
    2972                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2973                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2974              $C$DW$392       .dwtag  DW_TAG_member
    2975                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    2976                      .dwattr $C$DW$392, DW_AT_name("speed_fb_pu")
    2977                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_speed_fb_pu")
    2978                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    2979                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2980              $C$DW$393       .dwtag  DW_TAG_member
    2981                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$20)
    2982                      .dwattr $C$DW$393, DW_AT_name("speed_outMax_pu")
    2983                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_speed_outMax_pu")
    2984                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2985                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2986              $C$DW$394       .dwtag  DW_TAG_member
    2987                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$56)
    2988                      .dwattr $C$DW$394, DW_AT_name("flag_enableCurrentCtrl")
    2989                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    2990                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    2991                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2992                      .dwendtag $C$DW$T$57
    2993              
    2994              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    2995                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$57)
    2996                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2997              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    2998                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$57)
    2999                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    3000              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3001                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3002                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3003              $C$DW$395       .dwtag  DW_TAG_TI_far_type
    3004                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$84)
    3005              $C$DW$T$85      .dwtag  DW_TAG_const_type
    3006                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$395)
    3007              
    3008              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3009                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3010                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3011              $C$DW$396       .dwtag  DW_TAG_member
    3012                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$21)
    3013                      .dwattr $C$DW$396, DW_AT_name("rsvd")
    3014                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_rsvd")
    3015                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3016                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3017              $C$DW$397       .dwtag  DW_TAG_member
    3018                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$59)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   60

    3019                      .dwattr $C$DW$397, DW_AT_name("targetProc")
    3020                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_targetProc")
    3021                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3022                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3023              $C$DW$398       .dwtag  DW_TAG_member
    3024                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$21)
    3025                      .dwattr $C$DW$398, DW_AT_name("major")
    3026                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_major")
    3027                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3028                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3029              $C$DW$399       .dwtag  DW_TAG_member
    3030                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$21)
    3031                      .dwattr $C$DW$399, DW_AT_name("minor")
    3032                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_minor")
    3033                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3034                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3035                      .dwendtag $C$DW$T$60
    3036              
    3037              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3038                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    3039                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3040              
    3041              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3042                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3043                      .dwattr $C$DW$T$19, DW_AT_declaration
    3044                      .dwendtag $C$DW$T$19
    3045              
    3046              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3047                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3048                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    3049              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3050                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3051                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3052              
    3053              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3054                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3055                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3056              $C$DW$400       .dwtag  DW_TAG_member
    3057                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    3058                      .dwattr $C$DW$400, DW_AT_name("sinTh")
    3059                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_sinTh")
    3060                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3061                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3062              $C$DW$401       .dwtag  DW_TAG_member
    3063                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    3064                      .dwattr $C$DW$401, DW_AT_name("cosTh")
    3065                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_cosTh")
    3066                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3067                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3068                      .dwendtag $C$DW$T$61
    3069              
    3070              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3071                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3072                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3073              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   61

    3074                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3075                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    3076              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3077                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3078                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3079              
    3080              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3081                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3082                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3083              $C$DW$402       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$62)
    3085                      .dwattr $C$DW$402, DW_AT_name("value")
    3086                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_value")
    3087                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3088                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3089                      .dwendtag $C$DW$T$63
    3090              
    3091              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3092                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3093                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3094              
    3095              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3096                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    3097                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3098              $C$DW$403       .dwtag  DW_TAG_member
    3099                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$65)
    3100                      .dwattr $C$DW$403, DW_AT_name("type")
    3101                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_type")
    3102                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3103                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3104              $C$DW$404       .dwtag  DW_TAG_member
    3105                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$53)
    3106                      .dwattr $C$DW$404, DW_AT_name("numPolePairs")
    3107                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_numPolePairs")
    3108                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3109                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3110              $C$DW$405       .dwtag  DW_TAG_member
    3111                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$54)
    3112                      .dwattr $C$DW$405, DW_AT_name("Lr_H")
    3113                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Lr_H")
    3114                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3115                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3116              $C$DW$406       .dwtag  DW_TAG_member
    3117                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$54)
    3118                      .dwattr $C$DW$406, DW_AT_name("Ls_d_H")
    3119                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Ls_d_H")
    3120                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3121                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3122              $C$DW$407       .dwtag  DW_TAG_member
    3123                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$54)
    3124                      .dwattr $C$DW$407, DW_AT_name("Ls_q_H")
    3125                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Ls_q_H")
    3126                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3127                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3128              $C$DW$408       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   62

    3129                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$54)
    3130                      .dwattr $C$DW$408, DW_AT_name("Rr_Ohm")
    3131                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Rr_Ohm")
    3132                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3133                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3134              $C$DW$409       .dwtag  DW_TAG_member
    3135                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$54)
    3136                      .dwattr $C$DW$409, DW_AT_name("Rs_Ohm")
    3137                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Rs_Ohm")
    3138                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3139                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3140              $C$DW$410       .dwtag  DW_TAG_member
    3141                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$54)
    3142                      .dwattr $C$DW$410, DW_AT_name("ratedFlux_VpHz")
    3143                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3144                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3145                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3146                      .dwendtag $C$DW$T$66
    3147              
    3148              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    3149                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3150                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3151              
    3152              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3153                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3154                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3155              $C$DW$411       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    3157                      .dwattr $C$DW$411, DW_AT_name("sinTh")
    3158                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_sinTh")
    3159                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3160                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3161              $C$DW$412       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    3163                      .dwattr $C$DW$412, DW_AT_name("cosTh")
    3164                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_cosTh")
    3165                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3166                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3167                      .dwendtag $C$DW$T$67
    3168              
    3169              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3170                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3171                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3172              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3173                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    3174                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
    3175              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3176                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3177                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3178              
    3179              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3180                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3181                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3182              $C$DW$413       .dwtag  DW_TAG_member
    3183                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   63

    3184                      .dwattr $C$DW$413, DW_AT_name("Kp")
    3185                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Kp")
    3186                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3187                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3188              $C$DW$414       .dwtag  DW_TAG_member
    3189                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    3190                      .dwattr $C$DW$414, DW_AT_name("Ki")
    3191                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Ki")
    3192                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3193                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3194              $C$DW$415       .dwtag  DW_TAG_member
    3195                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    3196                      .dwattr $C$DW$415, DW_AT_name("Kd")
    3197                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Kd")
    3198                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3199                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3200              $C$DW$416       .dwtag  DW_TAG_member
    3201                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    3202                      .dwattr $C$DW$416, DW_AT_name("Ui")
    3203                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Ui")
    3204                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3205                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3206              $C$DW$417       .dwtag  DW_TAG_member
    3207                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    3208                      .dwattr $C$DW$417, DW_AT_name("refValue")
    3209                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_refValue")
    3210                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3211                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3212              $C$DW$418       .dwtag  DW_TAG_member
    3213                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    3214                      .dwattr $C$DW$418, DW_AT_name("fbackValue")
    3215                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_fbackValue")
    3216                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3217                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3218              $C$DW$419       .dwtag  DW_TAG_member
    3219                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    3220                      .dwattr $C$DW$419, DW_AT_name("outMin")
    3221                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_outMin")
    3222                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3223                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3224              $C$DW$420       .dwtag  DW_TAG_member
    3225                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    3226                      .dwattr $C$DW$420, DW_AT_name("outMax")
    3227                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_outMax")
    3228                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3229                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3230                      .dwendtag $C$DW$T$68
    3231              
    3232              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3233                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3234                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3235              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3236                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3237                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    3238              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   64

    3239                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3240                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3241              
    3242              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3243                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3244                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3245              $C$DW$421       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    3247                      .dwattr $C$DW$421, DW_AT_name("maxModulation")
    3248                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_maxModulation")
    3249                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3250                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3251                      .dwendtag $C$DW$T$69
    3252              
    3253              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3254                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3255                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3256              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3257                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    3258                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    3259              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3260                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3261                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3262              
    3263              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3264                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3265                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3266              $C$DW$422       .dwtag  DW_TAG_member
    3267                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    3268                      .dwattr $C$DW$422, DW_AT_name("targetValue")
    3269                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_targetValue")
    3270                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3271                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3272              $C$DW$423       .dwtag  DW_TAG_member
    3273                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3274                      .dwattr $C$DW$423, DW_AT_name("intValue")
    3275                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_intValue")
    3276                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3277                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3278              $C$DW$424       .dwtag  DW_TAG_member
    3279                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3280                      .dwattr $C$DW$424, DW_AT_name("minValue")
    3281                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_minValue")
    3282                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3283                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3284              $C$DW$425       .dwtag  DW_TAG_member
    3285                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3286                      .dwattr $C$DW$425, DW_AT_name("maxValue")
    3287                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_maxValue")
    3288                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3289                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3290              $C$DW$426       .dwtag  DW_TAG_member
    3291                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    3292                      .dwattr $C$DW$426, DW_AT_name("maxDelta")
    3293                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_maxDelta")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   65

    3294                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3295                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3296                      .dwendtag $C$DW$T$70
    3297              
    3298              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3299                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3300                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3301              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3302                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3303                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3304              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3305                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3306                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3307              
    3308              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3309                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    3310                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    3311              $C$DW$427       .dwtag  DW_TAG_member
    3312                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$54)
    3313                      .dwattr $C$DW$427, DW_AT_name("iqFullScaleCurrent_A")
    3314                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3315                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3316                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3317              $C$DW$428       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$54)
    3319                      .dwattr $C$DW$428, DW_AT_name("iqFullScaleVoltage_V")
    3320                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3321                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3322                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3323              $C$DW$429       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$54)
    3325                      .dwattr $C$DW$429, DW_AT_name("iqFullScaleFreq_Hz")
    3326                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3327                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3328                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3329              $C$DW$430       .dwtag  DW_TAG_member
    3330                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$53)
    3331                      .dwattr $C$DW$430, DW_AT_name("numIsrTicksPerCtrlTick")
    3332                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3333                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3334                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3335              $C$DW$431       .dwtag  DW_TAG_member
    3336                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$53)
    3337                      .dwattr $C$DW$431, DW_AT_name("numCtrlTicksPerCurrentTick")
    3338                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3339                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3340                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3341              $C$DW$432       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$53)
    3343                      .dwattr $C$DW$432, DW_AT_name("numCtrlTicksPerEstTick")
    3344                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3345                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3346                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3347              $C$DW$433       .dwtag  DW_TAG_member
    3348                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$53)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   66

    3349                      .dwattr $C$DW$433, DW_AT_name("numCtrlTicksPerSpeedTick")
    3350                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3351                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3352                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3353              $C$DW$434       .dwtag  DW_TAG_member
    3354                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$53)
    3355                      .dwattr $C$DW$434, DW_AT_name("numCtrlTicksPerTrajTick")
    3356                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3357                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3358                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3359              $C$DW$435       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$22)
    3361                      .dwattr $C$DW$435, DW_AT_name("numCurrentSensors")
    3362                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_numCurrentSensors")
    3363                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3364                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3365              $C$DW$436       .dwtag  DW_TAG_member
    3366                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$22)
    3367                      .dwattr $C$DW$436, DW_AT_name("numVoltageSensors")
    3368                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_numVoltageSensors")
    3369                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3370                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3371              $C$DW$437       .dwtag  DW_TAG_member
    3372                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$54)
    3373                      .dwattr $C$DW$437, DW_AT_name("offsetPole_rps")
    3374                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_offsetPole_rps")
    3375                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3376                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3377              $C$DW$438       .dwtag  DW_TAG_member
    3378                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$54)
    3379                      .dwattr $C$DW$438, DW_AT_name("fluxPole_rps")
    3380                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_fluxPole_rps")
    3381                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3382                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3383              $C$DW$439       .dwtag  DW_TAG_member
    3384                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$54)
    3385                      .dwattr $C$DW$439, DW_AT_name("zeroSpeedLimit")
    3386                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3387                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3388                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3389              $C$DW$440       .dwtag  DW_TAG_member
    3390                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$54)
    3391                      .dwattr $C$DW$440, DW_AT_name("forceAngleFreq_Hz")
    3392                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3393                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3394                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3395              $C$DW$441       .dwtag  DW_TAG_member
    3396                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$54)
    3397                      .dwattr $C$DW$441, DW_AT_name("maxAccel_Hzps")
    3398                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3399                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3400                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3401              $C$DW$442       .dwtag  DW_TAG_member
    3402                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$54)
    3403                      .dwattr $C$DW$442, DW_AT_name("maxAccel_est_Hzps")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   67

    3404                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3405                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3406                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3407              $C$DW$443       .dwtag  DW_TAG_member
    3408                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$54)
    3409                      .dwattr $C$DW$443, DW_AT_name("directionPole_rps")
    3410                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_directionPole_rps")
    3411                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3412                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3413              $C$DW$444       .dwtag  DW_TAG_member
    3414                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$54)
    3415                      .dwattr $C$DW$444, DW_AT_name("speedPole_rps")
    3416                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_speedPole_rps")
    3417                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3418                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3419              $C$DW$445       .dwtag  DW_TAG_member
    3420                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$54)
    3421                      .dwattr $C$DW$445, DW_AT_name("dcBusPole_rps")
    3422                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_dcBusPole_rps")
    3423                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3424                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3425              $C$DW$446       .dwtag  DW_TAG_member
    3426                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$54)
    3427                      .dwattr $C$DW$446, DW_AT_name("fluxFraction")
    3428                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_fluxFraction")
    3429                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3430                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3431              $C$DW$447       .dwtag  DW_TAG_member
    3432                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$54)
    3433                      .dwattr $C$DW$447, DW_AT_name("indEst_speedMaxFraction")
    3434                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    3435                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3436                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3437              $C$DW$448       .dwtag  DW_TAG_member
    3438                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$54)
    3439                      .dwattr $C$DW$448, DW_AT_name("powerWarpGain")
    3440                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_powerWarpGain")
    3441                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3442                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3443              $C$DW$449       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$53)
    3445                      .dwattr $C$DW$449, DW_AT_name("systemFreq_MHz")
    3446                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_systemFreq_MHz")
    3447                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3448                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3449              $C$DW$450       .dwtag  DW_TAG_member
    3450                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$54)
    3451                      .dwattr $C$DW$450, DW_AT_name("pwmPeriod_usec")
    3452                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    3453                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3454                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3455              $C$DW$451       .dwtag  DW_TAG_member
    3456                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$54)
    3457                      .dwattr $C$DW$451, DW_AT_name("voltage_sf")
    3458                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_voltage_sf")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   68

    3459                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3460                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3461              $C$DW$452       .dwtag  DW_TAG_member
    3462                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$54)
    3463                      .dwattr $C$DW$452, DW_AT_name("current_sf")
    3464                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_current_sf")
    3465                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3466                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3467              $C$DW$453       .dwtag  DW_TAG_member
    3468                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$54)
    3469                      .dwattr $C$DW$453, DW_AT_name("voltageFilterPole_rps")
    3470                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    3471                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3472                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3473              $C$DW$454       .dwtag  DW_TAG_member
    3474                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$54)
    3475                      .dwattr $C$DW$454, DW_AT_name("maxVsMag_pu")
    3476                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3477                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3478                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3479              $C$DW$455       .dwtag  DW_TAG_member
    3480                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$54)
    3481                      .dwattr $C$DW$455, DW_AT_name("estKappa")
    3482                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_estKappa")
    3483                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3484                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3485              $C$DW$456       .dwtag  DW_TAG_member
    3486                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$65)
    3487                      .dwattr $C$DW$456, DW_AT_name("motor_type")
    3488                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_motor_type")
    3489                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3490                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3491              $C$DW$457       .dwtag  DW_TAG_member
    3492                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$53)
    3493                      .dwattr $C$DW$457, DW_AT_name("motor_numPolePairs")
    3494                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_motor_numPolePairs")
    3495                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    3496                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3497              $C$DW$458       .dwtag  DW_TAG_member
    3498                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$54)
    3499                      .dwattr $C$DW$458, DW_AT_name("motor_ratedFlux")
    3500                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_motor_ratedFlux")
    3501                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3502                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3503              $C$DW$459       .dwtag  DW_TAG_member
    3504                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$54)
    3505                      .dwattr $C$DW$459, DW_AT_name("motor_Rr")
    3506                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_motor_Rr")
    3507                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3508                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3509              $C$DW$460       .dwtag  DW_TAG_member
    3510                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$54)
    3511                      .dwattr $C$DW$460, DW_AT_name("motor_Rs")
    3512                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_motor_Rs")
    3513                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   69

    3514                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3515              $C$DW$461       .dwtag  DW_TAG_member
    3516                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$54)
    3517                      .dwattr $C$DW$461, DW_AT_name("motor_Ls_d")
    3518                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_motor_Ls_d")
    3519                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3520                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3521              $C$DW$462       .dwtag  DW_TAG_member
    3522                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$54)
    3523                      .dwattr $C$DW$462, DW_AT_name("motor_Ls_q")
    3524                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_motor_Ls_q")
    3525                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3526                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3527              $C$DW$463       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$54)
    3529                      .dwattr $C$DW$463, DW_AT_name("maxCurrent")
    3530                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_maxCurrent")
    3531                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3532                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3533              $C$DW$464       .dwtag  DW_TAG_member
    3534                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$54)
    3535                      .dwattr $C$DW$464, DW_AT_name("maxCurrent_resEst")
    3536                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    3537                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3538                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3539              $C$DW$465       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    3541                      .dwattr $C$DW$465, DW_AT_name("maxCurrent_indEst")
    3542                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    3543                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3544                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3545              $C$DW$466       .dwtag  DW_TAG_member
    3546                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    3547                      .dwattr $C$DW$466, DW_AT_name("maxCurrentSlope")
    3548                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_maxCurrentSlope")
    3549                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3550                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3551              $C$DW$467       .dwtag  DW_TAG_member
    3552                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    3553                      .dwattr $C$DW$467, DW_AT_name("maxCurrentSlope_powerWarp")
    3554                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    3555                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3556                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3557              $C$DW$468       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$54)
    3559                      .dwattr $C$DW$468, DW_AT_name("IdRated")
    3560                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_IdRated")
    3561                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    3562                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3563              $C$DW$469       .dwtag  DW_TAG_member
    3564                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$54)
    3565                      .dwattr $C$DW$469, DW_AT_name("IdRatedFraction_indEst")
    3566                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    3567                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3568                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 08:44:25 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0842811                              PAGE   70

    3569              $C$DW$470       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$54)
    3571                      .dwattr $C$DW$470, DW_AT_name("IdRatedFraction_ratedFlux")
    3572                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    3573                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    3574                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3575              $C$DW$471       .dwtag  DW_TAG_member
    3576                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$54)
    3577                      .dwattr $C$DW$471, DW_AT_name("IdRated_delta")
    3578                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_IdRated_delta")
    3579                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3580                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3581              $C$DW$472       .dwtag  DW_TAG_member
    3582                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$54)
    3583                      .dwattr $C$DW$472, DW_AT_name("fluxEstFreq_Hz")
    3584                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    3585                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    3586                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3587              $C$DW$473       .dwtag  DW_TAG_member
    3588                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$52)
    3589                      .dwattr $C$DW$473, DW_AT_name("ctrlWaitTime")
    3590                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_ctrlWaitTime")
    3591                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3592                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3593              $C$DW$474       .dwtag  DW_TAG_member
    3594                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$71)
    3595                      .dwattr $C$DW$474, DW_AT_name("estWaitTime")
    3596                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_estWaitTime")
    3597                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3598                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3599              $C$DW$475       .dwtag  DW_TAG_member
    3600                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$72)
