TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1378810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 13:27:23 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/modules/cpu_usage/src/32b/cpu_u
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;       c:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\137882 C

     115                      .dwendentry
     116                      .dwendtag $C$DW$1
     117              
     118 00000016               .sect   ".text"
     119                      .clink
     120                      .global _CPU_USAGE_init
     121              
     122              $C$DW$9 .dwtag  DW_TAG_subprogram, DW_AT_name("CPU_USAGE_init")
     123                      .dwattr $C$DW$9, DW_AT_low_pc(_CPU_USAGE_init)
     124                      .dwattr $C$DW$9, DW_AT_high_pc(0x00)
     125                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_CPU_USAGE_init")
     126                      .dwattr $C$DW$9, DW_AT_external
     127                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$24)
     128                      .dwattr $C$DW$9, DW_AT_TI_begin_file("C:/ti/motorware/motorware_1_01_00_18/sw/modules/cpu_usage/src/3
     129                      .dwattr $C$DW$9, DW_AT_TI_begin_line(0x15)
     130                      .dwattr $C$DW$9, DW_AT_TI_begin_column(0x12)
     131                      .dwattr $C$DW$9, DW_AT_TI_max_frame_size(-2)
     132                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_18/sw/modules/cpu_usage/src/32b/cpu_usage.c",line 22,
     133              
     134                      .dwfde $C$DW$CIE, _CPU_USAGE_init
     135              $C$DW$10        .dwtag  DW_TAG_formal_parameter, DW_AT_name("pMemory")
     136                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_pMemory")
     137                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$3)
     138                      .dwattr $C$DW$10, DW_AT_location[DW_OP_reg12]
     139              $C$DW$11        .dwtag  DW_TAG_formal_parameter, DW_AT_name("numBytes")
     140                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_numBytes")
     141                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$27)
     142                      .dwattr $C$DW$11, DW_AT_location[DW_OP_reg0]
     143              
     144              ;***************************************************************
     145              ;* FNAME: _CPU_USAGE_init               FR SIZE:   0           *
     146              ;*                                                             *
     147              ;* FUNCTION ENVIRONMENT                                        *
     148              ;*                                                             *
     149              ;* FUNCTION PROPERTIES                                         *
     150              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     151              ;***************************************************************
     152              
     153              _CPU_USAGE_init:
     154              ;* AR6   assigned to _numBytes
     155              $C$DW$12        .dwtag  DW_TAG_variable, DW_AT_name("numBytes")
     156                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_numBytes")
     157                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$27)
     158                      .dwattr $C$DW$12, DW_AT_location[DW_OP_reg16]
     159              ;* AR4   assigned to _pMemory
     160              $C$DW$13        .dwtag  DW_TAG_variable, DW_AT_name("pMemory")
     161                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_pMemory")
     162                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$31)
     163                      .dwattr $C$DW$13, DW_AT_location[DW_OP_reg12]
     164                      .dwcfi  cfa_offset, -2
     165                      .dwcfi  save_reg_to_mem, 26, 0
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1378810                              PAGE    4

     166                      .dwcfi  save_reg_to_reg, 78, 26
     167 00000016 1EA6          MOVL      XAR6,ACC              ; [CPU_] |22| 
     168                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_18/sw/modules/cpu_usage/src/32b/cpu_usage.c",line 26,
     169 00000017 0216          MOVB      ACC,#22               ; [CPU_] |26| 
     170 00000018 0FA6          CMPL      ACC,XAR6              ; [CPU_] |26| 
     171 00000019 6902          B         $C$L1,LOS             ; [CPU_] |26| 
     172                      ; branchcc occurs ; [] |26| 
     173 0000001a D400          MOVB      XAR4,#0               ; [CPU_] |26| 
     174              $C$L1:    
     175              $C$DW$14        .dwtag  DW_TAG_TI_branch
     176                      .dwattr $C$DW$14, DW_AT_low_pc(0x00)
     177                      .dwattr $C$DW$14, DW_AT_TI_return
     178 0000001b 0006          LRETR     ; [CPU_] 
     179                      ; return occurs ; [] 
     180                      .dwattr $C$DW$9, DW_AT_TI_end_file("C:/ti/motorware/motorware_1_01_00_18/sw/modules/cpu_usage/src/32b
     181                      .dwattr $C$DW$9, DW_AT_TI_end_line(0x20)
     182                      .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     183                      .dwendentry
     184                      .dwendtag $C$DW$9
     185              
     186              
     187              ;***************************************************************
     188              ;* TYPE INFORMATION                                            *
     189              ;***************************************************************
     190              
     191              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     192                      .dwattr $C$DW$T$21, DW_AT_name("_CPU_USAGE_Obj_")
     193                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x16)
     194              $C$DW$15        .dwtag  DW_TAG_member
     195                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     196                      .dwattr $C$DW$15, DW_AT_name("timerPeriod_cnts")
     197                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_timerPeriod_cnts")
     198                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     199                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     200              $C$DW$16        .dwtag  DW_TAG_member
     201                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     202                      .dwattr $C$DW$16, DW_AT_name("cnt_z0")
     203                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_cnt_z0")
     204                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     205                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     206              $C$DW$17        .dwtag  DW_TAG_member
     207                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     208                      .dwattr $C$DW$17, DW_AT_name("cnt_z1")
     209                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_cnt_z1")
     210                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     211                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     212              $C$DW$18        .dwtag  DW_TAG_member
     213                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     214                      .dwattr $C$DW$18, DW_AT_name("deltaCnt")
     215                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_deltaCnt")
     216                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     217                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     218              $C$DW$19        .dwtag  DW_TAG_member
     219                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     220                      .dwattr $C$DW$19, DW_AT_name("deltaCntAcc")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1378810                              PAGE    5

     221                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_deltaCntAcc")
     222                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     223                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     224              $C$DW$20        .dwtag  DW_TAG_member
     225                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     226                      .dwattr $C$DW$20, DW_AT_name("deltaCntAccNum")
     227                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_deltaCntAccNum")
     228                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     229                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     230              $C$DW$21        .dwtag  DW_TAG_member
     231                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     232                      .dwattr $C$DW$21, DW_AT_name("deltaCntAccNumMax")
     233                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
     234                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     235                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     236              $C$DW$22        .dwtag  DW_TAG_member
     237                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     238                      .dwattr $C$DW$22, DW_AT_name("minDeltaCntObserved")
     239                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_minDeltaCntObserved")
     240                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     241                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     242              $C$DW$23        .dwtag  DW_TAG_member
     243                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     244                      .dwattr $C$DW$23, DW_AT_name("avgDeltaCntObserved")
     245                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
     246                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     247                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     248              $C$DW$24        .dwtag  DW_TAG_member
     249                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     250                      .dwattr $C$DW$24, DW_AT_name("maxDeltaCntObserved")
     251                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
     252                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     253                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     254              $C$DW$25        .dwtag  DW_TAG_member
     255                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$20)
     256                      .dwattr $C$DW$25, DW_AT_name("flag_resetStats")
     257                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_flag_resetStats")
     258                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     259                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     260                      .dwendtag $C$DW$T$21
     261              
     262              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Obj")
     263                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     264                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     265              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
     266                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
     267                      .dwattr $C$DW$T$23, DW_AT_address_class(0x16)
     268              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Handle")
     269                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     270                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     271              $C$DW$26        .dwtag  DW_TAG_TI_far_type
     272                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$24)
     273              $C$DW$T$25      .dwtag  DW_TAG_const_type
     274                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$26)
     275              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:23 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1378810                              PAGE    6

     276                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
     277              $C$DW$27        .dwtag  DW_TAG_TI_far_type
     278                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$3)
     279              $C$DW$T$31      .dwtag  DW_TAG_const_type
     280                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$27)
     281              $C$DW$T$4       .dwtag  DW_TAG_base_type
     282                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     283                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     284                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     285              $C$DW$T$5       .dwtag  DW_TAG_base_type
     286                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     287                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     288                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     289              $C$DW$T$6       .dwtag  DW_TAG_base_type
     290                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     291                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     292                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     293              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
     294                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
     295                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     296              $C$DW$T$7       .dwtag  DW_TAG_base_type
     297                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     298                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     299                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     300              $C$DW$T$8       .dwtag  DW_TAG_base_type
     301                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     302                      .dwattr $C$DW$T$8, DW_AT_name("short")
     303                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     304              $C$DW$T$9       .dwtag  DW_TAG_base_type
     305                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     306                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     307                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     308              $C$DW$T$10      .dwtag  DW_TAG_base_type
     309                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     310                      .dwattr $C$DW$T$10, DW_AT_name("int")
