TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 13:27:26 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/modules/hal/boards/hvkit_rev1p1
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("PLL_disableClkDetect")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PLL_disableClkDetect")

    9022                      .dwattr $C$DW$T$279, DW_AT_language(DW_LANG_C)
    9023              
    9024              $C$DW$T$280     .dwtag  DW_TAG_enumeration_type
    9025                      .dwattr $C$DW$T$280, DW_AT_byte_size(0x01)
    9026              $C$DW$1572      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_1_Bit"), DW_AT_const_value(0x01)
    9027              $C$DW$1573      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_2_Bits"), DW_AT_const_value(0x02)
    9028              $C$DW$1574      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_3_Bits"), DW_AT_const_value(0x03)
    9029              $C$DW$1575      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_4_Bits"), DW_AT_const_value(0x04)
    9030              $C$DW$1576      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_5_Bits"), DW_AT_const_value(0x05)
    9031              $C$DW$1577      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_6_Bits"), DW_AT_const_value(0x06)
    9032              $C$DW$1578      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_7_Bits"), DW_AT_const_value(0x07)
    9033              $C$DW$1579      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_8_Bits"), DW_AT_const_value(0x00)
    9034                      .dwendtag $C$DW$T$280
    9035              
    9036              $C$DW$T$281     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_BitCount_e")
    9037                      .dwattr $C$DW$T$281, DW_AT_type(*$C$DW$T$280)
    9038                      .dwattr $C$DW$T$281, DW_AT_language(DW_LANG_C)
    9039              
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  174

    9040              $C$DW$T$282     .dwtag  DW_TAG_enumeration_type
    9041                      .dwattr $C$DW$T$282, DW_AT_byte_size(0x01)
    9042              $C$DW$1580      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_None"), DW_AT_const_value(0x00)
    9043              $C$DW$1581      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Arb_Lost"), DW_AT_const_value(0x01)
    9044              $C$DW$1582      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_NACK"), DW_AT_const_value(0x02)
    9045              $C$DW$1583      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Reg_Rdy"), DW_AT_const_value(0x04)
    9046              $C$DW$1584      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Rx_Rdy"), DW_AT_const_value(0x08)
    9047              $C$DW$1585      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Tx_Rdy"), DW_AT_const_value(0x10)
    9048              $C$DW$1586      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Stop"), DW_AT_const_value(0x20)
    9049              $C$DW$1587      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_AD0"), DW_AT_const_value(0x100)
    9050              $C$DW$1588      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Slave_Addr"), DW_AT_const_value(0x200)
    9051              $C$DW$1589      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Tx_Empty"), DW_AT_const_value(0x400)
    9052              $C$DW$1590      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Rx_Full"), DW_AT_const_value(0x800)
    9053              $C$DW$1591      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Busy"), DW_AT_const_value(0x1000)
    9054              $C$DW$1592      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_NACK_Sent"), DW_AT_const_value(0x2000)
    9055              $C$DW$1593      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Slave_Dir"), DW_AT_const_value(0x4000)
    9056                      .dwendtag $C$DW$T$282
    9057              
    9058              $C$DW$T$283     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Status_e")
    9059                      .dwattr $C$DW$T$283, DW_AT_type(*$C$DW$T$282)
    9060                      .dwattr $C$DW$T$283, DW_AT_language(DW_LANG_C)
    9061              
    9062              $C$DW$T$287     .dwtag  DW_TAG_enumeration_type
    9063                      .dwattr $C$DW$T$287, DW_AT_byte_size(0x01)
    9064              $C$DW$1594      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    9065              $C$DW$1595      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    9066                      .dwendtag $C$DW$T$287
    9067              
    9068              $C$DW$T$288     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    9069                      .dwattr $C$DW$T$288, DW_AT_type(*$C$DW$T$287)
    9070                      .dwattr $C$DW$T$288, DW_AT_language(DW_LANG_C)
    9071              
    9072              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9073                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    9074                      .dwattr $C$DW$T$19, DW_AT_declaration
    9075                      .dwendtag $C$DW$T$19
    9076              
    9077              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9078                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
    9079                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
    9080              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    9081                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    9082                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    9083              
    9084              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    9085                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    9086                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    9087              $C$DW$1596      .dwtag  DW_TAG_member
    9088                      .dwattr $C$DW$1596, DW_AT_type(*$C$DW$T$24)
    9089                      .dwattr $C$DW$1596, DW_AT_name("ADCRESULT")
    9090                      .dwattr $C$DW$1596, DW_AT_TI_symbol_name("_ADCRESULT")
    9091                      .dwattr $C$DW$1596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9092                      .dwattr $C$DW$1596, DW_AT_accessibility(DW_ACCESS_public)
    9093              $C$DW$1597      .dwtag  DW_TAG_member
    9094                      .dwattr $C$DW$1597, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  175

    9095                      .dwattr $C$DW$1597, DW_AT_name("resvd_1")
    9096                      .dwattr $C$DW$1597, DW_AT_TI_symbol_name("_resvd_1")
    9097                      .dwattr $C$DW$1597, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9098                      .dwattr $C$DW$1597, DW_AT_accessibility(DW_ACCESS_public)
    9099              $C$DW$1598      .dwtag  DW_TAG_member
    9100                      .dwattr $C$DW$1598, DW_AT_type(*$C$DW$T$23)
    9101                      .dwattr $C$DW$1598, DW_AT_name("ADCCTL1")
    9102                      .dwattr $C$DW$1598, DW_AT_TI_symbol_name("_ADCCTL1")
    9103                      .dwattr $C$DW$1598, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9104                      .dwattr $C$DW$1598, DW_AT_accessibility(DW_ACCESS_public)
    9105              $C$DW$1599      .dwtag  DW_TAG_member
    9106                      .dwattr $C$DW$1599, DW_AT_type(*$C$DW$T$23)
    9107                      .dwattr $C$DW$1599, DW_AT_name("ADCCTL2")
    9108                      .dwattr $C$DW$1599, DW_AT_TI_symbol_name("_ADCCTL2")
    9109                      .dwattr $C$DW$1599, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9110                      .dwattr $C$DW$1599, DW_AT_accessibility(DW_ACCESS_public)
    9111              $C$DW$1600      .dwtag  DW_TAG_member
    9112                      .dwattr $C$DW$1600, DW_AT_type(*$C$DW$T$26)
    9113                      .dwattr $C$DW$1600, DW_AT_name("rsvd_2")
    9114                      .dwattr $C$DW$1600, DW_AT_TI_symbol_name("_rsvd_2")
    9115                      .dwattr $C$DW$1600, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9116                      .dwattr $C$DW$1600, DW_AT_accessibility(DW_ACCESS_public)
    9117              $C$DW$1601      .dwtag  DW_TAG_member
    9118                      .dwattr $C$DW$1601, DW_AT_type(*$C$DW$T$23)
    9119                      .dwattr $C$DW$1601, DW_AT_name("ADCINTFLG")
    9120                      .dwattr $C$DW$1601, DW_AT_TI_symbol_name("_ADCINTFLG")
    9121                      .dwattr $C$DW$1601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9122                      .dwattr $C$DW$1601, DW_AT_accessibility(DW_ACCESS_public)
    9123              $C$DW$1602      .dwtag  DW_TAG_member
    9124                      .dwattr $C$DW$1602, DW_AT_type(*$C$DW$T$23)
    9125                      .dwattr $C$DW$1602, DW_AT_name("ADCINTFLGCLR")
    9126                      .dwattr $C$DW$1602, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9127                      .dwattr $C$DW$1602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9128                      .dwattr $C$DW$1602, DW_AT_accessibility(DW_ACCESS_public)
    9129              $C$DW$1603      .dwtag  DW_TAG_member
    9130                      .dwattr $C$DW$1603, DW_AT_type(*$C$DW$T$23)
    9131                      .dwattr $C$DW$1603, DW_AT_name("ADCINTOVF")
    9132                      .dwattr $C$DW$1603, DW_AT_TI_symbol_name("_ADCINTOVF")
    9133                      .dwattr $C$DW$1603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9134                      .dwattr $C$DW$1603, DW_AT_accessibility(DW_ACCESS_public)
    9135              $C$DW$1604      .dwtag  DW_TAG_member
    9136                      .dwattr $C$DW$1604, DW_AT_type(*$C$DW$T$23)
    9137                      .dwattr $C$DW$1604, DW_AT_name("ADCINTOVFCLR")
    9138                      .dwattr $C$DW$1604, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9139                      .dwattr $C$DW$1604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9140                      .dwattr $C$DW$1604, DW_AT_accessibility(DW_ACCESS_public)
    9141              $C$DW$1605      .dwtag  DW_TAG_member
    9142                      .dwattr $C$DW$1605, DW_AT_type(*$C$DW$T$27)
    9143                      .dwattr $C$DW$1605, DW_AT_name("INTSELxNy")
    9144                      .dwattr $C$DW$1605, DW_AT_TI_symbol_name("_INTSELxNy")
    9145                      .dwattr $C$DW$1605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9146                      .dwattr $C$DW$1605, DW_AT_accessibility(DW_ACCESS_public)
    9147              $C$DW$1606      .dwtag  DW_TAG_member
    9148                      .dwattr $C$DW$1606, DW_AT_type(*$C$DW$T$28)
    9149                      .dwattr $C$DW$1606, DW_AT_name("rsvd_3")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  176

    9150                      .dwattr $C$DW$1606, DW_AT_TI_symbol_name("_rsvd_3")
    9151                      .dwattr $C$DW$1606, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9152                      .dwattr $C$DW$1606, DW_AT_accessibility(DW_ACCESS_public)
    9153              $C$DW$1607      .dwtag  DW_TAG_member
    9154                      .dwattr $C$DW$1607, DW_AT_type(*$C$DW$T$23)
    9155                      .dwattr $C$DW$1607, DW_AT_name("SOCPRICTRL")
    9156                      .dwattr $C$DW$1607, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9157                      .dwattr $C$DW$1607, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9158                      .dwattr $C$DW$1607, DW_AT_accessibility(DW_ACCESS_public)
    9159              $C$DW$1608      .dwtag  DW_TAG_member
    9160                      .dwattr $C$DW$1608, DW_AT_type(*$C$DW$T$23)
    9161                      .dwattr $C$DW$1608, DW_AT_name("rsvd_4")
    9162                      .dwattr $C$DW$1608, DW_AT_TI_symbol_name("_rsvd_4")
    9163                      .dwattr $C$DW$1608, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9164                      .dwattr $C$DW$1608, DW_AT_accessibility(DW_ACCESS_public)
    9165              $C$DW$1609      .dwtag  DW_TAG_member
    9166                      .dwattr $C$DW$1609, DW_AT_type(*$C$DW$T$23)
    9167                      .dwattr $C$DW$1609, DW_AT_name("ADCSAMPLEMODE")
    9168                      .dwattr $C$DW$1609, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9169                      .dwattr $C$DW$1609, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9170                      .dwattr $C$DW$1609, DW_AT_accessibility(DW_ACCESS_public)
    9171              $C$DW$1610      .dwtag  DW_TAG_member
    9172                      .dwattr $C$DW$1610, DW_AT_type(*$C$DW$T$23)
    9173                      .dwattr $C$DW$1610, DW_AT_name("rsvd_5")
    9174                      .dwattr $C$DW$1610, DW_AT_TI_symbol_name("_rsvd_5")
    9175                      .dwattr $C$DW$1610, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9176                      .dwattr $C$DW$1610, DW_AT_accessibility(DW_ACCESS_public)
    9177              $C$DW$1611      .dwtag  DW_TAG_member
    9178                      .dwattr $C$DW$1611, DW_AT_type(*$C$DW$T$23)
    9179                      .dwattr $C$DW$1611, DW_AT_name("ADCINTSOCSEL1")
    9180                      .dwattr $C$DW$1611, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9181                      .dwattr $C$DW$1611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9182                      .dwattr $C$DW$1611, DW_AT_accessibility(DW_ACCESS_public)
    9183              $C$DW$1612      .dwtag  DW_TAG_member
    9184                      .dwattr $C$DW$1612, DW_AT_type(*$C$DW$T$23)
    9185                      .dwattr $C$DW$1612, DW_AT_name("ADCINTSOCSEL2")
    9186                      .dwattr $C$DW$1612, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9187                      .dwattr $C$DW$1612, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9188                      .dwattr $C$DW$1612, DW_AT_accessibility(DW_ACCESS_public)
    9189              $C$DW$1613      .dwtag  DW_TAG_member
    9190                      .dwattr $C$DW$1613, DW_AT_type(*$C$DW$T$26)
    9191                      .dwattr $C$DW$1613, DW_AT_name("rsvd_6")
    9192                      .dwattr $C$DW$1613, DW_AT_TI_symbol_name("_rsvd_6")
    9193                      .dwattr $C$DW$1613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9194                      .dwattr $C$DW$1613, DW_AT_accessibility(DW_ACCESS_public)
    9195              $C$DW$1614      .dwtag  DW_TAG_member
    9196                      .dwattr $C$DW$1614, DW_AT_type(*$C$DW$T$23)
    9197                      .dwattr $C$DW$1614, DW_AT_name("ADCSOCFLG1")
    9198                      .dwattr $C$DW$1614, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9199                      .dwattr $C$DW$1614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9200                      .dwattr $C$DW$1614, DW_AT_accessibility(DW_ACCESS_public)
    9201              $C$DW$1615      .dwtag  DW_TAG_member
    9202                      .dwattr $C$DW$1615, DW_AT_type(*$C$DW$T$23)
    9203                      .dwattr $C$DW$1615, DW_AT_name("rsvd_7")
    9204                      .dwattr $C$DW$1615, DW_AT_TI_symbol_name("_rsvd_7")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  177

    9205                      .dwattr $C$DW$1615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9206                      .dwattr $C$DW$1615, DW_AT_accessibility(DW_ACCESS_public)
    9207              $C$DW$1616      .dwtag  DW_TAG_member
    9208                      .dwattr $C$DW$1616, DW_AT_type(*$C$DW$T$23)
    9209                      .dwattr $C$DW$1616, DW_AT_name("ADCSOCFRC1")
    9210                      .dwattr $C$DW$1616, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9211                      .dwattr $C$DW$1616, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9212                      .dwattr $C$DW$1616, DW_AT_accessibility(DW_ACCESS_public)
    9213              $C$DW$1617      .dwtag  DW_TAG_member
    9214                      .dwattr $C$DW$1617, DW_AT_type(*$C$DW$T$23)
    9215                      .dwattr $C$DW$1617, DW_AT_name("rsvd_8")
    9216                      .dwattr $C$DW$1617, DW_AT_TI_symbol_name("_rsvd_8")
    9217                      .dwattr $C$DW$1617, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9218                      .dwattr $C$DW$1617, DW_AT_accessibility(DW_ACCESS_public)
    9219              $C$DW$1618      .dwtag  DW_TAG_member
    9220                      .dwattr $C$DW$1618, DW_AT_type(*$C$DW$T$23)
    9221                      .dwattr $C$DW$1618, DW_AT_name("ADCSOCOVF1")
    9222                      .dwattr $C$DW$1618, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9223                      .dwattr $C$DW$1618, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9224                      .dwattr $C$DW$1618, DW_AT_accessibility(DW_ACCESS_public)
    9225              $C$DW$1619      .dwtag  DW_TAG_member
    9226                      .dwattr $C$DW$1619, DW_AT_type(*$C$DW$T$23)
    9227                      .dwattr $C$DW$1619, DW_AT_name("rsvd_9")
    9228                      .dwattr $C$DW$1619, DW_AT_TI_symbol_name("_rsvd_9")
    9229                      .dwattr $C$DW$1619, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9230                      .dwattr $C$DW$1619, DW_AT_accessibility(DW_ACCESS_public)
    9231              $C$DW$1620      .dwtag  DW_TAG_member
    9232                      .dwattr $C$DW$1620, DW_AT_type(*$C$DW$T$23)
    9233                      .dwattr $C$DW$1620, DW_AT_name("ADCSOCOVFCLR1")
    9234                      .dwattr $C$DW$1620, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9235                      .dwattr $C$DW$1620, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9236                      .dwattr $C$DW$1620, DW_AT_accessibility(DW_ACCESS_public)
    9237              $C$DW$1621      .dwtag  DW_TAG_member
    9238                      .dwattr $C$DW$1621, DW_AT_type(*$C$DW$T$23)
    9239                      .dwattr $C$DW$1621, DW_AT_name("rsvd_10")
    9240                      .dwattr $C$DW$1621, DW_AT_TI_symbol_name("_rsvd_10")
    9241                      .dwattr $C$DW$1621, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9242                      .dwattr $C$DW$1621, DW_AT_accessibility(DW_ACCESS_public)
    9243              $C$DW$1622      .dwtag  DW_TAG_member
    9244                      .dwattr $C$DW$1622, DW_AT_type(*$C$DW$T$24)
    9245                      .dwattr $C$DW$1622, DW_AT_name("ADCSOCxCTL")
    9246                      .dwattr $C$DW$1622, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9247                      .dwattr $C$DW$1622, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9248                      .dwattr $C$DW$1622, DW_AT_accessibility(DW_ACCESS_public)
    9249              $C$DW$1623      .dwtag  DW_TAG_member
    9250                      .dwattr $C$DW$1623, DW_AT_type(*$C$DW$T$24)
    9251                      .dwattr $C$DW$1623, DW_AT_name("rsvd_11")
    9252                      .dwattr $C$DW$1623, DW_AT_TI_symbol_name("_rsvd_11")
    9253                      .dwattr $C$DW$1623, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9254                      .dwattr $C$DW$1623, DW_AT_accessibility(DW_ACCESS_public)
    9255              $C$DW$1624      .dwtag  DW_TAG_member
    9256                      .dwattr $C$DW$1624, DW_AT_type(*$C$DW$T$23)
    9257                      .dwattr $C$DW$1624, DW_AT_name("ADCREFTRIM")
    9258                      .dwattr $C$DW$1624, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9259                      .dwattr $C$DW$1624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  178

    9260                      .dwattr $C$DW$1624, DW_AT_accessibility(DW_ACCESS_public)
    9261              $C$DW$1625      .dwtag  DW_TAG_member
    9262                      .dwattr $C$DW$1625, DW_AT_type(*$C$DW$T$23)
    9263                      .dwattr $C$DW$1625, DW_AT_name("ADCOFFTRIM")
    9264                      .dwattr $C$DW$1625, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9265                      .dwattr $C$DW$1625, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9266                      .dwattr $C$DW$1625, DW_AT_accessibility(DW_ACCESS_public)
    9267              $C$DW$1626      .dwtag  DW_TAG_member
    9268                      .dwattr $C$DW$1626, DW_AT_type(*$C$DW$T$29)
    9269                      .dwattr $C$DW$1626, DW_AT_name("resvd_12")
    9270                      .dwattr $C$DW$1626, DW_AT_TI_symbol_name("_resvd_12")
    9271                      .dwattr $C$DW$1626, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9272                      .dwattr $C$DW$1626, DW_AT_accessibility(DW_ACCESS_public)
    9273              $C$DW$1627      .dwtag  DW_TAG_member
    9274                      .dwattr $C$DW$1627, DW_AT_type(*$C$DW$T$23)
    9275                      .dwattr $C$DW$1627, DW_AT_name("ADCREV")
    9276                      .dwattr $C$DW$1627, DW_AT_TI_symbol_name("_ADCREV")
    9277                      .dwattr $C$DW$1627, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9278                      .dwattr $C$DW$1627, DW_AT_accessibility(DW_ACCESS_public)
    9279                      .dwendtag $C$DW$T$30
    9280              
    9281              $C$DW$T$295     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    9282                      .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$30)
    9283                      .dwattr $C$DW$T$295, DW_AT_language(DW_LANG_C)
    9284              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    9285                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
    9286                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
    9287              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    9288                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    9289                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    9290              
    9291              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    9292                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
    9293                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
    9294              $C$DW$1628      .dwtag  DW_TAG_member
    9295                      .dwattr $C$DW$1628, DW_AT_type(*$C$DW$T$23)
    9296                      .dwattr $C$DW$1628, DW_AT_name("XCLK")
    9297                      .dwattr $C$DW$1628, DW_AT_TI_symbol_name("_XCLK")
    9298                      .dwattr $C$DW$1628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9299                      .dwattr $C$DW$1628, DW_AT_accessibility(DW_ACCESS_public)
    9300              $C$DW$1629      .dwtag  DW_TAG_member
    9301                      .dwattr $C$DW$1629, DW_AT_type(*$C$DW$T$23)
    9302                      .dwattr $C$DW$1629, DW_AT_name("rsvd_1")
    9303                      .dwattr $C$DW$1629, DW_AT_TI_symbol_name("_rsvd_1")
    9304                      .dwattr $C$DW$1629, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9305                      .dwattr $C$DW$1629, DW_AT_accessibility(DW_ACCESS_public)
    9306              $C$DW$1630      .dwtag  DW_TAG_member
    9307                      .dwattr $C$DW$1630, DW_AT_type(*$C$DW$T$23)
    9308                      .dwattr $C$DW$1630, DW_AT_name("CLKCTL")
    9309                      .dwattr $C$DW$1630, DW_AT_TI_symbol_name("_CLKCTL")
    9310                      .dwattr $C$DW$1630, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9311                      .dwattr $C$DW$1630, DW_AT_accessibility(DW_ACCESS_public)
    9312              $C$DW$1631      .dwtag  DW_TAG_member
    9313                      .dwattr $C$DW$1631, DW_AT_type(*$C$DW$T$31)
    9314                      .dwattr $C$DW$1631, DW_AT_name("rsvd_2")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  179

    9315                      .dwattr $C$DW$1631, DW_AT_TI_symbol_name("_rsvd_2")
    9316                      .dwattr $C$DW$1631, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9317                      .dwattr $C$DW$1631, DW_AT_accessibility(DW_ACCESS_public)
    9318              $C$DW$1632      .dwtag  DW_TAG_member
    9319                      .dwattr $C$DW$1632, DW_AT_type(*$C$DW$T$23)
    9320                      .dwattr $C$DW$1632, DW_AT_name("LOSPCP")
    9321                      .dwattr $C$DW$1632, DW_AT_TI_symbol_name("_LOSPCP")
    9322                      .dwattr $C$DW$1632, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9323                      .dwattr $C$DW$1632, DW_AT_accessibility(DW_ACCESS_public)
    9324              $C$DW$1633      .dwtag  DW_TAG_member
    9325                      .dwattr $C$DW$1633, DW_AT_type(*$C$DW$T$23)
    9326                      .dwattr $C$DW$1633, DW_AT_name("PCLKCR0")
    9327                      .dwattr $C$DW$1633, DW_AT_TI_symbol_name("_PCLKCR0")
    9328                      .dwattr $C$DW$1633, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9329                      .dwattr $C$DW$1633, DW_AT_accessibility(DW_ACCESS_public)
    9330              $C$DW$1634      .dwtag  DW_TAG_member
    9331                      .dwattr $C$DW$1634, DW_AT_type(*$C$DW$T$23)
    9332                      .dwattr $C$DW$1634, DW_AT_name("PCLKCR1")
    9333                      .dwattr $C$DW$1634, DW_AT_TI_symbol_name("_PCLKCR1")
    9334                      .dwattr $C$DW$1634, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9335                      .dwattr $C$DW$1634, DW_AT_accessibility(DW_ACCESS_public)
    9336              $C$DW$1635      .dwtag  DW_TAG_member
    9337                      .dwattr $C$DW$1635, DW_AT_type(*$C$DW$T$26)
    9338                      .dwattr $C$DW$1635, DW_AT_name("rsvd_3")
    9339                      .dwattr $C$DW$1635, DW_AT_TI_symbol_name("_rsvd_3")
    9340                      .dwattr $C$DW$1635, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9341                      .dwattr $C$DW$1635, DW_AT_accessibility(DW_ACCESS_public)
    9342              $C$DW$1636      .dwtag  DW_TAG_member
    9343                      .dwattr $C$DW$1636, DW_AT_type(*$C$DW$T$23)
    9344                      .dwattr $C$DW$1636, DW_AT_name("PCLKCR3")
    9345                      .dwattr $C$DW$1636, DW_AT_TI_symbol_name("_PCLKCR3")
    9346                      .dwattr $C$DW$1636, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9347                      .dwattr $C$DW$1636, DW_AT_accessibility(DW_ACCESS_public)
    9348                      .dwendtag $C$DW$T$32
    9349              
    9350              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    9351                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
    9352                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
    9353              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    9354                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    9355                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    9356              
    9357              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    9358                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
    9359                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    9360              $C$DW$1637      .dwtag  DW_TAG_member
    9361                      .dwattr $C$DW$1637, DW_AT_type(*$C$DW$T$33)
    9362                      .dwattr $C$DW$1637, DW_AT_name("tmp")
    9363                      .dwattr $C$DW$1637, DW_AT_TI_symbol_name("_tmp")
    9364                      .dwattr $C$DW$1637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9365                      .dwattr $C$DW$1637, DW_AT_accessibility(DW_ACCESS_public)
    9366                      .dwendtag $C$DW$T$34
    9367              
    9368              $C$DW$T$302     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
    9369                      .dwattr $C$DW$T$302, DW_AT_type(*$C$DW$T$34)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  180

    9370                      .dwattr $C$DW$T$302, DW_AT_language(DW_LANG_C)
    9371              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    9372                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
    9373                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
    9374              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    9375                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    9376                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    9377              
    9378              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9379                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
    9380                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
    9381              $C$DW$1638      .dwtag  DW_TAG_member
    9382                      .dwattr $C$DW$1638, DW_AT_type(*$C$DW$T$35)
    9383                      .dwattr $C$DW$1638, DW_AT_name("a1")
    9384                      .dwattr $C$DW$1638, DW_AT_TI_symbol_name("_a1")
    9385                      .dwattr $C$DW$1638, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9386                      .dwattr $C$DW$1638, DW_AT_accessibility(DW_ACCESS_public)
    9387              $C$DW$1639      .dwtag  DW_TAG_member
    9388                      .dwattr $C$DW$1639, DW_AT_type(*$C$DW$T$35)
    9389                      .dwattr $C$DW$1639, DW_AT_name("b0")
    9390                      .dwattr $C$DW$1639, DW_AT_TI_symbol_name("_b0")
    9391                      .dwattr $C$DW$1639, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9392                      .dwattr $C$DW$1639, DW_AT_accessibility(DW_ACCESS_public)
    9393              $C$DW$1640      .dwtag  DW_TAG_member
    9394                      .dwattr $C$DW$1640, DW_AT_type(*$C$DW$T$35)
    9395                      .dwattr $C$DW$1640, DW_AT_name("b1")
    9396                      .dwattr $C$DW$1640, DW_AT_TI_symbol_name("_b1")
    9397                      .dwattr $C$DW$1640, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9398                      .dwattr $C$DW$1640, DW_AT_accessibility(DW_ACCESS_public)
    9399              $C$DW$1641      .dwtag  DW_TAG_member
    9400                      .dwattr $C$DW$1641, DW_AT_type(*$C$DW$T$35)
    9401                      .dwattr $C$DW$1641, DW_AT_name("x1")
    9402                      .dwattr $C$DW$1641, DW_AT_TI_symbol_name("_x1")
    9403                      .dwattr $C$DW$1641, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9404                      .dwattr $C$DW$1641, DW_AT_accessibility(DW_ACCESS_public)
    9405              $C$DW$1642      .dwtag  DW_TAG_member
    9406                      .dwattr $C$DW$1642, DW_AT_type(*$C$DW$T$35)
    9407                      .dwattr $C$DW$1642, DW_AT_name("y1")
    9408                      .dwattr $C$DW$1642, DW_AT_TI_symbol_name("_y1")
    9409                      .dwattr $C$DW$1642, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9410                      .dwattr $C$DW$1642, DW_AT_accessibility(DW_ACCESS_public)
    9411                      .dwendtag $C$DW$T$36
    9412              
    9413              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    9414                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$36)
    9415                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    9416              
    9417              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9418                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    9419                      .dwattr $C$DW$T$20, DW_AT_declaration
    9420                      .dwendtag $C$DW$T$20
    9421              
    9422              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    9423                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$20)
    9424                      .dwattr $C$DW$T$88, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  181

    9425              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    9426                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    9427                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    9428              
    9429              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    9430                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
    9431                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    9432              $C$DW$1643      .dwtag  DW_TAG_member
    9433                      .dwattr $C$DW$1643, DW_AT_type(*$C$DW$T$23)
    9434                      .dwattr $C$DW$1643, DW_AT_name("FOPT")
    9435                      .dwattr $C$DW$1643, DW_AT_TI_symbol_name("_FOPT")
    9436                      .dwattr $C$DW$1643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9437                      .dwattr $C$DW$1643, DW_AT_accessibility(DW_ACCESS_public)
    9438              $C$DW$1644      .dwtag  DW_TAG_member
    9439                      .dwattr $C$DW$1644, DW_AT_type(*$C$DW$T$23)
    9440                      .dwattr $C$DW$1644, DW_AT_name("rsvd_1")
    9441                      .dwattr $C$DW$1644, DW_AT_TI_symbol_name("_rsvd_1")
    9442                      .dwattr $C$DW$1644, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9443                      .dwattr $C$DW$1644, DW_AT_accessibility(DW_ACCESS_public)
    9444              $C$DW$1645      .dwtag  DW_TAG_member
    9445                      .dwattr $C$DW$1645, DW_AT_type(*$C$DW$T$23)
    9446                      .dwattr $C$DW$1645, DW_AT_name("FPWR")
    9447                      .dwattr $C$DW$1645, DW_AT_TI_symbol_name("_FPWR")
    9448                      .dwattr $C$DW$1645, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9449                      .dwattr $C$DW$1645, DW_AT_accessibility(DW_ACCESS_public)
    9450              $C$DW$1646      .dwtag  DW_TAG_member
    9451                      .dwattr $C$DW$1646, DW_AT_type(*$C$DW$T$23)
    9452                      .dwattr $C$DW$1646, DW_AT_name("FSTATUS")
    9453                      .dwattr $C$DW$1646, DW_AT_TI_symbol_name("_FSTATUS")
    9454                      .dwattr $C$DW$1646, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9455                      .dwattr $C$DW$1646, DW_AT_accessibility(DW_ACCESS_public)
    9456              $C$DW$1647      .dwtag  DW_TAG_member
    9457                      .dwattr $C$DW$1647, DW_AT_type(*$C$DW$T$23)
    9458                      .dwattr $C$DW$1647, DW_AT_name("FSTDBYWAIT")
    9459                      .dwattr $C$DW$1647, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9460                      .dwattr $C$DW$1647, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9461                      .dwattr $C$DW$1647, DW_AT_accessibility(DW_ACCESS_public)
    9462              $C$DW$1648      .dwtag  DW_TAG_member
    9463                      .dwattr $C$DW$1648, DW_AT_type(*$C$DW$T$23)
    9464                      .dwattr $C$DW$1648, DW_AT_name("FACTIVEWAIT")
    9465                      .dwattr $C$DW$1648, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9466                      .dwattr $C$DW$1648, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9467                      .dwattr $C$DW$1648, DW_AT_accessibility(DW_ACCESS_public)
    9468              $C$DW$1649      .dwtag  DW_TAG_member
    9469                      .dwattr $C$DW$1649, DW_AT_type(*$C$DW$T$23)
    9470                      .dwattr $C$DW$1649, DW_AT_name("FBANKWAIT")
    9471                      .dwattr $C$DW$1649, DW_AT_TI_symbol_name("_FBANKWAIT")
    9472                      .dwattr $C$DW$1649, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9473                      .dwattr $C$DW$1649, DW_AT_accessibility(DW_ACCESS_public)
    9474              $C$DW$1650      .dwtag  DW_TAG_member
    9475                      .dwattr $C$DW$1650, DW_AT_type(*$C$DW$T$23)
    9476                      .dwattr $C$DW$1650, DW_AT_name("FOTPWAIT")
    9477                      .dwattr $C$DW$1650, DW_AT_TI_symbol_name("_FOTPWAIT")
    9478                      .dwattr $C$DW$1650, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9479                      .dwattr $C$DW$1650, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  182

    9480                      .dwendtag $C$DW$T$37
    9481              
    9482              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    9483                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
    9484                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
    9485              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    9486                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    9487                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    9488              
    9489              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    9490                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
    9491                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
    9492              $C$DW$1651      .dwtag  DW_TAG_member
    9493                      .dwattr $C$DW$1651, DW_AT_type(*$C$DW$T$39)
    9494                      .dwattr $C$DW$1651, DW_AT_name("GPACTRL")
    9495                      .dwattr $C$DW$1651, DW_AT_TI_symbol_name("_GPACTRL")
    9496                      .dwattr $C$DW$1651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9497                      .dwattr $C$DW$1651, DW_AT_accessibility(DW_ACCESS_public)
    9498              $C$DW$1652      .dwtag  DW_TAG_member
    9499                      .dwattr $C$DW$1652, DW_AT_type(*$C$DW$T$39)
    9500                      .dwattr $C$DW$1652, DW_AT_name("GPAQSEL1")
    9501                      .dwattr $C$DW$1652, DW_AT_TI_symbol_name("_GPAQSEL1")
    9502                      .dwattr $C$DW$1652, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9503                      .dwattr $C$DW$1652, DW_AT_accessibility(DW_ACCESS_public)
    9504              $C$DW$1653      .dwtag  DW_TAG_member
    9505                      .dwattr $C$DW$1653, DW_AT_type(*$C$DW$T$39)
    9506                      .dwattr $C$DW$1653, DW_AT_name("GPAQSEL2")
    9507                      .dwattr $C$DW$1653, DW_AT_TI_symbol_name("_GPAQSEL2")
    9508                      .dwattr $C$DW$1653, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9509                      .dwattr $C$DW$1653, DW_AT_accessibility(DW_ACCESS_public)
    9510              $C$DW$1654      .dwtag  DW_TAG_member
    9511                      .dwattr $C$DW$1654, DW_AT_type(*$C$DW$T$39)
    9512                      .dwattr $C$DW$1654, DW_AT_name("GPAMUX1")
    9513                      .dwattr $C$DW$1654, DW_AT_TI_symbol_name("_GPAMUX1")
    9514                      .dwattr $C$DW$1654, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9515                      .dwattr $C$DW$1654, DW_AT_accessibility(DW_ACCESS_public)
    9516              $C$DW$1655      .dwtag  DW_TAG_member
    9517                      .dwattr $C$DW$1655, DW_AT_type(*$C$DW$T$39)
    9518                      .dwattr $C$DW$1655, DW_AT_name("GPAMUX2")
    9519                      .dwattr $C$DW$1655, DW_AT_TI_symbol_name("_GPAMUX2")
    9520                      .dwattr $C$DW$1655, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9521                      .dwattr $C$DW$1655, DW_AT_accessibility(DW_ACCESS_public)
    9522              $C$DW$1656      .dwtag  DW_TAG_member
    9523                      .dwattr $C$DW$1656, DW_AT_type(*$C$DW$T$39)
    9524                      .dwattr $C$DW$1656, DW_AT_name("GPADIR")
    9525                      .dwattr $C$DW$1656, DW_AT_TI_symbol_name("_GPADIR")
    9526                      .dwattr $C$DW$1656, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9527                      .dwattr $C$DW$1656, DW_AT_accessibility(DW_ACCESS_public)
    9528              $C$DW$1657      .dwtag  DW_TAG_member
    9529                      .dwattr $C$DW$1657, DW_AT_type(*$C$DW$T$39)
    9530                      .dwattr $C$DW$1657, DW_AT_name("GPAPUD")
    9531                      .dwattr $C$DW$1657, DW_AT_TI_symbol_name("_GPAPUD")
    9532                      .dwattr $C$DW$1657, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9533                      .dwattr $C$DW$1657, DW_AT_accessibility(DW_ACCESS_public)
    9534              $C$DW$1658      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  183

    9535                      .dwattr $C$DW$1658, DW_AT_type(*$C$DW$T$26)
    9536                      .dwattr $C$DW$1658, DW_AT_name("rsvd_1")
    9537                      .dwattr $C$DW$1658, DW_AT_TI_symbol_name("_rsvd_1")
    9538                      .dwattr $C$DW$1658, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9539                      .dwattr $C$DW$1658, DW_AT_accessibility(DW_ACCESS_public)
    9540              $C$DW$1659      .dwtag  DW_TAG_member
    9541                      .dwattr $C$DW$1659, DW_AT_type(*$C$DW$T$39)
    9542                      .dwattr $C$DW$1659, DW_AT_name("GPBCTRL")
    9543                      .dwattr $C$DW$1659, DW_AT_TI_symbol_name("_GPBCTRL")
    9544                      .dwattr $C$DW$1659, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9545                      .dwattr $C$DW$1659, DW_AT_accessibility(DW_ACCESS_public)
    9546              $C$DW$1660      .dwtag  DW_TAG_member
    9547                      .dwattr $C$DW$1660, DW_AT_type(*$C$DW$T$39)
    9548                      .dwattr $C$DW$1660, DW_AT_name("GPBQSEL1")
    9549                      .dwattr $C$DW$1660, DW_AT_TI_symbol_name("_GPBQSEL1")
    9550                      .dwattr $C$DW$1660, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9551                      .dwattr $C$DW$1660, DW_AT_accessibility(DW_ACCESS_public)
    9552              $C$DW$1661      .dwtag  DW_TAG_member
    9553                      .dwattr $C$DW$1661, DW_AT_type(*$C$DW$T$26)
    9554                      .dwattr $C$DW$1661, DW_AT_name("rsvd_2")
    9555                      .dwattr $C$DW$1661, DW_AT_TI_symbol_name("_rsvd_2")
    9556                      .dwattr $C$DW$1661, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9557                      .dwattr $C$DW$1661, DW_AT_accessibility(DW_ACCESS_public)
    9558              $C$DW$1662      .dwtag  DW_TAG_member
    9559                      .dwattr $C$DW$1662, DW_AT_type(*$C$DW$T$39)
    9560                      .dwattr $C$DW$1662, DW_AT_name("GPBMUX1")
    9561                      .dwattr $C$DW$1662, DW_AT_TI_symbol_name("_GPBMUX1")
    9562                      .dwattr $C$DW$1662, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9563                      .dwattr $C$DW$1662, DW_AT_accessibility(DW_ACCESS_public)
    9564              $C$DW$1663      .dwtag  DW_TAG_member
    9565                      .dwattr $C$DW$1663, DW_AT_type(*$C$DW$T$26)
    9566                      .dwattr $C$DW$1663, DW_AT_name("rsvd_3")
    9567                      .dwattr $C$DW$1663, DW_AT_TI_symbol_name("_rsvd_3")
    9568                      .dwattr $C$DW$1663, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9569                      .dwattr $C$DW$1663, DW_AT_accessibility(DW_ACCESS_public)
    9570              $C$DW$1664      .dwtag  DW_TAG_member
    9571                      .dwattr $C$DW$1664, DW_AT_type(*$C$DW$T$39)
    9572                      .dwattr $C$DW$1664, DW_AT_name("GPBDIR")
    9573                      .dwattr $C$DW$1664, DW_AT_TI_symbol_name("_GPBDIR")
    9574                      .dwattr $C$DW$1664, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9575                      .dwattr $C$DW$1664, DW_AT_accessibility(DW_ACCESS_public)
    9576              $C$DW$1665      .dwtag  DW_TAG_member
    9577                      .dwattr $C$DW$1665, DW_AT_type(*$C$DW$T$39)
    9578                      .dwattr $C$DW$1665, DW_AT_name("GPBPUD")
    9579                      .dwattr $C$DW$1665, DW_AT_TI_symbol_name("_GPBPUD")
    9580                      .dwattr $C$DW$1665, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9581                      .dwattr $C$DW$1665, DW_AT_accessibility(DW_ACCESS_public)
    9582              $C$DW$1666      .dwtag  DW_TAG_member
    9583                      .dwattr $C$DW$1666, DW_AT_type(*$C$DW$T$40)
    9584                      .dwattr $C$DW$1666, DW_AT_name("rsvd_4")
    9585                      .dwattr $C$DW$1666, DW_AT_TI_symbol_name("_rsvd_4")
    9586                      .dwattr $C$DW$1666, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9587                      .dwattr $C$DW$1666, DW_AT_accessibility(DW_ACCESS_public)
    9588              $C$DW$1667      .dwtag  DW_TAG_member
    9589                      .dwattr $C$DW$1667, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  184

    9590                      .dwattr $C$DW$1667, DW_AT_name("AIOMUX1")
    9591                      .dwattr $C$DW$1667, DW_AT_TI_symbol_name("_AIOMUX1")
    9592                      .dwattr $C$DW$1667, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9593                      .dwattr $C$DW$1667, DW_AT_accessibility(DW_ACCESS_public)
    9594              $C$DW$1668      .dwtag  DW_TAG_member
    9595                      .dwattr $C$DW$1668, DW_AT_type(*$C$DW$T$26)
    9596                      .dwattr $C$DW$1668, DW_AT_name("rsvd_5")
    9597                      .dwattr $C$DW$1668, DW_AT_TI_symbol_name("_rsvd_5")
    9598                      .dwattr $C$DW$1668, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9599                      .dwattr $C$DW$1668, DW_AT_accessibility(DW_ACCESS_public)
    9600              $C$DW$1669      .dwtag  DW_TAG_member
    9601                      .dwattr $C$DW$1669, DW_AT_type(*$C$DW$T$39)
    9602                      .dwattr $C$DW$1669, DW_AT_name("AIODIR")
    9603                      .dwattr $C$DW$1669, DW_AT_TI_symbol_name("_AIODIR")
    9604                      .dwattr $C$DW$1669, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9605                      .dwattr $C$DW$1669, DW_AT_accessibility(DW_ACCESS_public)
    9606              $C$DW$1670      .dwtag  DW_TAG_member
    9607                      .dwattr $C$DW$1670, DW_AT_type(*$C$DW$T$41)
    9608                      .dwattr $C$DW$1670, DW_AT_name("rsvd_6")
    9609                      .dwattr $C$DW$1670, DW_AT_TI_symbol_name("_rsvd_6")
    9610                      .dwattr $C$DW$1670, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9611                      .dwattr $C$DW$1670, DW_AT_accessibility(DW_ACCESS_public)
    9612              $C$DW$1671      .dwtag  DW_TAG_member
    9613                      .dwattr $C$DW$1671, DW_AT_type(*$C$DW$T$39)
    9614                      .dwattr $C$DW$1671, DW_AT_name("GPADAT")
    9615                      .dwattr $C$DW$1671, DW_AT_TI_symbol_name("_GPADAT")
    9616                      .dwattr $C$DW$1671, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9617                      .dwattr $C$DW$1671, DW_AT_accessibility(DW_ACCESS_public)
    9618              $C$DW$1672      .dwtag  DW_TAG_member
    9619                      .dwattr $C$DW$1672, DW_AT_type(*$C$DW$T$39)
    9620                      .dwattr $C$DW$1672, DW_AT_name("GPASET")
    9621                      .dwattr $C$DW$1672, DW_AT_TI_symbol_name("_GPASET")
    9622                      .dwattr $C$DW$1672, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    9623                      .dwattr $C$DW$1672, DW_AT_accessibility(DW_ACCESS_public)
    9624              $C$DW$1673      .dwtag  DW_TAG_member
    9625                      .dwattr $C$DW$1673, DW_AT_type(*$C$DW$T$39)
    9626                      .dwattr $C$DW$1673, DW_AT_name("GPACLEAR")
    9627                      .dwattr $C$DW$1673, DW_AT_TI_symbol_name("_GPACLEAR")
    9628                      .dwattr $C$DW$1673, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9629                      .dwattr $C$DW$1673, DW_AT_accessibility(DW_ACCESS_public)
    9630              $C$DW$1674      .dwtag  DW_TAG_member
    9631                      .dwattr $C$DW$1674, DW_AT_type(*$C$DW$T$39)
    9632                      .dwattr $C$DW$1674, DW_AT_name("GPATOGGLE")
    9633                      .dwattr $C$DW$1674, DW_AT_TI_symbol_name("_GPATOGGLE")
    9634                      .dwattr $C$DW$1674, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9635                      .dwattr $C$DW$1674, DW_AT_accessibility(DW_ACCESS_public)
    9636              $C$DW$1675      .dwtag  DW_TAG_member
    9637                      .dwattr $C$DW$1675, DW_AT_type(*$C$DW$T$39)
    9638                      .dwattr $C$DW$1675, DW_AT_name("GPBDAT")
    9639                      .dwattr $C$DW$1675, DW_AT_TI_symbol_name("_GPBDAT")
    9640                      .dwattr $C$DW$1675, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    9641                      .dwattr $C$DW$1675, DW_AT_accessibility(DW_ACCESS_public)
    9642              $C$DW$1676      .dwtag  DW_TAG_member
    9643                      .dwattr $C$DW$1676, DW_AT_type(*$C$DW$T$39)
    9644                      .dwattr $C$DW$1676, DW_AT_name("GPBSET")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  185

    9645                      .dwattr $C$DW$1676, DW_AT_TI_symbol_name("_GPBSET")
    9646                      .dwattr $C$DW$1676, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    9647                      .dwattr $C$DW$1676, DW_AT_accessibility(DW_ACCESS_public)
    9648              $C$DW$1677      .dwtag  DW_TAG_member
    9649                      .dwattr $C$DW$1677, DW_AT_type(*$C$DW$T$39)
    9650                      .dwattr $C$DW$1677, DW_AT_name("GPBCLEAR")
    9651                      .dwattr $C$DW$1677, DW_AT_TI_symbol_name("_GPBCLEAR")
    9652                      .dwattr $C$DW$1677, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    9653                      .dwattr $C$DW$1677, DW_AT_accessibility(DW_ACCESS_public)
    9654              $C$DW$1678      .dwtag  DW_TAG_member
    9655                      .dwattr $C$DW$1678, DW_AT_type(*$C$DW$T$39)
    9656                      .dwattr $C$DW$1678, DW_AT_name("GPBTOGGLE")
    9657                      .dwattr $C$DW$1678, DW_AT_TI_symbol_name("_GPBTOGGLE")
    9658                      .dwattr $C$DW$1678, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    9659                      .dwattr $C$DW$1678, DW_AT_accessibility(DW_ACCESS_public)
    9660              $C$DW$1679      .dwtag  DW_TAG_member
    9661                      .dwattr $C$DW$1679, DW_AT_type(*$C$DW$T$31)
    9662                      .dwattr $C$DW$1679, DW_AT_name("rsvd_7")
    9663                      .dwattr $C$DW$1679, DW_AT_TI_symbol_name("_rsvd_7")
    9664                      .dwattr $C$DW$1679, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    9665                      .dwattr $C$DW$1679, DW_AT_accessibility(DW_ACCESS_public)
    9666              $C$DW$1680      .dwtag  DW_TAG_member
    9667                      .dwattr $C$DW$1680, DW_AT_type(*$C$DW$T$39)
    9668                      .dwattr $C$DW$1680, DW_AT_name("AIODAT")
    9669                      .dwattr $C$DW$1680, DW_AT_TI_symbol_name("_AIODAT")
    9670                      .dwattr $C$DW$1680, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9671                      .dwattr $C$DW$1680, DW_AT_accessibility(DW_ACCESS_public)
    9672              $C$DW$1681      .dwtag  DW_TAG_member
    9673                      .dwattr $C$DW$1681, DW_AT_type(*$C$DW$T$39)
    9674                      .dwattr $C$DW$1681, DW_AT_name("AIOSET")
    9675                      .dwattr $C$DW$1681, DW_AT_TI_symbol_name("_AIOSET")
    9676                      .dwattr $C$DW$1681, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    9677                      .dwattr $C$DW$1681, DW_AT_accessibility(DW_ACCESS_public)
    9678              $C$DW$1682      .dwtag  DW_TAG_member
    9679                      .dwattr $C$DW$1682, DW_AT_type(*$C$DW$T$39)
    9680                      .dwattr $C$DW$1682, DW_AT_name("AIOCLEAR")
    9681                      .dwattr $C$DW$1682, DW_AT_TI_symbol_name("_AIOCLEAR")
    9682                      .dwattr $C$DW$1682, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9683                      .dwattr $C$DW$1682, DW_AT_accessibility(DW_ACCESS_public)
    9684              $C$DW$1683      .dwtag  DW_TAG_member
    9685                      .dwattr $C$DW$1683, DW_AT_type(*$C$DW$T$39)
    9686                      .dwattr $C$DW$1683, DW_AT_name("AIOTOGGLE")
    9687                      .dwattr $C$DW$1683, DW_AT_TI_symbol_name("_AIOTOGGLE")
    9688                      .dwattr $C$DW$1683, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9689                      .dwattr $C$DW$1683, DW_AT_accessibility(DW_ACCESS_public)
    9690              $C$DW$1684      .dwtag  DW_TAG_member
    9691                      .dwattr $C$DW$1684, DW_AT_type(*$C$DW$T$28)
    9692                      .dwattr $C$DW$1684, DW_AT_name("GPIOXINTnSEL")
    9693                      .dwattr $C$DW$1684, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    9694                      .dwattr $C$DW$1684, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9695                      .dwattr $C$DW$1684, DW_AT_accessibility(DW_ACCESS_public)
    9696              $C$DW$1685      .dwtag  DW_TAG_member
    9697                      .dwattr $C$DW$1685, DW_AT_type(*$C$DW$T$27)
    9698                      .dwattr $C$DW$1685, DW_AT_name("rsvd_8")
    9699                      .dwattr $C$DW$1685, DW_AT_TI_symbol_name("_rsvd_8")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  186

    9700                      .dwattr $C$DW$1685, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    9701                      .dwattr $C$DW$1685, DW_AT_accessibility(DW_ACCESS_public)
    9702              $C$DW$1686      .dwtag  DW_TAG_member
    9703                      .dwattr $C$DW$1686, DW_AT_type(*$C$DW$T$39)
    9704                      .dwattr $C$DW$1686, DW_AT_name("GPIOLPMSEL")
    9705                      .dwattr $C$DW$1686, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    9706                      .dwattr $C$DW$1686, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    9707                      .dwattr $C$DW$1686, DW_AT_accessibility(DW_ACCESS_public)
    9708                      .dwendtag $C$DW$T$42
    9709              
    9710              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    9711                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
    9712                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    9713              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    9714                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    9715                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    9716              
    9717              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9718                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
    9719                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x0e)
    9720              $C$DW$1687      .dwtag  DW_TAG_member
    9721                      .dwattr $C$DW$1687, DW_AT_type(*$C$DW$T$43)
    9722                      .dwattr $C$DW$1687, DW_AT_name("I")
    9723                      .dwattr $C$DW$1687, DW_AT_TI_symbol_name("_I")
    9724                      .dwattr $C$DW$1687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9725                      .dwattr $C$DW$1687, DW_AT_accessibility(DW_ACCESS_public)
    9726              $C$DW$1688      .dwtag  DW_TAG_member
    9727                      .dwattr $C$DW$1688, DW_AT_type(*$C$DW$T$43)
    9728                      .dwattr $C$DW$1688, DW_AT_name("V")
    9729                      .dwattr $C$DW$1688, DW_AT_TI_symbol_name("_V")
    9730                      .dwattr $C$DW$1688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9731                      .dwattr $C$DW$1688, DW_AT_accessibility(DW_ACCESS_public)
    9732              $C$DW$1689      .dwtag  DW_TAG_member
    9733                      .dwattr $C$DW$1689, DW_AT_type(*$C$DW$T$35)
    9734                      .dwattr $C$DW$1689, DW_AT_name("dcBus")
    9735                      .dwattr $C$DW$1689, DW_AT_TI_symbol_name("_dcBus")
    9736                      .dwattr $C$DW$1689, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9737                      .dwattr $C$DW$1689, DW_AT_accessibility(DW_ACCESS_public)
    9738                      .dwendtag $C$DW$T$44
    9739              
    9740              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    9741                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$44)
    9742                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    9743              
    9744              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    9745                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
    9746                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
    9747              $C$DW$1690      .dwtag  DW_TAG_member
    9748                      .dwattr $C$DW$1690, DW_AT_type(*$C$DW$T$22)
    9749                      .dwattr $C$DW$1690, DW_AT_name("PeriodMax")
    9750                      .dwattr $C$DW$1690, DW_AT_TI_symbol_name("_PeriodMax")
    9751                      .dwattr $C$DW$1690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9752                      .dwattr $C$DW$1690, DW_AT_accessibility(DW_ACCESS_public)
    9753              $C$DW$1691      .dwtag  DW_TAG_member
    9754                      .dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$47)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  187

    9755                      .dwattr $C$DW$1691, DW_AT_name("ptrData")
    9756                      .dwattr $C$DW$1691, DW_AT_TI_symbol_name("_ptrData")
    9757                      .dwattr $C$DW$1691, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9758                      .dwattr $C$DW$1691, DW_AT_accessibility(DW_ACCESS_public)
    9759              $C$DW$1692      .dwtag  DW_TAG_member
    9760                      .dwattr $C$DW$1692, DW_AT_type(*$C$DW$T$48)
    9761                      .dwattr $C$DW$1692, DW_AT_name("value")
    9762                      .dwattr $C$DW$1692, DW_AT_TI_symbol_name("_value")
    9763                      .dwattr $C$DW$1692, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9764                      .dwattr $C$DW$1692, DW_AT_accessibility(DW_ACCESS_public)
    9765              $C$DW$1693      .dwtag  DW_TAG_member
    9766                      .dwattr $C$DW$1693, DW_AT_type(*$C$DW$T$48)
    9767                      .dwattr $C$DW$1693, DW_AT_name("offset")
    9768                      .dwattr $C$DW$1693, DW_AT_TI_symbol_name("_offset")
    9769                      .dwattr $C$DW$1693, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9770                      .dwattr $C$DW$1693, DW_AT_accessibility(DW_ACCESS_public)
    9771              $C$DW$1694      .dwtag  DW_TAG_member
    9772                      .dwattr $C$DW$1694, DW_AT_type(*$C$DW$T$48)
    9773                      .dwattr $C$DW$1694, DW_AT_name("gain")
    9774                      .dwattr $C$DW$1694, DW_AT_TI_symbol_name("_gain")
    9775                      .dwattr $C$DW$1694, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9776                      .dwattr $C$DW$1694, DW_AT_accessibility(DW_ACCESS_public)
    9777                      .dwendtag $C$DW$T$49
    9778              
    9779              $C$DW$T$312     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_DacData_t")
    9780                      .dwattr $C$DW$T$312, DW_AT_type(*$C$DW$T$49)
    9781                      .dwattr $C$DW$T$312, DW_AT_language(DW_LANG_C)
    9782              $C$DW$T$313     .dwtag  DW_TAG_pointer_type
    9783                      .dwattr $C$DW$T$313, DW_AT_type(*$C$DW$T$312)
    9784                      .dwattr $C$DW$T$313, DW_AT_address_class(0x16)
    9785              $C$DW$1695      .dwtag  DW_TAG_TI_far_type
    9786                      .dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$313)
    9787              $C$DW$T$314     .dwtag  DW_TAG_const_type
    9788                      .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$1695)
    9789              
    9790              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    9791                      .dwattr $C$DW$T$84, DW_AT_name("_HAL_Obj_")
    9792                      .dwattr $C$DW$T$84, DW_AT_byte_size(0xa8)
    9793              $C$DW$1696      .dwtag  DW_TAG_member
    9794                      .dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$51)
    9795                      .dwattr $C$DW$1696, DW_AT_name("adcHandle")
    9796                      .dwattr $C$DW$1696, DW_AT_TI_symbol_name("_adcHandle")
    9797                      .dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9798                      .dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
    9799              $C$DW$1697      .dwtag  DW_TAG_member
    9800                      .dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$53)
    9801                      .dwattr $C$DW$1697, DW_AT_name("clkHandle")
    9802                      .dwattr $C$DW$1697, DW_AT_TI_symbol_name("_clkHandle")
    9803                      .dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9804                      .dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
    9805              $C$DW$1698      .dwtag  DW_TAG_member
    9806                      .dwattr $C$DW$1698, DW_AT_type(*$C$DW$T$55)
    9807                      .dwattr $C$DW$1698, DW_AT_name("cpuHandle")
    9808                      .dwattr $C$DW$1698, DW_AT_TI_symbol_name("_cpuHandle")
    9809                      .dwattr $C$DW$1698, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  188

    9810                      .dwattr $C$DW$1698, DW_AT_accessibility(DW_ACCESS_public)
    9811              $C$DW$1699      .dwtag  DW_TAG_member
    9812                      .dwattr $C$DW$1699, DW_AT_type(*$C$DW$T$57)
    9813                      .dwattr $C$DW$1699, DW_AT_name("flashHandle")
    9814                      .dwattr $C$DW$1699, DW_AT_TI_symbol_name("_flashHandle")
    9815                      .dwattr $C$DW$1699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9816                      .dwattr $C$DW$1699, DW_AT_accessibility(DW_ACCESS_public)
    9817              $C$DW$1700      .dwtag  DW_TAG_member
    9818                      .dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$59)
    9819                      .dwattr $C$DW$1700, DW_AT_name("gpioHandle")
    9820                      .dwattr $C$DW$1700, DW_AT_TI_symbol_name("_gpioHandle")
    9821                      .dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9822                      .dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
    9823              $C$DW$1701      .dwtag  DW_TAG_member
    9824                      .dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$62)
    9825                      .dwattr $C$DW$1701, DW_AT_name("offsetHandle_I")
    9826                      .dwattr $C$DW$1701, DW_AT_TI_symbol_name("_offsetHandle_I")
    9827                      .dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9828                      .dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
    9829              $C$DW$1702      .dwtag  DW_TAG_member
    9830                      .dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$64)
    9831                      .dwattr $C$DW$1702, DW_AT_name("offset_I")
    9832                      .dwattr $C$DW$1702, DW_AT_TI_symbol_name("_offset_I")
    9833                      .dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9834                      .dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
    9835              $C$DW$1703      .dwtag  DW_TAG_member
    9836                      .dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$62)
    9837                      .dwattr $C$DW$1703, DW_AT_name("offsetHandle_V")
    9838                      .dwattr $C$DW$1703, DW_AT_TI_symbol_name("_offsetHandle_V")
    9839                      .dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9840                      .dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
    9841              $C$DW$1704      .dwtag  DW_TAG_member
    9842                      .dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$64)
    9843                      .dwattr $C$DW$1704, DW_AT_name("offset_V")
    9844                      .dwattr $C$DW$1704, DW_AT_TI_symbol_name("_offset_V")
    9845                      .dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9846                      .dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
    9847              $C$DW$1705      .dwtag  DW_TAG_member
    9848                      .dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$66)
    9849                      .dwattr $C$DW$1705, DW_AT_name("oscHandle")
    9850                      .dwattr $C$DW$1705, DW_AT_TI_symbol_name("_oscHandle")
    9851                      .dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    9852                      .dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
    9853              $C$DW$1706      .dwtag  DW_TAG_member
    9854                      .dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$68)
    9855                      .dwattr $C$DW$1706, DW_AT_name("pieHandle")
    9856                      .dwattr $C$DW$1706, DW_AT_TI_symbol_name("_pieHandle")
    9857                      .dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9858                      .dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
    9859              $C$DW$1707      .dwtag  DW_TAG_member
    9860                      .dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$70)
    9861                      .dwattr $C$DW$1707, DW_AT_name("pllHandle")
    9862                      .dwattr $C$DW$1707, DW_AT_TI_symbol_name("_pllHandle")
    9863                      .dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9864                      .dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  189

    9865              $C$DW$1708      .dwtag  DW_TAG_member
    9866                      .dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$73)
    9867                      .dwattr $C$DW$1708, DW_AT_name("pwmHandle")
    9868                      .dwattr $C$DW$1708, DW_AT_TI_symbol_name("_pwmHandle")
    9869                      .dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    9870                      .dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
    9871              $C$DW$1709      .dwtag  DW_TAG_member
    9872                      .dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$73)
    9873                      .dwattr $C$DW$1709, DW_AT_name("pwmDacHandle")
    9874                      .dwattr $C$DW$1709, DW_AT_TI_symbol_name("_pwmDacHandle")
    9875                      .dwattr $C$DW$1709, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    9876                      .dwattr $C$DW$1709, DW_AT_accessibility(DW_ACCESS_public)
    9877              $C$DW$1710      .dwtag  DW_TAG_member
    9878                      .dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$75)
    9879                      .dwattr $C$DW$1710, DW_AT_name("pwrHandle")
    9880                      .dwattr $C$DW$1710, DW_AT_TI_symbol_name("_pwrHandle")
    9881                      .dwattr $C$DW$1710, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    9882                      .dwattr $C$DW$1710, DW_AT_accessibility(DW_ACCESS_public)
    9883              $C$DW$1711      .dwtag  DW_TAG_member
    9884                      .dwattr $C$DW$1711, DW_AT_type(*$C$DW$T$78)
    9885                      .dwattr $C$DW$1711, DW_AT_name("timerHandle")
    9886                      .dwattr $C$DW$1711, DW_AT_TI_symbol_name("_timerHandle")
    9887                      .dwattr $C$DW$1711, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    9888                      .dwattr $C$DW$1711, DW_AT_accessibility(DW_ACCESS_public)
    9889              $C$DW$1712      .dwtag  DW_TAG_member
    9890                      .dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$80)
    9891                      .dwattr $C$DW$1712, DW_AT_name("i2cHandle")
    9892                      .dwattr $C$DW$1712, DW_AT_TI_symbol_name("_i2cHandle")
    9893                      .dwattr $C$DW$1712, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    9894                      .dwattr $C$DW$1712, DW_AT_accessibility(DW_ACCESS_public)
    9895              $C$DW$1713      .dwtag  DW_TAG_member
    9896                      .dwattr $C$DW$1713, DW_AT_type(*$C$DW$T$82)
    9897                      .dwattr $C$DW$1713, DW_AT_name("wdogHandle")
    9898                      .dwattr $C$DW$1713, DW_AT_TI_symbol_name("_wdogHandle")
    9899                      .dwattr $C$DW$1713, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9900                      .dwattr $C$DW$1713, DW_AT_accessibility(DW_ACCESS_public)
    9901              $C$DW$1714      .dwtag  DW_TAG_member
    9902                      .dwattr $C$DW$1714, DW_AT_type(*$C$DW$T$83)
    9903                      .dwattr $C$DW$1714, DW_AT_name("adcBias")
    9904                      .dwattr $C$DW$1714, DW_AT_TI_symbol_name("_adcBias")
    9905                      .dwattr $C$DW$1714, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    9906                      .dwattr $C$DW$1714, DW_AT_accessibility(DW_ACCESS_public)
    9907              $C$DW$1715      .dwtag  DW_TAG_member
    9908                      .dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$35)
    9909                      .dwattr $C$DW$1715, DW_AT_name("current_sf")
    9910                      .dwattr $C$DW$1715, DW_AT_TI_symbol_name("_current_sf")
    9911                      .dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9912                      .dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
    9913              $C$DW$1716      .dwtag  DW_TAG_member
    9914                      .dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$35)
    9915                      .dwattr $C$DW$1716, DW_AT_name("voltage_sf")
    9916                      .dwattr $C$DW$1716, DW_AT_TI_symbol_name("_voltage_sf")
    9917                      .dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9918                      .dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
    9919              $C$DW$1717      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  190

    9920                      .dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$33)
    9921                      .dwattr $C$DW$1717, DW_AT_name("numCurrentSensors")
    9922                      .dwattr $C$DW$1717, DW_AT_TI_symbol_name("_numCurrentSensors")
    9923                      .dwattr $C$DW$1717, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9924                      .dwattr $C$DW$1717, DW_AT_accessibility(DW_ACCESS_public)
    9925              $C$DW$1718      .dwtag  DW_TAG_member
    9926                      .dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$33)
    9927                      .dwattr $C$DW$1718, DW_AT_name("numVoltageSensors")
    9928                      .dwattr $C$DW$1718, DW_AT_TI_symbol_name("_numVoltageSensors")
    9929                      .dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0xa7]
    9930                      .dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
    9931                      .dwendtag $C$DW$T$84
    9932              
    9933              $C$DW$T$317     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    9934                      .dwattr $C$DW$T$317, DW_AT_type(*$C$DW$T$84)
    9935                      .dwattr $C$DW$T$317, DW_AT_language(DW_LANG_C)
    9936              $C$DW$T$318     .dwtag  DW_TAG_pointer_type
    9937                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$T$317)
    9938                      .dwattr $C$DW$T$318, DW_AT_address_class(0x16)
    9939              $C$DW$T$319     .dwtag  DW_TAG_pointer_type
    9940                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$T$84)
    9941                      .dwattr $C$DW$T$319, DW_AT_address_class(0x16)
    9942              $C$DW$T$320     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    9943                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$T$319)
    9944                      .dwattr $C$DW$T$320, DW_AT_language(DW_LANG_C)
    9945              $C$DW$1719      .dwtag  DW_TAG_TI_far_type
    9946                      .dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$320)
    9947              $C$DW$T$321     .dwtag  DW_TAG_const_type
    9948                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$1719)
    9949              
    9950              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9951                      .dwattr $C$DW$T$86, DW_AT_name("_MATH_vec3_")
    9952                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x06)
    9953              $C$DW$1720      .dwtag  DW_TAG_member
    9954                      .dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$85)
    9955                      .dwattr $C$DW$1720, DW_AT_name("value")
    9956                      .dwattr $C$DW$1720, DW_AT_TI_symbol_name("_value")
    9957                      .dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9958                      .dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
    9959                      .dwendtag $C$DW$T$86
    9960              
    9961              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    9962                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$86)
    9963                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    9964              
    9965              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    9966                      .dwattr $C$DW$T$90, DW_AT_name("_OFFSET_")
    9967                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x10)
    9968              $C$DW$1721      .dwtag  DW_TAG_member
    9969                      .dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$35)
    9970                      .dwattr $C$DW$1721, DW_AT_name("value")
    9971                      .dwattr $C$DW$1721, DW_AT_TI_symbol_name("_value")
    9972                      .dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9973                      .dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
    9974              $C$DW$1722      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  191

    9975                      .dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$35)
    9976                      .dwattr $C$DW$1722, DW_AT_name("bias")
    9977                      .dwattr $C$DW$1722, DW_AT_TI_symbol_name("_bias")
    9978                      .dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9979                      .dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
    9980              $C$DW$1723      .dwtag  DW_TAG_member
    9981                      .dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$87)
    9982                      .dwattr $C$DW$1723, DW_AT_name("filter")
    9983                      .dwattr $C$DW$1723, DW_AT_TI_symbol_name("_filter")
    9984                      .dwattr $C$DW$1723, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9985                      .dwattr $C$DW$1723, DW_AT_accessibility(DW_ACCESS_public)
    9986              $C$DW$1724      .dwtag  DW_TAG_member
    9987                      .dwattr $C$DW$1724, DW_AT_type(*$C$DW$T$89)
    9988                      .dwattr $C$DW$1724, DW_AT_name("filterHandle")
    9989                      .dwattr $C$DW$1724, DW_AT_TI_symbol_name("_filterHandle")
    9990                      .dwattr $C$DW$1724, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9991                      .dwattr $C$DW$1724, DW_AT_accessibility(DW_ACCESS_public)
    9992                      .dwendtag $C$DW$T$90
    9993              
    9994              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
    9995                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$90)
    9996                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    9997              
    9998              $C$DW$T$64      .dwtag  DW_TAG_array_type
    9999                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   10000                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   10001                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   10002              $C$DW$1725      .dwtag  DW_TAG_subrange_type
   10003                      .dwattr $C$DW$1725, DW_AT_upper_bound(0x02)
   10004                      .dwendtag $C$DW$T$64
   10005              
   10006              
   10007              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   10008                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   10009                      .dwattr $C$DW$T$21, DW_AT_declaration
   10010                      .dwendtag $C$DW$T$21
   10011              
   10012              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   10013                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   10014                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
   10015              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
   10016                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   10017                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   10018              
   10019              $C$DW$T$62      .dwtag  DW_TAG_array_type
   10020                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   10021                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   10022                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   10023              $C$DW$1726      .dwtag  DW_TAG_subrange_type
   10024                      .dwattr $C$DW$1726, DW_AT_upper_bound(0x02)
   10025                      .dwendtag $C$DW$T$62
   10026              
   10027              
   10028              $C$DW$T$91      .dwtag  DW_TAG_structure_type
   10029                      .dwattr $C$DW$T$91, DW_AT_name("_OSC_Obj_")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  192

   10030                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x03)
   10031              $C$DW$1727      .dwtag  DW_TAG_member
   10032                      .dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$23)
   10033                      .dwattr $C$DW$1727, DW_AT_name("INTOSC1TRIM")
   10034                      .dwattr $C$DW$1727, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   10035                      .dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10036                      .dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
   10037              $C$DW$1728      .dwtag  DW_TAG_member
   10038                      .dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$23)
   10039                      .dwattr $C$DW$1728, DW_AT_name("rsvd_1")
   10040                      .dwattr $C$DW$1728, DW_AT_TI_symbol_name("_rsvd_1")
   10041                      .dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10042                      .dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
   10043              $C$DW$1729      .dwtag  DW_TAG_member
   10044                      .dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$23)
   10045                      .dwattr $C$DW$1729, DW_AT_name("INTOSC2TRIM")
   10046                      .dwattr $C$DW$1729, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   10047                      .dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10048                      .dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
   10049                      .dwendtag $C$DW$T$91
   10050              
   10051              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   10052                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$91)
   10053                      .dwattr $C$DW$T$65, DW_AT_address_class(0x16)
   10054              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
   10055                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   10056                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   10057              
   10058              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   10059                      .dwattr $C$DW$T$92, DW_AT_name("_PIE_IERIFR_t")
   10060                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
   10061              $C$DW$1730      .dwtag  DW_TAG_member
   10062                      .dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$23)
   10063                      .dwattr $C$DW$1730, DW_AT_name("IER")
   10064                      .dwattr $C$DW$1730, DW_AT_TI_symbol_name("_IER")
   10065                      .dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10066                      .dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
   10067              $C$DW$1731      .dwtag  DW_TAG_member
   10068                      .dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$23)
   10069                      .dwattr $C$DW$1731, DW_AT_name("IFR")
   10070                      .dwattr $C$DW$1731, DW_AT_TI_symbol_name("_IFR")
   10071                      .dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10072                      .dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
   10073                      .dwendtag $C$DW$T$92
   10074              
   10075              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
   10076                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   10077                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   10078              $C$DW$1732      .dwtag  DW_TAG_TI_far_type
   10079                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$93)
   10080              $C$DW$T$94      .dwtag  DW_TAG_volatile_type
   10081                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$1732)
   10082              
   10083              $C$DW$T$95      .dwtag  DW_TAG_array_type
   10084                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  193

   10085                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   10086                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x18)
   10087              $C$DW$1733      .dwtag  DW_TAG_subrange_type
   10088                      .dwattr $C$DW$1733, DW_AT_upper_bound(0x0b)
   10089                      .dwendtag $C$DW$T$95
   10090              
   10091              
   10092              $C$DW$T$102     .dwtag  DW_TAG_structure_type
   10093                      .dwattr $C$DW$T$102, DW_AT_name("_PIE_Obj_")
   10094                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x639c)
   10095              $C$DW$1734      .dwtag  DW_TAG_member
   10096                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$23)
   10097                      .dwattr $C$DW$1734, DW_AT_name("PIECTRL")
   10098                      .dwattr $C$DW$1734, DW_AT_TI_symbol_name("_PIECTRL")
   10099                      .dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10100                      .dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
   10101              $C$DW$1735      .dwtag  DW_TAG_member
   10102                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$23)
   10103                      .dwattr $C$DW$1735, DW_AT_name("PIEACK")
   10104                      .dwattr $C$DW$1735, DW_AT_TI_symbol_name("_PIEACK")
   10105                      .dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10106                      .dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
   10107              $C$DW$1736      .dwtag  DW_TAG_member
   10108                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$95)
   10109                      .dwattr $C$DW$1736, DW_AT_name("PIEIER_PIEIFR")
   10110                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   10111                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10112                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
   10113              $C$DW$1737      .dwtag  DW_TAG_member
   10114                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$96)
   10115                      .dwattr $C$DW$1737, DW_AT_name("rsvd_1")
   10116                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_rsvd_1")
   10117                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10118                      .dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
   10119              $C$DW$1738      .dwtag  DW_TAG_member
   10120                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$100)
   10121                      .dwattr $C$DW$1738, DW_AT_name("Reset")
   10122                      .dwattr $C$DW$1738, DW_AT_TI_symbol_name("_Reset")
   10123                      .dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   10124                      .dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
   10125              $C$DW$1739      .dwtag  DW_TAG_member
   10126                      .dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$100)
   10127                      .dwattr $C$DW$1739, DW_AT_name("INT1")
   10128                      .dwattr $C$DW$1739, DW_AT_TI_symbol_name("_INT1")
   10129                      .dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   10130                      .dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
   10131              $C$DW$1740      .dwtag  DW_TAG_member
   10132                      .dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$100)
   10133                      .dwattr $C$DW$1740, DW_AT_name("INT2")
   10134                      .dwattr $C$DW$1740, DW_AT_TI_symbol_name("_INT2")
   10135                      .dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   10136                      .dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
   10137              $C$DW$1741      .dwtag  DW_TAG_member
   10138                      .dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$100)
   10139                      .dwattr $C$DW$1741, DW_AT_name("INT3")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  194

   10140                      .dwattr $C$DW$1741, DW_AT_TI_symbol_name("_INT3")
   10141                      .dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   10142                      .dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
   10143              $C$DW$1742      .dwtag  DW_TAG_member
   10144                      .dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$100)
   10145                      .dwattr $C$DW$1742, DW_AT_name("INT4")
   10146                      .dwattr $C$DW$1742, DW_AT_TI_symbol_name("_INT4")
   10147                      .dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   10148                      .dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
   10149              $C$DW$1743      .dwtag  DW_TAG_member
   10150                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$100)
   10151                      .dwattr $C$DW$1743, DW_AT_name("INT5")
   10152                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_INT5")
   10153                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   10154                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
   10155              $C$DW$1744      .dwtag  DW_TAG_member
   10156                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$100)
   10157                      .dwattr $C$DW$1744, DW_AT_name("INT6")
   10158                      .dwattr $C$DW$1744, DW_AT_TI_symbol_name("_INT6")
   10159                      .dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   10160                      .dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
   10161              $C$DW$1745      .dwtag  DW_TAG_member
   10162                      .dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$100)
   10163                      .dwattr $C$DW$1745, DW_AT_name("INT7")
   10164                      .dwattr $C$DW$1745, DW_AT_TI_symbol_name("_INT7")
   10165                      .dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   10166                      .dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
   10167              $C$DW$1746      .dwtag  DW_TAG_member
   10168                      .dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$100)
   10169                      .dwattr $C$DW$1746, DW_AT_name("INT8")
   10170                      .dwattr $C$DW$1746, DW_AT_TI_symbol_name("_INT8")
   10171                      .dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   10172                      .dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
   10173              $C$DW$1747      .dwtag  DW_TAG_member
   10174                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$100)
   10175                      .dwattr $C$DW$1747, DW_AT_name("INT9")
   10176                      .dwattr $C$DW$1747, DW_AT_TI_symbol_name("_INT9")
   10177                      .dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   10178                      .dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
   10179              $C$DW$1748      .dwtag  DW_TAG_member
   10180                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$100)
   10181                      .dwattr $C$DW$1748, DW_AT_name("INT10")
   10182                      .dwattr $C$DW$1748, DW_AT_TI_symbol_name("_INT10")
   10183                      .dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   10184                      .dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
   10185              $C$DW$1749      .dwtag  DW_TAG_member
   10186                      .dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$100)
   10187                      .dwattr $C$DW$1749, DW_AT_name("INT11")
   10188                      .dwattr $C$DW$1749, DW_AT_TI_symbol_name("_INT11")
   10189                      .dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10190                      .dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
   10191              $C$DW$1750      .dwtag  DW_TAG_member
   10192                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$100)
   10193                      .dwattr $C$DW$1750, DW_AT_name("INT12")
   10194                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_INT12")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:27 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1421610                              PAGE  195

   10195                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10196                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
   10197              $C$DW$1751      .dwtag  DW_TAG_member
   10198                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$100)
   10199                      .dwattr $C$DW$1751, DW_AT_name("TINT1")
   10200                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_TINT1")
   10201                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10202                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
   10203              $C$DW$1752      .dwtag  DW_TAG_member
   10204                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$100)
   10205                      .dwattr $C$DW$1752, DW_AT_name("TINT2")
   10206                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_TINT2")
   10207                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10208                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
   10209              $C$DW$1753      .dwtag  DW_TAG_member
   10210                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$100)
   10211                      .dwattr $C$DW$1753, DW_AT_name("DATALOG")
   10212                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_DATALOG")
   10213                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
   10214                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
   10215              $C$DW$1754      .dwtag  DW_TAG_member
   10216                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$100)
   10217                      .dwattr $C$DW$1754, DW_AT_name("RTOSINT")
   10218                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_RTOSINT")
   10219                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10220                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
   10221              $C$DW$1755      .dwtag  DW_TAG_member
   10222                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$100)
   10223                      .dwattr $C$DW$1755, DW_AT_name("EMUINT")
   10224                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_EMUINT")
   10225                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   10226                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
   10227              $C$DW$1756      .dwtag  DW_TAG_member
   10228                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$100)
   10229                      .dwattr $C$DW$1756, DW_AT_name("NMI")
   10230                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_NMI")
   10231                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10232                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
   10233              $C$DW$1757      .dwtag  DW_TAG_member
   10234                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$100)
   10235                      .dwattr $C$DW$1757, DW_AT_name("ILLEGAL")
   10236                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_ILLEGAL")
   10237                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10238                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
   10239              $C$DW$1758      .dwtag  DW_TAG_member
   10240                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$100)
