TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 13:27:58 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3630              $C$DW$526       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    3631              $C$DW$527       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    3632                      .dwendtag $C$DW$T$181
    3633              
    3634              $C$DW$T$182     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    3635                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$181)
    3636                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    3637              $C$DW$528       .dwtag  DW_TAG_TI_far_type
    3638                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$182)
    3639              $C$DW$T$183     .dwtag  DW_TAG_const_type
    3640                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$528)
    3641              
    3642              $C$DW$T$184     .dwtag  DW_TAG_enumeration_type
    3643                      .dwattr $C$DW$T$184, DW_AT_byte_size(0x01)
    3644              $C$DW$529       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3645              $C$DW$530       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3646              $C$DW$531       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3647              $C$DW$532       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3648              $C$DW$533       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3649              $C$DW$534       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3650              $C$DW$535       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3651              $C$DW$536       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3652              $C$DW$537       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3653              $C$DW$538       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3654              $C$DW$539       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3655              $C$DW$540       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   73

    3656                      .dwendtag $C$DW$T$184
    3657              
    3658              $C$DW$T$185     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3659                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    3660                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    3661              
    3662              $C$DW$T$187     .dwtag  DW_TAG_enumeration_type
    3663                      .dwattr $C$DW$T$187, DW_AT_byte_size(0x01)
    3664              $C$DW$541       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3665              $C$DW$542       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3666                      .dwendtag $C$DW$T$187
    3667              
    3668              $C$DW$T$188     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3669                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
    3670                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    3671              
    3672              $C$DW$T$190     .dwtag  DW_TAG_enumeration_type
    3673                      .dwattr $C$DW$T$190, DW_AT_byte_size(0x01)
    3674              $C$DW$543       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_1"), DW_AT_const_value(0x00)
    3675              $C$DW$544       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_2"), DW_AT_const_value(0x01)
    3676              $C$DW$545       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_3"), DW_AT_const_value(0x02)
    3677              $C$DW$546       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_4"), DW_AT_const_value(0x03)
    3678                      .dwendtag $C$DW$T$190
    3679              
    3680              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Number_e")
    3681                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    3682                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    3683              
    3684              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3685                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    3686                      .dwattr $C$DW$T$19, DW_AT_declaration
    3687                      .dwendtag $C$DW$T$19
    3688              
    3689              $C$DW$T$114     .dwtag  DW_TAG_pointer_type
    3690                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$19)
    3691                      .dwattr $C$DW$T$114, DW_AT_address_class(0x16)
    3692              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3693                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    3694                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3695              
    3696              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3697                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3698                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3699              $C$DW$547       .dwtag  DW_TAG_member
    3700                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$25)
    3701                      .dwattr $C$DW$547, DW_AT_name("ADCRESULT")
    3702                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_ADCRESULT")
    3703                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3704                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3705              $C$DW$548       .dwtag  DW_TAG_member
    3706                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$26)
    3707                      .dwattr $C$DW$548, DW_AT_name("resvd_1")
    3708                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_resvd_1")
    3709                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3710                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   74

    3711              $C$DW$549       .dwtag  DW_TAG_member
    3712                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$24)
    3713                      .dwattr $C$DW$549, DW_AT_name("ADCCTL1")
    3714                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_ADCCTL1")
    3715                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3716                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3717              $C$DW$550       .dwtag  DW_TAG_member
    3718                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$24)
    3719                      .dwattr $C$DW$550, DW_AT_name("ADCCTL2")
    3720                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_ADCCTL2")
    3721                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3722                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3723              $C$DW$551       .dwtag  DW_TAG_member
    3724                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$27)
    3725                      .dwattr $C$DW$551, DW_AT_name("rsvd_2")
    3726                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_rsvd_2")
    3727                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3728                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3729              $C$DW$552       .dwtag  DW_TAG_member
    3730                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$24)
    3731                      .dwattr $C$DW$552, DW_AT_name("ADCINTFLG")
    3732                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_ADCINTFLG")
    3733                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3734                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3735              $C$DW$553       .dwtag  DW_TAG_member
    3736                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$24)
    3737                      .dwattr $C$DW$553, DW_AT_name("ADCINTFLGCLR")
    3738                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3739                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3740                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3741              $C$DW$554       .dwtag  DW_TAG_member
    3742                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$24)
    3743                      .dwattr $C$DW$554, DW_AT_name("ADCINTOVF")
    3744                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_ADCINTOVF")
    3745                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3746                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3747              $C$DW$555       .dwtag  DW_TAG_member
    3748                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$24)
    3749                      .dwattr $C$DW$555, DW_AT_name("ADCINTOVFCLR")
    3750                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3751                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3752                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3753              $C$DW$556       .dwtag  DW_TAG_member
    3754                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$28)
    3755                      .dwattr $C$DW$556, DW_AT_name("INTSELxNy")
    3756                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_INTSELxNy")
    3757                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3758                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3759              $C$DW$557       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$29)
    3761                      .dwattr $C$DW$557, DW_AT_name("rsvd_3")
    3762                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_rsvd_3")
    3763                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3764                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3765              $C$DW$558       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   75

    3766                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$24)
    3767                      .dwattr $C$DW$558, DW_AT_name("SOCPRICTRL")
    3768                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3769                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3770                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3771              $C$DW$559       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$24)
    3773                      .dwattr $C$DW$559, DW_AT_name("rsvd_4")
    3774                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_rsvd_4")
    3775                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3776                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3777              $C$DW$560       .dwtag  DW_TAG_member
    3778                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$24)
    3779                      .dwattr $C$DW$560, DW_AT_name("ADCSAMPLEMODE")
    3780                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3781                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3782                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3783              $C$DW$561       .dwtag  DW_TAG_member
    3784                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$24)
    3785                      .dwattr $C$DW$561, DW_AT_name("rsvd_5")
    3786                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_rsvd_5")
    3787                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3788                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3789              $C$DW$562       .dwtag  DW_TAG_member
    3790                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$24)
    3791                      .dwattr $C$DW$562, DW_AT_name("ADCINTSOCSEL1")
    3792                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3793                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3794                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3795              $C$DW$563       .dwtag  DW_TAG_member
    3796                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$24)
    3797                      .dwattr $C$DW$563, DW_AT_name("ADCINTSOCSEL2")
    3798                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3799                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3800                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3801              $C$DW$564       .dwtag  DW_TAG_member
    3802                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$27)
    3803                      .dwattr $C$DW$564, DW_AT_name("rsvd_6")
    3804                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_rsvd_6")
    3805                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3806                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3807              $C$DW$565       .dwtag  DW_TAG_member
    3808                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$24)
    3809                      .dwattr $C$DW$565, DW_AT_name("ADCSOCFLG1")
    3810                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3811                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3812                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3813              $C$DW$566       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$24)
    3815                      .dwattr $C$DW$566, DW_AT_name("rsvd_7")
    3816                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_rsvd_7")
    3817                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3818                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3819              $C$DW$567       .dwtag  DW_TAG_member
    3820                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   76

    3821                      .dwattr $C$DW$567, DW_AT_name("ADCSOCFRC1")
    3822                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3823                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3824                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3825              $C$DW$568       .dwtag  DW_TAG_member
    3826                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$24)
    3827                      .dwattr $C$DW$568, DW_AT_name("rsvd_8")
    3828                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_rsvd_8")
    3829                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3830                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3831              $C$DW$569       .dwtag  DW_TAG_member
    3832                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$24)
    3833                      .dwattr $C$DW$569, DW_AT_name("ADCSOCOVF1")
    3834                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3835                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3836                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3837              $C$DW$570       .dwtag  DW_TAG_member
    3838                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$24)
    3839                      .dwattr $C$DW$570, DW_AT_name("rsvd_9")
    3840                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_rsvd_9")
    3841                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3842                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3843              $C$DW$571       .dwtag  DW_TAG_member
    3844                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$24)
    3845                      .dwattr $C$DW$571, DW_AT_name("ADCSOCOVFCLR1")
    3846                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3847                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3848                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3849              $C$DW$572       .dwtag  DW_TAG_member
    3850                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$24)
    3851                      .dwattr $C$DW$572, DW_AT_name("rsvd_10")
    3852                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_rsvd_10")
    3853                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3854                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3855              $C$DW$573       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$25)
    3857                      .dwattr $C$DW$573, DW_AT_name("ADCSOCxCTL")
    3858                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3859                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3860                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3861              $C$DW$574       .dwtag  DW_TAG_member
    3862                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$25)
    3863                      .dwattr $C$DW$574, DW_AT_name("rsvd_11")
    3864                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_rsvd_11")
    3865                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3866                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3867              $C$DW$575       .dwtag  DW_TAG_member
    3868                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$24)
    3869                      .dwattr $C$DW$575, DW_AT_name("ADCREFTRIM")
    3870                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3871                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3872                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3873              $C$DW$576       .dwtag  DW_TAG_member
    3874                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$24)
    3875                      .dwattr $C$DW$576, DW_AT_name("ADCOFFTRIM")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   77

    3876                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3877                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3878                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3879              $C$DW$577       .dwtag  DW_TAG_member
    3880                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$30)
    3881                      .dwattr $C$DW$577, DW_AT_name("resvd_12")
    3882                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_resvd_12")
    3883                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3884                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3885              $C$DW$578       .dwtag  DW_TAG_member
    3886                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$24)
    3887                      .dwattr $C$DW$578, DW_AT_name("ADCREV")
    3888                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_ADCREV")
    3889                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3890                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3891                      .dwendtag $C$DW$T$31
    3892              
    3893              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3894                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$31)
    3895                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    3896              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    3897                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$31)
    3898                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    3899              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3900                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3901                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3902              
    3903              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3904                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    3905                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    3906              $C$DW$579       .dwtag  DW_TAG_member
    3907                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$32)
    3908                      .dwattr $C$DW$579, DW_AT_name("alpha_sf")
    3909                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_alpha_sf")
    3910                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3911                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3912              $C$DW$580       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$32)
    3914                      .dwattr $C$DW$580, DW_AT_name("beta_sf")
    3915                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_beta_sf")
    3916                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3917                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3918              $C$DW$581       .dwtag  DW_TAG_member
    3919                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$33)
    3920                      .dwattr $C$DW$581, DW_AT_name("numSensors")
    3921                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_numSensors")
    3922                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3923                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3924                      .dwendtag $C$DW$T$34
    3925              
    3926              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3927                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$34)
    3928                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3929              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3930                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$34)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   78

    3931                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3932              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3933                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3934                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3935              
    3936              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3937                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    3938                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    3939              $C$DW$582       .dwtag  DW_TAG_member
    3940                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$24)
    3941                      .dwattr $C$DW$582, DW_AT_name("XCLK")
    3942                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_XCLK")
    3943                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3944                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3945              $C$DW$583       .dwtag  DW_TAG_member
    3946                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$24)
    3947                      .dwattr $C$DW$583, DW_AT_name("rsvd_1")
    3948                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_rsvd_1")
    3949                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3950                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3951              $C$DW$584       .dwtag  DW_TAG_member
    3952                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$24)
    3953                      .dwattr $C$DW$584, DW_AT_name("CLKCTL")
    3954                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_CLKCTL")
    3955                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3956                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3957              $C$DW$585       .dwtag  DW_TAG_member
    3958                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$35)
    3959                      .dwattr $C$DW$585, DW_AT_name("rsvd_2")
    3960                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_rsvd_2")
    3961                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3962                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3963              $C$DW$586       .dwtag  DW_TAG_member
    3964                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$24)
    3965                      .dwattr $C$DW$586, DW_AT_name("LOSPCP")
    3966                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_LOSPCP")
    3967                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3968                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3969              $C$DW$587       .dwtag  DW_TAG_member
    3970                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$24)
    3971                      .dwattr $C$DW$587, DW_AT_name("PCLKCR0")
    3972                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_PCLKCR0")
    3973                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3974                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3975              $C$DW$588       .dwtag  DW_TAG_member
    3976                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$24)
    3977                      .dwattr $C$DW$588, DW_AT_name("PCLKCR1")
    3978                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_PCLKCR1")
    3979                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3980                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3981              $C$DW$589       .dwtag  DW_TAG_member
    3982                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$27)
    3983                      .dwattr $C$DW$589, DW_AT_name("rsvd_3")
    3984                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_rsvd_3")
    3985                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   79

    3986                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3987              $C$DW$590       .dwtag  DW_TAG_member
    3988                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$24)
    3989                      .dwattr $C$DW$590, DW_AT_name("PCLKCR3")
    3990                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_PCLKCR3")
    3991                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3992                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3993                      .dwendtag $C$DW$T$36
    3994              
    3995              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    3996                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$36)
    3997                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    3998              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3999                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    4000                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    4001              
    4002              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4003                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    4004                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4005              $C$DW$591       .dwtag  DW_TAG_member
    4006                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$33)
    4007                      .dwattr $C$DW$591, DW_AT_name("tmp")
    4008                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_tmp")
    4009                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4010                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4011                      .dwendtag $C$DW$T$37
    4012              
    4013              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    4014                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$37)
    4015                      .dwattr $C$DW$T$89, DW_AT_address_class(0x16)
    4016              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4017                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    4018                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    4019              
    4020              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4021                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_USAGE_Obj_")
    4022                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x16)
    4023              $C$DW$592       .dwtag  DW_TAG_member
    4024                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$38)
    4025                      .dwattr $C$DW$592, DW_AT_name("timerPeriod_cnts")
    4026                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    4027                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4028                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4029              $C$DW$593       .dwtag  DW_TAG_member
    4030                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$38)
    4031                      .dwattr $C$DW$593, DW_AT_name("cnt_z0")
    4032                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_cnt_z0")
    4033                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4034                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    4035              $C$DW$594       .dwtag  DW_TAG_member
    4036                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$38)
    4037                      .dwattr $C$DW$594, DW_AT_name("cnt_z1")
    4038                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_cnt_z1")
    4039                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4040                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   80

    4041              $C$DW$595       .dwtag  DW_TAG_member
    4042                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$38)
    4043                      .dwattr $C$DW$595, DW_AT_name("deltaCnt")
    4044                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_deltaCnt")
    4045                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4046                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    4047              $C$DW$596       .dwtag  DW_TAG_member
    4048                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$38)
    4049                      .dwattr $C$DW$596, DW_AT_name("deltaCntAcc")
    4050                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_deltaCntAcc")
    4051                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4052                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4053              $C$DW$597       .dwtag  DW_TAG_member
    4054                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$38)
    4055                      .dwattr $C$DW$597, DW_AT_name("deltaCntAccNum")
    4056                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_deltaCntAccNum")
    4057                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4058                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4059              $C$DW$598       .dwtag  DW_TAG_member
    4060                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$38)
    4061                      .dwattr $C$DW$598, DW_AT_name("deltaCntAccNumMax")
    4062                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
    4063                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4064                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4065              $C$DW$599       .dwtag  DW_TAG_member
    4066                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$38)
    4067                      .dwattr $C$DW$599, DW_AT_name("minDeltaCntObserved")
    4068                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_minDeltaCntObserved")
    4069                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4070                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4071              $C$DW$600       .dwtag  DW_TAG_member
    4072                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$38)
    4073                      .dwattr $C$DW$600, DW_AT_name("avgDeltaCntObserved")
    4074                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
    4075                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4076                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4077              $C$DW$601       .dwtag  DW_TAG_member
    4078                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$38)
    4079                      .dwattr $C$DW$601, DW_AT_name("maxDeltaCntObserved")
    4080                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
    4081                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4082                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4083              $C$DW$602       .dwtag  DW_TAG_member
    4084                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$39)
    4085                      .dwattr $C$DW$602, DW_AT_name("flag_resetStats")
    4086                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_flag_resetStats")
    4087                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4088                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4089                      .dwendtag $C$DW$T$40
    4090              
    4091              $C$DW$T$194     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Obj")
    4092                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$40)
    4093                      .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    4094              $C$DW$T$195     .dwtag  DW_TAG_pointer_type
    4095                      .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   81

    4096                      .dwattr $C$DW$T$195, DW_AT_address_class(0x16)
    4097              $C$DW$T$196     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Handle")
    4098                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$195)
    4099                      .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    4100              
    4101              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    4102                      .dwattr $C$DW$T$72, DW_AT_name("_CTRL_Obj_")
    4103                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x108)
    4104              $C$DW$603       .dwtag  DW_TAG_member
    4105                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$41)
    4106                      .dwattr $C$DW$603, DW_AT_name("version")
    4107                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_version")
    4108                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4109                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4110              $C$DW$604       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$43)
    4112                      .dwattr $C$DW$604, DW_AT_name("state")
    4113                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_state")
    4114                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4115                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4116              $C$DW$605       .dwtag  DW_TAG_member
    4117                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$43)
    4118                      .dwattr $C$DW$605, DW_AT_name("prevState")
    4119                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_prevState")
    4120                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4121                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4122              $C$DW$606       .dwtag  DW_TAG_member
    4123                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$45)
    4124                      .dwattr $C$DW$606, DW_AT_name("errorCode")
    4125                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_errorCode")
    4126                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4127                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4128              $C$DW$607       .dwtag  DW_TAG_member
    4129                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$47)
    4130                      .dwattr $C$DW$607, DW_AT_name("clarkeHandle_I")
    4131                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4132                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4133                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4134              $C$DW$608       .dwtag  DW_TAG_member
    4135                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$48)
    4136                      .dwattr $C$DW$608, DW_AT_name("clarke_I")
    4137                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_clarke_I")
    4138                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4139                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4140              $C$DW$609       .dwtag  DW_TAG_member
    4141                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$47)
    4142                      .dwattr $C$DW$609, DW_AT_name("clarkeHandle_V")
    4143                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4144                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4145                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4146              $C$DW$610       .dwtag  DW_TAG_member
    4147                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$48)
    4148                      .dwattr $C$DW$610, DW_AT_name("clarke_V")
    4149                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_clarke_V")
    4150                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   82

    4151                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4152              $C$DW$611       .dwtag  DW_TAG_member
    4153                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$50)
    4154                      .dwattr $C$DW$611, DW_AT_name("estHandle")
    4155                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_estHandle")
    4156                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4157                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4158              $C$DW$612       .dwtag  DW_TAG_member
    4159                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$52)
    4160                      .dwattr $C$DW$612, DW_AT_name("parkHandle")
    4161                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_parkHandle")
    4162                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4163                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4164              $C$DW$613       .dwtag  DW_TAG_member
    4165                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$53)
    4166                      .dwattr $C$DW$613, DW_AT_name("park")
    4167                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_park")
    4168                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4169                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4170              $C$DW$614       .dwtag  DW_TAG_member
    4171                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$55)
    4172                      .dwattr $C$DW$614, DW_AT_name("pidHandle_Id")
    4173                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_pidHandle_Id")
    4174                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4175                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4176              $C$DW$615       .dwtag  DW_TAG_member
    4177                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$56)
    4178                      .dwattr $C$DW$615, DW_AT_name("pid_Id")
    4179                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_pid_Id")
    4180                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4181                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4182              $C$DW$616       .dwtag  DW_TAG_member
    4183                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$55)
    4184                      .dwattr $C$DW$616, DW_AT_name("pidHandle_Iq")
    4185                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4186                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4187                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4188              $C$DW$617       .dwtag  DW_TAG_member
    4189                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$56)
    4190                      .dwattr $C$DW$617, DW_AT_name("pid_Iq")
    4191                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_pid_Iq")
    4192                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4193                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4194              $C$DW$618       .dwtag  DW_TAG_member
    4195                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$55)
    4196                      .dwattr $C$DW$618, DW_AT_name("pidHandle_spd")
    4197                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_pidHandle_spd")
    4198                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4199                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4200              $C$DW$619       .dwtag  DW_TAG_member
    4201                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$56)
    4202                      .dwattr $C$DW$619, DW_AT_name("pid_spd")
    4203                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_pid_spd")
    4204                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4205                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   83

    4206              $C$DW$620       .dwtag  DW_TAG_member
    4207                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$58)
    4208                      .dwattr $C$DW$620, DW_AT_name("iparkHandle")
    4209                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_iparkHandle")
    4210                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4211                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4212              $C$DW$621       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$59)
    4214                      .dwattr $C$DW$621, DW_AT_name("ipark")
    4215                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_ipark")
    4216                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4217                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4218              $C$DW$622       .dwtag  DW_TAG_member
    4219                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$61)
    4220                      .dwattr $C$DW$622, DW_AT_name("svgenHandle")
    4221                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_svgenHandle")
    4222                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4223                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4224              $C$DW$623       .dwtag  DW_TAG_member
    4225                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$62)
    4226                      .dwattr $C$DW$623, DW_AT_name("svgen")
    4227                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_svgen")
    4228                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4229                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4230              $C$DW$624       .dwtag  DW_TAG_member
    4231                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$64)
    4232                      .dwattr $C$DW$624, DW_AT_name("trajHandle_Id")
    4233                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_trajHandle_Id")
    4234                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4235                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4236              $C$DW$625       .dwtag  DW_TAG_member
    4237                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$65)
    4238                      .dwattr $C$DW$625, DW_AT_name("traj_Id")
    4239                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_traj_Id")
    4240                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4241                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4242              $C$DW$626       .dwtag  DW_TAG_member
    4243                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$64)
    4244                      .dwattr $C$DW$626, DW_AT_name("trajHandle_spd")
    4245                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_trajHandle_spd")
    4246                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4247                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4248              $C$DW$627       .dwtag  DW_TAG_member
    4249                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$65)
    4250                      .dwattr $C$DW$627, DW_AT_name("traj_spd")
    4251                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_traj_spd")
    4252                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4253                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4254              $C$DW$628       .dwtag  DW_TAG_member
    4255                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$64)
    4256                      .dwattr $C$DW$628, DW_AT_name("trajHandle_spdMax")
    4257                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4258                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4259                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4260              $C$DW$629       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   84

    4261                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$65)
    4262                      .dwattr $C$DW$629, DW_AT_name("traj_spdMax")
    4263                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_traj_spdMax")
    4264                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4265                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4266              $C$DW$630       .dwtag  DW_TAG_member
    4267                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$66)
    4268                      .dwattr $C$DW$630, DW_AT_name("motorParams")
    4269                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_motorParams")
    4270                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4271                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4272              $C$DW$631       .dwtag  DW_TAG_member
    4273                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$68)
    4274                      .dwattr $C$DW$631, DW_AT_name("waitTimes")
    4275                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_waitTimes")
    4276                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4277                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4278              $C$DW$632       .dwtag  DW_TAG_member
    4279                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$67)
    4280                      .dwattr $C$DW$632, DW_AT_name("counter_state")
    4281                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_counter_state")
    4282                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4283                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4284              $C$DW$633       .dwtag  DW_TAG_member
    4285                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$69)
    4286                      .dwattr $C$DW$633, DW_AT_name("numIsrTicksPerCtrlTick")
    4287                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4288                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4289                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4290              $C$DW$634       .dwtag  DW_TAG_member
    4291                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$69)
    4292                      .dwattr $C$DW$634, DW_AT_name("numCtrlTicksPerCurrentTick")
    4293                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4294                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4295                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4296              $C$DW$635       .dwtag  DW_TAG_member
    4297                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$69)
    4298                      .dwattr $C$DW$635, DW_AT_name("numCtrlTicksPerSpeedTick")
    4299                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4300                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4301                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4302              $C$DW$636       .dwtag  DW_TAG_member
    4303                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$69)
    4304                      .dwattr $C$DW$636, DW_AT_name("numCtrlTicksPerTrajTick")
    4305                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4306                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4307                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4308              $C$DW$637       .dwtag  DW_TAG_member
    4309                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$67)
    4310                      .dwattr $C$DW$637, DW_AT_name("ctrlFreq_Hz")
    4311                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4312                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4313                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4314              $C$DW$638       .dwtag  DW_TAG_member
    4315                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$67)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   85

    4316                      .dwattr $C$DW$638, DW_AT_name("trajFreq_Hz")
    4317                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4318                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4319                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4320              $C$DW$639       .dwtag  DW_TAG_member
    4321                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$32)
    4322                      .dwattr $C$DW$639, DW_AT_name("trajPeriod_sec")
    4323                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4324                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4325                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4326              $C$DW$640       .dwtag  DW_TAG_member
    4327                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$70)
    4328                      .dwattr $C$DW$640, DW_AT_name("ctrlPeriod_sec")
    4329                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4330                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4331                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4332              $C$DW$641       .dwtag  DW_TAG_member
    4333                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$32)
    4334                      .dwattr $C$DW$641, DW_AT_name("maxVsMag_pu")
    4335                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4336                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4337                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4338              $C$DW$642       .dwtag  DW_TAG_member
    4339                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$71)
    4340                      .dwattr $C$DW$642, DW_AT_name("Iab_in")
    4341                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_Iab_in")
    4342                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4343                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4344              $C$DW$643       .dwtag  DW_TAG_member
    4345                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$71)
    4346                      .dwattr $C$DW$643, DW_AT_name("Iab_filt")
    4347                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_Iab_filt")
    4348                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4349                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4350              $C$DW$644       .dwtag  DW_TAG_member
    4351                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$71)
    4352                      .dwattr $C$DW$644, DW_AT_name("Idq_in")
    4353                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_Idq_in")
    4354                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4355                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4356              $C$DW$645       .dwtag  DW_TAG_member
    4357                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$71)
    4358                      .dwattr $C$DW$645, DW_AT_name("Vab_in")
    4359                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_Vab_in")
    4360                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4361                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4362              $C$DW$646       .dwtag  DW_TAG_member
    4363                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$32)
    4364                      .dwattr $C$DW$646, DW_AT_name("spd_out")
    4365                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_spd_out")
    4366                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4367                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4368              $C$DW$647       .dwtag  DW_TAG_member
    4369                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$71)
    4370                      .dwattr $C$DW$647, DW_AT_name("Vab_out")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   86

    4371                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_Vab_out")
    4372                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4373                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4374              $C$DW$648       .dwtag  DW_TAG_member
    4375                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$71)
    4376                      .dwattr $C$DW$648, DW_AT_name("Vdq_out")
    4377                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_Vdq_out")
    4378                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4379                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4380              $C$DW$649       .dwtag  DW_TAG_member
    4381                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$70)
    4382                      .dwattr $C$DW$649, DW_AT_name("Rhf")
    4383                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_Rhf")
    4384                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4385                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4386              $C$DW$650       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$70)
    4388                      .dwattr $C$DW$650, DW_AT_name("Lhf")
    4389                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_Lhf")
    4390                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4391                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4392              $C$DW$651       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$70)
    4394                      .dwattr $C$DW$651, DW_AT_name("RoverL")
    4395                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_RoverL")
    4396                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4397                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4398              $C$DW$652       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$32)
    4400                      .dwattr $C$DW$652, DW_AT_name("Kp_Id")
    4401                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_Kp_Id")
    4402                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4403                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4404              $C$DW$653       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$32)
    4406                      .dwattr $C$DW$653, DW_AT_name("Kp_Iq")
    4407                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_Kp_Iq")
    4408                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4409                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4410              $C$DW$654       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$32)
    4412                      .dwattr $C$DW$654, DW_AT_name("Kp_spd")
    4413                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_Kp_spd")
    4414                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4415                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4416              $C$DW$655       .dwtag  DW_TAG_member
    4417                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$32)
    4418                      .dwattr $C$DW$655, DW_AT_name("Ki_Id")
    4419                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_Ki_Id")
    4420                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4421                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4422              $C$DW$656       .dwtag  DW_TAG_member
    4423                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$32)
    4424                      .dwattr $C$DW$656, DW_AT_name("Ki_Iq")
    4425                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_Ki_Iq")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   87

    4426                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4427                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4428              $C$DW$657       .dwtag  DW_TAG_member
    4429                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$32)
    4430                      .dwattr $C$DW$657, DW_AT_name("Ki_spd")
    4431                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_Ki_spd")
    4432                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4433                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4434              $C$DW$658       .dwtag  DW_TAG_member
    4435                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$32)
    4436                      .dwattr $C$DW$658, DW_AT_name("Kd_Id")
    4437                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_Kd_Id")
    4438                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4439                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4440              $C$DW$659       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$32)
    4442                      .dwattr $C$DW$659, DW_AT_name("Kd_Iq")
    4443                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_Kd_Iq")
    4444                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4445                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4446              $C$DW$660       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$32)
    4448                      .dwattr $C$DW$660, DW_AT_name("Kd_spd")
    4449                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_Kd_spd")
    4450                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4451                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4452              $C$DW$661       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$32)
    4454                      .dwattr $C$DW$661, DW_AT_name("Ui_Id")
    4455                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_Ui_Id")
    4456                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4457                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4458              $C$DW$662       .dwtag  DW_TAG_member
    4459                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$32)
    4460                      .dwattr $C$DW$662, DW_AT_name("Ui_Iq")
    4461                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_Ui_Iq")
    4462                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4463                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4464              $C$DW$663       .dwtag  DW_TAG_member
    4465                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$32)
    4466                      .dwattr $C$DW$663, DW_AT_name("Ui_spd")
    4467                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_Ui_spd")
    4468                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4469                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4470              $C$DW$664       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$71)
    4472                      .dwattr $C$DW$664, DW_AT_name("Idq_ref")
    4473                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_Idq_ref")
    4474                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4475                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4476              $C$DW$665       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$32)
    4478                      .dwattr $C$DW$665, DW_AT_name("IdRated")
    4479                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_IdRated")
    4480                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   88

    4481                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4482              $C$DW$666       .dwtag  DW_TAG_member
    4483                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$32)
    4484                      .dwattr $C$DW$666, DW_AT_name("spd_ref")
    4485                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_spd_ref")
    4486                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4487                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4488              $C$DW$667       .dwtag  DW_TAG_member
    4489                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$32)
    4490                      .dwattr $C$DW$667, DW_AT_name("spd_max")
    4491                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_spd_max")
    4492                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4493                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4494              $C$DW$668       .dwtag  DW_TAG_member
    4495                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$69)
    4496                      .dwattr $C$DW$668, DW_AT_name("counter_current")
    4497                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_counter_current")
    4498                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4499                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4500              $C$DW$669       .dwtag  DW_TAG_member
    4501                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$69)
    4502                      .dwattr $C$DW$669, DW_AT_name("counter_isr")
    4503                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_counter_isr")
    4504                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4505                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4506              $C$DW$670       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$69)
    4508                      .dwattr $C$DW$670, DW_AT_name("counter_speed")
    4509                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_counter_speed")
    4510                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4511                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4512              $C$DW$671       .dwtag  DW_TAG_member
    4513                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$69)
    4514                      .dwattr $C$DW$671, DW_AT_name("counter_traj")
    4515                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_counter_traj")
    4516                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4517                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4518              $C$DW$672       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$39)
    4520                      .dwattr $C$DW$672, DW_AT_name("flag_enableCtrl")
    4521                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4522                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4523                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4524              $C$DW$673       .dwtag  DW_TAG_member
    4525                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$39)
    4526                      .dwattr $C$DW$673, DW_AT_name("flag_enableDcBusComp")
    4527                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4528                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4529                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4530              $C$DW$674       .dwtag  DW_TAG_member
    4531                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$39)
    4532                      .dwattr $C$DW$674, DW_AT_name("flag_enablePowerWarp")
    4533                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4534                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4535                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   89

    4536              $C$DW$675       .dwtag  DW_TAG_member
    4537                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$39)
    4538                      .dwattr $C$DW$675, DW_AT_name("flag_enableOffset")
    4539                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_flag_enableOffset")
    4540                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4541                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4542              $C$DW$676       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$39)
    4544                      .dwattr $C$DW$676, DW_AT_name("flag_enableSpeedCtrl")
    4545                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4546                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4547                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4548              $C$DW$677       .dwtag  DW_TAG_member
    4549                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$39)
    4550                      .dwattr $C$DW$677, DW_AT_name("flag_enableUserMotorParams")
    4551                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4552                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4553                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4554              $C$DW$678       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$71)
    4556                      .dwattr $C$DW$678, DW_AT_name("Idq_offset_pu")
    4557                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4558                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4559                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4560              $C$DW$679       .dwtag  DW_TAG_member
    4561                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$71)
    4562                      .dwattr $C$DW$679, DW_AT_name("Vdq_offset_pu")
    4563                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4564                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4565                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4566              $C$DW$680       .dwtag  DW_TAG_member
    4567                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$32)
    4568                      .dwattr $C$DW$680, DW_AT_name("angle_pu")
    4569                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_angle_pu")
    4570                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4571                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4572              $C$DW$681       .dwtag  DW_TAG_member
    4573                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$32)
    4574                      .dwattr $C$DW$681, DW_AT_name("speed_ref_pu")
    4575                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_speed_ref_pu")
    4576                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4577                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4578              $C$DW$682       .dwtag  DW_TAG_member
    4579                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$32)
    4580                      .dwattr $C$DW$682, DW_AT_name("speed_fb_pu")
    4581                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_speed_fb_pu")
    4582                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4583                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4584              $C$DW$683       .dwtag  DW_TAG_member
    4585                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$32)
    4586                      .dwattr $C$DW$683, DW_AT_name("speed_outMax_pu")
    4587                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4588                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4589                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4590              $C$DW$684       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   90

    4591                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$39)
    4592                      .dwattr $C$DW$684, DW_AT_name("flag_enableCurrentCtrl")
    4593                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4594                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4595                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4596                      .dwendtag $C$DW$T$72
    4597              
    4598              $C$DW$T$202     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4599                      .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$72)
    4600                      .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
    4601              $C$DW$T$203     .dwtag  DW_TAG_pointer_type
    4602                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$202)
    4603                      .dwattr $C$DW$T$203, DW_AT_address_class(0x16)
    4604              $C$DW$T$164     .dwtag  DW_TAG_pointer_type
    4605                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$72)
    4606                      .dwattr $C$DW$T$164, DW_AT_address_class(0x16)
    4607              $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4608                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
    4609                      .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    4610              $C$DW$685       .dwtag  DW_TAG_TI_far_type
    4611                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$165)
    4612              $C$DW$T$204     .dwtag  DW_TAG_const_type
    4613                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$685)
    4614              
    4615              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4616                      .dwattr $C$DW$T$75, DW_AT_name("_CTRL_Version_")
    4617                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x04)
    4618              $C$DW$686       .dwtag  DW_TAG_member
    4619                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$23)
    4620                      .dwattr $C$DW$686, DW_AT_name("rsvd")
    4621                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_rsvd")
    4622                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4623                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4624              $C$DW$687       .dwtag  DW_TAG_member
    4625                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$74)
    4626                      .dwattr $C$DW$687, DW_AT_name("targetProc")
    4627                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_targetProc")
    4628                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4629                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4630              $C$DW$688       .dwtag  DW_TAG_member
    4631                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$23)
    4632                      .dwattr $C$DW$688, DW_AT_name("major")
    4633                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_major")
    4634                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4635                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4636              $C$DW$689       .dwtag  DW_TAG_member
    4637                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$23)
    4638                      .dwattr $C$DW$689, DW_AT_name("minor")
    4639                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_minor")
    4640                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4641                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4642                      .dwendtag $C$DW$T$75
    4643              
    4644              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4645                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$75)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   91

    4646                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4647              $C$DW$T$210     .dwtag  DW_TAG_pointer_type
    4648                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$41)
    4649                      .dwattr $C$DW$T$210, DW_AT_address_class(0x16)
    4650              
    4651              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4652                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    4653                      .dwattr $C$DW$T$20, DW_AT_declaration
    4654                      .dwendtag $C$DW$T$20
    4655              
    4656              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    4657                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$20)
    4658                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    4659              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4660                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    4661                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4662              
    4663              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4664                      .dwattr $C$DW$T$76, DW_AT_name("_FEM_Obj_")
    4665                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x12)
    4666              $C$DW$690       .dwtag  DW_TAG_member
    4667                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$38)
    4668                      .dwattr $C$DW$690, DW_AT_name("timerPeriod_cnts")
    4669                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    4670                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4671                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4672              $C$DW$691       .dwtag  DW_TAG_member
    4673                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$38)
    4674                      .dwattr $C$DW$691, DW_AT_name("cnt_z0")
    4675                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_cnt_z0")
    4676                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4677                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4678              $C$DW$692       .dwtag  DW_TAG_member
    4679                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$38)
    4680                      .dwattr $C$DW$692, DW_AT_name("cnt_z1")
    4681                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_cnt_z1")
    4682                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4683                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4684              $C$DW$693       .dwtag  DW_TAG_member
    4685                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$38)
    4686                      .dwattr $C$DW$693, DW_AT_name("deltaCnt")
    4687                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_deltaCnt")
    4688                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4689                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4690              $C$DW$694       .dwtag  DW_TAG_member
    4691                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$38)
    4692                      .dwattr $C$DW$694, DW_AT_name("maxDeltaCnt")
    4693                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_maxDeltaCnt")
    4694                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4695                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4696              $C$DW$695       .dwtag  DW_TAG_member
    4697                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$38)
    4698                      .dwattr $C$DW$695, DW_AT_name("minDeltaCnt")
    4699                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_minDeltaCnt")
    4700                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   92

    4701                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4702              $C$DW$696       .dwtag  DW_TAG_member
    4703                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$38)
    4704                      .dwattr $C$DW$696, DW_AT_name("maxDeltaCntObserved")
    4705                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
    4706                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4707                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4708              $C$DW$697       .dwtag  DW_TAG_member
    4709                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$38)
    4710                      .dwattr $C$DW$697, DW_AT_name("errorCnt")
    4711                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_errorCnt")
    4712                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4713                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4714              $C$DW$698       .dwtag  DW_TAG_member
    4715                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$39)
    4716                      .dwattr $C$DW$698, DW_AT_name("flag_freqError")
    4717                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_flag_freqError")
    4718                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4719                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4720                      .dwendtag $C$DW$T$76
    4721              
    4722              $C$DW$T$213     .dwtag  DW_TAG_typedef, DW_AT_name("FEM_Obj")
    4723                      .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$76)
    4724                      .dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
    4725              $C$DW$T$214     .dwtag  DW_TAG_pointer_type
    4726                      .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$76)
    4727                      .dwattr $C$DW$T$214, DW_AT_address_class(0x16)
    4728              $C$DW$T$215     .dwtag  DW_TAG_typedef, DW_AT_name("FEM_Handle")
    4729                      .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$214)
    4730                      .dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
    4731              
    4732              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    4733                      .dwattr $C$DW$T$77, DW_AT_name("_FILTER_FO_")
    4734                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x0a)
    4735              $C$DW$699       .dwtag  DW_TAG_member
    4736                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$32)
    4737                      .dwattr $C$DW$699, DW_AT_name("a1")
    4738                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_a1")
    4739                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4740                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4741              $C$DW$700       .dwtag  DW_TAG_member
    4742                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$32)
    4743                      .dwattr $C$DW$700, DW_AT_name("b0")
    4744                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_b0")
    4745                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4746                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4747              $C$DW$701       .dwtag  DW_TAG_member
    4748                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$32)
    4749                      .dwattr $C$DW$701, DW_AT_name("b1")
    4750                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_b1")
    4751                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4752                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4753              $C$DW$702       .dwtag  DW_TAG_member
    4754                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$32)
    4755                      .dwattr $C$DW$702, DW_AT_name("x1")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   93

    4756                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_x1")
    4757                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4758                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4759              $C$DW$703       .dwtag  DW_TAG_member
    4760                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$32)
    4761                      .dwattr $C$DW$703, DW_AT_name("y1")
    4762                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_y1")
    4763                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4764                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4765                      .dwendtag $C$DW$T$77
    4766              
    4767              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4768                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$77)
    4769                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    4770              
    4771              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4772                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    4773                      .dwattr $C$DW$T$21, DW_AT_declaration
    4774                      .dwendtag $C$DW$T$21
    4775              
    4776              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    4777                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$21)
    4778                      .dwattr $C$DW$T$135, DW_AT_address_class(0x16)
    4779              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4780                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
    4781                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    4782              
    4783              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    4784                      .dwattr $C$DW$T$78, DW_AT_name("_FLASH_Obj_")
    4785                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x08)
    4786              $C$DW$704       .dwtag  DW_TAG_member
    4787                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$24)
    4788                      .dwattr $C$DW$704, DW_AT_name("FOPT")
    4789                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_FOPT")
    4790                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4791                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4792              $C$DW$705       .dwtag  DW_TAG_member
    4793                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$24)
    4794                      .dwattr $C$DW$705, DW_AT_name("rsvd_1")
    4795                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd_1")
    4796                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4797                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4798              $C$DW$706       .dwtag  DW_TAG_member
    4799                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
    4800                      .dwattr $C$DW$706, DW_AT_name("FPWR")
    4801                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_FPWR")
    4802                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4803                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4804              $C$DW$707       .dwtag  DW_TAG_member
    4805                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$24)
    4806                      .dwattr $C$DW$707, DW_AT_name("FSTATUS")
    4807                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_FSTATUS")
    4808                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4809                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4810              $C$DW$708       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 13:27:58 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0868410                              PAGE   94

    4811                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$24)
    4812                      .dwattr $C$DW$708, DW_AT_name("FSTDBYWAIT")
    4813                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4814                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4815                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4816              $C$DW$709       .dwtag  DW_TAG_member
    4817                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$24)
    4818                      .dwattr $C$DW$709, DW_AT_name("FACTIVEWAIT")
    4819                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4820                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4821                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4822              $C$DW$710       .dwtag  DW_TAG_member
    4823                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$24)
    4824                      .dwattr $C$DW$710, DW_AT_name("FBANKWAIT")
    4825                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_FBANKWAIT")
    4826                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4827                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4828              $C$DW$711       .dwtag  DW_TAG_member
    4829                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$24)
    4830                      .dwattr $C$DW$711, DW_AT_name("FOTPWAIT")
    4831                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_FOTPWAIT")
    4832                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4833                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4834                      .dwendtag $C$DW$T$78
    4835              
    4836              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    4837                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$78)
    4838                      .dwattr $C$DW$T$91, DW_AT_address_class(0x16)
