TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 15:00:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0401610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Wed Jun 21 15:00:39 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/modules/fem/src/32b/fem.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;       c:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\040162 C

     199                      .dwattr $C$DW$19, DW_AT_external
     200                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$24)
     201                      .dwattr $C$DW$19, DW_AT_TI_begin_file("C:/ti/motorware/motorware_1_01_00_18/sw/modules/fem/src/32b/fe
     202                      .dwattr $C$DW$19, DW_AT_TI_begin_line(0x15)
     203                      .dwattr $C$DW$19, DW_AT_TI_begin_column(0x0c)
     204                      .dwattr $C$DW$19, DW_AT_TI_max_frame_size(-2)
     205                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_18/sw/modules/fem/src/32b/fem.c",line 22,column 1,is_
     206              
     207                      .dwfde $C$DW$CIE, _FEM_init
     208              $C$DW$20        .dwtag  DW_TAG_formal_parameter, DW_AT_name("pMemory")
     209                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_pMemory")
     210                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$3)
     211                      .dwattr $C$DW$20, DW_AT_location[DW_OP_reg12]
     212              $C$DW$21        .dwtag  DW_TAG_formal_parameter, DW_AT_name("numBytes")
     213                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_numBytes")
     214                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 15:00:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0401610                              PAGE    5

     215                      .dwattr $C$DW$21, DW_AT_location[DW_OP_reg0]
     216              
     217              ;***************************************************************
     218              ;* FNAME: _FEM_init                     FR SIZE:   0           *
     219              ;*                                                             *
     220              ;* FUNCTION ENVIRONMENT                                        *
     221              ;*                                                             *
     222              ;* FUNCTION PROPERTIES                                         *
     223              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     224              ;***************************************************************
     225              
     226              _FEM_init:
     227              ;* AR6   assigned to _numBytes
     228              $C$DW$22        .dwtag  DW_TAG_variable, DW_AT_name("numBytes")
     229                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_numBytes")
     230                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$27)
     231                      .dwattr $C$DW$22, DW_AT_location[DW_OP_reg16]
     232              ;* AR4   assigned to _pMemory
     233              $C$DW$23        .dwtag  DW_TAG_variable, DW_AT_name("pMemory")
     234                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_pMemory")
     235                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$31)
     236                      .dwattr $C$DW$23, DW_AT_location[DW_OP_reg12]
     237                      .dwcfi  cfa_offset, -2
     238                      .dwcfi  save_reg_to_mem, 26, 0
     239                      .dwcfi  save_reg_to_reg, 78, 26
     240 00000032 1EA6          MOVL      XAR6,ACC              ; [CPU_] |22| 
     241                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_18/sw/modules/fem/src/32b/fem.c",line 26,column 5,is_
     242 00000033 0212          MOVB      ACC,#18               ; [CPU_] |26| 
     243 00000034 0FA6          CMPL      ACC,XAR6              ; [CPU_] |26| 
     244 00000035 6902          B         $C$L1,LOS             ; [CPU_] |26| 
     245                      ; branchcc occurs ; [] |26| 
     246 00000036 D400          MOVB      XAR4,#0               ; [CPU_] |26| 
     247              $C$L1:    
     248              $C$DW$24        .dwtag  DW_TAG_TI_branch
     249                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
     250                      .dwattr $C$DW$24, DW_AT_TI_return
     251 00000037 0006          LRETR     ; [CPU_] 
     252                      ; return occurs ; [] 
     253                      .dwattr $C$DW$19, DW_AT_TI_end_file("C:/ti/motorware/motorware_1_01_00_18/sw/modules/fem/src/32b/fem.
     254                      .dwattr $C$DW$19, DW_AT_TI_end_line(0x20)
     255                      .dwattr $C$DW$19, DW_AT_TI_end_column(0x01)
     256                      .dwendentry
     257                      .dwendtag $C$DW$19
     258              
     259              ;**************************************************************
     260              ;* UNDEFINED EXTERNAL REFERENCES                              *
     261              ;**************************************************************
     262                      .global FS$$SUB
     263                      .global FS$$DIV
     264                      .global FS$$TOUL
     265                      .global FS$$ADD
     266              
     267              ;***************************************************************
     268              ;* TYPE INFORMATION                                            *
     269              ;***************************************************************
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 15:00:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0401610                              PAGE    6

     270              
     271              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     272                      .dwattr $C$DW$T$21, DW_AT_name("_FEM_Obj_")
     273                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x12)
     274              $C$DW$25        .dwtag  DW_TAG_member
     275                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     276                      .dwattr $C$DW$25, DW_AT_name("timerPeriod_cnts")
     277                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_timerPeriod_cnts")
     278                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     279                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     280              $C$DW$26        .dwtag  DW_TAG_member
     281                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     282                      .dwattr $C$DW$26, DW_AT_name("cnt_z0")
     283                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_cnt_z0")
     284                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     285                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     286              $C$DW$27        .dwtag  DW_TAG_member
     287                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     288                      .dwattr $C$DW$27, DW_AT_name("cnt_z1")
     289                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_cnt_z1")
     290                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     291                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     292              $C$DW$28        .dwtag  DW_TAG_member
     293                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     294                      .dwattr $C$DW$28, DW_AT_name("deltaCnt")
     295                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_deltaCnt")
     296                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     297                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     298              $C$DW$29        .dwtag  DW_TAG_member
     299                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     300                      .dwattr $C$DW$29, DW_AT_name("maxDeltaCnt")
     301                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_maxDeltaCnt")
     302                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     303                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     304              $C$DW$30        .dwtag  DW_TAG_member
     305                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     306                      .dwattr $C$DW$30, DW_AT_name("minDeltaCnt")
     307                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_minDeltaCnt")
     308                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     309                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     310              $C$DW$31        .dwtag  DW_TAG_member
     311                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     312                      .dwattr $C$DW$31, DW_AT_name("maxDeltaCntObserved")
     313                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
     314                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     315                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     316              $C$DW$32        .dwtag  DW_TAG_member
     317                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     318                      .dwattr $C$DW$32, DW_AT_name("errorCnt")
     319                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_errorCnt")
     320                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     321                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     322              $C$DW$33        .dwtag  DW_TAG_member
     323                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
     324                      .dwattr $C$DW$33, DW_AT_name("flag_freqError")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 15:00:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0401610                              PAGE    7

     325                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_flag_freqError")
     326                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     327                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     328                      .dwendtag $C$DW$T$21
     329              
     330              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("FEM_Obj")
     331                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     332                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     333              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
     334                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
     335                      .dwattr $C$DW$T$23, DW_AT_address_class(0x16)
     336              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("FEM_Handle")
     337                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     338                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     339              $C$DW$34        .dwtag  DW_TAG_TI_far_type
     340                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$24)
     341              $C$DW$T$25      .dwtag  DW_TAG_const_type
     342                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$34)
     343              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     344                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
     345              $C$DW$35        .dwtag  DW_TAG_TI_far_type
     346                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$3)
     347              $C$DW$T$31      .dwtag  DW_TAG_const_type
     348                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$35)
     349              $C$DW$T$4       .dwtag  DW_TAG_base_type
     350                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     351                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     352                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     353              $C$DW$T$5       .dwtag  DW_TAG_base_type
     354                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     355                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     356                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     357              $C$DW$T$6       .dwtag  DW_TAG_base_type
     358                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     359                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     360                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     361              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
     362                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
     363                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     364              $C$DW$T$7       .dwtag  DW_TAG_base_type
     365                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     366                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     367                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     368              $C$DW$T$8       .dwtag  DW_TAG_base_type
     369                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     370                      .dwattr $C$DW$T$8, DW_AT_name("short")
     371                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     372              $C$DW$T$9       .dwtag  DW_TAG_base_type
     373                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     374                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     375                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     376              $C$DW$T$10      .dwtag  DW_TAG_base_type
     377                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     378                      .dwattr $C$DW$T$10, DW_AT_name("int")
     379                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 15:00:39 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
