TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 20:41:14 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4198              $C$DW$T$184     .dwtag  DW_TAG_enumeration_type
    4199                      .dwattr $C$DW$T$184, DW_AT_byte_size(0x01)
    4200              $C$DW$589       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    4201              $C$DW$590       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    4202              $C$DW$591       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    4203              $C$DW$592       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    4204              $C$DW$593       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    4205              $C$DW$594       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    4206              $C$DW$595       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    4207              $C$DW$596       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    4208              $C$DW$597       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    4209              $C$DW$598       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    4210              $C$DW$599       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    4211              $C$DW$600       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    4212                      .dwendtag $C$DW$T$184
    4213              
    4214              $C$DW$T$185     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    4215                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    4216                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    4217              
    4218              $C$DW$T$187     .dwtag  DW_TAG_enumeration_type
    4219                      .dwattr $C$DW$T$187, DW_AT_byte_size(0x01)
    4220              $C$DW$601       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    4221              $C$DW$602       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    4222              $C$DW$603       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    4223                      .dwendtag $C$DW$T$187
    4224              
    4225              $C$DW$T$188     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    4226                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
    4227                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   84

    4228              
    4229              $C$DW$T$190     .dwtag  DW_TAG_enumeration_type
    4230                      .dwattr $C$DW$T$190, DW_AT_byte_size(0x01)
    4231              $C$DW$604       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    4232              $C$DW$605       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    4233                      .dwendtag $C$DW$T$190
    4234              
    4235              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    4236                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$190)
    4237                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    4238              
    4239              $C$DW$T$193     .dwtag  DW_TAG_enumeration_type
    4240                      .dwattr $C$DW$T$193, DW_AT_byte_size(0x01)
    4241              $C$DW$606       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_1"), DW_AT_const_value(0x00)
    4242              $C$DW$607       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_2"), DW_AT_const_value(0x01)
    4243              $C$DW$608       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_3"), DW_AT_const_value(0x02)
    4244              $C$DW$609       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_4"), DW_AT_const_value(0x03)
    4245                      .dwendtag $C$DW$T$193
    4246              
    4247              $C$DW$T$194     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Number_e")
    4248                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$193)
    4249                      .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    4250              
    4251              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4252                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    4253                      .dwattr $C$DW$T$19, DW_AT_declaration
    4254                      .dwendtag $C$DW$T$19
    4255              
    4256              $C$DW$T$114     .dwtag  DW_TAG_pointer_type
    4257                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$19)
    4258                      .dwattr $C$DW$T$114, DW_AT_address_class(0x16)
    4259              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    4260                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    4261                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    4262              
    4263              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4264                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    4265                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    4266              $C$DW$610       .dwtag  DW_TAG_member
    4267                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$25)
    4268                      .dwattr $C$DW$610, DW_AT_name("ADCRESULT")
    4269                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_ADCRESULT")
    4270                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4271                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4272              $C$DW$611       .dwtag  DW_TAG_member
    4273                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$26)
    4274                      .dwattr $C$DW$611, DW_AT_name("resvd_1")
    4275                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_resvd_1")
    4276                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4277                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4278              $C$DW$612       .dwtag  DW_TAG_member
    4279                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$24)
    4280                      .dwattr $C$DW$612, DW_AT_name("ADCCTL1")
    4281                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_ADCCTL1")
    4282                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   85

    4283                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4284              $C$DW$613       .dwtag  DW_TAG_member
    4285                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$24)
    4286                      .dwattr $C$DW$613, DW_AT_name("ADCCTL2")
    4287                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_ADCCTL2")
    4288                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4289                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4290              $C$DW$614       .dwtag  DW_TAG_member
    4291                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$27)
    4292                      .dwattr $C$DW$614, DW_AT_name("rsvd_2")
    4293                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_rsvd_2")
    4294                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4295                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4296              $C$DW$615       .dwtag  DW_TAG_member
    4297                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$24)
    4298                      .dwattr $C$DW$615, DW_AT_name("ADCINTFLG")
    4299                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_ADCINTFLG")
    4300                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4301                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4302              $C$DW$616       .dwtag  DW_TAG_member
    4303                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$24)
    4304                      .dwattr $C$DW$616, DW_AT_name("ADCINTFLGCLR")
    4305                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4306                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4307                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4308              $C$DW$617       .dwtag  DW_TAG_member
    4309                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$24)
    4310                      .dwattr $C$DW$617, DW_AT_name("ADCINTOVF")
    4311                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_ADCINTOVF")
    4312                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4313                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4314              $C$DW$618       .dwtag  DW_TAG_member
    4315                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$24)
    4316                      .dwattr $C$DW$618, DW_AT_name("ADCINTOVFCLR")
    4317                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4318                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4319                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4320              $C$DW$619       .dwtag  DW_TAG_member
    4321                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$28)
    4322                      .dwattr $C$DW$619, DW_AT_name("INTSELxNy")
    4323                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_INTSELxNy")
    4324                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4325                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4326              $C$DW$620       .dwtag  DW_TAG_member
    4327                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$29)
    4328                      .dwattr $C$DW$620, DW_AT_name("rsvd_3")
    4329                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_rsvd_3")
    4330                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4331                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4332              $C$DW$621       .dwtag  DW_TAG_member
    4333                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$24)
    4334                      .dwattr $C$DW$621, DW_AT_name("SOCPRICTRL")
    4335                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4336                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4337                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   86

    4338              $C$DW$622       .dwtag  DW_TAG_member
    4339                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$24)
    4340                      .dwattr $C$DW$622, DW_AT_name("rsvd_4")
    4341                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_rsvd_4")
    4342                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4343                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4344              $C$DW$623       .dwtag  DW_TAG_member
    4345                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$24)
    4346                      .dwattr $C$DW$623, DW_AT_name("ADCSAMPLEMODE")
    4347                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4348                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4349                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4350              $C$DW$624       .dwtag  DW_TAG_member
    4351                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$24)
    4352                      .dwattr $C$DW$624, DW_AT_name("rsvd_5")
    4353                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_rsvd_5")
    4354                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4355                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4356              $C$DW$625       .dwtag  DW_TAG_member
    4357                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$24)
    4358                      .dwattr $C$DW$625, DW_AT_name("ADCINTSOCSEL1")
    4359                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4360                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4361                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4362              $C$DW$626       .dwtag  DW_TAG_member
    4363                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$24)
    4364                      .dwattr $C$DW$626, DW_AT_name("ADCINTSOCSEL2")
    4365                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4366                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4367                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4368              $C$DW$627       .dwtag  DW_TAG_member
    4369                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$27)
    4370                      .dwattr $C$DW$627, DW_AT_name("rsvd_6")
    4371                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_rsvd_6")
    4372                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4373                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4374              $C$DW$628       .dwtag  DW_TAG_member
    4375                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$24)
    4376                      .dwattr $C$DW$628, DW_AT_name("ADCSOCFLG1")
    4377                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4378                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4379                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4380              $C$DW$629       .dwtag  DW_TAG_member
    4381                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$24)
    4382                      .dwattr $C$DW$629, DW_AT_name("rsvd_7")
    4383                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_rsvd_7")
    4384                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4385                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4386              $C$DW$630       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$24)
    4388                      .dwattr $C$DW$630, DW_AT_name("ADCSOCFRC1")
    4389                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4390                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4391                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4392              $C$DW$631       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   87

    4393                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$24)
    4394                      .dwattr $C$DW$631, DW_AT_name("rsvd_8")
    4395                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_rsvd_8")
    4396                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4397                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4398              $C$DW$632       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$24)
    4400                      .dwattr $C$DW$632, DW_AT_name("ADCSOCOVF1")
    4401                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4402                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4403                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4404              $C$DW$633       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$24)
    4406                      .dwattr $C$DW$633, DW_AT_name("rsvd_9")
    4407                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_rsvd_9")
    4408                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4409                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4410              $C$DW$634       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$24)
    4412                      .dwattr $C$DW$634, DW_AT_name("ADCSOCOVFCLR1")
    4413                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4414                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4415                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4416              $C$DW$635       .dwtag  DW_TAG_member
    4417                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$24)
    4418                      .dwattr $C$DW$635, DW_AT_name("rsvd_10")
    4419                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_rsvd_10")
    4420                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4421                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4422              $C$DW$636       .dwtag  DW_TAG_member
    4423                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$25)
    4424                      .dwattr $C$DW$636, DW_AT_name("ADCSOCxCTL")
    4425                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4426                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4427                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4428              $C$DW$637       .dwtag  DW_TAG_member
    4429                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$25)
    4430                      .dwattr $C$DW$637, DW_AT_name("rsvd_11")
    4431                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_rsvd_11")
    4432                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4433                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4434              $C$DW$638       .dwtag  DW_TAG_member
    4435                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$24)
    4436                      .dwattr $C$DW$638, DW_AT_name("ADCREFTRIM")
    4437                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4438                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4439                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4440              $C$DW$639       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$24)
    4442                      .dwattr $C$DW$639, DW_AT_name("ADCOFFTRIM")
    4443                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4444                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4445                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4446              $C$DW$640       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   88

    4448                      .dwattr $C$DW$640, DW_AT_name("resvd_12")
    4449                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_resvd_12")
    4450                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4451                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4452              $C$DW$641       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$24)
    4454                      .dwattr $C$DW$641, DW_AT_name("ADCREV")
    4455                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_ADCREV")
    4456                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4457                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4458                      .dwendtag $C$DW$T$31
    4459              
    4460              $C$DW$T$196     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    4461                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$31)
    4462                      .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    4463              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    4464                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$31)
    4465                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    4466              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4467                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    4468                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    4469              
    4470              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4471                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    4472                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    4473              $C$DW$642       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$32)
    4475                      .dwattr $C$DW$642, DW_AT_name("alpha_sf")
    4476                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_alpha_sf")
    4477                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4478                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4479              $C$DW$643       .dwtag  DW_TAG_member
    4480                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$32)
    4481                      .dwattr $C$DW$643, DW_AT_name("beta_sf")
    4482                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_beta_sf")
    4483                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4484                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4485              $C$DW$644       .dwtag  DW_TAG_member
    4486                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$33)
    4487                      .dwattr $C$DW$644, DW_AT_name("numSensors")
    4488                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_numSensors")
    4489                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4490                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4491                      .dwendtag $C$DW$T$34
    4492              
    4493              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    4494                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$34)
    4495                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4496              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4497                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$34)
    4498                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    4499              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    4500                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4501                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4502              
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   89

    4503              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4504                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    4505                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    4506              $C$DW$645       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$24)
    4508                      .dwattr $C$DW$645, DW_AT_name("XCLK")
    4509                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_XCLK")
    4510                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4511                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4512              $C$DW$646       .dwtag  DW_TAG_member
    4513                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$24)
    4514                      .dwattr $C$DW$646, DW_AT_name("rsvd_1")
    4515                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_rsvd_1")
    4516                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4517                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4518              $C$DW$647       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$24)
    4520                      .dwattr $C$DW$647, DW_AT_name("CLKCTL")
    4521                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_CLKCTL")
    4522                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4523                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4524              $C$DW$648       .dwtag  DW_TAG_member
    4525                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$35)
    4526                      .dwattr $C$DW$648, DW_AT_name("rsvd_2")
    4527                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_rsvd_2")
    4528                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4529                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4530              $C$DW$649       .dwtag  DW_TAG_member
    4531                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$24)
    4532                      .dwattr $C$DW$649, DW_AT_name("LOSPCP")
    4533                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_LOSPCP")
    4534                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4535                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4536              $C$DW$650       .dwtag  DW_TAG_member
    4537                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$24)
    4538                      .dwattr $C$DW$650, DW_AT_name("PCLKCR0")
    4539                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_PCLKCR0")
    4540                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4541                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4542              $C$DW$651       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$24)
    4544                      .dwattr $C$DW$651, DW_AT_name("PCLKCR1")
    4545                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_PCLKCR1")
    4546                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4547                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4548              $C$DW$652       .dwtag  DW_TAG_member
    4549                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$27)
    4550                      .dwattr $C$DW$652, DW_AT_name("rsvd_3")
    4551                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_rsvd_3")
    4552                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4553                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4554              $C$DW$653       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$24)
    4556                      .dwattr $C$DW$653, DW_AT_name("PCLKCR3")
    4557                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_PCLKCR3")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   90

    4558                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4559                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4560                      .dwendtag $C$DW$T$36
    4561              
    4562              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    4563                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$36)
    4564                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    4565              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4566                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    4567                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    4568              
    4569              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4570                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    4571                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4572              $C$DW$654       .dwtag  DW_TAG_member
    4573                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$33)
    4574                      .dwattr $C$DW$654, DW_AT_name("tmp")
    4575                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_tmp")
    4576                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4577                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4578                      .dwendtag $C$DW$T$37
    4579              
    4580              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    4581                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$37)
    4582                      .dwattr $C$DW$T$89, DW_AT_address_class(0x16)
    4583              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4584                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    4585                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    4586              
    4587              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4588                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_USAGE_Obj_")
    4589                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x16)
    4590              $C$DW$655       .dwtag  DW_TAG_member
    4591                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$38)
    4592                      .dwattr $C$DW$655, DW_AT_name("timerPeriod_cnts")
    4593                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    4594                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4595                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4596              $C$DW$656       .dwtag  DW_TAG_member
    4597                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$38)
    4598                      .dwattr $C$DW$656, DW_AT_name("cnt_z0")
    4599                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_cnt_z0")
    4600                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4601                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4602              $C$DW$657       .dwtag  DW_TAG_member
    4603                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$38)
    4604                      .dwattr $C$DW$657, DW_AT_name("cnt_z1")
    4605                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_cnt_z1")
    4606                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4607                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4608              $C$DW$658       .dwtag  DW_TAG_member
    4609                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$38)
    4610                      .dwattr $C$DW$658, DW_AT_name("deltaCnt")
    4611                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_deltaCnt")
    4612                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   91

    4613                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4614              $C$DW$659       .dwtag  DW_TAG_member
    4615                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$38)
    4616                      .dwattr $C$DW$659, DW_AT_name("deltaCntAcc")
    4617                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_deltaCntAcc")
    4618                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4619                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4620              $C$DW$660       .dwtag  DW_TAG_member
    4621                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$38)
    4622                      .dwattr $C$DW$660, DW_AT_name("deltaCntAccNum")
    4623                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_deltaCntAccNum")
    4624                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4625                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4626              $C$DW$661       .dwtag  DW_TAG_member
    4627                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$38)
    4628                      .dwattr $C$DW$661, DW_AT_name("deltaCntAccNumMax")
    4629                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
    4630                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4631                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4632              $C$DW$662       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$38)
    4634                      .dwattr $C$DW$662, DW_AT_name("minDeltaCntObserved")
    4635                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_minDeltaCntObserved")
    4636                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4637                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4638              $C$DW$663       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$38)
    4640                      .dwattr $C$DW$663, DW_AT_name("avgDeltaCntObserved")
    4641                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
    4642                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4643                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4644              $C$DW$664       .dwtag  DW_TAG_member
    4645                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$38)
    4646                      .dwattr $C$DW$664, DW_AT_name("maxDeltaCntObserved")
    4647                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
    4648                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4649                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4650              $C$DW$665       .dwtag  DW_TAG_member
    4651                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$39)
    4652                      .dwattr $C$DW$665, DW_AT_name("flag_resetStats")
    4653                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_flag_resetStats")
    4654                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4655                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4656                      .dwendtag $C$DW$T$40
    4657              
    4658              $C$DW$T$197     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Obj")
    4659                      .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$40)
    4660                      .dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
    4661              $C$DW$T$198     .dwtag  DW_TAG_pointer_type
    4662                      .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$40)
    4663                      .dwattr $C$DW$T$198, DW_AT_address_class(0x16)
    4664              $C$DW$T$199     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Handle")
    4665                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$198)
    4666                      .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    4667              
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   92

    4668              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    4669                      .dwattr $C$DW$T$72, DW_AT_name("_CTRL_Obj_")
    4670                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x108)
    4671              $C$DW$666       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$41)
    4673                      .dwattr $C$DW$666, DW_AT_name("version")
    4674                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_version")
    4675                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4676                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4677              $C$DW$667       .dwtag  DW_TAG_member
    4678                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$43)
    4679                      .dwattr $C$DW$667, DW_AT_name("state")
    4680                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_state")
    4681                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4682                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4683              $C$DW$668       .dwtag  DW_TAG_member
    4684                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$43)
    4685                      .dwattr $C$DW$668, DW_AT_name("prevState")
    4686                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_prevState")
    4687                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4688                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4689              $C$DW$669       .dwtag  DW_TAG_member
    4690                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$45)
    4691                      .dwattr $C$DW$669, DW_AT_name("errorCode")
    4692                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_errorCode")
    4693                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4694                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4695              $C$DW$670       .dwtag  DW_TAG_member
    4696                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$47)
    4697                      .dwattr $C$DW$670, DW_AT_name("clarkeHandle_I")
    4698                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4699                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4700                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4701              $C$DW$671       .dwtag  DW_TAG_member
    4702                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$48)
    4703                      .dwattr $C$DW$671, DW_AT_name("clarke_I")
    4704                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_clarke_I")
    4705                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4706                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4707              $C$DW$672       .dwtag  DW_TAG_member
    4708                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$47)
    4709                      .dwattr $C$DW$672, DW_AT_name("clarkeHandle_V")
    4710                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4711                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4712                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4713              $C$DW$673       .dwtag  DW_TAG_member
    4714                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$48)
    4715                      .dwattr $C$DW$673, DW_AT_name("clarke_V")
    4716                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_clarke_V")
    4717                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4718                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4719              $C$DW$674       .dwtag  DW_TAG_member
    4720                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$50)
    4721                      .dwattr $C$DW$674, DW_AT_name("estHandle")
    4722                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_estHandle")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   93

    4723                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4724                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4725              $C$DW$675       .dwtag  DW_TAG_member
    4726                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$52)
    4727                      .dwattr $C$DW$675, DW_AT_name("parkHandle")
    4728                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_parkHandle")
    4729                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4730                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4731              $C$DW$676       .dwtag  DW_TAG_member
    4732                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$53)
    4733                      .dwattr $C$DW$676, DW_AT_name("park")
    4734                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_park")
    4735                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4736                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4737              $C$DW$677       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$55)
    4739                      .dwattr $C$DW$677, DW_AT_name("pidHandle_Id")
    4740                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_pidHandle_Id")
    4741                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4742                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4743              $C$DW$678       .dwtag  DW_TAG_member
    4744                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$56)
    4745                      .dwattr $C$DW$678, DW_AT_name("pid_Id")
    4746                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_pid_Id")
    4747                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4748                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4749              $C$DW$679       .dwtag  DW_TAG_member
    4750                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$55)
    4751                      .dwattr $C$DW$679, DW_AT_name("pidHandle_Iq")
    4752                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4753                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4754                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4755              $C$DW$680       .dwtag  DW_TAG_member
    4756                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$56)
    4757                      .dwattr $C$DW$680, DW_AT_name("pid_Iq")
    4758                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_pid_Iq")
    4759                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4760                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4761              $C$DW$681       .dwtag  DW_TAG_member
    4762                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$55)
    4763                      .dwattr $C$DW$681, DW_AT_name("pidHandle_spd")
    4764                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_pidHandle_spd")
    4765                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4766                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4767              $C$DW$682       .dwtag  DW_TAG_member
    4768                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$56)
    4769                      .dwattr $C$DW$682, DW_AT_name("pid_spd")
    4770                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_pid_spd")
    4771                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4772                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4773              $C$DW$683       .dwtag  DW_TAG_member
    4774                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$58)
    4775                      .dwattr $C$DW$683, DW_AT_name("iparkHandle")
    4776                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_iparkHandle")
    4777                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   94

    4778                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4779              $C$DW$684       .dwtag  DW_TAG_member
    4780                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$59)
    4781                      .dwattr $C$DW$684, DW_AT_name("ipark")
    4782                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ipark")
    4783                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4784                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4785              $C$DW$685       .dwtag  DW_TAG_member
    4786                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$61)
    4787                      .dwattr $C$DW$685, DW_AT_name("svgenHandle")
    4788                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_svgenHandle")
    4789                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4790                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4791              $C$DW$686       .dwtag  DW_TAG_member
    4792                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$62)
    4793                      .dwattr $C$DW$686, DW_AT_name("svgen")
    4794                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_svgen")
    4795                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4796                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4797              $C$DW$687       .dwtag  DW_TAG_member
    4798                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$64)
    4799                      .dwattr $C$DW$687, DW_AT_name("trajHandle_Id")
    4800                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_trajHandle_Id")
    4801                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4802                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4803              $C$DW$688       .dwtag  DW_TAG_member
    4804                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$65)
    4805                      .dwattr $C$DW$688, DW_AT_name("traj_Id")
    4806                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_traj_Id")
    4807                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4808                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4809              $C$DW$689       .dwtag  DW_TAG_member
    4810                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$64)
    4811                      .dwattr $C$DW$689, DW_AT_name("trajHandle_spd")
    4812                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_trajHandle_spd")
    4813                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4814                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4815              $C$DW$690       .dwtag  DW_TAG_member
    4816                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$65)
    4817                      .dwattr $C$DW$690, DW_AT_name("traj_spd")
    4818                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_traj_spd")
    4819                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4820                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4821              $C$DW$691       .dwtag  DW_TAG_member
    4822                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$64)
    4823                      .dwattr $C$DW$691, DW_AT_name("trajHandle_spdMax")
    4824                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4825                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4826                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4827              $C$DW$692       .dwtag  DW_TAG_member
    4828                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$65)
    4829                      .dwattr $C$DW$692, DW_AT_name("traj_spdMax")
    4830                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_traj_spdMax")
    4831                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4832                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   95

    4833              $C$DW$693       .dwtag  DW_TAG_member
    4834                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$66)
    4835                      .dwattr $C$DW$693, DW_AT_name("motorParams")
    4836                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_motorParams")
    4837                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4838                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4839              $C$DW$694       .dwtag  DW_TAG_member
    4840                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$68)
    4841                      .dwattr $C$DW$694, DW_AT_name("waitTimes")
    4842                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_waitTimes")
    4843                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4844                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4845              $C$DW$695       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$67)
    4847                      .dwattr $C$DW$695, DW_AT_name("counter_state")
    4848                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_counter_state")
    4849                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4850                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4851              $C$DW$696       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$69)
    4853                      .dwattr $C$DW$696, DW_AT_name("numIsrTicksPerCtrlTick")
    4854                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4855                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4856                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4857              $C$DW$697       .dwtag  DW_TAG_member
    4858                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$69)
    4859                      .dwattr $C$DW$697, DW_AT_name("numCtrlTicksPerCurrentTick")
    4860                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4861                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4862                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4863              $C$DW$698       .dwtag  DW_TAG_member
    4864                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$69)
    4865                      .dwattr $C$DW$698, DW_AT_name("numCtrlTicksPerSpeedTick")
    4866                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4867                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4868                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4869              $C$DW$699       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$69)
    4871                      .dwattr $C$DW$699, DW_AT_name("numCtrlTicksPerTrajTick")
    4872                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4873                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4874                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4875              $C$DW$700       .dwtag  DW_TAG_member
    4876                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$67)
    4877                      .dwattr $C$DW$700, DW_AT_name("ctrlFreq_Hz")
    4878                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4879                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4880                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4881              $C$DW$701       .dwtag  DW_TAG_member
    4882                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$67)
    4883                      .dwattr $C$DW$701, DW_AT_name("trajFreq_Hz")
    4884                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4885                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4886                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4887              $C$DW$702       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   96

    4888                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$32)
    4889                      .dwattr $C$DW$702, DW_AT_name("trajPeriod_sec")
    4890                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4891                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4892                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4893              $C$DW$703       .dwtag  DW_TAG_member
    4894                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$70)
    4895                      .dwattr $C$DW$703, DW_AT_name("ctrlPeriod_sec")
    4896                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4897                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4898                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4899              $C$DW$704       .dwtag  DW_TAG_member
    4900                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$32)
    4901                      .dwattr $C$DW$704, DW_AT_name("maxVsMag_pu")
    4902                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4903                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4904                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4905              $C$DW$705       .dwtag  DW_TAG_member
    4906                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$71)
    4907                      .dwattr $C$DW$705, DW_AT_name("Iab_in")
    4908                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_Iab_in")
    4909                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4910                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4911              $C$DW$706       .dwtag  DW_TAG_member
    4912                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$71)
    4913                      .dwattr $C$DW$706, DW_AT_name("Iab_filt")
    4914                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_Iab_filt")
    4915                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4916                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4917              $C$DW$707       .dwtag  DW_TAG_member
    4918                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$71)
    4919                      .dwattr $C$DW$707, DW_AT_name("Idq_in")
    4920                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_Idq_in")
    4921                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4922                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4923              $C$DW$708       .dwtag  DW_TAG_member
    4924                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$71)
    4925                      .dwattr $C$DW$708, DW_AT_name("Vab_in")
    4926                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_Vab_in")
    4927                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4928                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4929              $C$DW$709       .dwtag  DW_TAG_member
    4930                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$32)
    4931                      .dwattr $C$DW$709, DW_AT_name("spd_out")
    4932                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_spd_out")
    4933                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4934                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4935              $C$DW$710       .dwtag  DW_TAG_member
    4936                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$71)
    4937                      .dwattr $C$DW$710, DW_AT_name("Vab_out")
    4938                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_Vab_out")
    4939                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4940                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4941              $C$DW$711       .dwtag  DW_TAG_member
    4942                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$71)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   97

    4943                      .dwattr $C$DW$711, DW_AT_name("Vdq_out")
    4944                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_Vdq_out")
    4945                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4946                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4947              $C$DW$712       .dwtag  DW_TAG_member
    4948                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$70)
    4949                      .dwattr $C$DW$712, DW_AT_name("Rhf")
    4950                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_Rhf")
    4951                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4952                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4953              $C$DW$713       .dwtag  DW_TAG_member
    4954                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$70)
    4955                      .dwattr $C$DW$713, DW_AT_name("Lhf")
    4956                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_Lhf")
    4957                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4958                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4959              $C$DW$714       .dwtag  DW_TAG_member
    4960                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$70)
    4961                      .dwattr $C$DW$714, DW_AT_name("RoverL")
    4962                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_RoverL")
    4963                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4964                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    4965              $C$DW$715       .dwtag  DW_TAG_member
    4966                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$32)
    4967                      .dwattr $C$DW$715, DW_AT_name("Kp_Id")
    4968                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_Kp_Id")
    4969                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4970                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    4971              $C$DW$716       .dwtag  DW_TAG_member
    4972                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$32)
    4973                      .dwattr $C$DW$716, DW_AT_name("Kp_Iq")
    4974                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_Kp_Iq")
    4975                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4976                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    4977              $C$DW$717       .dwtag  DW_TAG_member
    4978                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$32)
    4979                      .dwattr $C$DW$717, DW_AT_name("Kp_spd")
    4980                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_Kp_spd")
    4981                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4982                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    4983              $C$DW$718       .dwtag  DW_TAG_member
    4984                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$32)
    4985                      .dwattr $C$DW$718, DW_AT_name("Ki_Id")
    4986                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_Ki_Id")
    4987                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4988                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    4989              $C$DW$719       .dwtag  DW_TAG_member
    4990                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$32)
    4991                      .dwattr $C$DW$719, DW_AT_name("Ki_Iq")
    4992                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_Ki_Iq")
    4993                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4994                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    4995              $C$DW$720       .dwtag  DW_TAG_member
    4996                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$32)
    4997                      .dwattr $C$DW$720, DW_AT_name("Ki_spd")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   98

    4998                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_Ki_spd")
    4999                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    5000                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    5001              $C$DW$721       .dwtag  DW_TAG_member
    5002                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$32)
    5003                      .dwattr $C$DW$721, DW_AT_name("Kd_Id")
    5004                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_Kd_Id")
    5005                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    5006                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    5007              $C$DW$722       .dwtag  DW_TAG_member
    5008                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$32)
    5009                      .dwattr $C$DW$722, DW_AT_name("Kd_Iq")
    5010                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_Kd_Iq")
    5011                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    5012                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    5013              $C$DW$723       .dwtag  DW_TAG_member
    5014                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$32)
    5015                      .dwattr $C$DW$723, DW_AT_name("Kd_spd")
    5016                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_Kd_spd")
    5017                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    5018                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    5019              $C$DW$724       .dwtag  DW_TAG_member
    5020                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$32)
    5021                      .dwattr $C$DW$724, DW_AT_name("Ui_Id")
    5022                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_Ui_Id")
    5023                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    5024                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    5025              $C$DW$725       .dwtag  DW_TAG_member
    5026                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$32)
    5027                      .dwattr $C$DW$725, DW_AT_name("Ui_Iq")
    5028                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_Ui_Iq")
    5029                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    5030                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    5031              $C$DW$726       .dwtag  DW_TAG_member
    5032                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$32)
    5033                      .dwattr $C$DW$726, DW_AT_name("Ui_spd")
    5034                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_Ui_spd")
    5035                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    5036                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    5037              $C$DW$727       .dwtag  DW_TAG_member
    5038                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$71)
    5039                      .dwattr $C$DW$727, DW_AT_name("Idq_ref")
    5040                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_Idq_ref")
    5041                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    5042                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    5043              $C$DW$728       .dwtag  DW_TAG_member
    5044                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$32)
    5045                      .dwattr $C$DW$728, DW_AT_name("IdRated")
    5046                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_IdRated")
    5047                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    5048                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    5049              $C$DW$729       .dwtag  DW_TAG_member
    5050                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$32)
    5051                      .dwattr $C$DW$729, DW_AT_name("spd_ref")
    5052                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_spd_ref")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE   99

    5053                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    5054                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5055              $C$DW$730       .dwtag  DW_TAG_member
    5056                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$32)
    5057                      .dwattr $C$DW$730, DW_AT_name("spd_max")
    5058                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_spd_max")
    5059                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    5060                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5061              $C$DW$731       .dwtag  DW_TAG_member
    5062                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$69)
    5063                      .dwattr $C$DW$731, DW_AT_name("counter_current")
    5064                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_counter_current")
    5065                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    5066                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    5067              $C$DW$732       .dwtag  DW_TAG_member
    5068                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$69)
    5069                      .dwattr $C$DW$732, DW_AT_name("counter_isr")
    5070                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_counter_isr")
    5071                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    5072                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    5073              $C$DW$733       .dwtag  DW_TAG_member
    5074                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$69)
    5075                      .dwattr $C$DW$733, DW_AT_name("counter_speed")
    5076                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_counter_speed")
    5077                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    5078                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    5079              $C$DW$734       .dwtag  DW_TAG_member
    5080                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$69)
    5081                      .dwattr $C$DW$734, DW_AT_name("counter_traj")
    5082                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_counter_traj")
    5083                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    5084                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    5085              $C$DW$735       .dwtag  DW_TAG_member
    5086                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$39)
    5087                      .dwattr $C$DW$735, DW_AT_name("flag_enableCtrl")
    5088                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_flag_enableCtrl")
    5089                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    5090                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    5091              $C$DW$736       .dwtag  DW_TAG_member
    5092                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$39)
    5093                      .dwattr $C$DW$736, DW_AT_name("flag_enableDcBusComp")
    5094                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    5095                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    5096                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    5097              $C$DW$737       .dwtag  DW_TAG_member
    5098                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$39)
    5099                      .dwattr $C$DW$737, DW_AT_name("flag_enablePowerWarp")
    5100                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    5101                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    5102                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    5103              $C$DW$738       .dwtag  DW_TAG_member
    5104                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$39)
    5105                      .dwattr $C$DW$738, DW_AT_name("flag_enableOffset")
    5106                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_flag_enableOffset")
    5107                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE  100

    5108                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    5109              $C$DW$739       .dwtag  DW_TAG_member
    5110                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$39)
    5111                      .dwattr $C$DW$739, DW_AT_name("flag_enableSpeedCtrl")
    5112                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    5113                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    5114                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    5115              $C$DW$740       .dwtag  DW_TAG_member
    5116                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$39)
    5117                      .dwattr $C$DW$740, DW_AT_name("flag_enableUserMotorParams")
    5118                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    5119                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    5120                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    5121              $C$DW$741       .dwtag  DW_TAG_member
    5122                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$71)
    5123                      .dwattr $C$DW$741, DW_AT_name("Idq_offset_pu")
    5124                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_Idq_offset_pu")
    5125                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    5126                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    5127              $C$DW$742       .dwtag  DW_TAG_member
    5128                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$71)
    5129                      .dwattr $C$DW$742, DW_AT_name("Vdq_offset_pu")
    5130                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    5131                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    5132                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    5133              $C$DW$743       .dwtag  DW_TAG_member
    5134                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$32)
    5135                      .dwattr $C$DW$743, DW_AT_name("angle_pu")
    5136                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_angle_pu")
    5137                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    5138                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    5139              $C$DW$744       .dwtag  DW_TAG_member
    5140                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$32)
    5141                      .dwattr $C$DW$744, DW_AT_name("speed_ref_pu")
    5142                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_speed_ref_pu")
    5143                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    5144                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    5145              $C$DW$745       .dwtag  DW_TAG_member
    5146                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$32)
    5147                      .dwattr $C$DW$745, DW_AT_name("speed_fb_pu")
    5148                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_speed_fb_pu")
    5149                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    5150                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    5151              $C$DW$746       .dwtag  DW_TAG_member
    5152                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$32)
    5153                      .dwattr $C$DW$746, DW_AT_name("speed_outMax_pu")
    5154                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_speed_outMax_pu")
    5155                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    5156                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    5157              $C$DW$747       .dwtag  DW_TAG_member
    5158                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$39)
    5159                      .dwattr $C$DW$747, DW_AT_name("flag_enableCurrentCtrl")
    5160                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    5161                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    5162                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE  101

    5163                      .dwendtag $C$DW$T$72
    5164              
    5165              $C$DW$T$205     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    5166                      .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$72)
    5167                      .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    5168              $C$DW$T$206     .dwtag  DW_TAG_pointer_type
    5169                      .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$205)
    5170                      .dwattr $C$DW$T$206, DW_AT_address_class(0x16)
    5171              $C$DW$T$164     .dwtag  DW_TAG_pointer_type
    5172                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$72)
    5173                      .dwattr $C$DW$T$164, DW_AT_address_class(0x16)
    5174              $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    5175                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
    5176                      .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    5177              $C$DW$748       .dwtag  DW_TAG_TI_far_type
    5178                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$165)
    5179              $C$DW$T$207     .dwtag  DW_TAG_const_type
    5180                      .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$748)
    5181              
    5182              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    5183                      .dwattr $C$DW$T$75, DW_AT_name("_CTRL_Version_")
    5184                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x04)
    5185              $C$DW$749       .dwtag  DW_TAG_member
    5186                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$23)
    5187                      .dwattr $C$DW$749, DW_AT_name("rsvd")
    5188                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_rsvd")
    5189                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5190                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    5191              $C$DW$750       .dwtag  DW_TAG_member
    5192                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$74)
    5193                      .dwattr $C$DW$750, DW_AT_name("targetProc")
    5194                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_targetProc")
    5195                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5196                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    5197              $C$DW$751       .dwtag  DW_TAG_member
    5198                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$23)
    5199                      .dwattr $C$DW$751, DW_AT_name("major")
    5200                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_major")
    5201                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5202                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    5203              $C$DW$752       .dwtag  DW_TAG_member
    5204                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$23)
    5205                      .dwattr $C$DW$752, DW_AT_name("minor")
    5206                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_minor")
    5207                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5208                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    5209                      .dwendtag $C$DW$T$75
    5210              
    5211              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    5212                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$75)
    5213                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    5214              $C$DW$T$213     .dwtag  DW_TAG_pointer_type
    5215                      .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$41)
    5216                      .dwattr $C$DW$T$213, DW_AT_address_class(0x16)
    5217              
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE  102

    5218              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5219                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    5220                      .dwattr $C$DW$T$20, DW_AT_declaration
    5221                      .dwendtag $C$DW$T$20
    5222              
    5223              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    5224                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$20)
    5225                      .dwattr $C$DW$T$49, DW_AT_address_class(0x16)
    5226              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    5227                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    5228                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    5229              
    5230              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    5231                      .dwattr $C$DW$T$76, DW_AT_name("_FEM_Obj_")
    5232                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x12)
    5233              $C$DW$753       .dwtag  DW_TAG_member
    5234                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$38)
    5235                      .dwattr $C$DW$753, DW_AT_name("timerPeriod_cnts")
    5236                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    5237                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5238                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    5239              $C$DW$754       .dwtag  DW_TAG_member
    5240                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$38)
    5241                      .dwattr $C$DW$754, DW_AT_name("cnt_z0")
    5242                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_cnt_z0")
    5243                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5244                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    5245              $C$DW$755       .dwtag  DW_TAG_member
    5246                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$38)
    5247                      .dwattr $C$DW$755, DW_AT_name("cnt_z1")
    5248                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_cnt_z1")
    5249                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5250                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    5251              $C$DW$756       .dwtag  DW_TAG_member
    5252                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$38)
    5253                      .dwattr $C$DW$756, DW_AT_name("deltaCnt")
    5254                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_deltaCnt")
    5255                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5256                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    5257              $C$DW$757       .dwtag  DW_TAG_member
    5258                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$38)
    5259                      .dwattr $C$DW$757, DW_AT_name("maxDeltaCnt")
    5260                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_maxDeltaCnt")
    5261                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5262                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    5263              $C$DW$758       .dwtag  DW_TAG_member
    5264                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$38)
    5265                      .dwattr $C$DW$758, DW_AT_name("minDeltaCnt")
    5266                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_minDeltaCnt")
    5267                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5268                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    5269              $C$DW$759       .dwtag  DW_TAG_member
    5270                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$38)
    5271                      .dwattr $C$DW$759, DW_AT_name("maxDeltaCntObserved")
    5272                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE  103

    5273                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5274                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    5275              $C$DW$760       .dwtag  DW_TAG_member
    5276                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$38)
    5277                      .dwattr $C$DW$760, DW_AT_name("errorCnt")
    5278                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_errorCnt")
    5279                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5280                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    5281              $C$DW$761       .dwtag  DW_TAG_member
    5282                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$39)
    5283                      .dwattr $C$DW$761, DW_AT_name("flag_freqError")
    5284                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_flag_freqError")
    5285                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5286                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    5287                      .dwendtag $C$DW$T$76
    5288              
    5289              $C$DW$T$216     .dwtag  DW_TAG_typedef, DW_AT_name("FEM_Obj")
    5290                      .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$76)
    5291                      .dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
    5292              $C$DW$T$217     .dwtag  DW_TAG_pointer_type
    5293                      .dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$76)
    5294                      .dwattr $C$DW$T$217, DW_AT_address_class(0x16)
    5295              $C$DW$T$218     .dwtag  DW_TAG_typedef, DW_AT_name("FEM_Handle")
    5296                      .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$217)
    5297                      .dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
    5298              
    5299              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    5300                      .dwattr $C$DW$T$77, DW_AT_name("_FILTER_FO_")
    5301                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x0a)
    5302              $C$DW$762       .dwtag  DW_TAG_member
    5303                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$32)
    5304                      .dwattr $C$DW$762, DW_AT_name("a1")
    5305                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_a1")
    5306                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5307                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    5308              $C$DW$763       .dwtag  DW_TAG_member
    5309                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$32)
    5310                      .dwattr $C$DW$763, DW_AT_name("b0")
    5311                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_b0")
    5312                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5313                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    5314              $C$DW$764       .dwtag  DW_TAG_member
    5315                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$32)
    5316                      .dwattr $C$DW$764, DW_AT_name("b1")
    5317                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_b1")
    5318                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5319                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    5320              $C$DW$765       .dwtag  DW_TAG_member
    5321                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$32)
    5322                      .dwattr $C$DW$765, DW_AT_name("x1")
    5323                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_x1")
    5324                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5325                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    5326              $C$DW$766       .dwtag  DW_TAG_member
    5327                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE  104

    5328                      .dwattr $C$DW$766, DW_AT_name("y1")
    5329                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_y1")
    5330                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5331                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    5332                      .dwendtag $C$DW$T$77
    5333              
    5334              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    5335                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$77)
    5336                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    5337              
    5338              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    5339                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    5340                      .dwattr $C$DW$T$21, DW_AT_declaration
    5341                      .dwendtag $C$DW$T$21
    5342              
    5343              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    5344                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$21)
    5345                      .dwattr $C$DW$T$135, DW_AT_address_class(0x16)
    5346              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    5347                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
    5348                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    5349              
    5350              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    5351                      .dwattr $C$DW$T$78, DW_AT_name("_FLASH_Obj_")
    5352                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x08)
    5353              $C$DW$767       .dwtag  DW_TAG_member
    5354                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$24)
    5355                      .dwattr $C$DW$767, DW_AT_name("FOPT")
    5356                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_FOPT")
    5357                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5358                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    5359              $C$DW$768       .dwtag  DW_TAG_member
    5360                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$24)
    5361                      .dwattr $C$DW$768, DW_AT_name("rsvd_1")
    5362                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_rsvd_1")
    5363                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5364                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    5365              $C$DW$769       .dwtag  DW_TAG_member
    5366                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$24)
    5367                      .dwattr $C$DW$769, DW_AT_name("FPWR")
    5368                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_FPWR")
    5369                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5370                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    5371              $C$DW$770       .dwtag  DW_TAG_member
    5372                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$24)
    5373                      .dwattr $C$DW$770, DW_AT_name("FSTATUS")
    5374                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_FSTATUS")
    5375                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5376                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    5377              $C$DW$771       .dwtag  DW_TAG_member
    5378                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$24)
    5379                      .dwattr $C$DW$771, DW_AT_name("FSTDBYWAIT")
    5380                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    5381                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5382                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1712410                              PAGE  105

    5383              $C$DW$772       .dwtag  DW_TAG_member
    5384                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$24)
    5385                      .dwattr $C$DW$772, DW_AT_name("FACTIVEWAIT")
    5386                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    5387                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5388                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    5389              $C$DW$773       .dwtag  DW_TAG_member
    5390                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$24)
    5391                      .dwattr $C$DW$773, DW_AT_name("FBANKWAIT")
    5392                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_FBANKWAIT")
    5393                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5394                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    5395              $C$DW$774       .dwtag  DW_TAG_member
    5396                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$24)
    5397                      .dwattr $C$DW$774, DW_AT_name("FOTPWAIT")
    5398                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_FOTPWAIT")
    5399                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5400                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    5401                      .dwendtag $C$DW$T$78
    5402              
    5403              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    5404                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$78)
    5405                      .dwattr $C$DW$T$91, DW_AT_address_class(0x16)
