TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 20:41:14 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_d_pu")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_d_pu")

    2886              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    2887              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    2888              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    2889              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    2890              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    2891              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    2892              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    2893              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    2894              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    2895              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    2896              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    2897              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    2898              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    2899              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    2900              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    2901              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    2902              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    2903              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    2904              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    2905              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    2906              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    2907              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    2908              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    2909              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    2910              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    2911              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    2912              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    2913                      .dwendtag $C$DW$T$74
    2914              
    2915              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    2916                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2917                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2918              $C$DW$362       .dwtag  DW_TAG_TI_far_type
    2919                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$75)
    2920              $C$DW$T$77      .dwtag  DW_TAG_const_type
    2921                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$362)
    2922              
    2923              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    2924                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   59

    2925              $C$DW$363       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    2926              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    2927              $C$DW$365       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    2928                      .dwendtag $C$DW$T$82
    2929              
    2930              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    2931                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    2932                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2933              $C$DW$366       .dwtag  DW_TAG_TI_far_type
    2934                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$83)
    2935              $C$DW$T$84      .dwtag  DW_TAG_const_type
    2936                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$366)
    2937              
    2938              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2939                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    2940                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    2941              $C$DW$367       .dwtag  DW_TAG_member
    2942                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2943                      .dwattr $C$DW$367, DW_AT_name("alpha_sf")
    2944                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_alpha_sf")
    2945                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2946                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2947              $C$DW$368       .dwtag  DW_TAG_member
    2948                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2949                      .dwattr $C$DW$368, DW_AT_name("beta_sf")
    2950                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_beta_sf")
    2951                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2952                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2953              $C$DW$369       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$22)
    2955                      .dwattr $C$DW$369, DW_AT_name("numSensors")
    2956                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_numSensors")
    2957                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2958                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2959                      .dwendtag $C$DW$T$23
    2960              
    2961              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    2962                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    2963                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2964              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2965                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    2966                      .dwattr $C$DW$T$29, DW_AT_address_class(0x16)
    2967              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    2968                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2969                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2970              
    2971              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2972                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    2973                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    2974              $C$DW$370       .dwtag  DW_TAG_member
    2975                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$24)
    2976                      .dwattr $C$DW$370, DW_AT_name("version")
    2977                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_version")
    2978                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2979                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   60

    2980              $C$DW$371       .dwtag  DW_TAG_member
    2981                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$26)
    2982                      .dwattr $C$DW$371, DW_AT_name("state")
    2983                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_state")
    2984                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2985                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2986              $C$DW$372       .dwtag  DW_TAG_member
    2987                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$26)
    2988                      .dwattr $C$DW$372, DW_AT_name("prevState")
    2989                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_prevState")
    2990                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2991                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2992              $C$DW$373       .dwtag  DW_TAG_member
    2993                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$28)
    2994                      .dwattr $C$DW$373, DW_AT_name("errorCode")
    2995                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_errorCode")
    2996                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2997                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2998              $C$DW$374       .dwtag  DW_TAG_member
    2999                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$30)
    3000                      .dwattr $C$DW$374, DW_AT_name("clarkeHandle_I")
    3001                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3002                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3003                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3004              $C$DW$375       .dwtag  DW_TAG_member
    3005                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$31)
    3006                      .dwattr $C$DW$375, DW_AT_name("clarke_I")
    3007                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_clarke_I")
    3008                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3009                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3010              $C$DW$376       .dwtag  DW_TAG_member
    3011                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$30)
    3012                      .dwattr $C$DW$376, DW_AT_name("clarkeHandle_V")
    3013                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3014                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3015                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3016              $C$DW$377       .dwtag  DW_TAG_member
    3017                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$31)
    3018                      .dwattr $C$DW$377, DW_AT_name("clarke_V")
    3019                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_clarke_V")
    3020                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3021                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3022              $C$DW$378       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$33)
    3024                      .dwattr $C$DW$378, DW_AT_name("estHandle")
    3025                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_estHandle")
    3026                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3027                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3028              $C$DW$379       .dwtag  DW_TAG_member
    3029                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$35)
    3030                      .dwattr $C$DW$379, DW_AT_name("parkHandle")
    3031                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_parkHandle")
    3032                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3033                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3034              $C$DW$380       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   61

    3035                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$36)
    3036                      .dwattr $C$DW$380, DW_AT_name("park")
    3037                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_park")
    3038                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3039                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3040              $C$DW$381       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$38)
    3042                      .dwattr $C$DW$381, DW_AT_name("pidHandle_Id")
    3043                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_pidHandle_Id")
    3044                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3045                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3046              $C$DW$382       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$39)
    3048                      .dwattr $C$DW$382, DW_AT_name("pid_Id")
    3049                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_pid_Id")
    3050                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3051                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3052              $C$DW$383       .dwtag  DW_TAG_member
    3053                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$38)
    3054                      .dwattr $C$DW$383, DW_AT_name("pidHandle_Iq")
    3055                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3056                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3057                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3058              $C$DW$384       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$39)
    3060                      .dwattr $C$DW$384, DW_AT_name("pid_Iq")
    3061                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_pid_Iq")
    3062                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3063                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3064              $C$DW$385       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$38)
    3066                      .dwattr $C$DW$385, DW_AT_name("pidHandle_spd")
    3067                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_pidHandle_spd")
    3068                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3069                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3070              $C$DW$386       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$39)
    3072                      .dwattr $C$DW$386, DW_AT_name("pid_spd")
    3073                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_pid_spd")
    3074                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3075                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3076              $C$DW$387       .dwtag  DW_TAG_member
    3077                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$41)
    3078                      .dwattr $C$DW$387, DW_AT_name("iparkHandle")
    3079                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_iparkHandle")
    3080                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3081                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3082              $C$DW$388       .dwtag  DW_TAG_member
    3083                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$42)
    3084                      .dwattr $C$DW$388, DW_AT_name("ipark")
    3085                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_ipark")
    3086                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3087                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3088              $C$DW$389       .dwtag  DW_TAG_member
    3089                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$44)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   62

    3090                      .dwattr $C$DW$389, DW_AT_name("svgenHandle")
    3091                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_svgenHandle")
    3092                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3093                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3094              $C$DW$390       .dwtag  DW_TAG_member
    3095                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$45)
    3096                      .dwattr $C$DW$390, DW_AT_name("svgen")
    3097                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_svgen")
    3098                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3099                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3100              $C$DW$391       .dwtag  DW_TAG_member
    3101                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$47)
    3102                      .dwattr $C$DW$391, DW_AT_name("trajHandle_Id")
    3103                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_trajHandle_Id")
    3104                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3105                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3106              $C$DW$392       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$48)
    3108                      .dwattr $C$DW$392, DW_AT_name("traj_Id")
    3109                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_traj_Id")
    3110                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3111                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3112              $C$DW$393       .dwtag  DW_TAG_member
    3113                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$47)
    3114                      .dwattr $C$DW$393, DW_AT_name("trajHandle_spd")
    3115                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_trajHandle_spd")
    3116                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3117                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3118              $C$DW$394       .dwtag  DW_TAG_member
    3119                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$48)
    3120                      .dwattr $C$DW$394, DW_AT_name("traj_spd")
    3121                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_traj_spd")
    3122                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3123                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3124              $C$DW$395       .dwtag  DW_TAG_member
    3125                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$47)
    3126                      .dwattr $C$DW$395, DW_AT_name("trajHandle_spdMax")
    3127                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3128                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3129                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3130              $C$DW$396       .dwtag  DW_TAG_member
    3131                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$48)
    3132                      .dwattr $C$DW$396, DW_AT_name("traj_spdMax")
    3133                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_traj_spdMax")
    3134                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3135                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3136              $C$DW$397       .dwtag  DW_TAG_member
    3137                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$49)
    3138                      .dwattr $C$DW$397, DW_AT_name("motorParams")
    3139                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_motorParams")
    3140                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3141                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3142              $C$DW$398       .dwtag  DW_TAG_member
    3143                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$52)
    3144                      .dwattr $C$DW$398, DW_AT_name("waitTimes")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   63

    3145                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_waitTimes")
    3146                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3147                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3148              $C$DW$399       .dwtag  DW_TAG_member
    3149                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$51)
    3150                      .dwattr $C$DW$399, DW_AT_name("counter_state")
    3151                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_counter_state")
    3152                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3153                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3154              $C$DW$400       .dwtag  DW_TAG_member
    3155                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$53)
    3156                      .dwattr $C$DW$400, DW_AT_name("numIsrTicksPerCtrlTick")
    3157                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3158                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3159                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3160              $C$DW$401       .dwtag  DW_TAG_member
    3161                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$53)
    3162                      .dwattr $C$DW$401, DW_AT_name("numCtrlTicksPerCurrentTick")
    3163                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3164                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3165                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3166              $C$DW$402       .dwtag  DW_TAG_member
    3167                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$53)
    3168                      .dwattr $C$DW$402, DW_AT_name("numCtrlTicksPerSpeedTick")
    3169                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3170                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3171                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3172              $C$DW$403       .dwtag  DW_TAG_member
    3173                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$53)
    3174                      .dwattr $C$DW$403, DW_AT_name("numCtrlTicksPerTrajTick")
    3175                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3176                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3177                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3178              $C$DW$404       .dwtag  DW_TAG_member
    3179                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$51)
    3180                      .dwattr $C$DW$404, DW_AT_name("ctrlFreq_Hz")
    3181                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3182                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3183                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3184              $C$DW$405       .dwtag  DW_TAG_member
    3185                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$51)
    3186                      .dwattr $C$DW$405, DW_AT_name("trajFreq_Hz")
    3187                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3188                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3189                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3190              $C$DW$406       .dwtag  DW_TAG_member
    3191                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    3192                      .dwattr $C$DW$406, DW_AT_name("trajPeriod_sec")
    3193                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3194                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3195                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3196              $C$DW$407       .dwtag  DW_TAG_member
    3197                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$54)
    3198                      .dwattr $C$DW$407, DW_AT_name("ctrlPeriod_sec")
    3199                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   64

    3200                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3201                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3202              $C$DW$408       .dwtag  DW_TAG_member
    3203                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    3204                      .dwattr $C$DW$408, DW_AT_name("maxVsMag_pu")
    3205                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3206                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3207                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3208              $C$DW$409       .dwtag  DW_TAG_member
    3209                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$55)
    3210                      .dwattr $C$DW$409, DW_AT_name("Iab_in")
    3211                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Iab_in")
    3212                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3213                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3214              $C$DW$410       .dwtag  DW_TAG_member
    3215                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$55)
    3216                      .dwattr $C$DW$410, DW_AT_name("Iab_filt")
    3217                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Iab_filt")
    3218                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3219                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3220              $C$DW$411       .dwtag  DW_TAG_member
    3221                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$55)
    3222                      .dwattr $C$DW$411, DW_AT_name("Idq_in")
    3223                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Idq_in")
    3224                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3225                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3226              $C$DW$412       .dwtag  DW_TAG_member
    3227                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$55)
    3228                      .dwattr $C$DW$412, DW_AT_name("Vab_in")
    3229                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Vab_in")
    3230                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3231                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3232              $C$DW$413       .dwtag  DW_TAG_member
    3233                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    3234                      .dwattr $C$DW$413, DW_AT_name("spd_out")
    3235                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_spd_out")
    3236                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3237                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3238              $C$DW$414       .dwtag  DW_TAG_member
    3239                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$55)
    3240                      .dwattr $C$DW$414, DW_AT_name("Vab_out")
    3241                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Vab_out")
    3242                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3243                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3244              $C$DW$415       .dwtag  DW_TAG_member
    3245                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$55)
    3246                      .dwattr $C$DW$415, DW_AT_name("Vdq_out")
    3247                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Vdq_out")
    3248                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3249                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3250              $C$DW$416       .dwtag  DW_TAG_member
    3251                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$54)
    3252                      .dwattr $C$DW$416, DW_AT_name("Rhf")
    3253                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Rhf")
    3254                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   65

    3255                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3256              $C$DW$417       .dwtag  DW_TAG_member
    3257                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$54)
    3258                      .dwattr $C$DW$417, DW_AT_name("Lhf")
    3259                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_Lhf")
    3260                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3261                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3262              $C$DW$418       .dwtag  DW_TAG_member
    3263                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$54)
    3264                      .dwattr $C$DW$418, DW_AT_name("RoverL")
    3265                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_RoverL")
    3266                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3267                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3268              $C$DW$419       .dwtag  DW_TAG_member
    3269                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    3270                      .dwattr $C$DW$419, DW_AT_name("Kp_Id")
    3271                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Kp_Id")
    3272                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3273                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3274              $C$DW$420       .dwtag  DW_TAG_member
    3275                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    3276                      .dwattr $C$DW$420, DW_AT_name("Kp_Iq")
    3277                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Kp_Iq")
    3278                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3279                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3280              $C$DW$421       .dwtag  DW_TAG_member
    3281                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    3282                      .dwattr $C$DW$421, DW_AT_name("Kp_spd")
    3283                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Kp_spd")
    3284                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3285                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3286              $C$DW$422       .dwtag  DW_TAG_member
    3287                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    3288                      .dwattr $C$DW$422, DW_AT_name("Ki_Id")
    3289                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Ki_Id")
    3290                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3291                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3292              $C$DW$423       .dwtag  DW_TAG_member
    3293                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3294                      .dwattr $C$DW$423, DW_AT_name("Ki_Iq")
    3295                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Ki_Iq")
    3296                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3297                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3298              $C$DW$424       .dwtag  DW_TAG_member
    3299                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3300                      .dwattr $C$DW$424, DW_AT_name("Ki_spd")
    3301                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_Ki_spd")
    3302                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3303                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3304              $C$DW$425       .dwtag  DW_TAG_member
    3305                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3306                      .dwattr $C$DW$425, DW_AT_name("Kd_Id")
    3307                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_Kd_Id")
    3308                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3309                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   66

    3310              $C$DW$426       .dwtag  DW_TAG_member
    3311                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    3312                      .dwattr $C$DW$426, DW_AT_name("Kd_Iq")
    3313                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Kd_Iq")
    3314                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3315                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3316              $C$DW$427       .dwtag  DW_TAG_member
    3317                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    3318                      .dwattr $C$DW$427, DW_AT_name("Kd_spd")
    3319                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Kd_spd")
    3320                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3321                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3322              $C$DW$428       .dwtag  DW_TAG_member
    3323                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    3324                      .dwattr $C$DW$428, DW_AT_name("Ui_Id")
    3325                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Ui_Id")
    3326                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3327                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3328              $C$DW$429       .dwtag  DW_TAG_member
    3329                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    3330                      .dwattr $C$DW$429, DW_AT_name("Ui_Iq")
    3331                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Ui_Iq")
    3332                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3333                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3334              $C$DW$430       .dwtag  DW_TAG_member
    3335                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    3336                      .dwattr $C$DW$430, DW_AT_name("Ui_spd")
    3337                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_Ui_spd")
    3338                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3339                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3340              $C$DW$431       .dwtag  DW_TAG_member
    3341                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$55)
    3342                      .dwattr $C$DW$431, DW_AT_name("Idq_ref")
    3343                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_Idq_ref")
    3344                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3345                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3346              $C$DW$432       .dwtag  DW_TAG_member
    3347                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    3348                      .dwattr $C$DW$432, DW_AT_name("IdRated")
    3349                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_IdRated")
    3350                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3351                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3352              $C$DW$433       .dwtag  DW_TAG_member
    3353                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    3354                      .dwattr $C$DW$433, DW_AT_name("spd_ref")
    3355                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_spd_ref")
    3356                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3357                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3358              $C$DW$434       .dwtag  DW_TAG_member
    3359                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    3360                      .dwattr $C$DW$434, DW_AT_name("spd_max")
    3361                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_spd_max")
    3362                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3363                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3364              $C$DW$435       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   67

    3365                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$53)
    3366                      .dwattr $C$DW$435, DW_AT_name("counter_current")
    3367                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_counter_current")
    3368                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3369                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3370              $C$DW$436       .dwtag  DW_TAG_member
    3371                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$53)
    3372                      .dwattr $C$DW$436, DW_AT_name("counter_isr")
    3373                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_counter_isr")
    3374                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3375                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3376              $C$DW$437       .dwtag  DW_TAG_member
    3377                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$53)
    3378                      .dwattr $C$DW$437, DW_AT_name("counter_speed")
    3379                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_counter_speed")
    3380                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3381                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3382              $C$DW$438       .dwtag  DW_TAG_member
    3383                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$53)
    3384                      .dwattr $C$DW$438, DW_AT_name("counter_traj")
    3385                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_counter_traj")
    3386                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3387                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3388              $C$DW$439       .dwtag  DW_TAG_member
    3389                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    3390                      .dwattr $C$DW$439, DW_AT_name("flag_enableCtrl")
    3391                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3392                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3393                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3394              $C$DW$440       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$56)
    3396                      .dwattr $C$DW$440, DW_AT_name("flag_enableDcBusComp")
    3397                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3398                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3399                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3400              $C$DW$441       .dwtag  DW_TAG_member
    3401                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$56)
    3402                      .dwattr $C$DW$441, DW_AT_name("flag_enablePowerWarp")
    3403                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3404                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3405                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3406              $C$DW$442       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$56)
    3408                      .dwattr $C$DW$442, DW_AT_name("flag_enableOffset")
    3409                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_flag_enableOffset")
    3410                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3411                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3412              $C$DW$443       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    3414                      .dwattr $C$DW$443, DW_AT_name("flag_enableSpeedCtrl")
    3415                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3416                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3417                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3418              $C$DW$444       .dwtag  DW_TAG_member
    3419                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   68

    3420                      .dwattr $C$DW$444, DW_AT_name("flag_enableUserMotorParams")
    3421                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3422                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3423                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3424              $C$DW$445       .dwtag  DW_TAG_member
    3425                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$55)
    3426                      .dwattr $C$DW$445, DW_AT_name("Idq_offset_pu")
    3427                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3428                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3429                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3430              $C$DW$446       .dwtag  DW_TAG_member
    3431                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$55)
    3432                      .dwattr $C$DW$446, DW_AT_name("Vdq_offset_pu")
    3433                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3434                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3435                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3436              $C$DW$447       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
    3438                      .dwattr $C$DW$447, DW_AT_name("angle_pu")
    3439                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_angle_pu")
    3440                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3441                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3442              $C$DW$448       .dwtag  DW_TAG_member
    3443                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
    3444                      .dwattr $C$DW$448, DW_AT_name("speed_ref_pu")
    3445                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_speed_ref_pu")
    3446                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3447                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3448              $C$DW$449       .dwtag  DW_TAG_member
    3449                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    3450                      .dwattr $C$DW$449, DW_AT_name("speed_fb_pu")
    3451                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_speed_fb_pu")
    3452                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3453                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3454              $C$DW$450       .dwtag  DW_TAG_member
    3455                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    3456                      .dwattr $C$DW$450, DW_AT_name("speed_outMax_pu")
    3457                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3458                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3459                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3460              $C$DW$451       .dwtag  DW_TAG_member
    3461                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$56)
    3462                      .dwattr $C$DW$451, DW_AT_name("flag_enableCurrentCtrl")
    3463                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3464                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3465                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3466                      .dwendtag $C$DW$T$57
    3467              
    3468              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3469                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    3470                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3471              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3472                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    3473                      .dwattr $C$DW$T$86, DW_AT_address_class(0x16)
    3474              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   69

    3475                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3476                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3477              $C$DW$452       .dwtag  DW_TAG_TI_far_type
    3478                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$87)
    3479              $C$DW$T$88      .dwtag  DW_TAG_const_type
    3480                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$452)
    3481              
    3482              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3483                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3484                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3485              $C$DW$453       .dwtag  DW_TAG_member
    3486                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$21)
    3487                      .dwattr $C$DW$453, DW_AT_name("rsvd")
    3488                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_rsvd")
    3489                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3490                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3491              $C$DW$454       .dwtag  DW_TAG_member
    3492                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$59)
    3493                      .dwattr $C$DW$454, DW_AT_name("targetProc")
    3494                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_targetProc")
    3495                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3496                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3497              $C$DW$455       .dwtag  DW_TAG_member
    3498                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$21)
    3499                      .dwattr $C$DW$455, DW_AT_name("major")
    3500                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_major")
    3501                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3502                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3503              $C$DW$456       .dwtag  DW_TAG_member
    3504                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$21)
    3505                      .dwattr $C$DW$456, DW_AT_name("minor")
    3506                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_minor")
    3507                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3508                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3509                      .dwendtag $C$DW$T$60
    3510              
    3511              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3512                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    3513                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3514              
    3515              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3516                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3517                      .dwattr $C$DW$T$19, DW_AT_declaration
    3518                      .dwendtag $C$DW$T$19
    3519              
    3520              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3521                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3522                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    3523              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3524                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3525                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3526              
    3527              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3528                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3529                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   70

    3530              $C$DW$457       .dwtag  DW_TAG_member
    3531                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    3532                      .dwattr $C$DW$457, DW_AT_name("sinTh")
    3533                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_sinTh")
    3534                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3535                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3536              $C$DW$458       .dwtag  DW_TAG_member
    3537                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    3538                      .dwattr $C$DW$458, DW_AT_name("cosTh")
    3539                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_cosTh")
    3540                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3541                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3542                      .dwendtag $C$DW$T$61
    3543              
    3544              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3545                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3546                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3547              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3548                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3549                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    3550              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3551                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3552                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3553              
    3554              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3555                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3556                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3557              $C$DW$459       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$62)
    3559                      .dwattr $C$DW$459, DW_AT_name("value")
    3560                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_value")
    3561                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3562                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3563                      .dwendtag $C$DW$T$63
    3564              
    3565              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3566                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3567                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3568              
    3569              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3570                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    3571                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3572              $C$DW$460       .dwtag  DW_TAG_member
    3573                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$65)
    3574                      .dwattr $C$DW$460, DW_AT_name("type")
    3575                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_type")
    3576                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3577                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3578              $C$DW$461       .dwtag  DW_TAG_member
    3579                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$53)
    3580                      .dwattr $C$DW$461, DW_AT_name("numPolePairs")
    3581                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_numPolePairs")
    3582                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3583                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3584              $C$DW$462       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   71

    3585                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$54)
    3586                      .dwattr $C$DW$462, DW_AT_name("Lr_H")
    3587                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_Lr_H")
    3588                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3589                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3590              $C$DW$463       .dwtag  DW_TAG_member
    3591                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$54)
    3592                      .dwattr $C$DW$463, DW_AT_name("Ls_d_H")
    3593                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_Ls_d_H")
    3594                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3595                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3596              $C$DW$464       .dwtag  DW_TAG_member
    3597                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$54)
    3598                      .dwattr $C$DW$464, DW_AT_name("Ls_q_H")
    3599                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_Ls_q_H")
    3600                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3601                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3602              $C$DW$465       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    3604                      .dwattr $C$DW$465, DW_AT_name("Rr_Ohm")
    3605                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_Rr_Ohm")
    3606                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3607                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3608              $C$DW$466       .dwtag  DW_TAG_member
    3609                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    3610                      .dwattr $C$DW$466, DW_AT_name("Rs_Ohm")
    3611                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_Rs_Ohm")
    3612                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3613                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3614              $C$DW$467       .dwtag  DW_TAG_member
    3615                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    3616                      .dwattr $C$DW$467, DW_AT_name("ratedFlux_VpHz")
    3617                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3618                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3619                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3620                      .dwendtag $C$DW$T$66
    3621              
    3622              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    3623                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3624                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3625              
    3626              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3627                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3628                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3629              $C$DW$468       .dwtag  DW_TAG_member
    3630                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    3631                      .dwattr $C$DW$468, DW_AT_name("sinTh")
    3632                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_sinTh")
    3633                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3634                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3635              $C$DW$469       .dwtag  DW_TAG_member
    3636                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    3637                      .dwattr $C$DW$469, DW_AT_name("cosTh")
    3638                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_cosTh")
    3639                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   72

    3640                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3641                      .dwendtag $C$DW$T$67
    3642              
    3643              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3644                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3645                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3646              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3647                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    3648                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
    3649              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3650                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3651                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3652              
    3653              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3654                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3655                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3656              $C$DW$470       .dwtag  DW_TAG_member
    3657                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
    3658                      .dwattr $C$DW$470, DW_AT_name("Kp")
    3659                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_Kp")
    3660                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3661                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3662              $C$DW$471       .dwtag  DW_TAG_member
    3663                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    3664                      .dwattr $C$DW$471, DW_AT_name("Ki")
    3665                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_Ki")
    3666                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3667                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3668              $C$DW$472       .dwtag  DW_TAG_member
    3669                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    3670                      .dwattr $C$DW$472, DW_AT_name("Kd")
    3671                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_Kd")
    3672                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3673                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3674              $C$DW$473       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    3676                      .dwattr $C$DW$473, DW_AT_name("Ui")
    3677                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_Ui")
    3678                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3679                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3680              $C$DW$474       .dwtag  DW_TAG_member
    3681                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    3682                      .dwattr $C$DW$474, DW_AT_name("refValue")
    3683                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_refValue")
    3684                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3685                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3686              $C$DW$475       .dwtag  DW_TAG_member
    3687                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    3688                      .dwattr $C$DW$475, DW_AT_name("fbackValue")
    3689                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_fbackValue")
    3690                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3691                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3692              $C$DW$476       .dwtag  DW_TAG_member
    3693                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
    3694                      .dwattr $C$DW$476, DW_AT_name("outMin")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   73

    3695                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_outMin")
    3696                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3697                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3698              $C$DW$477       .dwtag  DW_TAG_member
    3699                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    3700                      .dwattr $C$DW$477, DW_AT_name("outMax")
    3701                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_outMax")
    3702                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3703                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3704                      .dwendtag $C$DW$T$68
    3705              
    3706              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3707                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3708                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3709              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3710                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3711                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    3712              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    3713                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3714                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3715              
    3716              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3717                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3718                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3719              $C$DW$478       .dwtag  DW_TAG_member
    3720                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    3721                      .dwattr $C$DW$478, DW_AT_name("maxModulation")
    3722                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_maxModulation")
    3723                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3724                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3725                      .dwendtag $C$DW$T$69
    3726              
    3727              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3728                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3729                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3730              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3731                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    3732                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    3733              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3734                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3735                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3736              
    3737              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3738                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3739                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3740              $C$DW$479       .dwtag  DW_TAG_member
    3741                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    3742                      .dwattr $C$DW$479, DW_AT_name("targetValue")
    3743                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_targetValue")
    3744                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3745                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3746              $C$DW$480       .dwtag  DW_TAG_member
    3747                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    3748                      .dwattr $C$DW$480, DW_AT_name("intValue")
    3749                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_intValue")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   74

    3750                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3751                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3752              $C$DW$481       .dwtag  DW_TAG_member
    3753                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    3754                      .dwattr $C$DW$481, DW_AT_name("minValue")
    3755                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_minValue")
    3756                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3757                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3758              $C$DW$482       .dwtag  DW_TAG_member
    3759                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    3760                      .dwattr $C$DW$482, DW_AT_name("maxValue")
    3761                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_maxValue")
    3762                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3763                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3764              $C$DW$483       .dwtag  DW_TAG_member
    3765                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$20)
    3766                      .dwattr $C$DW$483, DW_AT_name("maxDelta")
    3767                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_maxDelta")
    3768                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3769                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3770                      .dwendtag $C$DW$T$70
    3771              
    3772              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3773                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3774                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3775              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3776                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3777                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3778              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3779                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3780                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3781              
    3782              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3783                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    3784                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    3785              $C$DW$484       .dwtag  DW_TAG_member
    3786                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    3787                      .dwattr $C$DW$484, DW_AT_name("iqFullScaleCurrent_A")
    3788                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3789                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3790                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3791              $C$DW$485       .dwtag  DW_TAG_member
    3792                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$54)
    3793                      .dwattr $C$DW$485, DW_AT_name("iqFullScaleVoltage_V")
    3794                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3795                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3796                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3797              $C$DW$486       .dwtag  DW_TAG_member
    3798                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$54)
    3799                      .dwattr $C$DW$486, DW_AT_name("iqFullScaleFreq_Hz")
    3800                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3801                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3802                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3803              $C$DW$487       .dwtag  DW_TAG_member
    3804                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$53)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   75

    3805                      .dwattr $C$DW$487, DW_AT_name("numIsrTicksPerCtrlTick")
    3806                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3807                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3808                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3809              $C$DW$488       .dwtag  DW_TAG_member
    3810                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$53)
    3811                      .dwattr $C$DW$488, DW_AT_name("numCtrlTicksPerCurrentTick")
    3812                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3813                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3814                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3815              $C$DW$489       .dwtag  DW_TAG_member
    3816                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$53)
    3817                      .dwattr $C$DW$489, DW_AT_name("numCtrlTicksPerEstTick")
    3818                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3819                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3820                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3821              $C$DW$490       .dwtag  DW_TAG_member
    3822                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$53)
    3823                      .dwattr $C$DW$490, DW_AT_name("numCtrlTicksPerSpeedTick")
    3824                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3825                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3826                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3827              $C$DW$491       .dwtag  DW_TAG_member
    3828                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$53)
    3829                      .dwattr $C$DW$491, DW_AT_name("numCtrlTicksPerTrajTick")
    3830                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3831                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3832                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3833              $C$DW$492       .dwtag  DW_TAG_member
    3834                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$22)
    3835                      .dwattr $C$DW$492, DW_AT_name("numCurrentSensors")
    3836                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_numCurrentSensors")
    3837                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3838                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3839              $C$DW$493       .dwtag  DW_TAG_member
    3840                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$22)
    3841                      .dwattr $C$DW$493, DW_AT_name("numVoltageSensors")
    3842                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_numVoltageSensors")
    3843                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3844                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3845              $C$DW$494       .dwtag  DW_TAG_member
    3846                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$54)
    3847                      .dwattr $C$DW$494, DW_AT_name("offsetPole_rps")
    3848                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_offsetPole_rps")
    3849                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3850                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3851              $C$DW$495       .dwtag  DW_TAG_member
    3852                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$54)
    3853                      .dwattr $C$DW$495, DW_AT_name("fluxPole_rps")
    3854                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_fluxPole_rps")
    3855                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3856                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3857              $C$DW$496       .dwtag  DW_TAG_member
    3858                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
    3859                      .dwattr $C$DW$496, DW_AT_name("zeroSpeedLimit")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   76

    3860                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3861                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3862                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3863              $C$DW$497       .dwtag  DW_TAG_member
    3864                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$54)
    3865                      .dwattr $C$DW$497, DW_AT_name("forceAngleFreq_Hz")
    3866                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3867                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3868                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3869              $C$DW$498       .dwtag  DW_TAG_member
    3870                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    3871                      .dwattr $C$DW$498, DW_AT_name("maxAccel_Hzps")
    3872                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3873                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3874                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3875              $C$DW$499       .dwtag  DW_TAG_member
    3876                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    3877                      .dwattr $C$DW$499, DW_AT_name("maxAccel_est_Hzps")
    3878                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3879                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3880                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3881              $C$DW$500       .dwtag  DW_TAG_member
    3882                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    3883                      .dwattr $C$DW$500, DW_AT_name("directionPole_rps")
    3884                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_directionPole_rps")
    3885                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3886                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3887              $C$DW$501       .dwtag  DW_TAG_member
    3888                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    3889                      .dwattr $C$DW$501, DW_AT_name("speedPole_rps")
    3890                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_speedPole_rps")
    3891                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3892                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3893              $C$DW$502       .dwtag  DW_TAG_member
    3894                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$54)
    3895                      .dwattr $C$DW$502, DW_AT_name("dcBusPole_rps")
    3896                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_dcBusPole_rps")
    3897                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3898                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3899              $C$DW$503       .dwtag  DW_TAG_member
    3900                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$54)
    3901                      .dwattr $C$DW$503, DW_AT_name("fluxFraction")
    3902                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_fluxFraction")
    3903                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3904                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3905              $C$DW$504       .dwtag  DW_TAG_member
    3906                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$54)
    3907                      .dwattr $C$DW$504, DW_AT_name("indEst_speedMaxFraction")
    3908                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    3909                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3910                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3911              $C$DW$505       .dwtag  DW_TAG_member
    3912                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$54)
    3913                      .dwattr $C$DW$505, DW_AT_name("powerWarpGain")
    3914                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_powerWarpGain")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   77

    3915                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3916                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3917              $C$DW$506       .dwtag  DW_TAG_member
    3918                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$53)
    3919                      .dwattr $C$DW$506, DW_AT_name("systemFreq_MHz")
    3920                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_systemFreq_MHz")
    3921                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3922                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3923              $C$DW$507       .dwtag  DW_TAG_member
    3924                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$54)
    3925                      .dwattr $C$DW$507, DW_AT_name("pwmPeriod_usec")
    3926                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    3927                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3928                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3929              $C$DW$508       .dwtag  DW_TAG_member
    3930                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$54)
    3931                      .dwattr $C$DW$508, DW_AT_name("voltage_sf")
    3932                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_voltage_sf")
    3933                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3934                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3935              $C$DW$509       .dwtag  DW_TAG_member
    3936                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$54)
    3937                      .dwattr $C$DW$509, DW_AT_name("current_sf")
    3938                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_current_sf")
    3939                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3940                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3941              $C$DW$510       .dwtag  DW_TAG_member
    3942                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$54)
    3943                      .dwattr $C$DW$510, DW_AT_name("voltageFilterPole_rps")
    3944                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    3945                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3946                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3947              $C$DW$511       .dwtag  DW_TAG_member
    3948                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$54)
    3949                      .dwattr $C$DW$511, DW_AT_name("maxVsMag_pu")
    3950                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3951                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3952                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3953              $C$DW$512       .dwtag  DW_TAG_member
    3954                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$54)
    3955                      .dwattr $C$DW$512, DW_AT_name("estKappa")
    3956                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_estKappa")
    3957                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3958                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3959              $C$DW$513       .dwtag  DW_TAG_member
    3960                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$65)
    3961                      .dwattr $C$DW$513, DW_AT_name("motor_type")
    3962                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_motor_type")
    3963                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3964                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3965              $C$DW$514       .dwtag  DW_TAG_member
    3966                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$53)
    3967                      .dwattr $C$DW$514, DW_AT_name("motor_numPolePairs")
    3968                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_motor_numPolePairs")
    3969                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   78

    3970                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3971              $C$DW$515       .dwtag  DW_TAG_member
    3972                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$54)
    3973                      .dwattr $C$DW$515, DW_AT_name("motor_ratedFlux")
    3974                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_motor_ratedFlux")
    3975                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3976                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3977              $C$DW$516       .dwtag  DW_TAG_member
    3978                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$54)
    3979                      .dwattr $C$DW$516, DW_AT_name("motor_Rr")
    3980                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_motor_Rr")
    3981                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3982                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3983              $C$DW$517       .dwtag  DW_TAG_member
    3984                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$54)
    3985                      .dwattr $C$DW$517, DW_AT_name("motor_Rs")
    3986                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_motor_Rs")
    3987                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3988                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3989              $C$DW$518       .dwtag  DW_TAG_member
    3990                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$54)
    3991                      .dwattr $C$DW$518, DW_AT_name("motor_Ls_d")
    3992                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_motor_Ls_d")
    3993                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3994                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3995              $C$DW$519       .dwtag  DW_TAG_member
    3996                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$54)
    3997                      .dwattr $C$DW$519, DW_AT_name("motor_Ls_q")
    3998                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_motor_Ls_q")
    3999                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4000                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    4001              $C$DW$520       .dwtag  DW_TAG_member
    4002                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$54)
    4003                      .dwattr $C$DW$520, DW_AT_name("maxCurrent")
    4004                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_maxCurrent")
    4005                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4006                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4007              $C$DW$521       .dwtag  DW_TAG_member
    4008                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$54)
    4009                      .dwattr $C$DW$521, DW_AT_name("maxCurrent_resEst")
    4010                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    4011                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4012                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4013              $C$DW$522       .dwtag  DW_TAG_member
    4014                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$54)
    4015                      .dwattr $C$DW$522, DW_AT_name("maxCurrent_indEst")
    4016                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    4017                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4018                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4019              $C$DW$523       .dwtag  DW_TAG_member
    4020                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$54)
    4021                      .dwattr $C$DW$523, DW_AT_name("maxCurrentSlope")
    4022                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_maxCurrentSlope")
    4023                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4024                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 20:41:14 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0710010                              PAGE   79

    4025              $C$DW$524       .dwtag  DW_TAG_member
    4026                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$54)
    4027                      .dwattr $C$DW$524, DW_AT_name("maxCurrentSlope_powerWarp")
    4028                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    4029                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4030                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4031              $C$DW$525       .dwtag  DW_TAG_member
    4032                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$54)
    4033                      .dwattr $C$DW$525, DW_AT_name("IdRated")
    4034                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_IdRated")
    4035                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4036                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4037              $C$DW$526       .dwtag  DW_TAG_member
    4038                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$54)
    4039                      .dwattr $C$DW$526, DW_AT_name("IdRatedFraction_indEst")
    4040                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    4041                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4042                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4043              $C$DW$527       .dwtag  DW_TAG_member
    4044                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$54)
    4045                      .dwattr $C$DW$527, DW_AT_name("IdRatedFraction_ratedFlux")
    4046                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    4047                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4048                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4049              $C$DW$528       .dwtag  DW_TAG_member
    4050                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$54)
    4051                      .dwattr $C$DW$528, DW_AT_name("IdRated_delta")
    4052                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_IdRated_delta")
    4053                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4054                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4055              $C$DW$529       .dwtag  DW_TAG_member
    4056                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$54)
    4057                      .dwattr $C$DW$529, DW_AT_name("fluxEstFreq_Hz")
    4058                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    4059                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    4060                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4061              $C$DW$530       .dwtag  DW_TAG_member
    4062                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$52)
    4063                      .dwattr $C$DW$530, DW_AT_name("ctrlWaitTime")
    4064                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_ctrlWaitTime")
    4065                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4066                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4067              $C$DW$531       .dwtag  DW_TAG_member
    4068                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$71)
    4069                      .dwattr $C$DW$531, DW_AT_name("estWaitTime")
    4070                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_estWaitTime")
    4071                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4072                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4073              $C$DW$532       .dwtag  DW_TAG_member
    4074                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$72)
    4075                      .dwattr $C$DW$532, DW_AT_name("FluxWaitTime")
