TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1804410                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Jun 19 18:10:36 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/drivers/pwm/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;       c:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\180442 C

    7391              $C$DW$T$113     .dwtag  DW_TAG_const_type
    7392                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$777)
    7393              
    7394              $C$DW$T$114     .dwtag  DW_TAG_enumeration_type
    7395                      .dwattr $C$DW$T$114, DW_AT_byte_size(0x01)
    7396              $C$DW$778       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_ShadowMode_Shadow"), DW_AT_const_value(0x00)
    7397              $C$DW$779       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_ShadowMode_Immediate"), DW_AT_const_value(0x01)
    7398                      .dwendtag $C$DW$T$114
    7399              
    7400              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_ShadowMode_e")
    7401                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    7402                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    7403              $C$DW$780       .dwtag  DW_TAG_TI_far_type
    7404                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$115)
    7405              $C$DW$T$116     .dwtag  DW_TAG_const_type
    7406                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$780)
    7407              
    7408              $C$DW$T$117     .dwtag  DW_TAG_enumeration_type
    7409                      .dwattr $C$DW$T$117, DW_AT_byte_size(0x01)
    7410              $C$DW$781       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_EPWMxSYNC"), DW_AT_const_value(0x00)
    7411              $C$DW$782       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_CounterEqualZero"), DW_AT_const_value(0x1
    7412              $C$DW$783       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_CounterEqualCounterCompareZero"), DW_AT_c
    7413              $C$DW$784       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_Disable"), DW_AT_const_value(0x30)
    7414                      .dwendtag $C$DW$T$117
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1804410                              PAGE  138

    7415              
    7416              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_SyncMode_e")
    7417                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    7418                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    7419              $C$DW$785       .dwtag  DW_TAG_TI_far_type
    7420                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$118)
    7421              $C$DW$T$119     .dwtag  DW_TAG_const_type
    7422                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$785)
    7423              
    7424              $C$DW$T$120     .dwtag  DW_TAG_enumeration_type
    7425                      .dwattr $C$DW$T$120, DW_AT_byte_size(0x01)
    7426              $C$DW$786       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_Disabled"), DW_AT_const_value(0
    7427              $C$DW$787       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHL_DCxLX"), DW_AT_const_valu
    7428              $C$DW$788       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHH_DCxLX"), DW_AT_const_valu
    7429              $C$DW$789       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHx_DCxLL"), DW_AT_const_valu
    7430              $C$DW$790       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHx_DCxLH"), DW_AT_const_valu
    7431              $C$DW$791       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHL_DCxLH"), DW_AT_const_valu
    7432                      .dwendtag $C$DW$T$120
    7433              
    7434              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_TripZoneDCEventSel_e")
    7435                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    7436                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    7437              $C$DW$792       .dwtag  DW_TAG_TI_far_type
    7438                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$121)
    7439              $C$DW$T$122     .dwtag  DW_TAG_const_type
    7440                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$792)
    7441              
    7442              $C$DW$T$123     .dwtag  DW_TAG_enumeration_type
    7443                      .dwattr $C$DW$T$123, DW_AT_byte_size(0x01)
    7444              $C$DW$793       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_HighImp"), DW_AT_const_value(0x00)
    7445              $C$DW$794       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_EPWM_High"), DW_AT_const_value(0x01)
    7446              $C$DW$795       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_EPWM_Low"), DW_AT_const_value(0x02)
    7447              $C$DW$796       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_DoNothing"), DW_AT_const_value(0x03)
    7448                      .dwendtag $C$DW$T$123
    7449              
    7450              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_TripZoneState_e")
    7451                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    7452                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    7453              $C$DW$797       .dwtag  DW_TAG_TI_far_type
    7454                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$124)
    7455              $C$DW$T$125     .dwtag  DW_TAG_const_type
    7456                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$797)
    7457              
    7458              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7459                      .dwattr $C$DW$T$23, DW_AT_name("_PWM_Obj_")
    7460                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x3a)
    7461              $C$DW$798       .dwtag  DW_TAG_member
    7462                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$20)
    7463                      .dwattr $C$DW$798, DW_AT_name("TBCTL")
    7464                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_TBCTL")
    7465                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7466                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7467              $C$DW$799       .dwtag  DW_TAG_member
    7468                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$20)
    7469                      .dwattr $C$DW$799, DW_AT_name("TBSTS")
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1804410                              PAGE  139

    7470                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_TBSTS")
    7471                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7472                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7473              $C$DW$800       .dwtag  DW_TAG_member
    7474                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$20)
    7475                      .dwattr $C$DW$800, DW_AT_name("TBPHSHR")
    7476                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_TBPHSHR")
    7477                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7478                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7479              $C$DW$801       .dwtag  DW_TAG_member
    7480                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$20)
    7481                      .dwattr $C$DW$801, DW_AT_name("TBPHS")
    7482                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_TBPHS")
    7483                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7484                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7485              $C$DW$802       .dwtag  DW_TAG_member
    7486                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$20)
    7487                      .dwattr $C$DW$802, DW_AT_name("TBCTR")
    7488                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_TBCTR")
    7489                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7490                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7491              $C$DW$803       .dwtag  DW_TAG_member
    7492                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$20)
    7493                      .dwattr $C$DW$803, DW_AT_name("TBPRD")
    7494                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_TBPRD")
    7495                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7496                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7497              $C$DW$804       .dwtag  DW_TAG_member
    7498                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$20)
    7499                      .dwattr $C$DW$804, DW_AT_name("TBPRDHR")
    7500                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_TBPRDHR")
    7501                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7502                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7503              $C$DW$805       .dwtag  DW_TAG_member
    7504                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$20)
    7505                      .dwattr $C$DW$805, DW_AT_name("CMPCTL")
    7506                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_CMPCTL")
    7507                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7508                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7509              $C$DW$806       .dwtag  DW_TAG_member
    7510                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$20)
    7511                      .dwattr $C$DW$806, DW_AT_name("CMPAHR")
    7512                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_CMPAHR")
    7513                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7514                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7515              $C$DW$807       .dwtag  DW_TAG_member
    7516                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$20)
    7517                      .dwattr $C$DW$807, DW_AT_name("CMPA")
    7518                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_CMPA")
    7519                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7520                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7521              $C$DW$808       .dwtag  DW_TAG_member
    7522                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$20)
    7523                      .dwattr $C$DW$808, DW_AT_name("CMPB")
    7524                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_CMPB")
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1804410                              PAGE  140

    7525                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7526                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7527              $C$DW$809       .dwtag  DW_TAG_member
    7528                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$20)
    7529                      .dwattr $C$DW$809, DW_AT_name("AQCTLA")
    7530                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_AQCTLA")
    7531                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7532                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7533              $C$DW$810       .dwtag  DW_TAG_member
    7534                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$20)
    7535                      .dwattr $C$DW$810, DW_AT_name("AQCTLB")
    7536                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_AQCTLB")
    7537                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7538                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7539              $C$DW$811       .dwtag  DW_TAG_member
    7540                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$20)
    7541                      .dwattr $C$DW$811, DW_AT_name("AQSFRC")
    7542                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_AQSFRC")
    7543                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7544                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7545              $C$DW$812       .dwtag  DW_TAG_member
    7546                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$20)
    7547                      .dwattr $C$DW$812, DW_AT_name("AQCSFRC")
    7548                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_AQCSFRC")
    7549                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7550                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7551              $C$DW$813       .dwtag  DW_TAG_member
    7552                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$20)
    7553                      .dwattr $C$DW$813, DW_AT_name("DBCTL")
    7554                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_DBCTL")
    7555                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    7556                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7557              $C$DW$814       .dwtag  DW_TAG_member
    7558                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$20)
    7559                      .dwattr $C$DW$814, DW_AT_name("DBRED")
    7560                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_DBRED")
    7561                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7562                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7563              $C$DW$815       .dwtag  DW_TAG_member
    7564                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$20)
    7565                      .dwattr $C$DW$815, DW_AT_name("DBFED")
    7566                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_DBFED")
    7567                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7568                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7569              $C$DW$816       .dwtag  DW_TAG_member
    7570                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$20)
    7571                      .dwattr $C$DW$816, DW_AT_name("TZSEL")
    7572                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_TZSEL")
    7573                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7574                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    7575              $C$DW$817       .dwtag  DW_TAG_member
    7576                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$20)
    7577                      .dwattr $C$DW$817, DW_AT_name("TZDCSEL")
    7578                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_TZDCSEL")
    7579                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1804410                              PAGE  141

    7580                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7581              $C$DW$818       .dwtag  DW_TAG_member
    7582                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$20)
    7583                      .dwattr $C$DW$818, DW_AT_name("TZCTL")
    7584                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_TZCTL")
    7585                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7586                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7587              $C$DW$819       .dwtag  DW_TAG_member
    7588                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$20)
    7589                      .dwattr $C$DW$819, DW_AT_name("TZEINT")
    7590                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_TZEINT")
    7591                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7592                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    7593              $C$DW$820       .dwtag  DW_TAG_member
    7594                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$20)
    7595                      .dwattr $C$DW$820, DW_AT_name("TZFLG")
    7596                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_TZFLG")
    7597                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7598                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    7599              $C$DW$821       .dwtag  DW_TAG_member
    7600                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$20)
    7601                      .dwattr $C$DW$821, DW_AT_name("TZCLR")
    7602                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_TZCLR")
    7603                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    7604                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    7605              $C$DW$822       .dwtag  DW_TAG_member
    7606                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$20)
    7607                      .dwattr $C$DW$822, DW_AT_name("TZFRC")
    7608                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_TZFRC")
    7609                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7610                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    7611              $C$DW$823       .dwtag  DW_TAG_member
    7612                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$20)
    7613                      .dwattr $C$DW$823, DW_AT_name("ETSEL")
    7614                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_ETSEL")
    7615                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    7616                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    7617              $C$DW$824       .dwtag  DW_TAG_member
    7618                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$20)
    7619                      .dwattr $C$DW$824, DW_AT_name("ETPS")
    7620                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_ETPS")
    7621                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7622                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    7623              $C$DW$825       .dwtag  DW_TAG_member
    7624                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$20)
    7625                      .dwattr $C$DW$825, DW_AT_name("ETFLG")
    7626                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_ETFLG")
    7627                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    7628                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    7629              $C$DW$826       .dwtag  DW_TAG_member
    7630                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$20)
    7631                      .dwattr $C$DW$826, DW_AT_name("ETCLR")
    7632                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_ETCLR")
    7633                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7634                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1804410                              PAGE  142

    7635              $C$DW$827       .dwtag  DW_TAG_member
    7636                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$20)
    7637                      .dwattr $C$DW$827, DW_AT_name("ETFRC")
    7638                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_ETFRC")
    7639                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    7640                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    7641              $C$DW$828       .dwtag  DW_TAG_member
    7642                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$20)
    7643                      .dwattr $C$DW$828, DW_AT_name("PCCTL")
    7644                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_PCCTL")
    7645                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7646                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    7647              $C$DW$829       .dwtag  DW_TAG_member
    7648                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$20)
    7649                      .dwattr $C$DW$829, DW_AT_name("rsvd_1")
    7650                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_rsvd_1")
    7651                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    7652                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    7653              $C$DW$830       .dwtag  DW_TAG_member
    7654                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$20)
    7655                      .dwattr $C$DW$830, DW_AT_name("HRCNFG")
    7656                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_HRCNFG")
    7657                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7658                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    7659              $C$DW$831       .dwtag  DW_TAG_member
    7660                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$20)
    7661                      .dwattr $C$DW$831, DW_AT_name("HRPWR")
    7662                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_HRPWR")
    7663                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7664                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    7665              $C$DW$832       .dwtag  DW_TAG_member
    7666                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$21)
    7667                      .dwattr $C$DW$832, DW_AT_name("rsvd_2")
    7668                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_rsvd_2")
    7669                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7670                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    7671              $C$DW$833       .dwtag  DW_TAG_member
    7672                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$20)
    7673                      .dwattr $C$DW$833, DW_AT_name("HRMSTEP")
    7674                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_HRMSTEP")
    7675                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7676                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    7677              $C$DW$834       .dwtag  DW_TAG_member
    7678                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$20)
    7679                      .dwattr $C$DW$834, DW_AT_name("rsvd_3")
    7680                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_rsvd_3")
    7681                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    7682                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    7683              $C$DW$835       .dwtag  DW_TAG_member
    7684                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$20)
    7685                      .dwattr $C$DW$835, DW_AT_name("HRPCTL")
    7686                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_HRPCTL")
    7687                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7688                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    7689              $C$DW$836       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1804410                              PAGE  143

    7690                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$20)
    7691                      .dwattr $C$DW$836, DW_AT_name("rsvd_4")
    7692                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_rsvd_4")
    7693                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    7694                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    7695              $C$DW$837       .dwtag  DW_TAG_member
    7696                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$20)
    7697                      .dwattr $C$DW$837, DW_AT_name("TBPRDHRM")
    7698                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_TBPRDHRM")
    7699                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7700                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    7701              $C$DW$838       .dwtag  DW_TAG_member
    7702                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$20)
    7703                      .dwattr $C$DW$838, DW_AT_name("TBPRDM")
    7704                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_TBPRDM")
    7705                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    7706                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    7707              $C$DW$839       .dwtag  DW_TAG_member
    7708                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$20)
    7709                      .dwattr $C$DW$839, DW_AT_name("CMPAHRM")
    7710                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_CMPAHRM")
    7711                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7712                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    7713              $C$DW$840       .dwtag  DW_TAG_member
    7714                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$20)
    7715                      .dwattr $C$DW$840, DW_AT_name("CMPAM")
    7716                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_CMPAM")
    7717                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    7718                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    7719              $C$DW$841       .dwtag  DW_TAG_member
    7720                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$22)
    7721                      .dwattr $C$DW$841, DW_AT_name("rsvd_5")
    7722                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_rsvd_5")
    7723                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    7724                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    7725              $C$DW$842       .dwtag  DW_TAG_member
    7726                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$20)
    7727                      .dwattr $C$DW$842, DW_AT_name("DCTRIPSEL")
    7728                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_DCTRIPSEL")
    7729                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7730                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    7731              $C$DW$843       .dwtag  DW_TAG_member
    7732                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$20)
    7733                      .dwattr $C$DW$843, DW_AT_name("DCACTL")
    7734                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_DCACTL")
    7735                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    7736                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    7737              $C$DW$844       .dwtag  DW_TAG_member
    7738                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$20)
    7739                      .dwattr $C$DW$844, DW_AT_name("DCBCTL")
    7740                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_DCBCTL")
    7741                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7742                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    7743              $C$DW$845       .dwtag  DW_TAG_member
    7744                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1804410                              PAGE  144

    7745                      .dwattr $C$DW$845, DW_AT_name("DCFCTL")
    7746                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_DCFCTL")
    7747                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    7748                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    7749              $C$DW$846       .dwtag  DW_TAG_member
    7750                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$20)
    7751                      .dwattr $C$DW$846, DW_AT_name("DCCAPCTL")
    7752                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_DCCAPCTL")
    7753                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7754                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    7755              $C$DW$847       .dwtag  DW_TAG_member
    7756                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$20)
    7757                      .dwattr $C$DW$847, DW_AT_name("DCFOFFSET")
    7758                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_DCFOFFSET")
    7759                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    7760                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    7761              $C$DW$848       .dwtag  DW_TAG_member
    7762                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$20)
    7763                      .dwattr $C$DW$848, DW_AT_name("DCFOFFSETCNT")
    7764                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_DCFOFFSETCNT")
    7765                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7766                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    7767              $C$DW$849       .dwtag  DW_TAG_member
    7768                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$20)
    7769                      .dwattr $C$DW$849, DW_AT_name("DCFWINDOW")
    7770                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_DCFWINDOW")
    7771                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    7772                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    7773              $C$DW$850       .dwtag  DW_TAG_member
    7774                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$20)
    7775                      .dwattr $C$DW$850, DW_AT_name("DCFWINDOWCNT")
    7776                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_DCFWINDOWCNT")
    7777                      .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7778                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
    7779              $C$DW$851       .dwtag  DW_TAG_member
    7780                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$20)
    7781                      .dwattr $C$DW$851, DW_AT_name("DCCAP")
    7782                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_DCCAP")
    7783                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    7784                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
    7785                      .dwendtag $C$DW$T$23
    7786              
    7787              $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Obj")
    7788                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$23)
    7789                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    7790              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    7791                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
    7792                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    7793              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Handle")
    7794                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    7795                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    7796              $C$DW$852       .dwtag  DW_TAG_TI_far_type
    7797                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$33)
    7798              $C$DW$T$127     .dwtag  DW_TAG_const_type
    7799                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$852)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1804410                              PAGE  145

    7800              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    7801                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    7802              $C$DW$853       .dwtag  DW_TAG_TI_far_type
    7803                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$3)
    7804              $C$DW$T$133     .dwtag  DW_TAG_const_type
    7805                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$853)
    7806              $C$DW$T$4       .dwtag  DW_TAG_base_type
    7807                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    7808                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    7809                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    7810              $C$DW$T$5       .dwtag  DW_TAG_base_type
    7811                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    7812                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    7813                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    7814              $C$DW$T$6       .dwtag  DW_TAG_base_type
    7815                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    7816                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    7817                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    7818              $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    7819                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$6)
    7820                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    7821              $C$DW$854       .dwtag  DW_TAG_TI_far_type
    7822                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$155)
    7823              $C$DW$T$156     .dwtag  DW_TAG_const_type
    7824                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$854)
    7825              $C$DW$T$7       .dwtag  DW_TAG_base_type
    7826                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    7827                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    7828                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    7829              $C$DW$T$8       .dwtag  DW_TAG_base_type
    7830                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    7831                      .dwattr $C$DW$T$8, DW_AT_name("short")
    7832                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    7833              $C$DW$T$9       .dwtag  DW_TAG_base_type
    7834                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    7835                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
