TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Mon Jun 19 18:10:37 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_d_pu")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_d_pu")

    2882              $C$DW$334       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    2883              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    2884              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    2885              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    2886              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    2887              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    2888              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    2889              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    2890              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    2891              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    2892              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    2893              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    2894              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    2895              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    2896              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    2897              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    2898              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    2899              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    2900              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    2901              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    2902              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    2903              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    2904              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    2905              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    2906              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    2907              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    2908              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    2909                      .dwendtag $C$DW$T$74
    2910              
    2911              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    2912                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2913                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2914              $C$DW$361       .dwtag  DW_TAG_TI_far_type
    2915                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$75)
    2916              $C$DW$T$77      .dwtag  DW_TAG_const_type
    2917                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$361)
    2918              
    2919              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    2920                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    2921              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    2922              $C$DW$363       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    2923              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    2924                      .dwendtag $C$DW$T$82
    2925              
    2926              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    2927                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    2928                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   59

    2929              $C$DW$365       .dwtag  DW_TAG_TI_far_type
    2930                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$83)
    2931              $C$DW$T$84      .dwtag  DW_TAG_const_type
    2932                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$365)
    2933              
    2934              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2935                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    2936                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    2937              $C$DW$366       .dwtag  DW_TAG_member
    2938                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    2939                      .dwattr $C$DW$366, DW_AT_name("alpha_sf")
    2940                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_alpha_sf")
    2941                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2942                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2943              $C$DW$367       .dwtag  DW_TAG_member
    2944                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2945                      .dwattr $C$DW$367, DW_AT_name("beta_sf")
    2946                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_beta_sf")
    2947                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2948                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2949              $C$DW$368       .dwtag  DW_TAG_member
    2950                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$22)
    2951                      .dwattr $C$DW$368, DW_AT_name("numSensors")
    2952                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_numSensors")
    2953                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2954                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2955                      .dwendtag $C$DW$T$23
    2956              
    2957              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    2958                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    2959                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2960              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2961                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    2962                      .dwattr $C$DW$T$29, DW_AT_address_class(0x16)
    2963              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    2964                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2965                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2966              
    2967              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2968                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    2969                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    2970              $C$DW$369       .dwtag  DW_TAG_member
    2971                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$24)
    2972                      .dwattr $C$DW$369, DW_AT_name("version")
    2973                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_version")
    2974                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2975                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2976              $C$DW$370       .dwtag  DW_TAG_member
    2977                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$26)
    2978                      .dwattr $C$DW$370, DW_AT_name("state")
    2979                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_state")
    2980                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2981                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2982              $C$DW$371       .dwtag  DW_TAG_member
    2983                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   60

    2984                      .dwattr $C$DW$371, DW_AT_name("prevState")
    2985                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_prevState")
    2986                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2987                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2988              $C$DW$372       .dwtag  DW_TAG_member
    2989                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$28)
    2990                      .dwattr $C$DW$372, DW_AT_name("errorCode")
    2991                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_errorCode")
    2992                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2993                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2994              $C$DW$373       .dwtag  DW_TAG_member
    2995                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$30)
    2996                      .dwattr $C$DW$373, DW_AT_name("clarkeHandle_I")
    2997                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_clarkeHandle_I")
    2998                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2999                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3000              $C$DW$374       .dwtag  DW_TAG_member
    3001                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$31)
    3002                      .dwattr $C$DW$374, DW_AT_name("clarke_I")
    3003                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_clarke_I")
    3004                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3005                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3006              $C$DW$375       .dwtag  DW_TAG_member
    3007                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$30)
    3008                      .dwattr $C$DW$375, DW_AT_name("clarkeHandle_V")
    3009                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3010                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3011                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3012              $C$DW$376       .dwtag  DW_TAG_member
    3013                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$31)
    3014                      .dwattr $C$DW$376, DW_AT_name("clarke_V")
    3015                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_clarke_V")
    3016                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3017                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3018              $C$DW$377       .dwtag  DW_TAG_member
    3019                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$33)
    3020                      .dwattr $C$DW$377, DW_AT_name("estHandle")
    3021                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_estHandle")
    3022                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3023                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3024              $C$DW$378       .dwtag  DW_TAG_member
    3025                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$35)
    3026                      .dwattr $C$DW$378, DW_AT_name("parkHandle")
    3027                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_parkHandle")
    3028                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3029                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3030              $C$DW$379       .dwtag  DW_TAG_member
    3031                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$36)
    3032                      .dwattr $C$DW$379, DW_AT_name("park")
    3033                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_park")
    3034                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3035                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3036              $C$DW$380       .dwtag  DW_TAG_member
    3037                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$38)
    3038                      .dwattr $C$DW$380, DW_AT_name("pidHandle_Id")
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   61

    3039                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_pidHandle_Id")
    3040                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3041                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3042              $C$DW$381       .dwtag  DW_TAG_member
    3043                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$39)
    3044                      .dwattr $C$DW$381, DW_AT_name("pid_Id")
    3045                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_pid_Id")
    3046                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3047                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3048              $C$DW$382       .dwtag  DW_TAG_member
    3049                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$38)
    3050                      .dwattr $C$DW$382, DW_AT_name("pidHandle_Iq")
    3051                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3052                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3053                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3054              $C$DW$383       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$39)
    3056                      .dwattr $C$DW$383, DW_AT_name("pid_Iq")
    3057                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_pid_Iq")
    3058                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3059                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3060              $C$DW$384       .dwtag  DW_TAG_member
    3061                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$38)
    3062                      .dwattr $C$DW$384, DW_AT_name("pidHandle_spd")
    3063                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_pidHandle_spd")
    3064                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3065                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3066              $C$DW$385       .dwtag  DW_TAG_member
    3067                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$39)
    3068                      .dwattr $C$DW$385, DW_AT_name("pid_spd")
    3069                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_pid_spd")
    3070                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3071                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3072              $C$DW$386       .dwtag  DW_TAG_member
    3073                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$41)
    3074                      .dwattr $C$DW$386, DW_AT_name("iparkHandle")
    3075                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_iparkHandle")
    3076                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3077                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3078              $C$DW$387       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$42)
    3080                      .dwattr $C$DW$387, DW_AT_name("ipark")
    3081                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_ipark")
    3082                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3083                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3084              $C$DW$388       .dwtag  DW_TAG_member
    3085                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$44)
    3086                      .dwattr $C$DW$388, DW_AT_name("svgenHandle")
    3087                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_svgenHandle")
    3088                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3089                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3090              $C$DW$389       .dwtag  DW_TAG_member
    3091                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$45)
    3092                      .dwattr $C$DW$389, DW_AT_name("svgen")
    3093                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_svgen")
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   62

    3094                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3095                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3096              $C$DW$390       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$47)
    3098                      .dwattr $C$DW$390, DW_AT_name("trajHandle_Id")
    3099                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_trajHandle_Id")
    3100                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3101                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3102              $C$DW$391       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$48)
    3104                      .dwattr $C$DW$391, DW_AT_name("traj_Id")
    3105                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_traj_Id")
    3106                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3107                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3108              $C$DW$392       .dwtag  DW_TAG_member
    3109                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$47)
    3110                      .dwattr $C$DW$392, DW_AT_name("trajHandle_spd")
    3111                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_trajHandle_spd")
    3112                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3113                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3114              $C$DW$393       .dwtag  DW_TAG_member
    3115                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$48)
    3116                      .dwattr $C$DW$393, DW_AT_name("traj_spd")
    3117                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_traj_spd")
    3118                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3119                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3120              $C$DW$394       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$47)
    3122                      .dwattr $C$DW$394, DW_AT_name("trajHandle_spdMax")
    3123                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3124                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3125                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3126              $C$DW$395       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$48)
    3128                      .dwattr $C$DW$395, DW_AT_name("traj_spdMax")
    3129                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_traj_spdMax")
    3130                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3131                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3132              $C$DW$396       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$49)
    3134                      .dwattr $C$DW$396, DW_AT_name("motorParams")
    3135                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_motorParams")
    3136                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3137                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3138              $C$DW$397       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$52)
    3140                      .dwattr $C$DW$397, DW_AT_name("waitTimes")
    3141                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_waitTimes")
    3142                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3143                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3144              $C$DW$398       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$51)
    3146                      .dwattr $C$DW$398, DW_AT_name("counter_state")
    3147                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_counter_state")
    3148                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   63

    3149                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3150              $C$DW$399       .dwtag  DW_TAG_member
    3151                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$53)
    3152                      .dwattr $C$DW$399, DW_AT_name("numIsrTicksPerCtrlTick")
    3153                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3154                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3155                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3156              $C$DW$400       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$53)
    3158                      .dwattr $C$DW$400, DW_AT_name("numCtrlTicksPerCurrentTick")
    3159                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3160                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3161                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3162              $C$DW$401       .dwtag  DW_TAG_member
    3163                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$53)
    3164                      .dwattr $C$DW$401, DW_AT_name("numCtrlTicksPerSpeedTick")
    3165                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3166                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3167                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3168              $C$DW$402       .dwtag  DW_TAG_member
    3169                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$53)
    3170                      .dwattr $C$DW$402, DW_AT_name("numCtrlTicksPerTrajTick")
    3171                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3172                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3173                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3174              $C$DW$403       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$51)
    3176                      .dwattr $C$DW$403, DW_AT_name("ctrlFreq_Hz")
    3177                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3178                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3179                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3180              $C$DW$404       .dwtag  DW_TAG_member
    3181                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$51)
    3182                      .dwattr $C$DW$404, DW_AT_name("trajFreq_Hz")
    3183                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3184                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3185                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3186              $C$DW$405       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3188                      .dwattr $C$DW$405, DW_AT_name("trajPeriod_sec")
    3189                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3190                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3191                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3192              $C$DW$406       .dwtag  DW_TAG_member
    3193                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$54)
    3194                      .dwattr $C$DW$406, DW_AT_name("ctrlPeriod_sec")
    3195                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3196                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3197                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3198              $C$DW$407       .dwtag  DW_TAG_member
    3199                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3200                      .dwattr $C$DW$407, DW_AT_name("maxVsMag_pu")
    3201                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3202                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3203                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   64

    3204              $C$DW$408       .dwtag  DW_TAG_member
    3205                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$55)
    3206                      .dwattr $C$DW$408, DW_AT_name("Iab_in")
    3207                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Iab_in")
    3208                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3209                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3210              $C$DW$409       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$55)
    3212                      .dwattr $C$DW$409, DW_AT_name("Iab_filt")
    3213                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Iab_filt")
    3214                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3215                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3216              $C$DW$410       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$55)
    3218                      .dwattr $C$DW$410, DW_AT_name("Idq_in")
    3219                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Idq_in")
    3220                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3221                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3222              $C$DW$411       .dwtag  DW_TAG_member
    3223                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$55)
    3224                      .dwattr $C$DW$411, DW_AT_name("Vab_in")
    3225                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Vab_in")
    3226                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3227                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3228              $C$DW$412       .dwtag  DW_TAG_member
    3229                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    3230                      .dwattr $C$DW$412, DW_AT_name("spd_out")
    3231                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_spd_out")
    3232                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3233                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3234              $C$DW$413       .dwtag  DW_TAG_member
    3235                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$55)
    3236                      .dwattr $C$DW$413, DW_AT_name("Vab_out")
    3237                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Vab_out")
    3238                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3239                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3240              $C$DW$414       .dwtag  DW_TAG_member
    3241                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$55)
    3242                      .dwattr $C$DW$414, DW_AT_name("Vdq_out")
    3243                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Vdq_out")
    3244                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3245                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3246              $C$DW$415       .dwtag  DW_TAG_member
    3247                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$54)
    3248                      .dwattr $C$DW$415, DW_AT_name("Rhf")
    3249                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Rhf")
    3250                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3251                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3252              $C$DW$416       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$54)
    3254                      .dwattr $C$DW$416, DW_AT_name("Lhf")
    3255                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Lhf")
    3256                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3257                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3258              $C$DW$417       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   65

    3259                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$54)
    3260                      .dwattr $C$DW$417, DW_AT_name("RoverL")
    3261                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_RoverL")
    3262                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3263                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3264              $C$DW$418       .dwtag  DW_TAG_member
    3265                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    3266                      .dwattr $C$DW$418, DW_AT_name("Kp_Id")
    3267                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Kp_Id")
    3268                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3269                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3270              $C$DW$419       .dwtag  DW_TAG_member
    3271                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    3272                      .dwattr $C$DW$419, DW_AT_name("Kp_Iq")
    3273                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Kp_Iq")
    3274                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3275                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3276              $C$DW$420       .dwtag  DW_TAG_member
    3277                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    3278                      .dwattr $C$DW$420, DW_AT_name("Kp_spd")
    3279                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Kp_spd")
    3280                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3281                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3282              $C$DW$421       .dwtag  DW_TAG_member
    3283                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    3284                      .dwattr $C$DW$421, DW_AT_name("Ki_Id")
    3285                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Ki_Id")
    3286                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3287                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3288              $C$DW$422       .dwtag  DW_TAG_member
    3289                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    3290                      .dwattr $C$DW$422, DW_AT_name("Ki_Iq")
    3291                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Ki_Iq")
    3292                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3293                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3294              $C$DW$423       .dwtag  DW_TAG_member
    3295                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3296                      .dwattr $C$DW$423, DW_AT_name("Ki_spd")
    3297                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Ki_spd")
    3298                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3299                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3300              $C$DW$424       .dwtag  DW_TAG_member
    3301                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3302                      .dwattr $C$DW$424, DW_AT_name("Kd_Id")
    3303                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_Kd_Id")
    3304                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3305                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3306              $C$DW$425       .dwtag  DW_TAG_member
    3307                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3308                      .dwattr $C$DW$425, DW_AT_name("Kd_Iq")
    3309                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_Kd_Iq")
    3310                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3311                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3312              $C$DW$426       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   66

    3314                      .dwattr $C$DW$426, DW_AT_name("Kd_spd")
    3315                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Kd_spd")
    3316                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3317                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3318              $C$DW$427       .dwtag  DW_TAG_member
    3319                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    3320                      .dwattr $C$DW$427, DW_AT_name("Ui_Id")
    3321                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Ui_Id")
    3322                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3323                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3324              $C$DW$428       .dwtag  DW_TAG_member
    3325                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    3326                      .dwattr $C$DW$428, DW_AT_name("Ui_Iq")
    3327                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Ui_Iq")
    3328                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3329                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3330              $C$DW$429       .dwtag  DW_TAG_member
    3331                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    3332                      .dwattr $C$DW$429, DW_AT_name("Ui_spd")
    3333                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Ui_spd")
    3334                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3335                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3336              $C$DW$430       .dwtag  DW_TAG_member
    3337                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$55)
    3338                      .dwattr $C$DW$430, DW_AT_name("Idq_ref")
    3339                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_Idq_ref")
    3340                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3341                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3342              $C$DW$431       .dwtag  DW_TAG_member
    3343                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3344                      .dwattr $C$DW$431, DW_AT_name("IdRated")
    3345                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_IdRated")
    3346                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3347                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3348              $C$DW$432       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    3350                      .dwattr $C$DW$432, DW_AT_name("spd_ref")
    3351                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_spd_ref")
    3352                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3353                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3354              $C$DW$433       .dwtag  DW_TAG_member
    3355                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    3356                      .dwattr $C$DW$433, DW_AT_name("spd_max")
    3357                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_spd_max")
    3358                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3359                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3360              $C$DW$434       .dwtag  DW_TAG_member
    3361                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$53)
    3362                      .dwattr $C$DW$434, DW_AT_name("counter_current")
    3363                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_counter_current")
    3364                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3365                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3366              $C$DW$435       .dwtag  DW_TAG_member
    3367                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$53)
    3368                      .dwattr $C$DW$435, DW_AT_name("counter_isr")
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   67

    3369                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_counter_isr")
    3370                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3371                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3372              $C$DW$436       .dwtag  DW_TAG_member
    3373                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$53)
    3374                      .dwattr $C$DW$436, DW_AT_name("counter_speed")
    3375                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_counter_speed")
    3376                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3377                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3378              $C$DW$437       .dwtag  DW_TAG_member
    3379                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$53)
    3380                      .dwattr $C$DW$437, DW_AT_name("counter_traj")
    3381                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_counter_traj")
    3382                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3383                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3384              $C$DW$438       .dwtag  DW_TAG_member
    3385                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$56)
    3386                      .dwattr $C$DW$438, DW_AT_name("flag_enableCtrl")
    3387                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3388                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3389                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3390              $C$DW$439       .dwtag  DW_TAG_member
    3391                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    3392                      .dwattr $C$DW$439, DW_AT_name("flag_enableDcBusComp")
    3393                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3394                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3395                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3396              $C$DW$440       .dwtag  DW_TAG_member
    3397                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$56)
    3398                      .dwattr $C$DW$440, DW_AT_name("flag_enablePowerWarp")
    3399                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3400                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3401                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3402              $C$DW$441       .dwtag  DW_TAG_member
    3403                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$56)
    3404                      .dwattr $C$DW$441, DW_AT_name("flag_enableOffset")
    3405                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_flag_enableOffset")
    3406                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3407                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3408              $C$DW$442       .dwtag  DW_TAG_member
    3409                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$56)
    3410                      .dwattr $C$DW$442, DW_AT_name("flag_enableSpeedCtrl")
    3411                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3412                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3413                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3414              $C$DW$443       .dwtag  DW_TAG_member
    3415                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    3416                      .dwattr $C$DW$443, DW_AT_name("flag_enableUserMotorParams")
    3417                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3418                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3419                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3420              $C$DW$444       .dwtag  DW_TAG_member
    3421                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$55)
    3422                      .dwattr $C$DW$444, DW_AT_name("Idq_offset_pu")
    3423                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_Idq_offset_pu")
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   68

    3424                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3425                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3426              $C$DW$445       .dwtag  DW_TAG_member
    3427                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$55)
    3428                      .dwattr $C$DW$445, DW_AT_name("Vdq_offset_pu")
    3429                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3430                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3431                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3432              $C$DW$446       .dwtag  DW_TAG_member
    3433                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    3434                      .dwattr $C$DW$446, DW_AT_name("angle_pu")
    3435                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_angle_pu")
    3436                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3437                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3438              $C$DW$447       .dwtag  DW_TAG_member
    3439                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
    3440                      .dwattr $C$DW$447, DW_AT_name("speed_ref_pu")
    3441                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_speed_ref_pu")
    3442                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3443                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3444              $C$DW$448       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
    3446                      .dwattr $C$DW$448, DW_AT_name("speed_fb_pu")
    3447                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_speed_fb_pu")
    3448                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3449                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3450              $C$DW$449       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    3452                      .dwattr $C$DW$449, DW_AT_name("speed_outMax_pu")
    3453                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3454                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3455                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3456              $C$DW$450       .dwtag  DW_TAG_member
    3457                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$56)
    3458                      .dwattr $C$DW$450, DW_AT_name("flag_enableCurrentCtrl")
    3459                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3460                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3461                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3462                      .dwendtag $C$DW$T$57
    3463              
    3464              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3465                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    3466                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3467              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3468                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    3469                      .dwattr $C$DW$T$86, DW_AT_address_class(0x16)
    3470              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3471                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3472                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3473              $C$DW$451       .dwtag  DW_TAG_TI_far_type
    3474                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$87)
    3475              $C$DW$T$88      .dwtag  DW_TAG_const_type
    3476                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$451)
    3477              
    3478              $C$DW$T$60      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   69

    3479                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3480                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3481              $C$DW$452       .dwtag  DW_TAG_member
    3482                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$21)
    3483                      .dwattr $C$DW$452, DW_AT_name("rsvd")
    3484                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_rsvd")
    3485                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3486                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3487              $C$DW$453       .dwtag  DW_TAG_member
    3488                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$59)
    3489                      .dwattr $C$DW$453, DW_AT_name("targetProc")
    3490                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_targetProc")
    3491                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3492                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3493              $C$DW$454       .dwtag  DW_TAG_member
    3494                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$21)
    3495                      .dwattr $C$DW$454, DW_AT_name("major")
    3496                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_major")
    3497                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3498                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3499              $C$DW$455       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$21)
    3501                      .dwattr $C$DW$455, DW_AT_name("minor")
    3502                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_minor")
    3503                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3504                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3505                      .dwendtag $C$DW$T$60
    3506              
    3507              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3508                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    3509                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3510              
    3511              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3512                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3513                      .dwattr $C$DW$T$19, DW_AT_declaration
    3514                      .dwendtag $C$DW$T$19
    3515              
    3516              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3517                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3518                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    3519              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3520                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3521                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3522              
    3523              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3524                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3525                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3526              $C$DW$456       .dwtag  DW_TAG_member
    3527                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    3528                      .dwattr $C$DW$456, DW_AT_name("sinTh")
    3529                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_sinTh")
    3530                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3531                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3532              $C$DW$457       .dwtag  DW_TAG_member
    3533                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   70

    3534                      .dwattr $C$DW$457, DW_AT_name("cosTh")
    3535                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_cosTh")
    3536                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3537                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3538                      .dwendtag $C$DW$T$61
    3539              
    3540              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3541                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3542                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3543              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3544                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3545                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    3546              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3547                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3548                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3549              
    3550              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3551                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3552                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3553              $C$DW$458       .dwtag  DW_TAG_member
    3554                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$62)
    3555                      .dwattr $C$DW$458, DW_AT_name("value")
    3556                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_value")
    3557                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3558                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3559                      .dwendtag $C$DW$T$63
    3560              
    3561              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3562                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3563                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3564              
    3565              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3566                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    3567                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3568              $C$DW$459       .dwtag  DW_TAG_member
    3569                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$65)
    3570                      .dwattr $C$DW$459, DW_AT_name("type")
    3571                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_type")
    3572                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3573                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3574              $C$DW$460       .dwtag  DW_TAG_member
    3575                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$53)
    3576                      .dwattr $C$DW$460, DW_AT_name("numPolePairs")
    3577                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_numPolePairs")
    3578                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3579                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3580              $C$DW$461       .dwtag  DW_TAG_member
    3581                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$54)
    3582                      .dwattr $C$DW$461, DW_AT_name("Lr_H")
    3583                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_Lr_H")
    3584                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3585                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3586              $C$DW$462       .dwtag  DW_TAG_member
    3587                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$54)
    3588                      .dwattr $C$DW$462, DW_AT_name("Ls_d_H")
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   71

    3589                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_Ls_d_H")
    3590                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3591                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3592              $C$DW$463       .dwtag  DW_TAG_member
    3593                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$54)
    3594                      .dwattr $C$DW$463, DW_AT_name("Ls_q_H")
    3595                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_Ls_q_H")
    3596                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3597                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3598              $C$DW$464       .dwtag  DW_TAG_member
    3599                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$54)
    3600                      .dwattr $C$DW$464, DW_AT_name("Rr_Ohm")
    3601                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_Rr_Ohm")
    3602                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3603                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3604              $C$DW$465       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    3606                      .dwattr $C$DW$465, DW_AT_name("Rs_Ohm")
    3607                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_Rs_Ohm")
    3608                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3609                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3610              $C$DW$466       .dwtag  DW_TAG_member
    3611                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    3612                      .dwattr $C$DW$466, DW_AT_name("ratedFlux_VpHz")
    3613                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3614                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3615                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3616                      .dwendtag $C$DW$T$66
    3617              
    3618              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    3619                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3620                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3621              
    3622              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3623                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3624                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3625              $C$DW$467       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$20)
    3627                      .dwattr $C$DW$467, DW_AT_name("sinTh")
    3628                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_sinTh")
    3629                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3630                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3631              $C$DW$468       .dwtag  DW_TAG_member
    3632                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    3633                      .dwattr $C$DW$468, DW_AT_name("cosTh")
    3634                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_cosTh")
    3635                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3636                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3637                      .dwendtag $C$DW$T$67
    3638              
    3639              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3640                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3641                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3642              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3643                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   72

    3644                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
    3645              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3646                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3647                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3648              
    3649              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3650                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3651                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3652              $C$DW$469       .dwtag  DW_TAG_member
    3653                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    3654                      .dwattr $C$DW$469, DW_AT_name("Kp")
    3655                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_Kp")
    3656                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3657                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3658              $C$DW$470       .dwtag  DW_TAG_member
    3659                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
    3660                      .dwattr $C$DW$470, DW_AT_name("Ki")
    3661                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_Ki")
    3662                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3663                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3664              $C$DW$471       .dwtag  DW_TAG_member
    3665                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    3666                      .dwattr $C$DW$471, DW_AT_name("Kd")
    3667                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_Kd")
    3668                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3669                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3670              $C$DW$472       .dwtag  DW_TAG_member
    3671                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    3672                      .dwattr $C$DW$472, DW_AT_name("Ui")
    3673                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_Ui")
    3674                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3675                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3676              $C$DW$473       .dwtag  DW_TAG_member
    3677                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    3678                      .dwattr $C$DW$473, DW_AT_name("refValue")
    3679                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_refValue")
    3680                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3681                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3682              $C$DW$474       .dwtag  DW_TAG_member
    3683                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    3684                      .dwattr $C$DW$474, DW_AT_name("fbackValue")
    3685                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_fbackValue")
    3686                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3687                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3688              $C$DW$475       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    3690                      .dwattr $C$DW$475, DW_AT_name("outMin")
    3691                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_outMin")
    3692                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3693                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3694              $C$DW$476       .dwtag  DW_TAG_member
    3695                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
    3696                      .dwattr $C$DW$476, DW_AT_name("outMax")
    3697                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_outMax")
    3698                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   73

    3699                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3700                      .dwendtag $C$DW$T$68
    3701              
    3702              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3703                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3704                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3705              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3706                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3707                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    3708              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    3709                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3710                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3711              
    3712              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3713                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3714                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3715              $C$DW$477       .dwtag  DW_TAG_member
    3716                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    3717                      .dwattr $C$DW$477, DW_AT_name("maxModulation")
    3718                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_maxModulation")
    3719                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3720                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3721                      .dwendtag $C$DW$T$69
    3722              
    3723              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3724                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3725                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3726              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3727                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    3728                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    3729              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3730                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3731                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3732              
    3733              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3734                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3735                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3736              $C$DW$478       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    3738                      .dwattr $C$DW$478, DW_AT_name("targetValue")
    3739                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_targetValue")
    3740                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3741                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3742              $C$DW$479       .dwtag  DW_TAG_member
    3743                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    3744                      .dwattr $C$DW$479, DW_AT_name("intValue")
    3745                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_intValue")
    3746                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3747                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3748              $C$DW$480       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    3750                      .dwattr $C$DW$480, DW_AT_name("minValue")
    3751                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_minValue")
    3752                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3753                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   74

    3754              $C$DW$481       .dwtag  DW_TAG_member
    3755                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    3756                      .dwattr $C$DW$481, DW_AT_name("maxValue")
    3757                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_maxValue")
    3758                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3759                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3760              $C$DW$482       .dwtag  DW_TAG_member
    3761                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    3762                      .dwattr $C$DW$482, DW_AT_name("maxDelta")
    3763                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_maxDelta")
    3764                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3765                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3766                      .dwendtag $C$DW$T$70
    3767              
    3768              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3769                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3770                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3771              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3772                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3773                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3774              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3775                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3776                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3777              
    3778              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3779                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    3780                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    3781              $C$DW$483       .dwtag  DW_TAG_member
    3782                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$54)
    3783                      .dwattr $C$DW$483, DW_AT_name("iqFullScaleCurrent_A")
    3784                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3785                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3786                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3787              $C$DW$484       .dwtag  DW_TAG_member
    3788                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    3789                      .dwattr $C$DW$484, DW_AT_name("iqFullScaleVoltage_V")
    3790                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3791                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3792                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3793              $C$DW$485       .dwtag  DW_TAG_member
    3794                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$54)
    3795                      .dwattr $C$DW$485, DW_AT_name("iqFullScaleFreq_Hz")
    3796                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3797                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3798                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3799              $C$DW$486       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$53)
    3801                      .dwattr $C$DW$486, DW_AT_name("numIsrTicksPerCtrlTick")
    3802                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3803                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3804                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3805              $C$DW$487       .dwtag  DW_TAG_member
    3806                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$53)
    3807                      .dwattr $C$DW$487, DW_AT_name("numCtrlTicksPerCurrentTick")
    3808                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   75

    3809                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3810                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3811              $C$DW$488       .dwtag  DW_TAG_member
    3812                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$53)
    3813                      .dwattr $C$DW$488, DW_AT_name("numCtrlTicksPerEstTick")
    3814                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3815                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3816                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3817              $C$DW$489       .dwtag  DW_TAG_member
    3818                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$53)
    3819                      .dwattr $C$DW$489, DW_AT_name("numCtrlTicksPerSpeedTick")
    3820                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3821                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3822                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3823              $C$DW$490       .dwtag  DW_TAG_member
    3824                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$53)
    3825                      .dwattr $C$DW$490, DW_AT_name("numCtrlTicksPerTrajTick")
    3826                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3827                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3828                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3829              $C$DW$491       .dwtag  DW_TAG_member
    3830                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$22)
    3831                      .dwattr $C$DW$491, DW_AT_name("numCurrentSensors")
    3832                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_numCurrentSensors")
    3833                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3834                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3835              $C$DW$492       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$22)
    3837                      .dwattr $C$DW$492, DW_AT_name("numVoltageSensors")
    3838                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_numVoltageSensors")
    3839                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3840                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3841              $C$DW$493       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$54)
    3843                      .dwattr $C$DW$493, DW_AT_name("offsetPole_rps")
    3844                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_offsetPole_rps")
    3845                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3846                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3847              $C$DW$494       .dwtag  DW_TAG_member
    3848                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$54)
    3849                      .dwattr $C$DW$494, DW_AT_name("fluxPole_rps")
    3850                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_fluxPole_rps")
    3851                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3852                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3853              $C$DW$495       .dwtag  DW_TAG_member
    3854                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$54)
    3855                      .dwattr $C$DW$495, DW_AT_name("zeroSpeedLimit")
    3856                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3857                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3858                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3859              $C$DW$496       .dwtag  DW_TAG_member
    3860                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
    3861                      .dwattr $C$DW$496, DW_AT_name("forceAngleFreq_Hz")
    3862                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3863                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   76

    3864                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3865              $C$DW$497       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$54)
    3867                      .dwattr $C$DW$497, DW_AT_name("maxAccel_Hzps")
    3868                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3869                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3870                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3871              $C$DW$498       .dwtag  DW_TAG_member
    3872                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    3873                      .dwattr $C$DW$498, DW_AT_name("maxAccel_est_Hzps")
    3874                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3875                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3876                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3877              $C$DW$499       .dwtag  DW_TAG_member
    3878                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    3879                      .dwattr $C$DW$499, DW_AT_name("directionPole_rps")
    3880                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_directionPole_rps")
    3881                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3882                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3883              $C$DW$500       .dwtag  DW_TAG_member
    3884                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    3885                      .dwattr $C$DW$500, DW_AT_name("speedPole_rps")
    3886                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_speedPole_rps")
    3887                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3888                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3889              $C$DW$501       .dwtag  DW_TAG_member
    3890                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    3891                      .dwattr $C$DW$501, DW_AT_name("dcBusPole_rps")
    3892                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_dcBusPole_rps")
    3893                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3894                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3895              $C$DW$502       .dwtag  DW_TAG_member
    3896                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$54)
    3897                      .dwattr $C$DW$502, DW_AT_name("fluxFraction")
    3898                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_fluxFraction")
    3899                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3900                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3901              $C$DW$503       .dwtag  DW_TAG_member
    3902                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$54)
    3903                      .dwattr $C$DW$503, DW_AT_name("indEst_speedMaxFraction")
    3904                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    3905                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3906                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3907              $C$DW$504       .dwtag  DW_TAG_member
    3908                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$54)
    3909                      .dwattr $C$DW$504, DW_AT_name("powerWarpGain")
    3910                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_powerWarpGain")
    3911                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3912                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3913              $C$DW$505       .dwtag  DW_TAG_member
    3914                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$53)
    3915                      .dwattr $C$DW$505, DW_AT_name("systemFreq_MHz")
    3916                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_systemFreq_MHz")
    3917                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3918                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   77

    3919              $C$DW$506       .dwtag  DW_TAG_member
    3920                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$54)
    3921                      .dwattr $C$DW$506, DW_AT_name("pwmPeriod_usec")
    3922                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    3923                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3924                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3925              $C$DW$507       .dwtag  DW_TAG_member
    3926                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$54)
    3927                      .dwattr $C$DW$507, DW_AT_name("voltage_sf")
    3928                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_voltage_sf")
    3929                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3930                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3931              $C$DW$508       .dwtag  DW_TAG_member
    3932                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$54)
    3933                      .dwattr $C$DW$508, DW_AT_name("current_sf")
    3934                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_current_sf")
    3935                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3936                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3937              $C$DW$509       .dwtag  DW_TAG_member
    3938                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$54)
    3939                      .dwattr $C$DW$509, DW_AT_name("voltageFilterPole_rps")
    3940                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    3941                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3942                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3943              $C$DW$510       .dwtag  DW_TAG_member
    3944                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$54)
    3945                      .dwattr $C$DW$510, DW_AT_name("maxVsMag_pu")
    3946                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3947                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3948                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3949              $C$DW$511       .dwtag  DW_TAG_member
    3950                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$54)
    3951                      .dwattr $C$DW$511, DW_AT_name("estKappa")
    3952                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_estKappa")
    3953                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3954                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3955              $C$DW$512       .dwtag  DW_TAG_member
    3956                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$65)
    3957                      .dwattr $C$DW$512, DW_AT_name("motor_type")
    3958                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_motor_type")
    3959                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3960                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3961              $C$DW$513       .dwtag  DW_TAG_member
    3962                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$53)
    3963                      .dwattr $C$DW$513, DW_AT_name("motor_numPolePairs")
    3964                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_motor_numPolePairs")
    3965                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    3966                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3967              $C$DW$514       .dwtag  DW_TAG_member
    3968                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$54)
    3969                      .dwattr $C$DW$514, DW_AT_name("motor_ratedFlux")
    3970                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_motor_ratedFlux")
    3971                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3972                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3973              $C$DW$515       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   78

    3974                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$54)
    3975                      .dwattr $C$DW$515, DW_AT_name("motor_Rr")
    3976                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_motor_Rr")
    3977                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3978                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3979              $C$DW$516       .dwtag  DW_TAG_member
    3980                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$54)
    3981                      .dwattr $C$DW$516, DW_AT_name("motor_Rs")
    3982                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_motor_Rs")
    3983                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3984                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3985              $C$DW$517       .dwtag  DW_TAG_member
    3986                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$54)
    3987                      .dwattr $C$DW$517, DW_AT_name("motor_Ls_d")
    3988                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_motor_Ls_d")
    3989                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3990                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3991              $C$DW$518       .dwtag  DW_TAG_member
    3992                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$54)
    3993                      .dwattr $C$DW$518, DW_AT_name("motor_Ls_q")
    3994                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_motor_Ls_q")
    3995                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3996                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3997              $C$DW$519       .dwtag  DW_TAG_member
    3998                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$54)
    3999                      .dwattr $C$DW$519, DW_AT_name("maxCurrent")
    4000                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_maxCurrent")
    4001                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4002                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    4003              $C$DW$520       .dwtag  DW_TAG_member
    4004                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$54)
    4005                      .dwattr $C$DW$520, DW_AT_name("maxCurrent_resEst")
    4006                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    4007                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4008                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4009              $C$DW$521       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$54)
    4011                      .dwattr $C$DW$521, DW_AT_name("maxCurrent_indEst")
    4012                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    4013                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4014                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4015              $C$DW$522       .dwtag  DW_TAG_member
    4016                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$54)
    4017                      .dwattr $C$DW$522, DW_AT_name("maxCurrentSlope")
    4018                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_maxCurrentSlope")
    4019                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4020                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4021              $C$DW$523       .dwtag  DW_TAG_member
    4022                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$54)
    4023                      .dwattr $C$DW$523, DW_AT_name("maxCurrentSlope_powerWarp")
    4024                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    4025                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4026                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4027              $C$DW$524       .dwtag  DW_TAG_member
    4028                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.2.5 Mon Jun 19 18:10:37 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1992810                              PAGE   79

    4029                      .dwattr $C$DW$524, DW_AT_name("IdRated")
    4030                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_IdRated")
    4031                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4032                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4033              $C$DW$525       .dwtag  DW_TAG_member
    4034                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$54)
    4035                      .dwattr $C$DW$525, DW_AT_name("IdRatedFraction_indEst")
    4036                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    4037                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4038                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4039              $C$DW$526       .dwtag  DW_TAG_member
    4040                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$54)
    4041                      .dwattr $C$DW$526, DW_AT_name("IdRatedFraction_ratedFlux")
    4042                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    4043                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4044                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4045              $C$DW$527       .dwtag  DW_TAG_member
    4046                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$54)
    4047                      .dwattr $C$DW$527, DW_AT_name("IdRated_delta")
    4048                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_IdRated_delta")
    4049                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4050                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4051              $C$DW$528       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$54)
    4053                      .dwattr $C$DW$528, DW_AT_name("fluxEstFreq_Hz")
    4054                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    4055                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    4056                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4057              $C$DW$529       .dwtag  DW_TAG_member
    4058                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$52)
    4059                      .dwattr $C$DW$529, DW_AT_name("ctrlWaitTime")
    4060                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_ctrlWaitTime")
    4061                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4062                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4063              $C$DW$530       .dwtag  DW_TAG_member
    4064                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$71)
    4065                      .dwattr $C$DW$530, DW_AT_name("estWaitTime")
    4066                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_estWaitTime")
    4067                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4068                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4069              $C$DW$531       .dwtag  DW_TAG_member
    4070                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$72)
    4071                      .dwattr $C$DW$531, DW_AT_name("FluxWaitTime")
