TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1294410                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 19:54:48 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/modules/offset/src/32b/offset.c
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("FILTER_FO_setNumCoeffs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_FILTER_FO_setNumCoeffs")

     443                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$35)
     444                      .dwattr $C$DW$48, DW_AT_location[DW_OP_reg12]
     445              
     446              ;***************************************************************
     447              ;* FNAME: _OFFSET_getBeta               FR SIZE:   6           *
     448              ;*                                                             *
     449              ;* FUNCTION ENVIRONMENT                                        *
     450              ;*                                                             *
     451              ;* FUNCTION PROPERTIES                                         *
     452              ;*                            2 Parameter,  4 Auto,  0 SOE     *
     453              ;***************************************************************
     454              
     455              _OFFSET_getBeta:
     456              ;* AR4   assigned to _handle
     457              $C$DW$49        .dwtag  DW_TAG_variable, DW_AT_name("handle")
     458                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_handle")
     459                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$36)
     460                      .dwattr $C$DW$49, DW_AT_location[DW_OP_reg12]
     461              $C$DW$50        .dwtag  DW_TAG_variable, DW_AT_name("b0")
     462                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_b0")
     463                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     464                      .dwattr $C$DW$50, DW_AT_location[DW_OP_breg20 -4]
     465              $C$DW$51        .dwtag  DW_TAG_variable, DW_AT_name("b1")
     466                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_b1")
     467                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     468                      .dwattr $C$DW$51, DW_AT_location[DW_OP_breg20 -6]
     469                      .dwcfi  cfa_offset, -2
     470                      .dwcfi  save_reg_to_mem, 26, 0
     471                      .dwcfi  save_reg_to_reg, 78, 26
     472 00000038 FE06          ADDB      SP,#6                 ; [CPU_U] 
     473                      .dwcfi  cfa_offset, -8
     474                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_18/sw/modules/offset/src/32b/offset.c",line 64,column
     475 00000039 5DAD          MOVZ      AR5,SP                ; [CPU_U] |64| 
     476 0000003a D00E          MOVB      XAR0,#14              ; [CPU_] |64| 
     477 0000003b DD86          SUBB      XAR5,#6               ; [CPU_U] |64| 
     478 0000003c A042          MOVL      *-SP[2],XAR5          ; [CPU_] |64| 
     479 0000003d 8A94          MOVL      XAR4,*+XAR4[AR0]      ; [CPU_] |64| 
     480 0000003e 5DAD          MOVZ      AR5,SP                ; [CPU_U] |64| 
     481 0000003f DD84          SUBB      XAR5,#4               ; [CPU_U] |64| 
     482              $C$DW$52        .dwtag  DW_TAG_TI_branch
     483                      .dwattr $C$DW$52, DW_AT_low_pc(0x00)
     484                      .dwattr $C$DW$52, DW_AT_name("_FILTER_FO_getNumCoeffs")
     485                      .dwattr $C$DW$52, DW_AT_TI_call
     486 00000040 7640!         LCR       #_FILTER_FO_getNumCoeffs ; [CPU_] |64| 
         00000041 0000 
     487                      ; call occurs [#_FILTER_FO_getNumCoeffs] ; [] |64| 
     488                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_18/sw/modules/offset/src/32b/offset.c",line 66,column
     489 00000042 0644          MOVL      ACC,*-SP[4]           ; [CPU_] |66| 
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1294410                              PAGE   10

     490 00000043 FE86          SUBB      SP,#6                 ; [CPU_U] 
     491                      .dwcfi  cfa_offset, -2
     492              $C$DW$53        .dwtag  DW_TAG_TI_branch
     493                      .dwattr $C$DW$53, DW_AT_low_pc(0x00)
     494                      .dwattr $C$DW$53, DW_AT_TI_return
     495 00000044 0006          LRETR     ; [CPU_] 
     496                      ; return occurs ; [] 
     497                      .dwattr $C$DW$47, DW_AT_TI_end_file("C:/ti/motorware/motorware_1_01_00_18/sw/modules/offset/src/32b/o
     498                      .dwattr $C$DW$47, DW_AT_TI_end_line(0x43)
     499                      .dwattr $C$DW$47, DW_AT_TI_end_column(0x01)
     500                      .dwendentry
     501                      .dwendtag $C$DW$47
     502              
     503              ;**************************************************************
     504              ;* UNDEFINED EXTERNAL REFERENCES                              *
     505              ;**************************************************************
     506                      .global _FILTER_FO_setNumCoeffs
     507                      .global _FILTER_FO_setInitialConditions
     508                      .global _FILTER_FO_getNumCoeffs
     509                      .global _FILTER_FO_setDenCoeffs
     510                      .global _FILTER_FO_init
     511              
     512              ;***************************************************************
     513              ;* TYPE INFORMATION                                            *
     514              ;***************************************************************
     515              
     516              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     517                      .dwattr $C$DW$T$22, DW_AT_name("_FILTER_FO_")
     518                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0a)
     519              $C$DW$54        .dwtag  DW_TAG_member
     520                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
     521                      .dwattr $C$DW$54, DW_AT_name("a1")
     522                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_a1")
     523                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     524                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     525              $C$DW$55        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     527                      .dwattr $C$DW$55, DW_AT_name("b0")
     528                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_b0")
     529                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     530                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     531              $C$DW$56        .dwtag  DW_TAG_member
     532                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
     533                      .dwattr $C$DW$56, DW_AT_name("b1")
     534                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_b1")
     535                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     536                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     537              $C$DW$57        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     539                      .dwattr $C$DW$57, DW_AT_name("x1")
     540                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_x1")
     541                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     542                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     543              $C$DW$58        .dwtag  DW_TAG_member
     544                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1294410                              PAGE   11

     545                      .dwattr $C$DW$58, DW_AT_name("y1")
     546                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_y1")
     547                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     548                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     549                      .dwendtag $C$DW$T$22
     550              
     551              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
     552                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     553                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     554              
     555              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     556                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
     557                      .dwattr $C$DW$T$19, DW_AT_declaration
     558                      .dwendtag $C$DW$T$19
     559              
     560              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     561                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$19)
     562                      .dwattr $C$DW$T$24, DW_AT_address_class(0x16)
     563              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
     564                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     565                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     566              
     567              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     568                      .dwattr $C$DW$T$26, DW_AT_name("_OFFSET_")
     569                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
     570              $C$DW$59        .dwtag  DW_TAG_member
     571                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     572                      .dwattr $C$DW$59, DW_AT_name("value")
     573                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_value")
     574                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     575                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     576              $C$DW$60        .dwtag  DW_TAG_member
     577                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
     578                      .dwattr $C$DW$60, DW_AT_name("bias")
     579                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_bias")
     580                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     581                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     582              $C$DW$61        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$23)
     584                      .dwattr $C$DW$61, DW_AT_name("filter")
     585                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_filter")
     586                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     587                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     588              $C$DW$62        .dwtag  DW_TAG_member
     589                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$25)
     590                      .dwattr $C$DW$62, DW_AT_name("filterHandle")
     591                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_filterHandle")
     592                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     593                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     594                      .dwendtag $C$DW$T$26
     595              
     596              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
     597                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
     598                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     599              
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:48 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1294410                              PAGE   12

     600              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     601                      .dwattr $C$DW$T$20, DW_AT_name("_OFFSET_Obj_")
     602                      .dwattr $C$DW$T$20, DW_AT_declaration
     603                      .dwendtag $C$DW$T$20
     604              
     605              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
     606                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$20)
     607                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
     608              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
     609                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
     610                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
     611              $C$DW$63        .dwtag  DW_TAG_TI_far_type
     612                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$35)
     613              $C$DW$T$36      .dwtag  DW_TAG_const_type
     614                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$63)
     615              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     616                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
     617              $C$DW$64        .dwtag  DW_TAG_TI_far_type
     618                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$3)
     619              $C$DW$T$40      .dwtag  DW_TAG_const_type
     620                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$64)
     621              $C$DW$T$4       .dwtag  DW_TAG_base_type
     622                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     623                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     624                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     625              $C$DW$T$5       .dwtag  DW_TAG_base_type
     626                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     627                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     628                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     629              $C$DW$T$6       .dwtag  DW_TAG_base_type
     630                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     631                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     632                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     633              $C$DW$T$7       .dwtag  DW_TAG_base_type
     634                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     635                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     636                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     637              $C$DW$T$8       .dwtag  DW_TAG_base_type
     638                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     639                      .dwattr $C$DW$T$8, DW_AT_name("short")
     640                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     641              $C$DW$T$9       .dwtag  DW_TAG_base_type
     642                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     643                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     644                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     645              $C$DW$T$10      .dwtag  DW_TAG_base_type
     646                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
