TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 19:54:49 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    2551              $C$DW$381       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_4"), DW_AT_const_value(0x04)
    2552              $C$DW$382       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_5"), DW_AT_const_value(0x05)
    2553              $C$DW$383       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    2554              $C$DW$384       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    2555              $C$DW$385       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    2556              $C$DW$386       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    2557              $C$DW$387       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    2558              $C$DW$388       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    2559              $C$DW$389       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    2560              $C$DW$390       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    2561              $C$DW$391       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    2562              $C$DW$392       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    2563                      .dwendtag $C$DW$T$176
    2564              
    2565              $C$DW$T$177     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    2566                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    2567                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    2568              
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   52

    2569              $C$DW$T$179     .dwtag  DW_TAG_enumeration_type
    2570                      .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    2571              $C$DW$393       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    2572              $C$DW$394       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    2573              $C$DW$395       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    2574              $C$DW$396       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    2575              $C$DW$397       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    2576              $C$DW$398       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    2577              $C$DW$399       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    2578              $C$DW$400       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    2579              $C$DW$401       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    2580              $C$DW$402       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    2581              $C$DW$403       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    2582              $C$DW$404       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    2583                      .dwendtag $C$DW$T$179
    2584              
    2585              $C$DW$T$180     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    2586                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
    2587                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    2588              
    2589              $C$DW$T$182     .dwtag  DW_TAG_enumeration_type
    2590                      .dwattr $C$DW$T$182, DW_AT_byte_size(0x01)
    2591              $C$DW$405       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    2592              $C$DW$406       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    2593                      .dwendtag $C$DW$T$182
    2594              
    2595              $C$DW$T$183     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    2596                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$182)
    2597                      .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    2598              
    2599              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2600                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    2601                      .dwattr $C$DW$T$19, DW_AT_declaration
    2602                      .dwendtag $C$DW$T$19
    2603              
    2604              $C$DW$T$112     .dwtag  DW_TAG_pointer_type
    2605                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$19)
    2606                      .dwattr $C$DW$T$112, DW_AT_address_class(0x16)
    2607              $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    2608                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    2609                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    2610              
    2611              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2612                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    2613                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    2614              $C$DW$407       .dwtag  DW_TAG_member
    2615                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$25)
    2616                      .dwattr $C$DW$407, DW_AT_name("ADCRESULT")
    2617                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_ADCRESULT")
    2618                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2619                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    2620              $C$DW$408       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$26)
    2622                      .dwattr $C$DW$408, DW_AT_name("resvd_1")
    2623                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_resvd_1")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   53

    2624                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2625                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    2626              $C$DW$409       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$24)
    2628                      .dwattr $C$DW$409, DW_AT_name("ADCCTL1")
    2629                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_ADCCTL1")
    2630                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    2631                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    2632              $C$DW$410       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$24)
    2634                      .dwattr $C$DW$410, DW_AT_name("ADCCTL2")
    2635                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_ADCCTL2")
    2636                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    2637                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    2638              $C$DW$411       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$27)
    2640                      .dwattr $C$DW$411, DW_AT_name("rsvd_2")
    2641                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_rsvd_2")
    2642                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    2643                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    2644              $C$DW$412       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$24)
    2646                      .dwattr $C$DW$412, DW_AT_name("ADCINTFLG")
    2647                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_ADCINTFLG")
    2648                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    2649                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    2650              $C$DW$413       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$24)
    2652                      .dwattr $C$DW$413, DW_AT_name("ADCINTFLGCLR")
    2653                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    2654                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    2655                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    2656              $C$DW$414       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$24)
    2658                      .dwattr $C$DW$414, DW_AT_name("ADCINTOVF")
    2659                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_ADCINTOVF")
    2660                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    2661                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    2662              $C$DW$415       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$24)
    2664                      .dwattr $C$DW$415, DW_AT_name("ADCINTOVFCLR")
    2665                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    2666                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    2667                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    2668              $C$DW$416       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$28)
    2670                      .dwattr $C$DW$416, DW_AT_name("INTSELxNy")
    2671                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_INTSELxNy")
    2672                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    2673                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    2674              $C$DW$417       .dwtag  DW_TAG_member
    2675                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$29)
    2676                      .dwattr $C$DW$417, DW_AT_name("rsvd_3")
    2677                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_rsvd_3")
    2678                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   54

    2679                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    2680              $C$DW$418       .dwtag  DW_TAG_member
    2681                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$24)
    2682                      .dwattr $C$DW$418, DW_AT_name("SOCPRICTRL")
    2683                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_SOCPRICTRL")
    2684                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    2685                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    2686              $C$DW$419       .dwtag  DW_TAG_member
    2687                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$24)
    2688                      .dwattr $C$DW$419, DW_AT_name("rsvd_4")
    2689                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_rsvd_4")
    2690                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    2691                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    2692              $C$DW$420       .dwtag  DW_TAG_member
    2693                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$24)
    2694                      .dwattr $C$DW$420, DW_AT_name("ADCSAMPLEMODE")
    2695                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    2696                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    2697                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    2698              $C$DW$421       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$24)
    2700                      .dwattr $C$DW$421, DW_AT_name("rsvd_5")
    2701                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_rsvd_5")
    2702                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    2703                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    2704              $C$DW$422       .dwtag  DW_TAG_member
    2705                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$24)
    2706                      .dwattr $C$DW$422, DW_AT_name("ADCINTSOCSEL1")
    2707                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    2708                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    2709                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    2710              $C$DW$423       .dwtag  DW_TAG_member
    2711                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$24)
    2712                      .dwattr $C$DW$423, DW_AT_name("ADCINTSOCSEL2")
    2713                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    2714                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    2715                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    2716              $C$DW$424       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$27)
    2718                      .dwattr $C$DW$424, DW_AT_name("rsvd_6")
    2719                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_rsvd_6")
    2720                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    2721                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    2722              $C$DW$425       .dwtag  DW_TAG_member
    2723                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$24)
    2724                      .dwattr $C$DW$425, DW_AT_name("ADCSOCFLG1")
    2725                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    2726                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    2727                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    2728              $C$DW$426       .dwtag  DW_TAG_member
    2729                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$24)
    2730                      .dwattr $C$DW$426, DW_AT_name("rsvd_7")
    2731                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_rsvd_7")
    2732                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    2733                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   55

    2734              $C$DW$427       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$24)
    2736                      .dwattr $C$DW$427, DW_AT_name("ADCSOCFRC1")
    2737                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    2738                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    2739                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    2740              $C$DW$428       .dwtag  DW_TAG_member
    2741                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$24)
    2742                      .dwattr $C$DW$428, DW_AT_name("rsvd_8")
    2743                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_rsvd_8")
    2744                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    2745                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    2746              $C$DW$429       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$24)
    2748                      .dwattr $C$DW$429, DW_AT_name("ADCSOCOVF1")
    2749                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    2750                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    2751                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    2752              $C$DW$430       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$24)
    2754                      .dwattr $C$DW$430, DW_AT_name("rsvd_9")
    2755                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_rsvd_9")
    2756                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    2757                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    2758              $C$DW$431       .dwtag  DW_TAG_member
    2759                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$24)
    2760                      .dwattr $C$DW$431, DW_AT_name("ADCSOCOVFCLR1")
    2761                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    2762                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    2763                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    2764              $C$DW$432       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$24)
    2766                      .dwattr $C$DW$432, DW_AT_name("rsvd_10")
    2767                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_rsvd_10")
    2768                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    2769                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    2770              $C$DW$433       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$25)
    2772                      .dwattr $C$DW$433, DW_AT_name("ADCSOCxCTL")
    2773                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    2774                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    2775                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    2776              $C$DW$434       .dwtag  DW_TAG_member
    2777                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$25)
    2778                      .dwattr $C$DW$434, DW_AT_name("rsvd_11")
    2779                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd_11")
    2780                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    2781                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    2782              $C$DW$435       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$24)
    2784                      .dwattr $C$DW$435, DW_AT_name("ADCREFTRIM")
    2785                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_ADCREFTRIM")
    2786                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    2787                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    2788              $C$DW$436       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   56

    2789                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$24)
    2790                      .dwattr $C$DW$436, DW_AT_name("ADCOFFTRIM")
    2791                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    2792                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    2793                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    2794              $C$DW$437       .dwtag  DW_TAG_member
    2795                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$30)
    2796                      .dwattr $C$DW$437, DW_AT_name("resvd_12")
    2797                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_resvd_12")
    2798                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    2799                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    2800              $C$DW$438       .dwtag  DW_TAG_member
    2801                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$24)
    2802                      .dwattr $C$DW$438, DW_AT_name("ADCREV")
    2803                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_ADCREV")
    2804                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    2805                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    2806                      .dwendtag $C$DW$T$31
    2807              
    2808              $C$DW$T$185     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    2809                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$31)
    2810                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    2811              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    2812                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$31)
    2813                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    2814              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    2815                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    2816                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2817              
    2818              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2819                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    2820                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    2821              $C$DW$439       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$32)
    2823                      .dwattr $C$DW$439, DW_AT_name("alpha_sf")
    2824                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_alpha_sf")
    2825                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2826                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    2827              $C$DW$440       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$32)
    2829                      .dwattr $C$DW$440, DW_AT_name("beta_sf")
    2830                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_beta_sf")
    2831                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2832                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    2833              $C$DW$441       .dwtag  DW_TAG_member
    2834                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$33)
    2835                      .dwattr $C$DW$441, DW_AT_name("numSensors")
    2836                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_numSensors")
    2837                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2838                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    2839                      .dwendtag $C$DW$T$34
    2840              
    2841              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    2842                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    2843                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   57

    2844              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    2845                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    2846                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    2847              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    2848                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2849                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2850              
    2851              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2852                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    2853                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    2854              $C$DW$442       .dwtag  DW_TAG_member
    2855                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    2856                      .dwattr $C$DW$442, DW_AT_name("XCLK")
    2857                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_XCLK")
    2858                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2859                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    2860              $C$DW$443       .dwtag  DW_TAG_member
    2861                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$24)
    2862                      .dwattr $C$DW$443, DW_AT_name("rsvd_1")
    2863                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_rsvd_1")
    2864                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2865                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    2866              $C$DW$444       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
    2868                      .dwattr $C$DW$444, DW_AT_name("CLKCTL")
    2869                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_CLKCTL")
    2870                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2871                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    2872              $C$DW$445       .dwtag  DW_TAG_member
    2873                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$35)
    2874                      .dwattr $C$DW$445, DW_AT_name("rsvd_2")
    2875                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_rsvd_2")
    2876                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2877                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    2878              $C$DW$446       .dwtag  DW_TAG_member
    2879                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$24)
    2880                      .dwattr $C$DW$446, DW_AT_name("LOSPCP")
    2881                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_LOSPCP")
    2882                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2883                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    2884              $C$DW$447       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$24)
    2886                      .dwattr $C$DW$447, DW_AT_name("PCLKCR0")
    2887                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_PCLKCR0")
    2888                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2889                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    2890              $C$DW$448       .dwtag  DW_TAG_member
    2891                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$24)
    2892                      .dwattr $C$DW$448, DW_AT_name("PCLKCR1")
    2893                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_PCLKCR1")
    2894                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2895                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    2896              $C$DW$449       .dwtag  DW_TAG_member
    2897                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$27)
    2898                      .dwattr $C$DW$449, DW_AT_name("rsvd_3")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   58

    2899                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_rsvd_3")
    2900                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2901                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    2902              $C$DW$450       .dwtag  DW_TAG_member
    2903                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$24)
    2904                      .dwattr $C$DW$450, DW_AT_name("PCLKCR3")
    2905                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_PCLKCR3")
    2906                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2907                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    2908                      .dwendtag $C$DW$T$36
    2909              
    2910              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    2911                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$36)
    2912                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    2913              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    2914                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2915                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2916              
    2917              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2918                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    2919                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2920              $C$DW$451       .dwtag  DW_TAG_member
    2921                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$33)
    2922                      .dwattr $C$DW$451, DW_AT_name("tmp")
    2923                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_tmp")
    2924                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2925                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    2926                      .dwendtag $C$DW$T$37
    2927              
    2928              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    2929                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$37)
    2930                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    2931              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    2932                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    2933                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2934              
    2935              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    2936                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    2937                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    2938              $C$DW$452       .dwtag  DW_TAG_member
    2939                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$38)
    2940                      .dwattr $C$DW$452, DW_AT_name("version")
    2941                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_version")
    2942                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2943                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    2944              $C$DW$453       .dwtag  DW_TAG_member
    2945                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$40)
    2946                      .dwattr $C$DW$453, DW_AT_name("state")
    2947                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_state")
    2948                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2949                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    2950              $C$DW$454       .dwtag  DW_TAG_member
    2951                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$40)
    2952                      .dwattr $C$DW$454, DW_AT_name("prevState")
    2953                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_prevState")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   59

    2954                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2955                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    2956              $C$DW$455       .dwtag  DW_TAG_member
    2957                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$42)
    2958                      .dwattr $C$DW$455, DW_AT_name("errorCode")
    2959                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_errorCode")
    2960                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2961                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    2962              $C$DW$456       .dwtag  DW_TAG_member
    2963                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$44)
    2964                      .dwattr $C$DW$456, DW_AT_name("clarkeHandle_I")
    2965                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_clarkeHandle_I")
    2966                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2967                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    2968              $C$DW$457       .dwtag  DW_TAG_member
    2969                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$45)
    2970                      .dwattr $C$DW$457, DW_AT_name("clarke_I")
    2971                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_clarke_I")
    2972                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2973                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    2974              $C$DW$458       .dwtag  DW_TAG_member
    2975                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$44)
    2976                      .dwattr $C$DW$458, DW_AT_name("clarkeHandle_V")
    2977                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_clarkeHandle_V")
    2978                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2979                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    2980              $C$DW$459       .dwtag  DW_TAG_member
    2981                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$45)
    2982                      .dwattr $C$DW$459, DW_AT_name("clarke_V")
    2983                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_clarke_V")
    2984                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2985                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    2986              $C$DW$460       .dwtag  DW_TAG_member
    2987                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$47)
    2988                      .dwattr $C$DW$460, DW_AT_name("estHandle")
    2989                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_estHandle")
    2990                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2991                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    2992              $C$DW$461       .dwtag  DW_TAG_member
    2993                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$49)
    2994                      .dwattr $C$DW$461, DW_AT_name("parkHandle")
    2995                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_parkHandle")
    2996                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2997                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    2998              $C$DW$462       .dwtag  DW_TAG_member
    2999                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$50)
    3000                      .dwattr $C$DW$462, DW_AT_name("park")
    3001                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_park")
    3002                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3003                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3004              $C$DW$463       .dwtag  DW_TAG_member
    3005                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$52)
    3006                      .dwattr $C$DW$463, DW_AT_name("pidHandle_Id")
    3007                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_pidHandle_Id")
    3008                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   60

    3009                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3010              $C$DW$464       .dwtag  DW_TAG_member
    3011                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$53)
    3012                      .dwattr $C$DW$464, DW_AT_name("pid_Id")
    3013                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_pid_Id")
    3014                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3015                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3016              $C$DW$465       .dwtag  DW_TAG_member
    3017                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$52)
    3018                      .dwattr $C$DW$465, DW_AT_name("pidHandle_Iq")
    3019                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3020                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3021                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3022              $C$DW$466       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$53)
    3024                      .dwattr $C$DW$466, DW_AT_name("pid_Iq")
    3025                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_pid_Iq")
    3026                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3027                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3028              $C$DW$467       .dwtag  DW_TAG_member
    3029                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$52)
    3030                      .dwattr $C$DW$467, DW_AT_name("pidHandle_spd")
    3031                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_pidHandle_spd")
    3032                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3033                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3034              $C$DW$468       .dwtag  DW_TAG_member
    3035                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$53)
    3036                      .dwattr $C$DW$468, DW_AT_name("pid_spd")
    3037                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_pid_spd")
    3038                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3039                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3040              $C$DW$469       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$55)
    3042                      .dwattr $C$DW$469, DW_AT_name("iparkHandle")
    3043                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_iparkHandle")
    3044                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3045                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3046              $C$DW$470       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$56)
    3048                      .dwattr $C$DW$470, DW_AT_name("ipark")
    3049                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_ipark")
    3050                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3051                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3052              $C$DW$471       .dwtag  DW_TAG_member
    3053                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$58)
    3054                      .dwattr $C$DW$471, DW_AT_name("svgenHandle")
    3055                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_svgenHandle")
    3056                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3057                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3058              $C$DW$472       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$59)
    3060                      .dwattr $C$DW$472, DW_AT_name("svgen")
    3061                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_svgen")
    3062                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3063                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   61

    3064              $C$DW$473       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$61)
    3066                      .dwattr $C$DW$473, DW_AT_name("trajHandle_Id")
    3067                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_trajHandle_Id")
    3068                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3069                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3070              $C$DW$474       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$62)
    3072                      .dwattr $C$DW$474, DW_AT_name("traj_Id")
    3073                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_traj_Id")
    3074                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3075                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3076              $C$DW$475       .dwtag  DW_TAG_member
    3077                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$61)
    3078                      .dwattr $C$DW$475, DW_AT_name("trajHandle_spd")
    3079                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_trajHandle_spd")
    3080                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3081                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3082              $C$DW$476       .dwtag  DW_TAG_member
    3083                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$62)
    3084                      .dwattr $C$DW$476, DW_AT_name("traj_spd")
    3085                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_traj_spd")
    3086                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3087                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3088              $C$DW$477       .dwtag  DW_TAG_member
    3089                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$61)
    3090                      .dwattr $C$DW$477, DW_AT_name("trajHandle_spdMax")
    3091                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3092                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3093                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3094              $C$DW$478       .dwtag  DW_TAG_member
    3095                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$62)
    3096                      .dwattr $C$DW$478, DW_AT_name("traj_spdMax")
    3097                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_traj_spdMax")
    3098                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3099                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3100              $C$DW$479       .dwtag  DW_TAG_member
    3101                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$63)
    3102                      .dwattr $C$DW$479, DW_AT_name("motorParams")
    3103                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_motorParams")
    3104                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3105                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3106              $C$DW$480       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$66)
    3108                      .dwattr $C$DW$480, DW_AT_name("waitTimes")
    3109                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_waitTimes")
    3110                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3111                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3112              $C$DW$481       .dwtag  DW_TAG_member
    3113                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$65)
    3114                      .dwattr $C$DW$481, DW_AT_name("counter_state")
    3115                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_counter_state")
    3116                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3117                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3118              $C$DW$482       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   62

    3119                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$67)
    3120                      .dwattr $C$DW$482, DW_AT_name("numIsrTicksPerCtrlTick")
    3121                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3122                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3123                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3124              $C$DW$483       .dwtag  DW_TAG_member
    3125                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$67)
    3126                      .dwattr $C$DW$483, DW_AT_name("numCtrlTicksPerCurrentTick")
    3127                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3128                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3129                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3130              $C$DW$484       .dwtag  DW_TAG_member
    3131                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$67)
    3132                      .dwattr $C$DW$484, DW_AT_name("numCtrlTicksPerSpeedTick")
    3133                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3134                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3135                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3136              $C$DW$485       .dwtag  DW_TAG_member
    3137                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$67)
    3138                      .dwattr $C$DW$485, DW_AT_name("numCtrlTicksPerTrajTick")
    3139                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3140                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3141                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3142              $C$DW$486       .dwtag  DW_TAG_member
    3143                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$65)
    3144                      .dwattr $C$DW$486, DW_AT_name("ctrlFreq_Hz")
    3145                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3146                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3147                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3148              $C$DW$487       .dwtag  DW_TAG_member
    3149                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$65)
    3150                      .dwattr $C$DW$487, DW_AT_name("trajFreq_Hz")
    3151                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3152                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3153                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3154              $C$DW$488       .dwtag  DW_TAG_member
    3155                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$32)
    3156                      .dwattr $C$DW$488, DW_AT_name("trajPeriod_sec")
    3157                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3158                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3159                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3160              $C$DW$489       .dwtag  DW_TAG_member
    3161                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$68)
    3162                      .dwattr $C$DW$489, DW_AT_name("ctrlPeriod_sec")
    3163                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3164                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3165                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3166              $C$DW$490       .dwtag  DW_TAG_member
    3167                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$32)
    3168                      .dwattr $C$DW$490, DW_AT_name("maxVsMag_pu")
    3169                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3170                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3171                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3172              $C$DW$491       .dwtag  DW_TAG_member
    3173                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   63

    3174                      .dwattr $C$DW$491, DW_AT_name("Iab_in")
    3175                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_Iab_in")
    3176                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3177                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3178              $C$DW$492       .dwtag  DW_TAG_member
    3179                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$69)
    3180                      .dwattr $C$DW$492, DW_AT_name("Iab_filt")
    3181                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_Iab_filt")
    3182                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3183                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3184              $C$DW$493       .dwtag  DW_TAG_member
    3185                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$69)
    3186                      .dwattr $C$DW$493, DW_AT_name("Idq_in")
    3187                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_Idq_in")
    3188                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3189                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3190              $C$DW$494       .dwtag  DW_TAG_member
    3191                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$69)
    3192                      .dwattr $C$DW$494, DW_AT_name("Vab_in")
    3193                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_Vab_in")
    3194                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3195                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3196              $C$DW$495       .dwtag  DW_TAG_member
    3197                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$32)
    3198                      .dwattr $C$DW$495, DW_AT_name("spd_out")
    3199                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_spd_out")
    3200                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3201                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3202              $C$DW$496       .dwtag  DW_TAG_member
    3203                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$69)
    3204                      .dwattr $C$DW$496, DW_AT_name("Vab_out")
    3205                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_Vab_out")
    3206                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3207                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3208              $C$DW$497       .dwtag  DW_TAG_member
    3209                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$69)
    3210                      .dwattr $C$DW$497, DW_AT_name("Vdq_out")
    3211                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_Vdq_out")
    3212                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3213                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3214              $C$DW$498       .dwtag  DW_TAG_member
    3215                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$68)
    3216                      .dwattr $C$DW$498, DW_AT_name("Rhf")
    3217                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_Rhf")
    3218                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3219                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3220              $C$DW$499       .dwtag  DW_TAG_member
    3221                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$68)
    3222                      .dwattr $C$DW$499, DW_AT_name("Lhf")
    3223                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_Lhf")
    3224                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3225                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3226              $C$DW$500       .dwtag  DW_TAG_member
    3227                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$68)
    3228                      .dwattr $C$DW$500, DW_AT_name("RoverL")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   64

    3229                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_RoverL")
    3230                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3231                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3232              $C$DW$501       .dwtag  DW_TAG_member
    3233                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$32)
    3234                      .dwattr $C$DW$501, DW_AT_name("Kp_Id")
    3235                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_Kp_Id")
    3236                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3237                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3238              $C$DW$502       .dwtag  DW_TAG_member
    3239                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$32)
    3240                      .dwattr $C$DW$502, DW_AT_name("Kp_Iq")
    3241                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_Kp_Iq")
    3242                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3243                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3244              $C$DW$503       .dwtag  DW_TAG_member
    3245                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$32)
    3246                      .dwattr $C$DW$503, DW_AT_name("Kp_spd")
    3247                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_Kp_spd")
    3248                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3249                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3250              $C$DW$504       .dwtag  DW_TAG_member
    3251                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$32)
    3252                      .dwattr $C$DW$504, DW_AT_name("Ki_Id")
    3253                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_Ki_Id")
    3254                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3255                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3256              $C$DW$505       .dwtag  DW_TAG_member
    3257                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$32)
    3258                      .dwattr $C$DW$505, DW_AT_name("Ki_Iq")
    3259                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_Ki_Iq")
    3260                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3261                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3262              $C$DW$506       .dwtag  DW_TAG_member
    3263                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$32)
    3264                      .dwattr $C$DW$506, DW_AT_name("Ki_spd")
    3265                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_Ki_spd")
    3266                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3267                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3268              $C$DW$507       .dwtag  DW_TAG_member
    3269                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$32)
    3270                      .dwattr $C$DW$507, DW_AT_name("Kd_Id")
    3271                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_Kd_Id")
    3272                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3273                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3274              $C$DW$508       .dwtag  DW_TAG_member
    3275                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$32)
    3276                      .dwattr $C$DW$508, DW_AT_name("Kd_Iq")
    3277                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_Kd_Iq")
    3278                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3279                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3280              $C$DW$509       .dwtag  DW_TAG_member
    3281                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$32)
    3282                      .dwattr $C$DW$509, DW_AT_name("Kd_spd")
    3283                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_Kd_spd")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   65

    3284                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3285                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3286              $C$DW$510       .dwtag  DW_TAG_member
    3287                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$32)
    3288                      .dwattr $C$DW$510, DW_AT_name("Ui_Id")
    3289                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_Ui_Id")
    3290                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3291                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3292              $C$DW$511       .dwtag  DW_TAG_member
    3293                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$32)
    3294                      .dwattr $C$DW$511, DW_AT_name("Ui_Iq")
    3295                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_Ui_Iq")
    3296                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3297                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3298              $C$DW$512       .dwtag  DW_TAG_member
    3299                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$32)
    3300                      .dwattr $C$DW$512, DW_AT_name("Ui_spd")
    3301                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_Ui_spd")
    3302                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3303                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3304              $C$DW$513       .dwtag  DW_TAG_member
    3305                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$69)
    3306                      .dwattr $C$DW$513, DW_AT_name("Idq_ref")
    3307                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_Idq_ref")
    3308                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3309                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3310              $C$DW$514       .dwtag  DW_TAG_member
    3311                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$32)
    3312                      .dwattr $C$DW$514, DW_AT_name("IdRated")
    3313                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_IdRated")
    3314                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3315                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3316              $C$DW$515       .dwtag  DW_TAG_member
    3317                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$32)
    3318                      .dwattr $C$DW$515, DW_AT_name("spd_ref")
    3319                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_spd_ref")
    3320                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3321                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3322              $C$DW$516       .dwtag  DW_TAG_member
    3323                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$32)
    3324                      .dwattr $C$DW$516, DW_AT_name("spd_max")
    3325                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_spd_max")
    3326                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3327                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3328              $C$DW$517       .dwtag  DW_TAG_member
    3329                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$67)
    3330                      .dwattr $C$DW$517, DW_AT_name("counter_current")
    3331                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_counter_current")
    3332                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3333                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3334              $C$DW$518       .dwtag  DW_TAG_member
    3335                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$67)
    3336                      .dwattr $C$DW$518, DW_AT_name("counter_isr")
    3337                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_counter_isr")
    3338                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   66

    3339                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3340              $C$DW$519       .dwtag  DW_TAG_member
    3341                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$67)
    3342                      .dwattr $C$DW$519, DW_AT_name("counter_speed")
    3343                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_counter_speed")
    3344                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3345                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    3346              $C$DW$520       .dwtag  DW_TAG_member
    3347                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$67)
    3348                      .dwattr $C$DW$520, DW_AT_name("counter_traj")
    3349                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_counter_traj")
    3350                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3351                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    3352              $C$DW$521       .dwtag  DW_TAG_member
    3353                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$70)
    3354                      .dwattr $C$DW$521, DW_AT_name("flag_enableCtrl")
    3355                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3356                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3357                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    3358              $C$DW$522       .dwtag  DW_TAG_member
    3359                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$70)
    3360                      .dwattr $C$DW$522, DW_AT_name("flag_enableDcBusComp")
    3361                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3362                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3363                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    3364              $C$DW$523       .dwtag  DW_TAG_member
    3365                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$70)
    3366                      .dwattr $C$DW$523, DW_AT_name("flag_enablePowerWarp")
    3367                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3368                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3369                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    3370              $C$DW$524       .dwtag  DW_TAG_member
    3371                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$70)
    3372                      .dwattr $C$DW$524, DW_AT_name("flag_enableOffset")
    3373                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_flag_enableOffset")
    3374                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3375                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    3376              $C$DW$525       .dwtag  DW_TAG_member
    3377                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$70)
    3378                      .dwattr $C$DW$525, DW_AT_name("flag_enableSpeedCtrl")
    3379                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3380                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3381                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    3382              $C$DW$526       .dwtag  DW_TAG_member
    3383                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$70)
    3384                      .dwattr $C$DW$526, DW_AT_name("flag_enableUserMotorParams")
    3385                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3386                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3387                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    3388              $C$DW$527       .dwtag  DW_TAG_member
    3389                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$69)
    3390                      .dwattr $C$DW$527, DW_AT_name("Idq_offset_pu")
    3391                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3392                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3393                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   67

    3394              $C$DW$528       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$69)
    3396                      .dwattr $C$DW$528, DW_AT_name("Vdq_offset_pu")
    3397                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3398                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3399                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    3400              $C$DW$529       .dwtag  DW_TAG_member
    3401                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$32)
    3402                      .dwattr $C$DW$529, DW_AT_name("angle_pu")
    3403                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_angle_pu")
    3404                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3405                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    3406              $C$DW$530       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$32)
    3408                      .dwattr $C$DW$530, DW_AT_name("speed_ref_pu")
    3409                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_speed_ref_pu")
    3410                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3411                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    3412              $C$DW$531       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$32)
    3414                      .dwattr $C$DW$531, DW_AT_name("speed_fb_pu")
    3415                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_speed_fb_pu")
    3416                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3417                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    3418              $C$DW$532       .dwtag  DW_TAG_member
    3419                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$32)
    3420                      .dwattr $C$DW$532, DW_AT_name("speed_outMax_pu")
    3421                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3422                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3423                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    3424              $C$DW$533       .dwtag  DW_TAG_member
    3425                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$70)
    3426                      .dwattr $C$DW$533, DW_AT_name("flag_enableCurrentCtrl")
    3427                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3428                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3429                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    3430                      .dwendtag $C$DW$T$71
    3431              
    3432              $C$DW$T$186     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3433                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$71)
    3434                      .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    3435              $C$DW$T$187     .dwtag  DW_TAG_pointer_type
    3436                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$186)
    3437                      .dwattr $C$DW$T$187, DW_AT_address_class(0x16)
    3438              $C$DW$T$162     .dwtag  DW_TAG_pointer_type
    3439                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$71)
    3440                      .dwattr $C$DW$T$162, DW_AT_address_class(0x16)
    3441              $C$DW$T$163     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3442                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
    3443                      .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    3444              $C$DW$534       .dwtag  DW_TAG_TI_far_type
    3445                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$163)
    3446              $C$DW$T$188     .dwtag  DW_TAG_const_type
    3447                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$534)
    3448              
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   68

    3449              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    3450                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    3451                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    3452              $C$DW$535       .dwtag  DW_TAG_member
    3453                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$23)
    3454                      .dwattr $C$DW$535, DW_AT_name("rsvd")
    3455                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_rsvd")
    3456                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3457                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    3458              $C$DW$536       .dwtag  DW_TAG_member
    3459                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$73)
    3460                      .dwattr $C$DW$536, DW_AT_name("targetProc")
    3461                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_targetProc")
    3462                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3463                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    3464              $C$DW$537       .dwtag  DW_TAG_member
    3465                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$23)
    3466                      .dwattr $C$DW$537, DW_AT_name("major")
    3467                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_major")
    3468                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3469                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    3470              $C$DW$538       .dwtag  DW_TAG_member
    3471                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$23)
    3472                      .dwattr $C$DW$538, DW_AT_name("minor")
    3473                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_minor")
    3474                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3475                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    3476                      .dwendtag $C$DW$T$74
    3477              
    3478              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3479                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    3480                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3481              $C$DW$T$196     .dwtag  DW_TAG_pointer_type
    3482                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$38)
    3483                      .dwattr $C$DW$T$196, DW_AT_address_class(0x16)
    3484              
    3485              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3486                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    3487                      .dwattr $C$DW$T$20, DW_AT_declaration
    3488                      .dwendtag $C$DW$T$20
    3489              
    3490              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3491                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
    3492                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3493              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3494                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3495                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3496              
    3497              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    3498                      .dwattr $C$DW$T$75, DW_AT_name("_FILTER_FO_")
    3499                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x0a)
    3500              $C$DW$539       .dwtag  DW_TAG_member
    3501                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$32)
    3502                      .dwattr $C$DW$539, DW_AT_name("a1")
    3503                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_a1")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   69

    3504                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3505                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    3506              $C$DW$540       .dwtag  DW_TAG_member
    3507                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$32)
    3508                      .dwattr $C$DW$540, DW_AT_name("b0")
    3509                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_b0")
    3510                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3511                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    3512              $C$DW$541       .dwtag  DW_TAG_member
    3513                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$32)
    3514                      .dwattr $C$DW$541, DW_AT_name("b1")
    3515                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_b1")
    3516                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3517                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3518              $C$DW$542       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$32)
    3520                      .dwattr $C$DW$542, DW_AT_name("x1")
    3521                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_x1")
    3522                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3523                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3524              $C$DW$543       .dwtag  DW_TAG_member
    3525                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$32)
    3526                      .dwattr $C$DW$543, DW_AT_name("y1")
    3527                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_y1")
    3528                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3529                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3530                      .dwendtag $C$DW$T$75
    3531              
    3532              $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    3533                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$75)
    3534                      .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    3535              
    3536              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3537                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    3538                      .dwattr $C$DW$T$21, DW_AT_declaration
    3539                      .dwendtag $C$DW$T$21
    3540              
    3541              $C$DW$T$133     .dwtag  DW_TAG_pointer_type
    3542                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$21)
    3543                      .dwattr $C$DW$T$133, DW_AT_address_class(0x16)
    3544              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    3545                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$133)
    3546                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    3547              
    3548              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3549                      .dwattr $C$DW$T$76, DW_AT_name("_FLASH_Obj_")
    3550                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    3551              $C$DW$544       .dwtag  DW_TAG_member
    3552                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$24)
    3553                      .dwattr $C$DW$544, DW_AT_name("FOPT")
    3554                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_FOPT")
    3555                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3556                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3557              $C$DW$545       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   70

    3559                      .dwattr $C$DW$545, DW_AT_name("rsvd_1")
    3560                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_rsvd_1")
    3561                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3562                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3563              $C$DW$546       .dwtag  DW_TAG_member
    3564                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$24)
    3565                      .dwattr $C$DW$546, DW_AT_name("FPWR")
    3566                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_FPWR")
    3567                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3568                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    3569              $C$DW$547       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$24)
    3571                      .dwattr $C$DW$547, DW_AT_name("FSTATUS")
    3572                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_FSTATUS")
    3573                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3574                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3575              $C$DW$548       .dwtag  DW_TAG_member
    3576                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$24)
    3577                      .dwattr $C$DW$548, DW_AT_name("FSTDBYWAIT")
    3578                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    3579                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3580                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    3581              $C$DW$549       .dwtag  DW_TAG_member
    3582                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$24)
    3583                      .dwattr $C$DW$549, DW_AT_name("FACTIVEWAIT")
    3584                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    3585                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3586                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3587              $C$DW$550       .dwtag  DW_TAG_member
    3588                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$24)
    3589                      .dwattr $C$DW$550, DW_AT_name("FBANKWAIT")
    3590                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_FBANKWAIT")
    3591                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3592                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3593              $C$DW$551       .dwtag  DW_TAG_member
    3594                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$24)
    3595                      .dwattr $C$DW$551, DW_AT_name("FOTPWAIT")
    3596                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_FOTPWAIT")
    3597                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3598                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3599                      .dwendtag $C$DW$T$76
    3600              
    3601              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    3602                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$76)
    3603                      .dwattr $C$DW$T$89, DW_AT_address_class(0x16)
    3604              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    3605                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    3606                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    3607              
    3608              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    3609                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
    3610                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
    3611              $C$DW$552       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$77)
    3613                      .dwattr $C$DW$552, DW_AT_name("GPACTRL")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   71

    3614                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_GPACTRL")
    3615                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3616                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3617              $C$DW$553       .dwtag  DW_TAG_member
    3618                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$77)
    3619                      .dwattr $C$DW$553, DW_AT_name("GPAQSEL1")
    3620                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_GPAQSEL1")
    3621                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3622                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3623              $C$DW$554       .dwtag  DW_TAG_member
    3624                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$77)
    3625                      .dwattr $C$DW$554, DW_AT_name("GPAQSEL2")
    3626                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_GPAQSEL2")
    3627                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3628                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3629              $C$DW$555       .dwtag  DW_TAG_member
    3630                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$77)
    3631                      .dwattr $C$DW$555, DW_AT_name("GPAMUX1")
    3632                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_GPAMUX1")
    3633                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3634                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3635              $C$DW$556       .dwtag  DW_TAG_member
    3636                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$77)
    3637                      .dwattr $C$DW$556, DW_AT_name("GPAMUX2")
    3638                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_GPAMUX2")
    3639                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3640                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3641              $C$DW$557       .dwtag  DW_TAG_member
    3642                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$77)
    3643                      .dwattr $C$DW$557, DW_AT_name("GPADIR")
    3644                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_GPADIR")
    3645                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3646                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3647              $C$DW$558       .dwtag  DW_TAG_member
    3648                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$77)
    3649                      .dwattr $C$DW$558, DW_AT_name("GPAPUD")
    3650                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_GPAPUD")
    3651                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3652                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3653              $C$DW$559       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$27)
    3655                      .dwattr $C$DW$559, DW_AT_name("rsvd_1")
    3656                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_rsvd_1")
    3657                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3658                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3659              $C$DW$560       .dwtag  DW_TAG_member
    3660                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$77)
    3661                      .dwattr $C$DW$560, DW_AT_name("GPBCTRL")
    3662                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_GPBCTRL")
    3663                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3664                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3665              $C$DW$561       .dwtag  DW_TAG_member
    3666                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$77)
    3667                      .dwattr $C$DW$561, DW_AT_name("GPBQSEL1")
    3668                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_GPBQSEL1")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   72

    3669                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3670                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3671              $C$DW$562       .dwtag  DW_TAG_member
    3672                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$27)
    3673                      .dwattr $C$DW$562, DW_AT_name("rsvd_2")
    3674                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_rsvd_2")
    3675                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3676                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3677              $C$DW$563       .dwtag  DW_TAG_member
    3678                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$77)
    3679                      .dwattr $C$DW$563, DW_AT_name("GPBMUX1")
    3680                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_GPBMUX1")
    3681                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3682                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3683              $C$DW$564       .dwtag  DW_TAG_member
    3684                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$27)
    3685                      .dwattr $C$DW$564, DW_AT_name("rsvd_3")
    3686                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_rsvd_3")
    3687                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3688                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3689              $C$DW$565       .dwtag  DW_TAG_member
    3690                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$77)
    3691                      .dwattr $C$DW$565, DW_AT_name("GPBDIR")
    3692                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_GPBDIR")
    3693                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3694                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3695              $C$DW$566       .dwtag  DW_TAG_member
    3696                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$77)
    3697                      .dwattr $C$DW$566, DW_AT_name("GPBPUD")
    3698                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_GPBPUD")
    3699                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3700                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3701              $C$DW$567       .dwtag  DW_TAG_member
    3702                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$78)
    3703                      .dwattr $C$DW$567, DW_AT_name("rsvd_4")
    3704                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_rsvd_4")
    3705                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3706                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3707              $C$DW$568       .dwtag  DW_TAG_member
    3708                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$77)
    3709                      .dwattr $C$DW$568, DW_AT_name("AIOMUX1")
    3710                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_AIOMUX1")
    3711                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3712                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3713              $C$DW$569       .dwtag  DW_TAG_member
    3714                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$27)
    3715                      .dwattr $C$DW$569, DW_AT_name("rsvd_5")
    3716                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_rsvd_5")
    3717                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3718                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3719              $C$DW$570       .dwtag  DW_TAG_member
    3720                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$77)
    3721                      .dwattr $C$DW$570, DW_AT_name("AIODIR")
    3722                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_AIODIR")
    3723                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 19:54:49 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0954810                              PAGE   73

    3724                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3725              $C$DW$571       .dwtag  DW_TAG_member
    3726                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$79)
    3727                      .dwattr $C$DW$571, DW_AT_name("rsvd_6")
    3728                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_rsvd_6")
    3729                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3730                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3731              $C$DW$572       .dwtag  DW_TAG_member
    3732                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$77)
    3733                      .dwattr $C$DW$572, DW_AT_name("GPADAT")
    3734                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_GPADAT")
    3735                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3736                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3737              $C$DW$573       .dwtag  DW_TAG_member
    3738                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$77)
    3739                      .dwattr $C$DW$573, DW_AT_name("GPASET")
    3740                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_GPASET")
    3741                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3742                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3743              $C$DW$574       .dwtag  DW_TAG_member
    3744                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$77)
    3745                      .dwattr $C$DW$574, DW_AT_name("GPACLEAR")
    3746                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_GPACLEAR")
    3747                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3748                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3749              $C$DW$575       .dwtag  DW_TAG_member
    3750                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$77)
    3751                      .dwattr $C$DW$575, DW_AT_name("GPATOGGLE")
    3752                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_GPATOGGLE")
