TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/99306EUuHrt                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                 Unix v15.12.3.LTS *
       3              ;* Date/Time created: Tue Jul  4 10:34:28 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=softlib --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("/home/wmj/Documents/my_motor/sw/modules/cpu_time/src/32b/cpu_time.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen Unix v15.12.3.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("/home/wmj/Documents/my_motor/sw/solutions/instaspin_foc/boards/hvki
      13              ;       /mnt/eda_tools/ti/ccsv6/tools/compiler/c2000_15.12.3.LTS/bin/opt2000 /tmp/99306YDFv9i /tmp/99306wul3I

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/99306EUuHrt                                                     PAGE    3

     111                      .dwattr $C$DW$1, DW_AT_TI_end_column(0x01)
     112                      .dwendentry
     113                      .dwendtag $C$DW$1
     114              
     115 00000014               .sect   ".text"
     116                      .clink
     117                      .global _CPU_TIME_init
     118              
     119              $C$DW$7 .dwtag  DW_TAG_subprogram
     120                      .dwattr $C$DW$7, DW_AT_name("CPU_TIME_init")
     121                      .dwattr $C$DW$7, DW_AT_low_pc(_CPU_TIME_init)
     122                      .dwattr $C$DW$7, DW_AT_high_pc(0x00)
     123                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_CPU_TIME_init")
     124                      .dwattr $C$DW$7, DW_AT_external
     125                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$25)
     126                      .dwattr $C$DW$7, DW_AT_TI_begin_file("/home/wmj/Documents/my_motor/sw/modules/cpu_time/src/32b/cpu_ti
     127                      .dwattr $C$DW$7, DW_AT_TI_begin_line(0x15)
     128                      .dwattr $C$DW$7, DW_AT_TI_begin_column(0x11)
     129                      .dwattr $C$DW$7, DW_AT_TI_max_frame_size(-2)
     130                      .dwpsn  file "/home/wmj/Documents/my_motor/sw/modules/cpu_time/src/32b/cpu_time.c",line 22,column 1,i
     131              
     132                      .dwfde $C$DW$CIE, _CPU_TIME_init
     133              $C$DW$8 .dwtag  DW_TAG_formal_parameter
     134                      .dwattr $C$DW$8, DW_AT_name("pMemory")
     135                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_pMemory")
     136                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$3)
     137                      .dwattr $C$DW$8, DW_AT_location[DW_OP_reg12]
     138              
     139              $C$DW$9 .dwtag  DW_TAG_formal_parameter
     140                      .dwattr $C$DW$9, DW_AT_name("numBytes")
     141                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_numBytes")
     142                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$28)
     143                      .dwattr $C$DW$9, DW_AT_location[DW_OP_reg0]
     144              
     145              
     146              ;***************************************************************
     147              ;* FNAME: _CPU_TIME_init                FR SIZE:   0           *
     148              ;*                                                             *
     149              ;* FUNCTION ENVIRONMENT                                        *
     150              ;*                                                             *
     151              ;* FUNCTION PROPERTIES                                         *
     152              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     153              ;***************************************************************
     154              
     155              _CPU_TIME_init:
     156              ;* AR6   assigned to _numBytes
     157              $C$DW$10        .dwtag  DW_TAG_variable
     158                      .dwattr $C$DW$10, DW_AT_name("numBytes")
     159                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_numBytes")
     160                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$28)
     161                      .dwattr $C$DW$10, DW_AT_location[DW_OP_reg16]
     162              
     163                      .dwcfi  cfa_offset, -2
     164                      .dwcfi  save_reg_to_mem, 26, 0
     165 00000014 1EA6          MOVL      XAR6,ACC              ; [CPU_] |22| 
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/99306EUuHrt                                                     PAGE    4

     166                      .dwpsn  file "/home/wmj/Documents/my_motor/sw/modules/cpu_time/src/32b/cpu_time.c",line 26,column 5,i
     167 00000015 0218          MOVB      ACC,#24               ; [CPU_] |26| 
     168 00000016 0FA6          CMPL      ACC,XAR6              ; [CPU_] |26| 
     169 00000017 6902          B         $C$L1,LOS             ; [CPU_] |26| 
     170                      ; branchcc occurs ; [] |26| 
     171 00000018 D400          MOVB      XAR4,#0               ; [CPU_] |26| 
     172              $C$L1:    
     173              $C$DW$11        .dwtag  DW_TAG_TI_branch
     174                      .dwattr $C$DW$11, DW_AT_low_pc(0x00)
     175                      .dwattr $C$DW$11, DW_AT_TI_return
     176              
     177 00000019 0006          LRETR     ; [CPU_] 
     178                      ; return occurs ; [] 
     179                      .dwattr $C$DW$7, DW_AT_TI_end_file("/home/wmj/Documents/my_motor/sw/modules/cpu_time/src/32b/cpu_time
     180                      .dwattr $C$DW$7, DW_AT_TI_end_line(0x20)
     181                      .dwattr $C$DW$7, DW_AT_TI_end_column(0x01)
     182                      .dwendentry
     183                      .dwendtag $C$DW$7
     184              
     185              
     186              ;***************************************************************
     187              ;* TYPE INFORMATION                                            *
     188              ;***************************************************************
     189              
     190              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     191                      .dwattr $C$DW$T$22, DW_AT_name("_CPU_TIME_Obj_")
     192                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x18)
     193              $C$DW$12        .dwtag  DW_TAG_member
     194                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     195                      .dwattr $C$DW$12, DW_AT_name("pwm_period")
     196                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_pwm_period")
     197                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     198                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     199              
     200              $C$DW$13        .dwtag  DW_TAG_member
     201                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
     202                      .dwattr $C$DW$13, DW_AT_name("timer_cnt_now")
     203                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_timer_cnt_now")
     204                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     205                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     206              
     207              $C$DW$14        .dwtag  DW_TAG_member
     208                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
     209                      .dwattr $C$DW$14, DW_AT_name("timer_cnt_prev")
     210                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_timer_cnt_prev")
     211                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     212                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     213              
     214              $C$DW$15        .dwtag  DW_TAG_member
     215                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
     216                      .dwattr $C$DW$15, DW_AT_name("timer_delta_now")
     217                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_timer_delta_now")
     218                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     219                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     220              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/99306EUuHrt                                                     PAGE    5

     221              $C$DW$16        .dwtag  DW_TAG_member
     222                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
     223                      .dwattr $C$DW$16, DW_AT_name("timer_delta_prev")
     224                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_timer_delta_prev")
     225                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     226                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     227              
     228              $C$DW$17        .dwtag  DW_TAG_member
     229                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$20)
     230                      .dwattr $C$DW$17, DW_AT_name("timer_delta_min")
     231                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_timer_delta_min")
     232                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     233                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     234              
     235              $C$DW$18        .dwtag  DW_TAG_member
     236                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$20)
     237                      .dwattr $C$DW$18, DW_AT_name("timer_delta_max")
     238                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_timer_delta_max")
     239                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     240                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     241              
     242              $C$DW$19        .dwtag  DW_TAG_member
     243                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
     244                      .dwattr $C$DW$19, DW_AT_name("timer_delta_avg")
     245                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_timer_delta_avg")
     246                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     247                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     248              
     249              $C$DW$20        .dwtag  DW_TAG_member
     250                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
     251                      .dwattr $C$DW$20, DW_AT_name("timer_band_max")
     252                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_timer_band_max")
     253                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     254                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     255              
     256              $C$DW$21        .dwtag  DW_TAG_member
     257                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$20)
     258                      .dwattr $C$DW$21, DW_AT_name("timer_delta_CntAcc")
     259                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_timer_delta_CntAcc")
     260                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     261                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     262              
     263              $C$DW$22        .dwtag  DW_TAG_member
     264                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
     265                      .dwattr $C$DW$22, DW_AT_name("timer_delta_AccNum")
     266                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_timer_delta_AccNum")
     267                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     268                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     269              
     270              $C$DW$23        .dwtag  DW_TAG_member
     271                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$21)
     272                      .dwattr $C$DW$23, DW_AT_name("flag_resetStatus")
     273                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_flag_resetStatus")
     274                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     275                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/99306EUuHrt                                                     PAGE    6

     276              
     277                      .dwendtag $C$DW$T$22
     278              
     279              $C$DW$T$23      .dwtag  DW_TAG_typedef
     280                      .dwattr $C$DW$T$23, DW_AT_name("CPU_TIME_Obj")
     281                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     282                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     283              
     284              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     285                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$22)
     286                      .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
     287              
     288              $C$DW$T$25      .dwtag  DW_TAG_typedef
     289                      .dwattr $C$DW$T$25, DW_AT_name("CPU_TIME_Handle")
     290                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     291                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     292              
     293              $C$DW$24        .dwtag  DW_TAG_TI_far_type
     294                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$25)
     295              
     296              $C$DW$T$26      .dwtag  DW_TAG_const_type
     297                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$24)
     298              
     299              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     300                      .dwattr $C$DW$T$2, DW_AT_name("void")
     301              
     302              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     303                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     304                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     305              
     306              $C$DW$T$4       .dwtag  DW_TAG_base_type
     307                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     308                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     309                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     310              
     311              $C$DW$T$5       .dwtag  DW_TAG_base_type
     312                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     313                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     314                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     315              
     316              $C$DW$T$6       .dwtag  DW_TAG_base_type
     317                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     318                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     319                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     320              
     321              $C$DW$T$7       .dwtag  DW_TAG_base_type
     322                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     323                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     324                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     325              
     326              $C$DW$T$8       .dwtag  DW_TAG_base_type
     327                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     328                      .dwattr $C$DW$T$8, DW_AT_name("short")
     329                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     330              
TMS320C2000 Assembler Unix v15.12.3 Tue Jul  4 10:34:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
/tmp/99306EUuHrt                                                     PAGE    7

     331              $C$DW$T$9       .dwtag  DW_TAG_base_type
     332                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
