TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 15:17:11 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    7555              $C$DW$813       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_DcEvt"), DW_AT_const_value(0x00)
    7556              $C$DW$814       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualZero"), DW_AT_const_value(
    7557              $C$DW$815       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualPeriod"), DW_AT_const_valu
    7558              $C$DW$816       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualZeroOrPeriod"), DW_AT_cons
    7559              $C$DW$817       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpAIncr"), DW_AT_const_va
    7560              $C$DW$818       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpADecr"), DW_AT_const_va
    7561              $C$DW$819       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpBIncr"), DW_AT_const_va
    7562              $C$DW$820       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpBDecr"), DW_AT_const_va
    7563                      .dwendtag $C$DW$T$172
    7564              
    7565              $C$DW$T$173     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_SocPulseSrc_e")
    7566                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
    7567                      .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    7568              $C$DW$821       .dwtag  DW_TAG_TI_far_type
    7569                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$173)
    7570              $C$DW$T$174     .dwtag  DW_TAG_const_type
    7571                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$821)
    7572              
    7573              $C$DW$T$175     .dwtag  DW_TAG_enumeration_type
    7574                      .dwattr $C$DW$T$175, DW_AT_byte_size(0x01)
    7575              $C$DW$822       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    7576              $C$DW$823       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    7577              $C$DW$824       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    7578              $C$DW$825       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    7579              $C$DW$826       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    7580              $C$DW$827       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    7581              $C$DW$828       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    7582              $C$DW$829       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    7583              $C$DW$830       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    7584              $C$DW$831       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    7585              $C$DW$832       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    7586              $C$DW$833       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    7587                      .dwendtag $C$DW$T$175
    7588              
    7589              $C$DW$T$176     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    7590                      .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$175)
    7591                      .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    7592              
    7593              $C$DW$T$178     .dwtag  DW_TAG_enumeration_type
    7594                      .dwattr $C$DW$T$178, DW_AT_byte_size(0x01)
    7595              $C$DW$834       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_1"), DW_AT_const_value(0x00)
    7596              $C$DW$835       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_2"), DW_AT_const_value(0x01)
    7597              $C$DW$836       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_3"), DW_AT_const_value(0x02)
    7598              $C$DW$837       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_4"), DW_AT_const_value(0x03)
    7599                      .dwendtag $C$DW$T$178
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  153

    7600              
    7601              $C$DW$T$179     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Number_e")
    7602                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
    7603                      .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    7604              
    7605              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7606                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    7607                      .dwattr $C$DW$T$19, DW_AT_declaration
    7608                      .dwendtag $C$DW$T$19
    7609              
    7610              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    7611                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$19)
    7612                      .dwattr $C$DW$T$82, DW_AT_address_class(0x16)
    7613              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    7614                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    7615                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    7616              
    7617              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    7618                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    7619                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    7620              $C$DW$838       .dwtag  DW_TAG_member
    7621                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$25)
    7622                      .dwattr $C$DW$838, DW_AT_name("ADCRESULT")
    7623                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_ADCRESULT")
    7624                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7625                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    7626              $C$DW$839       .dwtag  DW_TAG_member
    7627                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$26)
    7628                      .dwattr $C$DW$839, DW_AT_name("resvd_1")
    7629                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_resvd_1")
    7630                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7631                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    7632              $C$DW$840       .dwtag  DW_TAG_member
    7633                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$24)
    7634                      .dwattr $C$DW$840, DW_AT_name("ADCCTL1")
    7635                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_ADCCTL1")
    7636                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    7637                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    7638              $C$DW$841       .dwtag  DW_TAG_member
    7639                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$24)
    7640                      .dwattr $C$DW$841, DW_AT_name("ADCCTL2")
    7641                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_ADCCTL2")
    7642                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    7643                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    7644              $C$DW$842       .dwtag  DW_TAG_member
    7645                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$27)
    7646                      .dwattr $C$DW$842, DW_AT_name("rsvd_2")
    7647                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_rsvd_2")
    7648                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    7649                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    7650              $C$DW$843       .dwtag  DW_TAG_member
    7651                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$24)
    7652                      .dwattr $C$DW$843, DW_AT_name("ADCINTFLG")
    7653                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_ADCINTFLG")
    7654                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  154

    7655                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    7656              $C$DW$844       .dwtag  DW_TAG_member
    7657                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$24)
    7658                      .dwattr $C$DW$844, DW_AT_name("ADCINTFLGCLR")
    7659                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    7660                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    7661                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    7662              $C$DW$845       .dwtag  DW_TAG_member
    7663                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$24)
    7664                      .dwattr $C$DW$845, DW_AT_name("ADCINTOVF")
    7665                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_ADCINTOVF")
    7666                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    7667                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    7668              $C$DW$846       .dwtag  DW_TAG_member
    7669                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$24)
    7670                      .dwattr $C$DW$846, DW_AT_name("ADCINTOVFCLR")
    7671                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    7672                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    7673                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    7674              $C$DW$847       .dwtag  DW_TAG_member
    7675                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$28)
    7676                      .dwattr $C$DW$847, DW_AT_name("INTSELxNy")
    7677                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_INTSELxNy")
    7678                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    7679                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    7680              $C$DW$848       .dwtag  DW_TAG_member
    7681                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$29)
    7682                      .dwattr $C$DW$848, DW_AT_name("rsvd_3")
    7683                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_rsvd_3")
    7684                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    7685                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    7686              $C$DW$849       .dwtag  DW_TAG_member
    7687                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$24)
    7688                      .dwattr $C$DW$849, DW_AT_name("SOCPRICTRL")
    7689                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_SOCPRICTRL")
    7690                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    7691                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    7692              $C$DW$850       .dwtag  DW_TAG_member
    7693                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$24)
    7694                      .dwattr $C$DW$850, DW_AT_name("rsvd_4")
    7695                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_rsvd_4")
    7696                      .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    7697                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
    7698              $C$DW$851       .dwtag  DW_TAG_member
    7699                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$24)
    7700                      .dwattr $C$DW$851, DW_AT_name("ADCSAMPLEMODE")
    7701                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    7702                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    7703                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
    7704              $C$DW$852       .dwtag  DW_TAG_member
    7705                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$24)
    7706                      .dwattr $C$DW$852, DW_AT_name("rsvd_5")
    7707                      .dwattr $C$DW$852, DW_AT_TI_symbol_name("_rsvd_5")
    7708                      .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    7709                      .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  155

    7710              $C$DW$853       .dwtag  DW_TAG_member
    7711                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$24)
    7712                      .dwattr $C$DW$853, DW_AT_name("ADCINTSOCSEL1")
    7713                      .dwattr $C$DW$853, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    7714                      .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    7715                      .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
    7716              $C$DW$854       .dwtag  DW_TAG_member
    7717                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$24)
    7718                      .dwattr $C$DW$854, DW_AT_name("ADCINTSOCSEL2")
    7719                      .dwattr $C$DW$854, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    7720                      .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    7721                      .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
    7722              $C$DW$855       .dwtag  DW_TAG_member
    7723                      .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$27)
    7724                      .dwattr $C$DW$855, DW_AT_name("rsvd_6")
    7725                      .dwattr $C$DW$855, DW_AT_TI_symbol_name("_rsvd_6")
    7726                      .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    7727                      .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
    7728              $C$DW$856       .dwtag  DW_TAG_member
    7729                      .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$24)
    7730                      .dwattr $C$DW$856, DW_AT_name("ADCSOCFLG1")
    7731                      .dwattr $C$DW$856, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    7732                      .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    7733                      .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
    7734              $C$DW$857       .dwtag  DW_TAG_member
    7735                      .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$24)
    7736                      .dwattr $C$DW$857, DW_AT_name("rsvd_7")
    7737                      .dwattr $C$DW$857, DW_AT_TI_symbol_name("_rsvd_7")
    7738                      .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    7739                      .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
    7740              $C$DW$858       .dwtag  DW_TAG_member
    7741                      .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$24)
    7742                      .dwattr $C$DW$858, DW_AT_name("ADCSOCFRC1")
    7743                      .dwattr $C$DW$858, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    7744                      .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    7745                      .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
    7746              $C$DW$859       .dwtag  DW_TAG_member
    7747                      .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$24)
    7748                      .dwattr $C$DW$859, DW_AT_name("rsvd_8")
    7749                      .dwattr $C$DW$859, DW_AT_TI_symbol_name("_rsvd_8")
    7750                      .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    7751                      .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
    7752              $C$DW$860       .dwtag  DW_TAG_member
    7753                      .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$24)
    7754                      .dwattr $C$DW$860, DW_AT_name("ADCSOCOVF1")
    7755                      .dwattr $C$DW$860, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    7756                      .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    7757                      .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
    7758              $C$DW$861       .dwtag  DW_TAG_member
    7759                      .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$24)
    7760                      .dwattr $C$DW$861, DW_AT_name("rsvd_9")
    7761                      .dwattr $C$DW$861, DW_AT_TI_symbol_name("_rsvd_9")
    7762                      .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    7763                      .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
    7764              $C$DW$862       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  156

    7765                      .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$24)
    7766                      .dwattr $C$DW$862, DW_AT_name("ADCSOCOVFCLR1")
    7767                      .dwattr $C$DW$862, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    7768                      .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    7769                      .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
    7770              $C$DW$863       .dwtag  DW_TAG_member
    7771                      .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$24)
    7772                      .dwattr $C$DW$863, DW_AT_name("rsvd_10")
    7773                      .dwattr $C$DW$863, DW_AT_TI_symbol_name("_rsvd_10")
    7774                      .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    7775                      .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
    7776              $C$DW$864       .dwtag  DW_TAG_member
    7777                      .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$25)
    7778                      .dwattr $C$DW$864, DW_AT_name("ADCSOCxCTL")
    7779                      .dwattr $C$DW$864, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    7780                      .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    7781                      .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
    7782              $C$DW$865       .dwtag  DW_TAG_member
    7783                      .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$25)
    7784                      .dwattr $C$DW$865, DW_AT_name("rsvd_11")
    7785                      .dwattr $C$DW$865, DW_AT_TI_symbol_name("_rsvd_11")
    7786                      .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    7787                      .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
    7788              $C$DW$866       .dwtag  DW_TAG_member
    7789                      .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$24)
    7790                      .dwattr $C$DW$866, DW_AT_name("ADCREFTRIM")
    7791                      .dwattr $C$DW$866, DW_AT_TI_symbol_name("_ADCREFTRIM")
    7792                      .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    7793                      .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
    7794              $C$DW$867       .dwtag  DW_TAG_member
    7795                      .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$24)
    7796                      .dwattr $C$DW$867, DW_AT_name("ADCOFFTRIM")
    7797                      .dwattr $C$DW$867, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    7798                      .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    7799                      .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
    7800              $C$DW$868       .dwtag  DW_TAG_member
    7801                      .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$30)
    7802                      .dwattr $C$DW$868, DW_AT_name("resvd_12")
    7803                      .dwattr $C$DW$868, DW_AT_TI_symbol_name("_resvd_12")
    7804                      .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    7805                      .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
    7806              $C$DW$869       .dwtag  DW_TAG_member
    7807                      .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$24)
    7808                      .dwattr $C$DW$869, DW_AT_name("ADCREV")
    7809                      .dwattr $C$DW$869, DW_AT_TI_symbol_name("_ADCREV")
    7810                      .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    7811                      .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
    7812                      .dwendtag $C$DW$T$31
    7813              
    7814              $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    7815                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$31)
    7816                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    7817              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    7818                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$31)
    7819                      .dwattr $C$DW$T$53, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  157

    7820              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    7821                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    7822                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    7823              
    7824              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7825                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    7826                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    7827              $C$DW$870       .dwtag  DW_TAG_member
    7828                      .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$32)
    7829                      .dwattr $C$DW$870, DW_AT_name("alpha_sf")
    7830                      .dwattr $C$DW$870, DW_AT_TI_symbol_name("_alpha_sf")
    7831                      .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7832                      .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
    7833              $C$DW$871       .dwtag  DW_TAG_member
    7834                      .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$32)
    7835                      .dwattr $C$DW$871, DW_AT_name("beta_sf")
    7836                      .dwattr $C$DW$871, DW_AT_TI_symbol_name("_beta_sf")
    7837                      .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7838                      .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
    7839              $C$DW$872       .dwtag  DW_TAG_member
    7840                      .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$33)
    7841                      .dwattr $C$DW$872, DW_AT_name("numSensors")
    7842                      .dwattr $C$DW$872, DW_AT_TI_symbol_name("_numSensors")
    7843                      .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7844                      .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
    7845                      .dwendtag $C$DW$T$34
    7846              
    7847              $C$DW$T$182     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    7848                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$34)
    7849                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    7850              $C$DW$T$183     .dwtag  DW_TAG_pointer_type
    7851                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$34)
    7852                      .dwattr $C$DW$T$183, DW_AT_address_class(0x16)
    7853              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    7854                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
    7855                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    7856              $C$DW$873       .dwtag  DW_TAG_TI_far_type
    7857                      .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$184)
    7858              $C$DW$T$185     .dwtag  DW_TAG_const_type
    7859                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$873)
    7860              
    7861              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7862                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    7863                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    7864              $C$DW$874       .dwtag  DW_TAG_member
    7865                      .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$24)
    7866                      .dwattr $C$DW$874, DW_AT_name("XCLK")
    7867                      .dwattr $C$DW$874, DW_AT_TI_symbol_name("_XCLK")
    7868                      .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7869                      .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
    7870              $C$DW$875       .dwtag  DW_TAG_member
    7871                      .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$24)
    7872                      .dwattr $C$DW$875, DW_AT_name("rsvd_1")
    7873                      .dwattr $C$DW$875, DW_AT_TI_symbol_name("_rsvd_1")
    7874                      .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  158

    7875                      .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
    7876              $C$DW$876       .dwtag  DW_TAG_member
    7877                      .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$24)
    7878                      .dwattr $C$DW$876, DW_AT_name("CLKCTL")
    7879                      .dwattr $C$DW$876, DW_AT_TI_symbol_name("_CLKCTL")
    7880                      .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7881                      .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
    7882              $C$DW$877       .dwtag  DW_TAG_member
    7883                      .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$35)
    7884                      .dwattr $C$DW$877, DW_AT_name("rsvd_2")
    7885                      .dwattr $C$DW$877, DW_AT_TI_symbol_name("_rsvd_2")
    7886                      .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7887                      .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
    7888              $C$DW$878       .dwtag  DW_TAG_member
    7889                      .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$24)
    7890                      .dwattr $C$DW$878, DW_AT_name("LOSPCP")
    7891                      .dwattr $C$DW$878, DW_AT_TI_symbol_name("_LOSPCP")
    7892                      .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7893                      .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
    7894              $C$DW$879       .dwtag  DW_TAG_member
    7895                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$24)
    7896                      .dwattr $C$DW$879, DW_AT_name("PCLKCR0")
    7897                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_PCLKCR0")
    7898                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7899                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
    7900              $C$DW$880       .dwtag  DW_TAG_member
    7901                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$24)
    7902                      .dwattr $C$DW$880, DW_AT_name("PCLKCR1")
    7903                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_PCLKCR1")
    7904                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7905                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
    7906              $C$DW$881       .dwtag  DW_TAG_member
    7907                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$27)
    7908                      .dwattr $C$DW$881, DW_AT_name("rsvd_3")
    7909                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_rsvd_3")
    7910                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7911                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    7912              $C$DW$882       .dwtag  DW_TAG_member
    7913                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$24)
    7914                      .dwattr $C$DW$882, DW_AT_name("PCLKCR3")
    7915                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_PCLKCR3")
    7916                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7917                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    7918                      .dwendtag $C$DW$T$36
    7919              
    7920              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    7921                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$36)
    7922                      .dwattr $C$DW$T$55, DW_AT_address_class(0x16)
    7923              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    7924                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    7925                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    7926              
    7927              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7928                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    7929                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  159

    7930              $C$DW$883       .dwtag  DW_TAG_member
    7931                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$33)
    7932                      .dwattr $C$DW$883, DW_AT_name("tmp")
    7933                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_tmp")
    7934                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7935                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    7936                      .dwendtag $C$DW$T$37
    7937              
    7938              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    7939                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$37)
    7940                      .dwattr $C$DW$T$57, DW_AT_address_class(0x16)
    7941              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    7942                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    7943                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    7944              
    7945              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    7946                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_USAGE_Obj_")
    7947                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x16)
    7948              $C$DW$884       .dwtag  DW_TAG_member
    7949                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$38)
    7950                      .dwattr $C$DW$884, DW_AT_name("timerPeriod_cnts")
    7951                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    7952                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7953                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    7954              $C$DW$885       .dwtag  DW_TAG_member
    7955                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$38)
    7956                      .dwattr $C$DW$885, DW_AT_name("cnt_z0")
    7957                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_cnt_z0")
    7958                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7959                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    7960              $C$DW$886       .dwtag  DW_TAG_member
    7961                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$38)
    7962                      .dwattr $C$DW$886, DW_AT_name("cnt_z1")
    7963                      .dwattr $C$DW$886, DW_AT_TI_symbol_name("_cnt_z1")
    7964                      .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7965                      .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
    7966              $C$DW$887       .dwtag  DW_TAG_member
    7967                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$38)
    7968                      .dwattr $C$DW$887, DW_AT_name("deltaCnt")
    7969                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_deltaCnt")
    7970                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7971                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
    7972              $C$DW$888       .dwtag  DW_TAG_member
    7973                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$38)
    7974                      .dwattr $C$DW$888, DW_AT_name("deltaCntAcc")
    7975                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_deltaCntAcc")
    7976                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7977                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
    7978              $C$DW$889       .dwtag  DW_TAG_member
    7979                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$38)
    7980                      .dwattr $C$DW$889, DW_AT_name("deltaCntAccNum")
    7981                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_deltaCntAccNum")
    7982                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7983                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
    7984              $C$DW$890       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  160

    7985                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$38)
    7986                      .dwattr $C$DW$890, DW_AT_name("deltaCntAccNumMax")
    7987                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
    7988                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7989                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
    7990              $C$DW$891       .dwtag  DW_TAG_member
    7991                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$38)
    7992                      .dwattr $C$DW$891, DW_AT_name("minDeltaCntObserved")
    7993                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_minDeltaCntObserved")
    7994                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7995                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
    7996              $C$DW$892       .dwtag  DW_TAG_member
    7997                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$38)
    7998                      .dwattr $C$DW$892, DW_AT_name("avgDeltaCntObserved")
    7999                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
    8000                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8001                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    8002              $C$DW$893       .dwtag  DW_TAG_member
    8003                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$38)
    8004                      .dwattr $C$DW$893, DW_AT_name("maxDeltaCntObserved")
    8005                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
    8006                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8007                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    8008              $C$DW$894       .dwtag  DW_TAG_member
    8009                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$39)
    8010                      .dwattr $C$DW$894, DW_AT_name("flag_resetStats")
    8011                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_flag_resetStats")
    8012                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8013                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    8014                      .dwendtag $C$DW$T$40
    8015              
    8016              $C$DW$T$192     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Obj")
    8017                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$40)
    8018                      .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    8019              $C$DW$T$193     .dwtag  DW_TAG_pointer_type
    8020                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$40)
    8021                      .dwattr $C$DW$T$193, DW_AT_address_class(0x16)
    8022              $C$DW$T$194     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Handle")
    8023                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$193)
    8024                      .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    8025              
    8026              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    8027                      .dwattr $C$DW$T$43, DW_AT_name("_CTRL_Version_")
    8028                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    8029              $C$DW$895       .dwtag  DW_TAG_member
    8030                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$23)
    8031                      .dwattr $C$DW$895, DW_AT_name("rsvd")
    8032                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_rsvd")
    8033                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8034                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    8035              $C$DW$896       .dwtag  DW_TAG_member
    8036                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$42)
    8037                      .dwattr $C$DW$896, DW_AT_name("targetProc")
    8038                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_targetProc")
    8039                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  161

    8040                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    8041              $C$DW$897       .dwtag  DW_TAG_member
    8042                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$23)
    8043                      .dwattr $C$DW$897, DW_AT_name("major")
    8044                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_major")
    8045                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8046                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    8047              $C$DW$898       .dwtag  DW_TAG_member
    8048                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$23)
    8049                      .dwattr $C$DW$898, DW_AT_name("minor")
    8050                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_minor")
    8051                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8052                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    8053                      .dwendtag $C$DW$T$43
    8054              
    8055              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    8056                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$43)
    8057                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    8058              
    8059              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8060                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    8061                      .dwattr $C$DW$T$20, DW_AT_declaration
    8062                      .dwendtag $C$DW$T$20
    8063              
    8064              $C$DW$T$145     .dwtag  DW_TAG_pointer_type
    8065                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$20)
    8066                      .dwattr $C$DW$T$145, DW_AT_address_class(0x16)
    8067              $C$DW$T$146     .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    8068                      .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$145)
    8069                      .dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
    8070              $C$DW$899       .dwtag  DW_TAG_TI_far_type
    8071                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$146)
    8072              $C$DW$T$198     .dwtag  DW_TAG_const_type
    8073                      .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$899)
    8074              
    8075              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    8076                      .dwattr $C$DW$T$44, DW_AT_name("_FILTER_FO_")
    8077                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x0a)
    8078              $C$DW$900       .dwtag  DW_TAG_member
    8079                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$32)
    8080                      .dwattr $C$DW$900, DW_AT_name("a1")
    8081                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_a1")
    8082                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8083                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    8084              $C$DW$901       .dwtag  DW_TAG_member
    8085                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$32)
    8086                      .dwattr $C$DW$901, DW_AT_name("b0")
    8087                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_b0")
    8088                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8089                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    8090              $C$DW$902       .dwtag  DW_TAG_member
    8091                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$32)
    8092                      .dwattr $C$DW$902, DW_AT_name("b1")
    8093                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_b1")
    8094                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  162

    8095                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8096              $C$DW$903       .dwtag  DW_TAG_member
    8097                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$32)
    8098                      .dwattr $C$DW$903, DW_AT_name("x1")
    8099                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_x1")
    8100                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8101                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8102              $C$DW$904       .dwtag  DW_TAG_member
    8103                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$32)
    8104                      .dwattr $C$DW$904, DW_AT_name("y1")
    8105                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_y1")
    8106                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8107                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8108                      .dwendtag $C$DW$T$44
    8109              
    8110              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    8111                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$44)
    8112                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    8113              
    8114              $C$DW$T$203     .dwtag  DW_TAG_array_type
    8115                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$103)
    8116                      .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
    8117                      .dwattr $C$DW$T$203, DW_AT_byte_size(0x3c)
    8118              $C$DW$905       .dwtag  DW_TAG_subrange_type
    8119                      .dwattr $C$DW$905, DW_AT_upper_bound(0x05)
    8120                      .dwendtag $C$DW$T$203
    8121              
    8122              $C$DW$T$204     .dwtag  DW_TAG_pointer_type
    8123                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$103)
    8124                      .dwattr $C$DW$T$204, DW_AT_address_class(0x16)
    8125              
    8126              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    8127                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    8128                      .dwattr $C$DW$T$21, DW_AT_declaration
    8129                      .dwendtag $C$DW$T$21
    8130              
    8131              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    8132                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$21)
    8133                      .dwattr $C$DW$T$104, DW_AT_address_class(0x16)
    8134              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    8135                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    8136                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    8137              
    8138              $C$DW$T$208     .dwtag  DW_TAG_array_type
    8139                      .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$105)
    8140                      .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    8141                      .dwattr $C$DW$T$208, DW_AT_byte_size(0x0c)
    8142              $C$DW$906       .dwtag  DW_TAG_subrange_type
    8143                      .dwattr $C$DW$906, DW_AT_upper_bound(0x05)
    8144                      .dwendtag $C$DW$T$208
    8145              
    8146              
    8147              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    8148                      .dwattr $C$DW$T$45, DW_AT_name("_FLASH_Obj_")
    8149                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  163

    8150              $C$DW$907       .dwtag  DW_TAG_member
    8151                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$24)
    8152                      .dwattr $C$DW$907, DW_AT_name("FOPT")
    8153                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_FOPT")
    8154                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8155                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8156              $C$DW$908       .dwtag  DW_TAG_member
    8157                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$24)
    8158                      .dwattr $C$DW$908, DW_AT_name("rsvd_1")
    8159                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_rsvd_1")
    8160                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8161                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8162              $C$DW$909       .dwtag  DW_TAG_member
    8163                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$24)
    8164                      .dwattr $C$DW$909, DW_AT_name("FPWR")
    8165                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_FPWR")
    8166                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8167                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8168              $C$DW$910       .dwtag  DW_TAG_member
    8169                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$24)
    8170                      .dwattr $C$DW$910, DW_AT_name("FSTATUS")
    8171                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_FSTATUS")
    8172                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8173                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8174              $C$DW$911       .dwtag  DW_TAG_member
    8175                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$24)
    8176                      .dwattr $C$DW$911, DW_AT_name("FSTDBYWAIT")
    8177                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    8178                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8179                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8180              $C$DW$912       .dwtag  DW_TAG_member
    8181                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$24)
    8182                      .dwattr $C$DW$912, DW_AT_name("FACTIVEWAIT")
    8183                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    8184                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8185                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8186              $C$DW$913       .dwtag  DW_TAG_member
    8187                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$24)
    8188                      .dwattr $C$DW$913, DW_AT_name("FBANKWAIT")
    8189                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_FBANKWAIT")
    8190                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8191                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8192              $C$DW$914       .dwtag  DW_TAG_member
    8193                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$24)
    8194                      .dwattr $C$DW$914, DW_AT_name("FOTPWAIT")
    8195                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_FOTPWAIT")
    8196                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8197                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    8198                      .dwendtag $C$DW$T$45
    8199              
    8200              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    8201                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$45)
    8202                      .dwattr $C$DW$T$59, DW_AT_address_class(0x16)
    8203              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    8204                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  164

    8205                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    8206              
    8207              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    8208                      .dwattr $C$DW$T$46, DW_AT_name("_FW_Obj_")
    8209                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x14)
    8210              $C$DW$915       .dwtag  DW_TAG_member
    8211                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$38)
    8212                      .dwattr $C$DW$915, DW_AT_name("numIsrTicksPerFwTick")
    8213                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_numIsrTicksPerFwTick")
    8214                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8215                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8216              $C$DW$916       .dwtag  DW_TAG_member
    8217                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$38)
    8218                      .dwattr $C$DW$916, DW_AT_name("counter_fw")
    8219                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_counter_fw")
    8220                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8221                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8222              $C$DW$917       .dwtag  DW_TAG_member
    8223                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$32)
    8224                      .dwattr $C$DW$917, DW_AT_name("delta_inc")
    8225                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_delta_inc")
    8226                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8227                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8228              $C$DW$918       .dwtag  DW_TAG_member
    8229                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$32)
    8230                      .dwattr $C$DW$918, DW_AT_name("delta_dec")
    8231                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_delta_dec")
    8232                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8233                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8234              $C$DW$919       .dwtag  DW_TAG_member
    8235                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$32)
    8236                      .dwattr $C$DW$919, DW_AT_name("refValue")
    8237                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_refValue")
    8238                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8239                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8240              $C$DW$920       .dwtag  DW_TAG_member
    8241                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$32)
    8242                      .dwattr $C$DW$920, DW_AT_name("fbackValue")
    8243                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_fbackValue")
    8244                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8245                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8246              $C$DW$921       .dwtag  DW_TAG_member
    8247                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$32)
    8248                      .dwattr $C$DW$921, DW_AT_name("output")
    8249                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_output")
    8250                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8251                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8252              $C$DW$922       .dwtag  DW_TAG_member
    8253                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$32)
    8254                      .dwattr $C$DW$922, DW_AT_name("outMin")
    8255                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_outMin")
    8256                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8257                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8258              $C$DW$923       .dwtag  DW_TAG_member
    8259                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  165

    8260                      .dwattr $C$DW$923, DW_AT_name("outMax")
    8261                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_outMax")
    8262                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8263                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8264              $C$DW$924       .dwtag  DW_TAG_member
    8265                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$39)
    8266                      .dwattr $C$DW$924, DW_AT_name("flag_enableFw")
    8267                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_flag_enableFw")
    8268                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8269                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8270                      .dwendtag $C$DW$T$46
    8271              
    8272              $C$DW$T$213     .dwtag  DW_TAG_typedef, DW_AT_name("FW_Obj")
    8273                      .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$46)
    8274                      .dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
    8275              $C$DW$T$214     .dwtag  DW_TAG_pointer_type
    8276                      .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$213)
    8277                      .dwattr $C$DW$T$214, DW_AT_address_class(0x16)
    8278              $C$DW$T$215     .dwtag  DW_TAG_pointer_type
    8279                      .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$46)
    8280                      .dwattr $C$DW$T$215, DW_AT_address_class(0x16)
    8281              $C$DW$T$216     .dwtag  DW_TAG_typedef, DW_AT_name("FW_Handle")
    8282                      .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$215)
    8283                      .dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
    8284              
    8285              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    8286                      .dwattr $C$DW$T$50, DW_AT_name("_GPIO_Obj_")
    8287                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x6a)
    8288              $C$DW$925       .dwtag  DW_TAG_member
    8289                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$47)
    8290                      .dwattr $C$DW$925, DW_AT_name("GPACTRL")
    8291                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_GPACTRL")
    8292                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8293                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    8294              $C$DW$926       .dwtag  DW_TAG_member
    8295                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$47)
    8296                      .dwattr $C$DW$926, DW_AT_name("GPAQSEL1")
    8297                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_GPAQSEL1")
    8298                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8299                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8300              $C$DW$927       .dwtag  DW_TAG_member
    8301                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$47)
    8302                      .dwattr $C$DW$927, DW_AT_name("GPAQSEL2")
    8303                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_GPAQSEL2")
    8304                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8305                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8306              $C$DW$928       .dwtag  DW_TAG_member
    8307                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$47)
    8308                      .dwattr $C$DW$928, DW_AT_name("GPAMUX1")
    8309                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_GPAMUX1")
    8310                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8311                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8312              $C$DW$929       .dwtag  DW_TAG_member
    8313                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$47)
    8314                      .dwattr $C$DW$929, DW_AT_name("GPAMUX2")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  166

    8315                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_GPAMUX2")
    8316                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8317                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8318              $C$DW$930       .dwtag  DW_TAG_member
    8319                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$47)
    8320                      .dwattr $C$DW$930, DW_AT_name("GPADIR")
    8321                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_GPADIR")
    8322                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8323                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    8324              $C$DW$931       .dwtag  DW_TAG_member
    8325                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$47)
    8326                      .dwattr $C$DW$931, DW_AT_name("GPAPUD")
    8327                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_GPAPUD")
    8328                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8329                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    8330              $C$DW$932       .dwtag  DW_TAG_member
    8331                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$27)
    8332                      .dwattr $C$DW$932, DW_AT_name("rsvd_1")
    8333                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_rsvd_1")
    8334                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8335                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    8336              $C$DW$933       .dwtag  DW_TAG_member
    8337                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$47)
    8338                      .dwattr $C$DW$933, DW_AT_name("GPBCTRL")
    8339                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_GPBCTRL")
    8340                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8341                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    8342              $C$DW$934       .dwtag  DW_TAG_member
    8343                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$47)
    8344                      .dwattr $C$DW$934, DW_AT_name("GPBQSEL1")
    8345                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_GPBQSEL1")
    8346                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8347                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    8348              $C$DW$935       .dwtag  DW_TAG_member
    8349                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$27)
    8350                      .dwattr $C$DW$935, DW_AT_name("rsvd_2")
    8351                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_rsvd_2")
    8352                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8353                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    8354              $C$DW$936       .dwtag  DW_TAG_member
    8355                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$47)
    8356                      .dwattr $C$DW$936, DW_AT_name("GPBMUX1")
    8357                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_GPBMUX1")
    8358                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8359                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    8360              $C$DW$937       .dwtag  DW_TAG_member
    8361                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$27)
    8362                      .dwattr $C$DW$937, DW_AT_name("rsvd_3")
    8363                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_rsvd_3")
    8364                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8365                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    8366              $C$DW$938       .dwtag  DW_TAG_member
    8367                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$47)
    8368                      .dwattr $C$DW$938, DW_AT_name("GPBDIR")
    8369                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_GPBDIR")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  167

    8370                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8371                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    8372              $C$DW$939       .dwtag  DW_TAG_member
    8373                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$47)
    8374                      .dwattr $C$DW$939, DW_AT_name("GPBPUD")
    8375                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_GPBPUD")
    8376                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8377                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    8378              $C$DW$940       .dwtag  DW_TAG_member
    8379                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$48)
    8380                      .dwattr $C$DW$940, DW_AT_name("rsvd_4")
    8381                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_rsvd_4")
    8382                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8383                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    8384              $C$DW$941       .dwtag  DW_TAG_member
    8385                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$47)
    8386                      .dwattr $C$DW$941, DW_AT_name("AIOMUX1")
    8387                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_AIOMUX1")
    8388                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    8389                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    8390              $C$DW$942       .dwtag  DW_TAG_member
    8391                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$27)
    8392                      .dwattr $C$DW$942, DW_AT_name("rsvd_5")
    8393                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_rsvd_5")
    8394                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8395                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    8396              $C$DW$943       .dwtag  DW_TAG_member
    8397                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$47)
    8398                      .dwattr $C$DW$943, DW_AT_name("AIODIR")
    8399                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_AIODIR")
    8400                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    8401                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    8402              $C$DW$944       .dwtag  DW_TAG_member
    8403                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$49)
    8404                      .dwattr $C$DW$944, DW_AT_name("rsvd_6")
    8405                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_rsvd_6")
    8406                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    8407                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    8408              $C$DW$945       .dwtag  DW_TAG_member
    8409                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$47)
    8410                      .dwattr $C$DW$945, DW_AT_name("GPADAT")
    8411                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_GPADAT")
    8412                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8413                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    8414              $C$DW$946       .dwtag  DW_TAG_member
    8415                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$47)
    8416                      .dwattr $C$DW$946, DW_AT_name("GPASET")
    8417                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_GPASET")
    8418                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    8419                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    8420              $C$DW$947       .dwtag  DW_TAG_member
    8421                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$47)
    8422                      .dwattr $C$DW$947, DW_AT_name("GPACLEAR")
    8423                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_GPACLEAR")
    8424                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  168

    8425                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    8426              $C$DW$948       .dwtag  DW_TAG_member
    8427                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$47)
    8428                      .dwattr $C$DW$948, DW_AT_name("GPATOGGLE")
    8429                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_GPATOGGLE")
    8430                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8431                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    8432              $C$DW$949       .dwtag  DW_TAG_member
    8433                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$47)
    8434                      .dwattr $C$DW$949, DW_AT_name("GPBDAT")
    8435                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_GPBDAT")
    8436                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8437                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    8438              $C$DW$950       .dwtag  DW_TAG_member
    8439                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$47)
    8440                      .dwattr $C$DW$950, DW_AT_name("GPBSET")
    8441                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_GPBSET")
    8442                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    8443                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    8444              $C$DW$951       .dwtag  DW_TAG_member
    8445                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$47)
    8446                      .dwattr $C$DW$951, DW_AT_name("GPBCLEAR")
    8447                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_GPBCLEAR")
    8448                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    8449                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    8450              $C$DW$952       .dwtag  DW_TAG_member
    8451                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$47)
    8452                      .dwattr $C$DW$952, DW_AT_name("GPBTOGGLE")
    8453                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_GPBTOGGLE")
    8454                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    8455                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    8456              $C$DW$953       .dwtag  DW_TAG_member
    8457                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$35)
    8458                      .dwattr $C$DW$953, DW_AT_name("rsvd_7")
    8459                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_rsvd_7")
    8460                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    8461                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    8462              $C$DW$954       .dwtag  DW_TAG_member
    8463                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$47)
    8464                      .dwattr $C$DW$954, DW_AT_name("AIODAT")
    8465                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_AIODAT")
    8466                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8467                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    8468              $C$DW$955       .dwtag  DW_TAG_member
    8469                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$47)
    8470                      .dwattr $C$DW$955, DW_AT_name("AIOSET")
    8471                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_AIOSET")
    8472                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    8473                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    8474              $C$DW$956       .dwtag  DW_TAG_member
    8475                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$47)
    8476                      .dwattr $C$DW$956, DW_AT_name("AIOCLEAR")
    8477                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_AIOCLEAR")
    8478                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8479                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  169

    8480              $C$DW$957       .dwtag  DW_TAG_member
    8481                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$47)
    8482                      .dwattr $C$DW$957, DW_AT_name("AIOTOGGLE")
    8483                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_AIOTOGGLE")
    8484                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8485                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    8486              $C$DW$958       .dwtag  DW_TAG_member
    8487                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$29)
    8488                      .dwattr $C$DW$958, DW_AT_name("GPIOXINTnSEL")
    8489                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    8490                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8491                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    8492              $C$DW$959       .dwtag  DW_TAG_member
    8493                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$28)
    8494                      .dwattr $C$DW$959, DW_AT_name("rsvd_8")
    8495                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_rsvd_8")
    8496                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    8497                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    8498              $C$DW$960       .dwtag  DW_TAG_member
    8499                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$47)
    8500                      .dwattr $C$DW$960, DW_AT_name("GPIOLPMSEL")
    8501                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    8502                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    8503                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    8504                      .dwendtag $C$DW$T$50
    8505              
    8506              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    8507                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$50)
    8508                      .dwattr $C$DW$T$61, DW_AT_address_class(0x16)
    8509              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    8510                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    8511                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    8512              
    8513              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    8514                      .dwattr $C$DW$T$52, DW_AT_name("_HAL_AdcData_t_")
    8515                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x0e)
    8516              $C$DW$961       .dwtag  DW_TAG_member
    8517                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$51)
    8518                      .dwattr $C$DW$961, DW_AT_name("I")
    8519                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_I")
    8520                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8521                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    8522              $C$DW$962       .dwtag  DW_TAG_member
    8523                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$51)
    8524                      .dwattr $C$DW$962, DW_AT_name("V")
    8525                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_V")
    8526                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8527                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    8528              $C$DW$963       .dwtag  DW_TAG_member
    8529                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$32)
    8530                      .dwattr $C$DW$963, DW_AT_name("dcBus")
    8531                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_dcBus")
    8532                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8533                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    8534                      .dwendtag $C$DW$T$52
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  170

    8535              
    8536              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    8537                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$52)
    8538                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    8539              
    8540              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    8541                      .dwattr $C$DW$T$87, DW_AT_name("_HAL_Obj_")
    8542                      .dwattr $C$DW$T$87, DW_AT_byte_size(0xa8)
    8543              $C$DW$964       .dwtag  DW_TAG_member
    8544                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$54)
    8545                      .dwattr $C$DW$964, DW_AT_name("adcHandle")
    8546                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_adcHandle")
    8547                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8548                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    8549              $C$DW$965       .dwtag  DW_TAG_member
    8550                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$56)
    8551                      .dwattr $C$DW$965, DW_AT_name("clkHandle")
    8552                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_clkHandle")
    8553                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8554                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    8555              $C$DW$966       .dwtag  DW_TAG_member
    8556                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$58)
    8557                      .dwattr $C$DW$966, DW_AT_name("cpuHandle")
    8558                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_cpuHandle")
    8559                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8560                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    8561              $C$DW$967       .dwtag  DW_TAG_member
    8562                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$60)
    8563                      .dwattr $C$DW$967, DW_AT_name("flashHandle")
    8564                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_flashHandle")
    8565                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8566                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    8567              $C$DW$968       .dwtag  DW_TAG_member
    8568                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$62)
    8569                      .dwattr $C$DW$968, DW_AT_name("gpioHandle")
    8570                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_gpioHandle")
    8571                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8572                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    8573              $C$DW$969       .dwtag  DW_TAG_member
    8574                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$65)
    8575                      .dwattr $C$DW$969, DW_AT_name("offsetHandle_I")
    8576                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_offsetHandle_I")
    8577                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8578                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    8579              $C$DW$970       .dwtag  DW_TAG_member
    8580                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$67)
    8581                      .dwattr $C$DW$970, DW_AT_name("offset_I")
    8582                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_offset_I")
    8583                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8584                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    8585              $C$DW$971       .dwtag  DW_TAG_member
    8586                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$65)
    8587                      .dwattr $C$DW$971, DW_AT_name("offsetHandle_V")
    8588                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_offsetHandle_V")
    8589                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  171

    8590                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    8591              $C$DW$972       .dwtag  DW_TAG_member
    8592                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$67)
    8593                      .dwattr $C$DW$972, DW_AT_name("offset_V")
    8594                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_offset_V")
    8595                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8596                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    8597              $C$DW$973       .dwtag  DW_TAG_member
    8598                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$69)
    8599                      .dwattr $C$DW$973, DW_AT_name("oscHandle")
    8600                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_oscHandle")
    8601                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    8602                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    8603              $C$DW$974       .dwtag  DW_TAG_member
    8604                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$71)
    8605                      .dwattr $C$DW$974, DW_AT_name("pieHandle")
    8606                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_pieHandle")
    8607                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8608                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    8609              $C$DW$975       .dwtag  DW_TAG_member
    8610                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$73)
    8611                      .dwattr $C$DW$975, DW_AT_name("pllHandle")
    8612                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_pllHandle")
    8613                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    8614                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    8615              $C$DW$976       .dwtag  DW_TAG_member
    8616                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$76)
    8617                      .dwattr $C$DW$976, DW_AT_name("pwmHandle")
    8618                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_pwmHandle")
    8619                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    8620                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    8621              $C$DW$977       .dwtag  DW_TAG_member
    8622                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$76)
    8623                      .dwattr $C$DW$977, DW_AT_name("pwmDacHandle")
    8624                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_pwmDacHandle")
    8625                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    8626                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    8627              $C$DW$978       .dwtag  DW_TAG_member
    8628                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$78)
    8629                      .dwattr $C$DW$978, DW_AT_name("pwrHandle")
    8630                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_pwrHandle")
    8631                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    8632                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    8633              $C$DW$979       .dwtag  DW_TAG_member
    8634                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$81)
    8635                      .dwattr $C$DW$979, DW_AT_name("timerHandle")
    8636                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_timerHandle")
    8637                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    8638                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    8639              $C$DW$980       .dwtag  DW_TAG_member
    8640                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$83)
    8641                      .dwattr $C$DW$980, DW_AT_name("i2cHandle")
    8642                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_i2cHandle")
    8643                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    8644                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  172

    8645              $C$DW$981       .dwtag  DW_TAG_member
    8646                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$85)
    8647                      .dwattr $C$DW$981, DW_AT_name("wdogHandle")
    8648                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_wdogHandle")
    8649                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    8650                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    8651              $C$DW$982       .dwtag  DW_TAG_member
    8652                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$86)
    8653                      .dwattr $C$DW$982, DW_AT_name("adcBias")
    8654                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_adcBias")
    8655                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    8656                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    8657              $C$DW$983       .dwtag  DW_TAG_member
    8658                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$32)
    8659                      .dwattr $C$DW$983, DW_AT_name("current_sf")
    8660                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_current_sf")
    8661                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    8662                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    8663              $C$DW$984       .dwtag  DW_TAG_member
    8664                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$32)
    8665                      .dwattr $C$DW$984, DW_AT_name("voltage_sf")
    8666                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_voltage_sf")
    8667                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8668                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    8669              $C$DW$985       .dwtag  DW_TAG_member
    8670                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$33)
    8671                      .dwattr $C$DW$985, DW_AT_name("numCurrentSensors")
    8672                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_numCurrentSensors")
    8673                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    8674                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    8675              $C$DW$986       .dwtag  DW_TAG_member
    8676                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$33)
    8677                      .dwattr $C$DW$986, DW_AT_name("numVoltageSensors")
    8678                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_numVoltageSensors")
    8679                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xa7]
    8680                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    8681                      .dwendtag $C$DW$T$87
    8682              
    8683              $C$DW$T$220     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    8684                      .dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$87)
    8685                      .dwattr $C$DW$T$220, DW_AT_language(DW_LANG_C)
    8686              $C$DW$T$221     .dwtag  DW_TAG_pointer_type
    8687                      .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$220)
    8688                      .dwattr $C$DW$T$221, DW_AT_address_class(0x16)
    8689              $C$DW$T$222     .dwtag  DW_TAG_pointer_type
    8690                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$87)
    8691                      .dwattr $C$DW$T$222, DW_AT_address_class(0x16)
    8692              $C$DW$T$223     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    8693                      .dwattr $C$DW$T$223, DW_AT_type(*$C$DW$T$222)
    8694                      .dwattr $C$DW$T$223, DW_AT_language(DW_LANG_C)
    8695              
    8696              $C$DW$T$88      .dwtag  DW_TAG_structure_type
    8697                      .dwattr $C$DW$T$88, DW_AT_name("_HAL_PwmData_t_")
    8698                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x06)
    8699              $C$DW$987       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  173

    8700                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$51)
    8701                      .dwattr $C$DW$987, DW_AT_name("Tabc")
    8702                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_Tabc")
    8703                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8704                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    8705                      .dwendtag $C$DW$T$88
    8706              
    8707              $C$DW$T$227     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_PwmData_t")
    8708                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$88)
    8709                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    8710              
    8711              $C$DW$T$89      .dwtag  DW_TAG_structure_type
    8712                      .dwattr $C$DW$T$89, DW_AT_name("_IPARK_Obj_")
    8713                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x04)
    8714              $C$DW$988       .dwtag  DW_TAG_member
    8715                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$32)
    8716                      .dwattr $C$DW$988, DW_AT_name("sinTh")
    8717                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_sinTh")
    8718                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8719                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    8720              $C$DW$989       .dwtag  DW_TAG_member
    8721                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$32)
    8722                      .dwattr $C$DW$989, DW_AT_name("cosTh")
    8723                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_cosTh")
    8724                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8725                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    8726                      .dwendtag $C$DW$T$89
    8727              
    8728              $C$DW$T$230     .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    8729                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$89)
    8730                      .dwattr $C$DW$T$230, DW_AT_language(DW_LANG_C)
    8731              $C$DW$T$231     .dwtag  DW_TAG_pointer_type
    8732                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    8733                      .dwattr $C$DW$T$231, DW_AT_address_class(0x16)
    8734              $C$DW$T$232     .dwtag  DW_TAG_pointer_type
    8735                      .dwattr $C$DW$T$232, DW_AT_type(*$C$DW$T$89)
    8736                      .dwattr $C$DW$T$232, DW_AT_address_class(0x16)
    8737              $C$DW$T$233     .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    8738                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$232)
    8739                      .dwattr $C$DW$T$233, DW_AT_language(DW_LANG_C)
    8740              
    8741              $C$DW$T$91      .dwtag  DW_TAG_structure_type
    8742                      .dwattr $C$DW$T$91, DW_AT_name("_MATH_vec2_")
    8743                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x04)
    8744              $C$DW$990       .dwtag  DW_TAG_member
    8745                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$90)
    8746                      .dwattr $C$DW$990, DW_AT_name("value")
    8747                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_value")
    8748                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8749                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    8750                      .dwendtag $C$DW$T$91
    8751              
    8752              $C$DW$T$237     .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    8753                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$91)
    8754                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 15:17:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1165210                              PAGE  174

    8755              $C$DW$991       .dwtag  DW_TAG_TI_far_type
    8756                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$237)
    8757              $C$DW$T$238     .dwtag  DW_TAG_const_type
    8758                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$991)
    8759              $C$DW$T$239     .dwtag  DW_TAG_pointer_type
    8760                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$T$238)
    8761                      .dwattr $C$DW$T$239, DW_AT_address_class(0x16)
    8762              $C$DW$T$240     .dwtag  DW_TAG_pointer_type
    8763                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$237)
    8764                      .dwattr $C$DW$T$240, DW_AT_address_class(0x16)
    8765              
    8766              $C$DW$T$93      .dwtag  DW_TAG_structure_type
    8767                      .dwattr $C$DW$T$93, DW_AT_name("_MATH_vec3_")
    8768                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x06)
    8769              $C$DW$992       .dwtag  DW_TAG_member
    8770                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$92)
    8771                      .dwattr $C$DW$992, DW_AT_name("value")
    8772                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_value")
    8773                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8774                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    8775                      .dwendtag $C$DW$T$93
    8776              
    8777              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    8778                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$93)
    8779                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    8780              
    8781              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    8782                      .dwattr $C$DW$T$102, DW_AT_name("_MOTOR_Vars_t_")
    8783                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x80)
    8784              $C$DW$993       .dwtag  DW_TAG_member
