TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Wed Jun 21 14:56:38 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/modules/diagnostic/graph/src/32
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_getSpeed_krpm")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_getSpeed_krpm")

     848              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_Low"), DW_AT_const_va
     849              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_High"), DW_AT_const_v
     850              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_Low"), DW_AT_const_va
     851              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
     852              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
     853              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
     854              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
     855              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
     856              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
     857              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
     858              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
     859              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
     860              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
     861              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
     862              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
     863              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
     864              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
     865              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
     866              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
     867              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
     868              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
     869              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
     870              $C$DW$176       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
     871              $C$DW$177       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
     872              $C$DW$178       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
     873              $C$DW$179       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
     874              $C$DW$180       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
     875              $C$DW$181       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
     876              $C$DW$182       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
     877              $C$DW$183       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
     878                      .dwendtag $C$DW$T$77
     879              
     880              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
     881                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
     882                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
     883              
     884              $C$DW$T$85      .dwtag  DW_TAG_enumeration_type
     885                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
     886              $C$DW$184       .dwtag  DW_TAG_enumerator, DW_AT_name("GRAPH_Buffer_NR0"), DW_AT_const_value(0x00)
     887              $C$DW$185       .dwtag  DW_TAG_enumerator, DW_AT_name("GRAPH_Buffer_NR1"), DW_AT_const_value(0x01)
     888              $C$DW$186       .dwtag  DW_TAG_enumerator, DW_AT_name("GRAPH_Buffer_NR2"), DW_AT_const_value(0x02)
     889              $C$DW$187       .dwtag  DW_TAG_enumerator, DW_AT_name("GRAPH_Buffer_NR3"), DW_AT_const_value(0x03)
     890                      .dwendtag $C$DW$T$85
     891              
     892              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("GRAPH_Buffer_NR_e")
     893                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
     894                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   18

     895              
     896              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     897                      .dwattr $C$DW$T$23, DW_AT_name("_Buffer_")
     898                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x204)
     899              $C$DW$188       .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$21)
     901                      .dwattr $C$DW$188, DW_AT_name("data")
     902                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_data")
     903                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     904                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
     905              $C$DW$189       .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
     907                      .dwattr $C$DW$189, DW_AT_name("read")
     908                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_read")
     909                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
     910                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
     911              $C$DW$190       .dwtag  DW_TAG_member
     912                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
     913                      .dwattr $C$DW$190, DW_AT_name("write")
     914                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_write")
     915                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x202]
     916                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
     917                      .dwendtag $C$DW$T$23
     918              
     919              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("Buffer_t")
     920                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$23)
     921                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
     922              $C$DW$191       .dwtag  DW_TAG_TI_far_type
     923                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$64)
     924              $C$DW$T$87      .dwtag  DW_TAG_volatile_type
     925                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$191)
     926              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
     927                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
     928                      .dwattr $C$DW$T$88, DW_AT_address_class(0x16)
     929              $C$DW$192       .dwtag  DW_TAG_TI_far_type
     930                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$88)
     931              $C$DW$T$89      .dwtag  DW_TAG_const_type
     932                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$192)
     933              
     934              $C$DW$T$65      .dwtag  DW_TAG_array_type
     935                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
     936                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     937                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x408)
     938              $C$DW$193       .dwtag  DW_TAG_subrange_type
     939                      .dwattr $C$DW$193, DW_AT_upper_bound(0x01)
     940                      .dwendtag $C$DW$T$65
     941              
     942              
     943              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     944                      .dwattr $C$DW$T$26, DW_AT_name("_CLARKE_Obj_")
     945                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x06)
     946              $C$DW$194       .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
     948                      .dwattr $C$DW$194, DW_AT_name("alpha_sf")
     949                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_alpha_sf")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   19

     950                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     951                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
     952              $C$DW$195       .dwtag  DW_TAG_member
     953                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
     954                      .dwattr $C$DW$195, DW_AT_name("beta_sf")
     955                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_beta_sf")
     956                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     957                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
     958              $C$DW$196       .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$25)
     960                      .dwattr $C$DW$196, DW_AT_name("numSensors")
     961                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_numSensors")
     962                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     963                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
     964                      .dwendtag $C$DW$T$26
     965              
     966              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
     967                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$26)
     968                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     969              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
     970                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
     971                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
     972              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
     973                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
     974                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
     975              
     976              $C$DW$T$60      .dwtag  DW_TAG_structure_type
     977                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Obj_")
     978                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x108)
     979              $C$DW$197       .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
     981                      .dwattr $C$DW$197, DW_AT_name("version")
     982                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_version")
     983                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
     985              $C$DW$198       .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$29)
     987                      .dwattr $C$DW$198, DW_AT_name("state")
     988                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_state")
     989                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     990                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
     991              $C$DW$199       .dwtag  DW_TAG_member
     992                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$29)
     993                      .dwattr $C$DW$199, DW_AT_name("prevState")
     994                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_prevState")
     995                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     996                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
     997              $C$DW$200       .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$31)
     999                      .dwattr $C$DW$200, DW_AT_name("errorCode")
    1000                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_errorCode")
    1001                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1002                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$201       .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   20

    1005                      .dwattr $C$DW$201, DW_AT_name("clarkeHandle_I")
    1006                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_clarkeHandle_I")
    1007                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1008                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1009              $C$DW$202       .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$34)
    1011                      .dwattr $C$DW$202, DW_AT_name("clarke_I")
    1012                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_clarke_I")
    1013                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1014                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$203       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$33)
    1017                      .dwattr $C$DW$203, DW_AT_name("clarkeHandle_V")
    1018                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_clarkeHandle_V")
    1019                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1020                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$204       .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$34)
    1023                      .dwattr $C$DW$204, DW_AT_name("clarke_V")
    1024                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_clarke_V")
    1025                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1026                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1027              $C$DW$205       .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$36)
    1029                      .dwattr $C$DW$205, DW_AT_name("estHandle")
    1030                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_estHandle")
    1031                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1032                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1033              $C$DW$206       .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$38)
    1035                      .dwattr $C$DW$206, DW_AT_name("parkHandle")
    1036                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_parkHandle")
    1037                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1038                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$207       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$39)
    1041                      .dwattr $C$DW$207, DW_AT_name("park")
    1042                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_park")
    1043                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1044                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$208       .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$41)
    1047                      .dwattr $C$DW$208, DW_AT_name("pidHandle_Id")
    1048                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_pidHandle_Id")
    1049                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1050                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1051              $C$DW$209       .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$42)
    1053                      .dwattr $C$DW$209, DW_AT_name("pid_Id")
    1054                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_pid_Id")
    1055                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1056                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$210       .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$41)
    1059                      .dwattr $C$DW$210, DW_AT_name("pidHandle_Iq")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   21

    1060                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_pidHandle_Iq")
    1061                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1062                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1063              $C$DW$211       .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$42)
    1065                      .dwattr $C$DW$211, DW_AT_name("pid_Iq")
    1066                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_pid_Iq")
    1067                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1068                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1069              $C$DW$212       .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$41)
    1071                      .dwattr $C$DW$212, DW_AT_name("pidHandle_spd")
    1072                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_pidHandle_spd")
    1073                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1074                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1075              $C$DW$213       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$42)
    1077                      .dwattr $C$DW$213, DW_AT_name("pid_spd")
    1078                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_pid_spd")
    1079                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1080                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1081              $C$DW$214       .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$44)
    1083                      .dwattr $C$DW$214, DW_AT_name("iparkHandle")
    1084                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_iparkHandle")
    1085                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    1086                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1087              $C$DW$215       .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$45)
    1089                      .dwattr $C$DW$215, DW_AT_name("ipark")
    1090                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_ipark")
    1091                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1092                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1093              $C$DW$216       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$47)
    1095                      .dwattr $C$DW$216, DW_AT_name("svgenHandle")
    1096                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_svgenHandle")
    1097                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1098                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$217       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$48)
    1101                      .dwattr $C$DW$217, DW_AT_name("svgen")
    1102                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_svgen")
    1103                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1104                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1105              $C$DW$218       .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$50)
    1107                      .dwattr $C$DW$218, DW_AT_name("trajHandle_Id")
    1108                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_trajHandle_Id")
    1109                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1110                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1111              $C$DW$219       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$51)
    1113                      .dwattr $C$DW$219, DW_AT_name("traj_Id")
    1114                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_traj_Id")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   22

    1115                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    1116                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$220       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$50)
    1119                      .dwattr $C$DW$220, DW_AT_name("trajHandle_spd")
    1120                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_trajHandle_spd")
    1121                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1122                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$221       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$51)
    1125                      .dwattr $C$DW$221, DW_AT_name("traj_spd")
    1126                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_traj_spd")
    1127                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    1128                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1129              $C$DW$222       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$50)
    1131                      .dwattr $C$DW$222, DW_AT_name("trajHandle_spdMax")
    1132                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    1133                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1134                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$223       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$51)
    1137                      .dwattr $C$DW$223, DW_AT_name("traj_spdMax")
    1138                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_traj_spdMax")
    1139                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    1140                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1141              $C$DW$224       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$52)
    1143                      .dwattr $C$DW$224, DW_AT_name("motorParams")
    1144                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_motorParams")
    1145                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1146                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1147              $C$DW$225       .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$55)
    1149                      .dwattr $C$DW$225, DW_AT_name("waitTimes")
    1150                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_waitTimes")
    1151                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    1152                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1153              $C$DW$226       .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$54)
    1155                      .dwattr $C$DW$226, DW_AT_name("counter_state")
    1156                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_counter_state")
    1157                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    1158                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1159              $C$DW$227       .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$56)
    1161                      .dwattr $C$DW$227, DW_AT_name("numIsrTicksPerCtrlTick")
    1162                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    1163                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    1164                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1165              $C$DW$228       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$56)
    1167                      .dwattr $C$DW$228, DW_AT_name("numCtrlTicksPerCurrentTick")
    1168                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    1169                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   23

    1170                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1171              $C$DW$229       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$56)
    1173                      .dwattr $C$DW$229, DW_AT_name("numCtrlTicksPerSpeedTick")
    1174                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    1175                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    1176                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1177              $C$DW$230       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$56)
    1179                      .dwattr $C$DW$230, DW_AT_name("numCtrlTicksPerTrajTick")
    1180                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    1181                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    1182                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1183              $C$DW$231       .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$54)
    1185                      .dwattr $C$DW$231, DW_AT_name("ctrlFreq_Hz")
    1186                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    1187                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1188                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1189              $C$DW$232       .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$54)
    1191                      .dwattr $C$DW$232, DW_AT_name("trajFreq_Hz")
    1192                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_trajFreq_Hz")
    1193                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    1194                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1195              $C$DW$233       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    1197                      .dwattr $C$DW$233, DW_AT_name("trajPeriod_sec")
    1198                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_trajPeriod_sec")
    1199                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1200                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1201              $C$DW$234       .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$57)
    1203                      .dwattr $C$DW$234, DW_AT_name("ctrlPeriod_sec")
    1204                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    1205                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    1206                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1207              $C$DW$235       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    1209                      .dwattr $C$DW$235, DW_AT_name("maxVsMag_pu")
    1210                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_maxVsMag_pu")
    1211                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1212                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1213              $C$DW$236       .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$58)
    1215                      .dwattr $C$DW$236, DW_AT_name("Iab_in")
    1216                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_Iab_in")
    1217                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    1218                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1219              $C$DW$237       .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$58)
    1221                      .dwattr $C$DW$237, DW_AT_name("Iab_filt")
    1222                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_Iab_filt")
    1223                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    1224                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   24

    1225              $C$DW$238       .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$58)
    1227                      .dwattr $C$DW$238, DW_AT_name("Idq_in")
    1228                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_Idq_in")
    1229                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    1230                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1231              $C$DW$239       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$58)
    1233                      .dwattr $C$DW$239, DW_AT_name("Vab_in")
    1234                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_Vab_in")
    1235                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    1236                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1237              $C$DW$240       .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    1239                      .dwattr $C$DW$240, DW_AT_name("spd_out")
    1240                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_spd_out")
    1241                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    1242                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1243              $C$DW$241       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$58)
    1245                      .dwattr $C$DW$241, DW_AT_name("Vab_out")
    1246                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_Vab_out")
    1247                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    1248                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1249              $C$DW$242       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$58)
    1251                      .dwattr $C$DW$242, DW_AT_name("Vdq_out")
    1252                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_Vdq_out")
    1253                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1254                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1255              $C$DW$243       .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$57)
    1257                      .dwattr $C$DW$243, DW_AT_name("Rhf")
    1258                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_Rhf")
    1259                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1260                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1261              $C$DW$244       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$57)
    1263                      .dwattr $C$DW$244, DW_AT_name("Lhf")
    1264                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_Lhf")
    1265                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    1266                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1267              $C$DW$245       .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$57)
    1269                      .dwattr $C$DW$245, DW_AT_name("RoverL")
    1270                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_RoverL")
    1271                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    1272                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1273              $C$DW$246       .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    1275                      .dwattr $C$DW$246, DW_AT_name("Kp_Id")
    1276                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_Kp_Id")
    1277                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    1278                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1279              $C$DW$247       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   25

    1280                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    1281                      .dwattr $C$DW$247, DW_AT_name("Kp_Iq")
    1282                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_Kp_Iq")
    1283                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    1284                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$248       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    1287                      .dwattr $C$DW$248, DW_AT_name("Kp_spd")
    1288                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_Kp_spd")
    1289                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    1290                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1291              $C$DW$249       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    1293                      .dwattr $C$DW$249, DW_AT_name("Ki_Id")
    1294                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_Ki_Id")
    1295                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    1296                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    1297              $C$DW$250       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    1299                      .dwattr $C$DW$250, DW_AT_name("Ki_Iq")
    1300                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_Ki_Iq")
    1301                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    1302                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    1303              $C$DW$251       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    1305                      .dwattr $C$DW$251, DW_AT_name("Ki_spd")
    1306                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_Ki_spd")
    1307                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    1308                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    1309              $C$DW$252       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    1311                      .dwattr $C$DW$252, DW_AT_name("Kd_Id")
    1312                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_Kd_Id")
    1313                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    1314                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    1315              $C$DW$253       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    1317                      .dwattr $C$DW$253, DW_AT_name("Kd_Iq")
    1318                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_Kd_Iq")
    1319                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    1320                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1321              $C$DW$254       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    1323                      .dwattr $C$DW$254, DW_AT_name("Kd_spd")
    1324                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_Kd_spd")
    1325                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    1326                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$255       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    1329                      .dwattr $C$DW$255, DW_AT_name("Ui_Id")
    1330                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_Ui_Id")
    1331                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    1332                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$256       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   26

    1335                      .dwattr $C$DW$256, DW_AT_name("Ui_Iq")
    1336                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_Ui_Iq")
    1337                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    1338                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    1339              $C$DW$257       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    1341                      .dwattr $C$DW$257, DW_AT_name("Ui_spd")
    1342                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_Ui_spd")
    1343                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1344                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    1345              $C$DW$258       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$58)
    1347                      .dwattr $C$DW$258, DW_AT_name("Idq_ref")
    1348                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_Idq_ref")
    1349                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    1350                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    1351              $C$DW$259       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    1353                      .dwattr $C$DW$259, DW_AT_name("IdRated")
    1354                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_IdRated")
    1355                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    1356                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    1357              $C$DW$260       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    1359                      .dwattr $C$DW$260, DW_AT_name("spd_ref")
    1360                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_spd_ref")
    1361                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    1362                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    1363              $C$DW$261       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    1365                      .dwattr $C$DW$261, DW_AT_name("spd_max")
    1366                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_spd_max")
    1367                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    1368                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1369              $C$DW$262       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$56)
    1371                      .dwattr $C$DW$262, DW_AT_name("counter_current")
    1372                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_counter_current")
    1373                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    1374                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1375              $C$DW$263       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$56)
    1377                      .dwattr $C$DW$263, DW_AT_name("counter_isr")
    1378                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_counter_isr")
    1379                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    1380                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    1381              $C$DW$264       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$56)
    1383                      .dwattr $C$DW$264, DW_AT_name("counter_speed")
    1384                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_counter_speed")
    1385                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    1386                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    1387              $C$DW$265       .dwtag  DW_TAG_member
    1388                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$56)
    1389                      .dwattr $C$DW$265, DW_AT_name("counter_traj")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   27

    1390                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_counter_traj")
    1391                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    1392                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    1393              $C$DW$266       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$59)
    1395                      .dwattr $C$DW$266, DW_AT_name("flag_enableCtrl")
    1396                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_flag_enableCtrl")
    1397                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1398                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    1399              $C$DW$267       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$59)
    1401                      .dwattr $C$DW$267, DW_AT_name("flag_enableDcBusComp")
    1402                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    1403                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    1404                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    1405              $C$DW$268       .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$59)
    1407                      .dwattr $C$DW$268, DW_AT_name("flag_enablePowerWarp")
    1408                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    1409                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    1410                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    1411              $C$DW$269       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$59)
    1413                      .dwattr $C$DW$269, DW_AT_name("flag_enableOffset")
    1414                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_flag_enableOffset")
    1415                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    1416                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    1417              $C$DW$270       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$59)
    1419                      .dwattr $C$DW$270, DW_AT_name("flag_enableSpeedCtrl")
    1420                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    1421                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1422                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    1423              $C$DW$271       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$59)
    1425                      .dwattr $C$DW$271, DW_AT_name("flag_enableUserMotorParams")
    1426                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    1427                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    1428                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    1429              $C$DW$272       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$58)
    1431                      .dwattr $C$DW$272, DW_AT_name("Idq_offset_pu")
    1432                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_Idq_offset_pu")
    1433                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    1434                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    1435              $C$DW$273       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$58)
    1437                      .dwattr $C$DW$273, DW_AT_name("Vdq_offset_pu")
    1438                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    1439                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    1440                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    1441              $C$DW$274       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    1443                      .dwattr $C$DW$274, DW_AT_name("angle_pu")
    1444                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_angle_pu")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   28

    1445                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    1446                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    1447              $C$DW$275       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    1449                      .dwattr $C$DW$275, DW_AT_name("speed_ref_pu")
    1450                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_speed_ref_pu")
    1451                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1452                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    1453              $C$DW$276       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    1455                      .dwattr $C$DW$276, DW_AT_name("speed_fb_pu")
    1456                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_speed_fb_pu")
    1457                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    1458                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    1459              $C$DW$277       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    1461                      .dwattr $C$DW$277, DW_AT_name("speed_outMax_pu")
    1462                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_speed_outMax_pu")
    1463                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    1464                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    1465              $C$DW$278       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$59)
    1467                      .dwattr $C$DW$278, DW_AT_name("flag_enableCurrentCtrl")
    1468                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    1469                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    1470                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    1471                      .dwendtag $C$DW$T$60
    1472              
    1473              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    1474                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$60)
    1475                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1476              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    1477                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$60)
    1478                      .dwattr $C$DW$T$94, DW_AT_address_class(0x16)
    1479              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    1480                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    1481                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1482              $C$DW$279       .dwtag  DW_TAG_TI_far_type
    1483                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$95)
    1484              $C$DW$T$96      .dwtag  DW_TAG_const_type
    1485                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$279)
    1486              
    1487              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    1488                      .dwattr $C$DW$T$63, DW_AT_name("_CTRL_Version_")
    1489                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    1490              $C$DW$280       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$24)
    1492                      .dwattr $C$DW$280, DW_AT_name("rsvd")
    1493                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_rsvd")
    1494                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    1496              $C$DW$281       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$62)
    1498                      .dwattr $C$DW$281, DW_AT_name("targetProc")
    1499                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_targetProc")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   29

    1500                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1501                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    1502              $C$DW$282       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$24)
    1504                      .dwattr $C$DW$282, DW_AT_name("major")
    1505                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_major")
    1506                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1507                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    1508              $C$DW$283       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$24)
    1510                      .dwattr $C$DW$283, DW_AT_name("minor")
    1511                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_minor")
    1512                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1513                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    1514                      .dwendtag $C$DW$T$63
    1515              
    1516              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    1517                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$63)
    1518                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1519              
    1520              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1521                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    1522                      .dwattr $C$DW$T$19, DW_AT_declaration
    1523                      .dwendtag $C$DW$T$19
    1524              
    1525              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1526                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    1527                      .dwattr $C$DW$T$35, DW_AT_address_class(0x16)
    1528              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    1529                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1530                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1531              
    1532              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    1533                      .dwattr $C$DW$T$66, DW_AT_name("_GRAPH_Vars_t_")
    1534                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x416)
    1535              $C$DW$284       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$53)
    1537                      .dwattr $C$DW$284, DW_AT_name("Buffer_reset")
    1538                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_Buffer_reset")
    1539                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    1541              $C$DW$285       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$53)
    1543                      .dwattr $C$DW$285, DW_AT_name("Buffer_counter")
    1544                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_Buffer_counter")
    1545                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1546                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    1547              $C$DW$286       .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$53)
    1549                      .dwattr $C$DW$286, DW_AT_name("Buffer_tick_counter")
    1550                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_Buffer_tick_counter")
    1551                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1552                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    1553              $C$DW$287       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$53)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   30

    1555                      .dwattr $C$DW$287, DW_AT_name("Buffer_tick")
    1556                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_Buffer_tick")
    1557                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1558                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    1559              $C$DW$288       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$53)
    1561                      .dwattr $C$DW$288, DW_AT_name("Buffer_mode")
    1562                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_Buffer_mode")
    1563                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1564                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    1565              $C$DW$289       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$59)
    1567                      .dwattr $C$DW$289, DW_AT_name("Buffer_reset_wait")
    1568                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_Buffer_reset_wait")
    1569                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1570                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    1571              $C$DW$290       .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    1573                      .dwattr $C$DW$290, DW_AT_name("Buffer_previous")
    1574                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_Buffer_previous")
    1575                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1576                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    1577              $C$DW$291       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$65)
    1579                      .dwattr $C$DW$291, DW_AT_name("Buffer_data")
    1580                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_Buffer_data")
    1581                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1582                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    1583                      .dwendtag $C$DW$T$66
    1584              
    1585              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("GRAPH_Vars_t")
    1586                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$66)
    1587                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    1588              $C$DW$292       .dwtag  DW_TAG_TI_far_type
    1589                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$98)
    1590              $C$DW$T$99      .dwtag  DW_TAG_volatile_type
    1591                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$292)
    1592              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    1593                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    1594                      .dwattr $C$DW$T$100, DW_AT_address_class(0x16)
    1595              $C$DW$293       .dwtag  DW_TAG_TI_far_type
    1596                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$100)
    1597              $C$DW$T$101     .dwtag  DW_TAG_const_type
    1598                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$293)
    1599              
    1600              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    1601                      .dwattr $C$DW$T$67, DW_AT_name("_IPARK_Obj_")
    1602                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    1603              $C$DW$294       .dwtag  DW_TAG_member
    1604                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    1605                      .dwattr $C$DW$294, DW_AT_name("sinTh")
    1606                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_sinTh")
    1607                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    1609              $C$DW$295       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   31

    1610                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
    1611                      .dwattr $C$DW$295, DW_AT_name("cosTh")
    1612                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_cosTh")
    1613                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1614                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    1615                      .dwendtag $C$DW$T$67
    1616              
    1617              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    1618                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$67)
    1619                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1620              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    1621                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$67)
    1622                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    1623              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    1624                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1625                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1626              
    1627              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    1628                      .dwattr $C$DW$T$69, DW_AT_name("_MATH_vec2_")
    1629                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x04)
    1630              $C$DW$296       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$68)
    1632                      .dwattr $C$DW$296, DW_AT_name("value")
    1633                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_value")
    1634                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1635                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    1636                      .dwendtag $C$DW$T$69
    1637              
    1638              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    1639                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$69)
    1640                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1641              
    1642              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    1643                      .dwattr $C$DW$T$71, DW_AT_name("_MATH_vec3_")
    1644                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x06)
    1645              $C$DW$297       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$70)
    1647                      .dwattr $C$DW$297, DW_AT_name("value")
    1648                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_value")
    1649                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1650                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    1651                      .dwendtag $C$DW$T$71
    1652              
    1653              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    1654                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$71)
    1655                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1656              
    1657              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    1658                      .dwattr $C$DW$T$74, DW_AT_name("_MOTOR_Params_")
    1659                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0e)
    1660              $C$DW$298       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$73)
    1662                      .dwattr $C$DW$298, DW_AT_name("type")
    1663                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_type")
    1664                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   32

    1665                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    1666              $C$DW$299       .dwtag  DW_TAG_member
    1667                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$56)
    1668                      .dwattr $C$DW$299, DW_AT_name("numPolePairs")
    1669                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_numPolePairs")
    1670                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1671                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    1672              $C$DW$300       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$57)
    1674                      .dwattr $C$DW$300, DW_AT_name("Lr_H")
    1675                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_Lr_H")
    1676                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1677                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    1678              $C$DW$301       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$57)
    1680                      .dwattr $C$DW$301, DW_AT_name("Ls_d_H")
    1681                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_Ls_d_H")
    1682                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1683                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    1684              $C$DW$302       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$57)
    1686                      .dwattr $C$DW$302, DW_AT_name("Ls_q_H")
    1687                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_Ls_q_H")
    1688                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1689                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    1690              $C$DW$303       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$57)
    1692                      .dwattr $C$DW$303, DW_AT_name("Rr_Ohm")
    1693                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_Rr_Ohm")
    1694                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1695                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    1696              $C$DW$304       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$57)
    1698                      .dwattr $C$DW$304, DW_AT_name("Rs_Ohm")
    1699                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_Rs_Ohm")
    1700                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1701                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    1702              $C$DW$305       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$57)
    1704                      .dwattr $C$DW$305, DW_AT_name("ratedFlux_VpHz")
    1705                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    1706                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1707                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    1708                      .dwendtag $C$DW$T$74
    1709              
    1710              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    1711                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$74)
    1712                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1713              
    1714              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    1715                      .dwattr $C$DW$T$80, DW_AT_name("_MOTOR_Vars_t_")
    1716                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x80)
    1717              $C$DW$306       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$59)
    1719                      .dwattr $C$DW$306, DW_AT_name("Flag_enableSys")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   33

    1720                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_Flag_enableSys")
    1721                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$307       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$59)
    1725                      .dwattr $C$DW$307, DW_AT_name("Flag_Run_Identify")
    1726                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_Flag_Run_Identify")
    1727                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1728                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    1729              $C$DW$308       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$59)
    1731                      .dwattr $C$DW$308, DW_AT_name("Flag_MotorIdentified")
    1732                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_Flag_MotorIdentified")
    1733                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1734                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    1735              $C$DW$309       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$59)
    1737                      .dwattr $C$DW$309, DW_AT_name("Flag_enableForceAngle")
    1738                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_Flag_enableForceAngle")
    1739                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1740                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    1741              $C$DW$310       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$59)
    1743                      .dwattr $C$DW$310, DW_AT_name("Flag_enableFieldWeakening")
    1744                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_Flag_enableFieldWeakening")
    1745                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1746                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    1747              $C$DW$311       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$59)
    1749                      .dwattr $C$DW$311, DW_AT_name("Flag_enableRsRecalc")
    1750                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_Flag_enableRsRecalc")
    1751                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1752                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    1753              $C$DW$312       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$59)
    1755                      .dwattr $C$DW$312, DW_AT_name("Flag_enableUserParams")
    1756                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_Flag_enableUserParams")
    1757                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1758                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    1759              $C$DW$313       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$59)
    1761                      .dwattr $C$DW$313, DW_AT_name("Flag_enableOffsetcalc")
    1762                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_Flag_enableOffsetcalc")
    1763                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1764                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    1765              $C$DW$314       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$59)
    1767                      .dwattr $C$DW$314, DW_AT_name("Flag_enablePowerWarp")
    1768                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_Flag_enablePowerWarp")
    1769                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1770                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    1771              $C$DW$315       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$59)
    1773                      .dwattr $C$DW$315, DW_AT_name("Flag_enableSpeedCtrl")
    1774                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_Flag_enableSpeedCtrl")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   34

    1775                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1776                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    1777              $C$DW$316       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$59)
    1779                      .dwattr $C$DW$316, DW_AT_name("Flag_enableRun")
    1780                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_Flag_enableRun")
    1781                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1782                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    1783              $C$DW$317       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$59)
    1785                      .dwattr $C$DW$317, DW_AT_name("Flag_RunState")
    1786                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_Flag_RunState")
    1787                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1788                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    1789              $C$DW$318       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$59)
    1791                      .dwattr $C$DW$318, DW_AT_name("Flag_enableFlyingStart")
    1792                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_Flag_enableFlyingStart")
    1793                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1794                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    1795              $C$DW$319       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$29)
    1797                      .dwattr $C$DW$319, DW_AT_name("CtrlState")
    1798                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_CtrlState")
    1799                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1800                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$320       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$76)
    1803                      .dwattr $C$DW$320, DW_AT_name("EstState")
    1804                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_EstState")
    1805                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1806                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$321       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$78)
    1809                      .dwattr $C$DW$321, DW_AT_name("UserErrorCode")
    1810                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_UserErrorCode")
    1811                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1812                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$322       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$27)
    1815                      .dwattr $C$DW$322, DW_AT_name("CtrlVersion")
    1816                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_CtrlVersion")
    1817                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1818                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$323       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$20)
    1821                      .dwattr $C$DW$323, DW_AT_name("IdRef_A")
    1822                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_IdRef_A")
    1823                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1824                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$324       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$20)
    1827                      .dwattr $C$DW$324, DW_AT_name("IqRef_A")
    1828                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_IqRef_A")
    1829                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   35

    1830                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    1831              $C$DW$325       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$20)
    1833                      .dwattr $C$DW$325, DW_AT_name("SpeedRef_pu")
    1834                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_SpeedRef_pu")
    1835                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1836                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$326       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$20)
    1839                      .dwattr $C$DW$326, DW_AT_name("SpeedRef_krpm")
    1840                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_SpeedRef_krpm")
    1841                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1842                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$327       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
    1845                      .dwattr $C$DW$327, DW_AT_name("SpeedTraj_krpm")
    1846                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_SpeedTraj_krpm")
    1847                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1848                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$328       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$20)
    1851                      .dwattr $C$DW$328, DW_AT_name("MaxAccel_krpmps")
    1852                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_MaxAccel_krpmps")
    1853                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1854                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    1855              $C$DW$329       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$20)
    1857                      .dwattr $C$DW$329, DW_AT_name("Speed_krpm")
    1858                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_Speed_krpm")
    1859                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1860                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    1861              $C$DW$330       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    1863                      .dwattr $C$DW$330, DW_AT_name("OverModulation")
    1864                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_OverModulation")
    1865                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1866                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    1867              $C$DW$331       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$20)
    1869                      .dwattr $C$DW$331, DW_AT_name("RsOnLineCurrent_A")
    1870                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_RsOnLineCurrent_A")
    1871                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1872                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    1873              $C$DW$332       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$20)
    1875                      .dwattr $C$DW$332, DW_AT_name("SvgenMaxModulation_ticks")
    1876                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_SvgenMaxModulation_ticks")
    1877                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1878                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    1879              $C$DW$333       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$20)
    1881                      .dwattr $C$DW$333, DW_AT_name("Flux_Wb")
    1882                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_Flux_Wb")
    1883                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1884                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   36

    1885              $C$DW$334       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$20)
    1887                      .dwattr $C$DW$334, DW_AT_name("Torque_Nm")
    1888                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_Torque_Nm")
    1889                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1890                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    1891              $C$DW$335       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$57)
    1893                      .dwattr $C$DW$335, DW_AT_name("MagnCurr_A")
    1894                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_MagnCurr_A")
    1895                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1896                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    1897              $C$DW$336       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$57)
    1899                      .dwattr $C$DW$336, DW_AT_name("Rr_Ohm")
    1900                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_Rr_Ohm")
    1901                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1902                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    1903              $C$DW$337       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$57)
    1905                      .dwattr $C$DW$337, DW_AT_name("Rs_Ohm")
    1906                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_Rs_Ohm")
    1907                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1908                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$338       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$57)
    1911                      .dwattr $C$DW$338, DW_AT_name("RsOnLine_Ohm")
    1912                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_RsOnLine_Ohm")
    1913                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1914                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    1915              $C$DW$339       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$57)
    1917                      .dwattr $C$DW$339, DW_AT_name("Lsd_H")
    1918                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_Lsd_H")
    1919                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1920                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    1921              $C$DW$340       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$57)
    1923                      .dwattr $C$DW$340, DW_AT_name("Lsq_H")
    1924                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_Lsq_H")
    1925                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1926                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$341       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$57)
    1929                      .dwattr $C$DW$341, DW_AT_name("Flux_VpHz")
    1930                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_Flux_VpHz")
    1931                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1932                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    1933              $C$DW$342       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$57)
    1935                      .dwattr $C$DW$342, DW_AT_name("ipd_excFreq_Hz")
    1936                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_ipd_excFreq_Hz")
    1937                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1938                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$343       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   37

    1940                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$20)
    1941                      .dwattr $C$DW$343, DW_AT_name("ipd_Kspd")
    1942                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_ipd_Kspd")
    1943                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1944                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$344       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    1947                      .dwattr $C$DW$344, DW_AT_name("ipd_excMag_coarse_pu")
    1948                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_ipd_excMag_coarse_pu")
    1949                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1950                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    1951              $C$DW$345       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    1953                      .dwattr $C$DW$345, DW_AT_name("ipd_excMag_fine_pu")
    1954                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_ipd_excMag_fine_pu")
    1955                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1956                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$346       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$16)
    1959                      .dwattr $C$DW$346, DW_AT_name("ipd_waitTime_coarse_sec")
    1960                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_ipd_waitTime_coarse_sec")
    1961                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1962                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$347       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$16)
    1965                      .dwattr $C$DW$347, DW_AT_name("ipd_waitTime_fine_sec")
    1966                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_ipd_waitTime_fine_sec")
    1967                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1968                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$348       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    1971                      .dwattr $C$DW$348, DW_AT_name("Kp_spd")
    1972                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_Kp_spd")
    1973                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1974                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    1975              $C$DW$349       .dwtag  DW_TAG_member
    1976                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    1977                      .dwattr $C$DW$349, DW_AT_name("Ki_spd")
    1978                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_Ki_spd")
    1979                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1980                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    1981              $C$DW$350       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
    1983                      .dwattr $C$DW$350, DW_AT_name("Kp_Idq")
    1984                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_Kp_Idq")
    1985                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1986                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    1987              $C$DW$351       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    1989                      .dwattr $C$DW$351, DW_AT_name("Ki_Idq")
    1990                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_Ki_Idq")
    1991                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1992                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    1993              $C$DW$352       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:38 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0706010                              PAGE   38

    1995                      .dwattr $C$DW$352, DW_AT_name("Vd")
    1996                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_Vd")
    1997                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1998                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$353       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    2001                      .dwattr $C$DW$353, DW_AT_name("Vq")
    2002                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_Vq")
    2003                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2004                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2005              $C$DW$354       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    2007                      .dwattr $C$DW$354, DW_AT_name("Vs")
    2008                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_Vs")
    2009                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2010                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2011              $C$DW$355       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
    2013                      .dwattr $C$DW$355, DW_AT_name("VsRef")
    2014                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_VsRef")
    2015                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2016                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2017              $C$DW$356       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    2019                      .dwattr $C$DW$356, DW_AT_name("VdcBus_kV")
    2020                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_VdcBus_kV")
    2021                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2022                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2023              $C$DW$357       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    2025                      .dwattr $C$DW$357, DW_AT_name("Id_A")
    2026                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_Id_A")
    2027                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2028                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2029              $C$DW$358       .dwtag  DW_TAG_member
    2030                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    2031                      .dwattr $C$DW$358, DW_AT_name("Iq_A")
    2032                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_Iq_A")
    2033                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2034                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2035              $C$DW$359       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    2037                      .dwattr $C$DW$359, DW_AT_name("Is_A")
