TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Wed Jun 21 14:56:41 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3226              $C$DW$462       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_30"), DW_AT_const_value(0x1e)
    3227              $C$DW$463       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Rsvd_31"), DW_AT_const_value(0x1f)
    3228              $C$DW$464       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_32"), DW_AT_const_value(0x20)
    3229              $C$DW$465       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_33"), DW_AT_const_value(0x21)
    3230              $C$DW$466       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_34"), DW_AT_const_value(0x22)
    3231              $C$DW$467       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_35"), DW_AT_const_value(0x23)
    3232              $C$DW$468       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_36"), DW_AT_const_value(0x24)
    3233              $C$DW$469       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_37"), DW_AT_const_value(0x25)
    3234              $C$DW$470       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Number_38"), DW_AT_const_value(0x26)
    3235              $C$DW$471       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_numGpios"), DW_AT_const_value(0x27)
    3236                      .dwendtag $C$DW$T$183
    3237              
    3238              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Number_e")
    3239                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
    3240                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    3241              $C$DW$472       .dwtag  DW_TAG_TI_far_type
    3242                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$184)
    3243              $C$DW$T$185     .dwtag  DW_TAG_const_type
    3244                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$472)
    3245              
    3246              $C$DW$T$186     .dwtag  DW_TAG_enumeration_type
    3247                      .dwattr $C$DW$T$186, DW_AT_byte_size(0x01)
    3248              $C$DW$473       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3249              $C$DW$474       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3250              $C$DW$475       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3251              $C$DW$476       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3252              $C$DW$477       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3253              $C$DW$478       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3254              $C$DW$479       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3255              $C$DW$480       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3256              $C$DW$481       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3257              $C$DW$482       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3258              $C$DW$483       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3259              $C$DW$484       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3260                      .dwendtag $C$DW$T$186
    3261              
    3262              $C$DW$T$187     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3263                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$186)
    3264                      .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    3265              
    3266              $C$DW$T$189     .dwtag  DW_TAG_enumeration_type
    3267                      .dwattr $C$DW$T$189, DW_AT_byte_size(0x01)
    3268              $C$DW$485       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3269              $C$DW$486       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3270              $C$DW$487       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   66

    3271                      .dwendtag $C$DW$T$189
    3272              
    3273              $C$DW$T$190     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3274                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$189)
    3275                      .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    3276              
    3277              $C$DW$T$192     .dwtag  DW_TAG_enumeration_type
    3278                      .dwattr $C$DW$T$192, DW_AT_byte_size(0x01)
    3279              $C$DW$488       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3280              $C$DW$489       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3281                      .dwendtag $C$DW$T$192
    3282              
    3283              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3284                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
    3285                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    3286              
    3287              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3288                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    3289                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    3290              $C$DW$490       .dwtag  DW_TAG_member
    3291                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$24)
    3292                      .dwattr $C$DW$490, DW_AT_name("ADCRESULT")
    3293                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_ADCRESULT")
    3294                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3295                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3296              $C$DW$491       .dwtag  DW_TAG_member
    3297                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$25)
    3298                      .dwattr $C$DW$491, DW_AT_name("resvd_1")
    3299                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_resvd_1")
    3300                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3301                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3302              $C$DW$492       .dwtag  DW_TAG_member
    3303                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$23)
    3304                      .dwattr $C$DW$492, DW_AT_name("ADCCTL1")
    3305                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_ADCCTL1")
    3306                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3307                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3308              $C$DW$493       .dwtag  DW_TAG_member
    3309                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$23)
    3310                      .dwattr $C$DW$493, DW_AT_name("ADCCTL2")
    3311                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_ADCCTL2")
    3312                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3313                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3314              $C$DW$494       .dwtag  DW_TAG_member
    3315                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$26)
    3316                      .dwattr $C$DW$494, DW_AT_name("rsvd_2")
    3317                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_rsvd_2")
    3318                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3319                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3320              $C$DW$495       .dwtag  DW_TAG_member
    3321                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$23)
    3322                      .dwattr $C$DW$495, DW_AT_name("ADCINTFLG")
    3323                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_ADCINTFLG")
    3324                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3325                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   67

    3326              $C$DW$496       .dwtag  DW_TAG_member
    3327                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$23)
    3328                      .dwattr $C$DW$496, DW_AT_name("ADCINTFLGCLR")
    3329                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3330                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3331                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3332              $C$DW$497       .dwtag  DW_TAG_member
    3333                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$23)
    3334                      .dwattr $C$DW$497, DW_AT_name("ADCINTOVF")
    3335                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_ADCINTOVF")
    3336                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3337                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3338              $C$DW$498       .dwtag  DW_TAG_member
    3339                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$23)
    3340                      .dwattr $C$DW$498, DW_AT_name("ADCINTOVFCLR")
    3341                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3342                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3343                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3344              $C$DW$499       .dwtag  DW_TAG_member
    3345                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$27)
    3346                      .dwattr $C$DW$499, DW_AT_name("INTSELxNy")
    3347                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_INTSELxNy")
    3348                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3349                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3350              $C$DW$500       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$28)
    3352                      .dwattr $C$DW$500, DW_AT_name("rsvd_3")
    3353                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_rsvd_3")
    3354                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3355                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3356              $C$DW$501       .dwtag  DW_TAG_member
    3357                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$23)
    3358                      .dwattr $C$DW$501, DW_AT_name("SOCPRICTRL")
    3359                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3360                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3361                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3362              $C$DW$502       .dwtag  DW_TAG_member
    3363                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$23)
    3364                      .dwattr $C$DW$502, DW_AT_name("rsvd_4")
    3365                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_rsvd_4")
    3366                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3367                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3368              $C$DW$503       .dwtag  DW_TAG_member
    3369                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$23)
    3370                      .dwattr $C$DW$503, DW_AT_name("ADCSAMPLEMODE")
    3371                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3372                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3373                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3374              $C$DW$504       .dwtag  DW_TAG_member
    3375                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$23)
    3376                      .dwattr $C$DW$504, DW_AT_name("rsvd_5")
    3377                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_rsvd_5")
    3378                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3379                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3380              $C$DW$505       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   68

    3381                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$23)
    3382                      .dwattr $C$DW$505, DW_AT_name("ADCINTSOCSEL1")
    3383                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3384                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3385                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3386              $C$DW$506       .dwtag  DW_TAG_member
    3387                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$23)
    3388                      .dwattr $C$DW$506, DW_AT_name("ADCINTSOCSEL2")
    3389                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3390                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3391                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3392              $C$DW$507       .dwtag  DW_TAG_member
    3393                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$26)
    3394                      .dwattr $C$DW$507, DW_AT_name("rsvd_6")
    3395                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_rsvd_6")
    3396                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3397                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3398              $C$DW$508       .dwtag  DW_TAG_member
    3399                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$23)
    3400                      .dwattr $C$DW$508, DW_AT_name("ADCSOCFLG1")
    3401                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3402                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3403                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3404              $C$DW$509       .dwtag  DW_TAG_member
    3405                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$23)
    3406                      .dwattr $C$DW$509, DW_AT_name("rsvd_7")
    3407                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_rsvd_7")
    3408                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3409                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3410              $C$DW$510       .dwtag  DW_TAG_member
    3411                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$23)
    3412                      .dwattr $C$DW$510, DW_AT_name("ADCSOCFRC1")
    3413                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3414                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3415                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3416              $C$DW$511       .dwtag  DW_TAG_member
    3417                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$23)
    3418                      .dwattr $C$DW$511, DW_AT_name("rsvd_8")
    3419                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_rsvd_8")
    3420                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3421                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3422              $C$DW$512       .dwtag  DW_TAG_member
    3423                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$23)
    3424                      .dwattr $C$DW$512, DW_AT_name("ADCSOCOVF1")
    3425                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3426                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3427                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3428              $C$DW$513       .dwtag  DW_TAG_member
    3429                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$23)
    3430                      .dwattr $C$DW$513, DW_AT_name("rsvd_9")
    3431                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_rsvd_9")
    3432                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3433                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3434              $C$DW$514       .dwtag  DW_TAG_member
    3435                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   69

    3436                      .dwattr $C$DW$514, DW_AT_name("ADCSOCOVFCLR1")
    3437                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3438                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3439                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3440              $C$DW$515       .dwtag  DW_TAG_member
    3441                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$23)
    3442                      .dwattr $C$DW$515, DW_AT_name("rsvd_10")
    3443                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_rsvd_10")
    3444                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3445                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3446              $C$DW$516       .dwtag  DW_TAG_member
    3447                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$24)
    3448                      .dwattr $C$DW$516, DW_AT_name("ADCSOCxCTL")
    3449                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3450                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3451                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3452              $C$DW$517       .dwtag  DW_TAG_member
    3453                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$24)
    3454                      .dwattr $C$DW$517, DW_AT_name("rsvd_11")
    3455                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_rsvd_11")
    3456                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3457                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3458              $C$DW$518       .dwtag  DW_TAG_member
    3459                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$23)
    3460                      .dwattr $C$DW$518, DW_AT_name("ADCREFTRIM")
    3461                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3462                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3463                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3464              $C$DW$519       .dwtag  DW_TAG_member
    3465                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$23)
    3466                      .dwattr $C$DW$519, DW_AT_name("ADCOFFTRIM")
    3467                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3468                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3469                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    3470              $C$DW$520       .dwtag  DW_TAG_member
    3471                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$29)
    3472                      .dwattr $C$DW$520, DW_AT_name("resvd_12")
    3473                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_resvd_12")
    3474                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3475                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    3476              $C$DW$521       .dwtag  DW_TAG_member
    3477                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$23)
    3478                      .dwattr $C$DW$521, DW_AT_name("ADCREV")
    3479                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_ADCREV")
    3480                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3481                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    3482                      .dwendtag $C$DW$T$30
    3483              
    3484              $C$DW$T$195     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3485                      .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$30)
    3486                      .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    3487              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    3488                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$30)
    3489                      .dwattr $C$DW$T$88, DW_AT_address_class(0x16)
    3490              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   70

    3491                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    3492                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3493              
    3494              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3495                      .dwattr $C$DW$T$34, DW_AT_name("_Buffer_")
    3496                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x204)
    3497              $C$DW$522       .dwtag  DW_TAG_member
    3498                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$32)
    3499                      .dwattr $C$DW$522, DW_AT_name("data")
    3500                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_data")
    3501                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3502                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    3503              $C$DW$523       .dwtag  DW_TAG_member
    3504                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$33)
    3505                      .dwattr $C$DW$523, DW_AT_name("read")
    3506                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_read")
    3507                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    3508                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    3509              $C$DW$524       .dwtag  DW_TAG_member
    3510                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$33)
    3511                      .dwattr $C$DW$524, DW_AT_name("write")
    3512                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_write")
    3513                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x202]
    3514                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    3515                      .dwendtag $C$DW$T$34
    3516              
    3517              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("Buffer_t")
    3518                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$34)
    3519                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3520              
    3521              $C$DW$T$84      .dwtag  DW_TAG_array_type
    3522                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3523                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3524                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x408)
    3525              $C$DW$525       .dwtag  DW_TAG_subrange_type
    3526                      .dwattr $C$DW$525, DW_AT_upper_bound(0x01)
    3527                      .dwendtag $C$DW$T$84
    3528              
    3529              
    3530              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3531                      .dwattr $C$DW$T$36, DW_AT_name("_CLARKE_Obj_")
    3532                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    3533              $C$DW$526       .dwtag  DW_TAG_member
    3534                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$31)
    3535                      .dwattr $C$DW$526, DW_AT_name("alpha_sf")
    3536                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_alpha_sf")
    3537                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3538                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    3539              $C$DW$527       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$31)
    3541                      .dwattr $C$DW$527, DW_AT_name("beta_sf")
    3542                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_beta_sf")
    3543                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3544                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    3545              $C$DW$528       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   71

    3546                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$35)
    3547                      .dwattr $C$DW$528, DW_AT_name("numSensors")
    3548                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_numSensors")
    3549                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3550                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    3551                      .dwendtag $C$DW$T$36
    3552              
    3553              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3554                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$36)
    3555                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3556              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    3557                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$36)
    3558                      .dwattr $C$DW$T$45, DW_AT_address_class(0x16)
    3559              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3560                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3561                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3562              
    3563              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3564                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    3565                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    3566              $C$DW$529       .dwtag  DW_TAG_member
    3567                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$23)
    3568                      .dwattr $C$DW$529, DW_AT_name("XCLK")
    3569                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_XCLK")
    3570                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3571                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    3572              $C$DW$530       .dwtag  DW_TAG_member
    3573                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$23)
    3574                      .dwattr $C$DW$530, DW_AT_name("rsvd_1")
    3575                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_rsvd_1")
    3576                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3577                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    3578              $C$DW$531       .dwtag  DW_TAG_member
    3579                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$23)
    3580                      .dwattr $C$DW$531, DW_AT_name("CLKCTL")
    3581                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_CLKCTL")
    3582                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3583                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    3584              $C$DW$532       .dwtag  DW_TAG_member
    3585                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$37)
    3586                      .dwattr $C$DW$532, DW_AT_name("rsvd_2")
    3587                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_rsvd_2")
    3588                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3589                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    3590              $C$DW$533       .dwtag  DW_TAG_member
    3591                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$23)
    3592                      .dwattr $C$DW$533, DW_AT_name("LOSPCP")
    3593                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_LOSPCP")
    3594                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3595                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    3596              $C$DW$534       .dwtag  DW_TAG_member
    3597                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$23)
    3598                      .dwattr $C$DW$534, DW_AT_name("PCLKCR0")
    3599                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_PCLKCR0")
    3600                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   72

    3601                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    3602              $C$DW$535       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$23)
    3604                      .dwattr $C$DW$535, DW_AT_name("PCLKCR1")
    3605                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_PCLKCR1")
    3606                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3607                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    3608              $C$DW$536       .dwtag  DW_TAG_member
    3609                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$26)
    3610                      .dwattr $C$DW$536, DW_AT_name("rsvd_3")
    3611                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_rsvd_3")
    3612                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3613                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    3614              $C$DW$537       .dwtag  DW_TAG_member
    3615                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$23)
    3616                      .dwattr $C$DW$537, DW_AT_name("PCLKCR3")
    3617                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_PCLKCR3")
    3618                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3619                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    3620                      .dwendtag $C$DW$T$38
    3621              
    3622              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    3623                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$38)
    3624                      .dwattr $C$DW$T$90, DW_AT_address_class(0x16)
    3625              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3626                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    3627                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    3628              
    3629              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3630                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    3631                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    3632              $C$DW$538       .dwtag  DW_TAG_member
    3633                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$35)
    3634                      .dwattr $C$DW$538, DW_AT_name("tmp")
    3635                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_tmp")
    3636                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3637                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    3638                      .dwendtag $C$DW$T$39
    3639              
    3640              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    3641                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$39)
    3642                      .dwattr $C$DW$T$92, DW_AT_address_class(0x16)
    3643              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3644                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    3645                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    3646              
    3647              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    3648                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Obj_")
    3649                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x108)
    3650              $C$DW$539       .dwtag  DW_TAG_member
    3651                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$40)
    3652                      .dwattr $C$DW$539, DW_AT_name("version")
    3653                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_version")
    3654                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3655                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   73

    3656              $C$DW$540       .dwtag  DW_TAG_member
    3657                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$42)
    3658                      .dwattr $C$DW$540, DW_AT_name("state")
    3659                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_state")
    3660                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3661                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    3662              $C$DW$541       .dwtag  DW_TAG_member
    3663                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$42)
    3664                      .dwattr $C$DW$541, DW_AT_name("prevState")
    3665                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_prevState")
    3666                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3667                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3668              $C$DW$542       .dwtag  DW_TAG_member
    3669                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$44)
    3670                      .dwattr $C$DW$542, DW_AT_name("errorCode")
    3671                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_errorCode")
    3672                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3673                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3674              $C$DW$543       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$46)
    3676                      .dwattr $C$DW$543, DW_AT_name("clarkeHandle_I")
    3677                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3678                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3679                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3680              $C$DW$544       .dwtag  DW_TAG_member
    3681                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$47)
    3682                      .dwattr $C$DW$544, DW_AT_name("clarke_I")
    3683                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_clarke_I")
    3684                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3685                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3686              $C$DW$545       .dwtag  DW_TAG_member
    3687                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$46)
    3688                      .dwattr $C$DW$545, DW_AT_name("clarkeHandle_V")
    3689                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3690                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3691                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3692              $C$DW$546       .dwtag  DW_TAG_member
    3693                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$47)
    3694                      .dwattr $C$DW$546, DW_AT_name("clarke_V")
    3695                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_clarke_V")
    3696                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3697                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    3698              $C$DW$547       .dwtag  DW_TAG_member
    3699                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$49)
    3700                      .dwattr $C$DW$547, DW_AT_name("estHandle")
    3701                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_estHandle")
    3702                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3703                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3704              $C$DW$548       .dwtag  DW_TAG_member
    3705                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$51)
    3706                      .dwattr $C$DW$548, DW_AT_name("parkHandle")
    3707                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_parkHandle")
    3708                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3709                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    3710              $C$DW$549       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   74

    3711                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$52)
    3712                      .dwattr $C$DW$549, DW_AT_name("park")
    3713                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_park")
    3714                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3715                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3716              $C$DW$550       .dwtag  DW_TAG_member
    3717                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$54)
    3718                      .dwattr $C$DW$550, DW_AT_name("pidHandle_Id")
    3719                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_pidHandle_Id")
    3720                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3721                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3722              $C$DW$551       .dwtag  DW_TAG_member
    3723                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$55)
    3724                      .dwattr $C$DW$551, DW_AT_name("pid_Id")
    3725                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_pid_Id")
    3726                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3727                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3728              $C$DW$552       .dwtag  DW_TAG_member
    3729                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$54)
    3730                      .dwattr $C$DW$552, DW_AT_name("pidHandle_Iq")
    3731                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3732                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3733                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3734              $C$DW$553       .dwtag  DW_TAG_member
    3735                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$55)
    3736                      .dwattr $C$DW$553, DW_AT_name("pid_Iq")
    3737                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_pid_Iq")
    3738                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3739                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3740              $C$DW$554       .dwtag  DW_TAG_member
    3741                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$54)
    3742                      .dwattr $C$DW$554, DW_AT_name("pidHandle_spd")
    3743                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_pidHandle_spd")
    3744                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3745                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3746              $C$DW$555       .dwtag  DW_TAG_member
    3747                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$55)
    3748                      .dwattr $C$DW$555, DW_AT_name("pid_spd")
    3749                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_pid_spd")
    3750                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3751                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3752              $C$DW$556       .dwtag  DW_TAG_member
    3753                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$57)
    3754                      .dwattr $C$DW$556, DW_AT_name("iparkHandle")
    3755                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_iparkHandle")
    3756                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3757                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3758              $C$DW$557       .dwtag  DW_TAG_member
    3759                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$58)
    3760                      .dwattr $C$DW$557, DW_AT_name("ipark")
    3761                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_ipark")
    3762                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3763                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3764              $C$DW$558       .dwtag  DW_TAG_member
    3765                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$60)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   75

    3766                      .dwattr $C$DW$558, DW_AT_name("svgenHandle")
    3767                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_svgenHandle")
    3768                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3769                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3770              $C$DW$559       .dwtag  DW_TAG_member
    3771                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$61)
    3772                      .dwattr $C$DW$559, DW_AT_name("svgen")
    3773                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_svgen")
    3774                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3775                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3776              $C$DW$560       .dwtag  DW_TAG_member
    3777                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$63)
    3778                      .dwattr $C$DW$560, DW_AT_name("trajHandle_Id")
    3779                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_trajHandle_Id")
    3780                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3781                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3782              $C$DW$561       .dwtag  DW_TAG_member
    3783                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$64)
    3784                      .dwattr $C$DW$561, DW_AT_name("traj_Id")
    3785                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_traj_Id")
    3786                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3787                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3788              $C$DW$562       .dwtag  DW_TAG_member
    3789                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$63)
    3790                      .dwattr $C$DW$562, DW_AT_name("trajHandle_spd")
    3791                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_trajHandle_spd")
    3792                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3793                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3794              $C$DW$563       .dwtag  DW_TAG_member
    3795                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$64)
    3796                      .dwattr $C$DW$563, DW_AT_name("traj_spd")
    3797                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_traj_spd")
    3798                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3799                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3800              $C$DW$564       .dwtag  DW_TAG_member
    3801                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$63)
    3802                      .dwattr $C$DW$564, DW_AT_name("trajHandle_spdMax")
    3803                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3804                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3805                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3806              $C$DW$565       .dwtag  DW_TAG_member
    3807                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$64)
    3808                      .dwattr $C$DW$565, DW_AT_name("traj_spdMax")
    3809                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_traj_spdMax")
    3810                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3811                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3812              $C$DW$566       .dwtag  DW_TAG_member
    3813                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$65)
    3814                      .dwattr $C$DW$566, DW_AT_name("motorParams")
    3815                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_motorParams")
    3816                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3817                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3818              $C$DW$567       .dwtag  DW_TAG_member
    3819                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$68)
    3820                      .dwattr $C$DW$567, DW_AT_name("waitTimes")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   76

    3821                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_waitTimes")
    3822                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3823                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3824              $C$DW$568       .dwtag  DW_TAG_member
    3825                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$67)
    3826                      .dwattr $C$DW$568, DW_AT_name("counter_state")
    3827                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_counter_state")
    3828                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3829                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3830              $C$DW$569       .dwtag  DW_TAG_member
    3831                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$69)
    3832                      .dwattr $C$DW$569, DW_AT_name("numIsrTicksPerCtrlTick")
    3833                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3834                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3835                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3836              $C$DW$570       .dwtag  DW_TAG_member
    3837                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$69)
    3838                      .dwattr $C$DW$570, DW_AT_name("numCtrlTicksPerCurrentTick")
    3839                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3840                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3841                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3842              $C$DW$571       .dwtag  DW_TAG_member
    3843                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$69)
    3844                      .dwattr $C$DW$571, DW_AT_name("numCtrlTicksPerSpeedTick")
    3845                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3846                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3847                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3848              $C$DW$572       .dwtag  DW_TAG_member
    3849                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$69)
    3850                      .dwattr $C$DW$572, DW_AT_name("numCtrlTicksPerTrajTick")
    3851                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3852                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3853                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3854              $C$DW$573       .dwtag  DW_TAG_member
    3855                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$67)
    3856                      .dwattr $C$DW$573, DW_AT_name("ctrlFreq_Hz")
    3857                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3858                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3859                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3860              $C$DW$574       .dwtag  DW_TAG_member
    3861                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$67)
    3862                      .dwattr $C$DW$574, DW_AT_name("trajFreq_Hz")
    3863                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3864                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3865                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3866              $C$DW$575       .dwtag  DW_TAG_member
    3867                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$31)
    3868                      .dwattr $C$DW$575, DW_AT_name("trajPeriod_sec")
    3869                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3870                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3871                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3872              $C$DW$576       .dwtag  DW_TAG_member
    3873                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$70)
    3874                      .dwattr $C$DW$576, DW_AT_name("ctrlPeriod_sec")
    3875                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   77

    3876                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3877                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3878              $C$DW$577       .dwtag  DW_TAG_member
    3879                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$31)
    3880                      .dwattr $C$DW$577, DW_AT_name("maxVsMag_pu")
    3881                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3882                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3883                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3884              $C$DW$578       .dwtag  DW_TAG_member
    3885                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$71)
    3886                      .dwattr $C$DW$578, DW_AT_name("Iab_in")
    3887                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_Iab_in")
    3888                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3889                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3890              $C$DW$579       .dwtag  DW_TAG_member
    3891                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$71)
    3892                      .dwattr $C$DW$579, DW_AT_name("Iab_filt")
    3893                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_Iab_filt")
    3894                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3895                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3896              $C$DW$580       .dwtag  DW_TAG_member
    3897                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$71)
    3898                      .dwattr $C$DW$580, DW_AT_name("Idq_in")
    3899                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_Idq_in")
    3900                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3901                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3902              $C$DW$581       .dwtag  DW_TAG_member
    3903                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$71)
    3904                      .dwattr $C$DW$581, DW_AT_name("Vab_in")
    3905                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_Vab_in")
    3906                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3907                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3908              $C$DW$582       .dwtag  DW_TAG_member
    3909                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$31)
    3910                      .dwattr $C$DW$582, DW_AT_name("spd_out")
    3911                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_spd_out")
    3912                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3913                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3914              $C$DW$583       .dwtag  DW_TAG_member
    3915                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$71)
    3916                      .dwattr $C$DW$583, DW_AT_name("Vab_out")
    3917                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_Vab_out")
    3918                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3919                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3920              $C$DW$584       .dwtag  DW_TAG_member
    3921                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$71)
    3922                      .dwattr $C$DW$584, DW_AT_name("Vdq_out")
    3923                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_Vdq_out")
    3924                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3925                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3926              $C$DW$585       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$70)
    3928                      .dwattr $C$DW$585, DW_AT_name("Rhf")
    3929                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_Rhf")
    3930                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   78

    3931                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3932              $C$DW$586       .dwtag  DW_TAG_member
    3933                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$70)
    3934                      .dwattr $C$DW$586, DW_AT_name("Lhf")
    3935                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_Lhf")
    3936                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3937                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3938              $C$DW$587       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$70)
    3940                      .dwattr $C$DW$587, DW_AT_name("RoverL")
    3941                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_RoverL")
    3942                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3943                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3944              $C$DW$588       .dwtag  DW_TAG_member
    3945                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$31)
    3946                      .dwattr $C$DW$588, DW_AT_name("Kp_Id")
    3947                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_Kp_Id")
    3948                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3949                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3950              $C$DW$589       .dwtag  DW_TAG_member
    3951                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$31)
    3952                      .dwattr $C$DW$589, DW_AT_name("Kp_Iq")
    3953                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_Kp_Iq")
    3954                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3955                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3956              $C$DW$590       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$31)
    3958                      .dwattr $C$DW$590, DW_AT_name("Kp_spd")
    3959                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_Kp_spd")
    3960                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3961                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3962              $C$DW$591       .dwtag  DW_TAG_member
    3963                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$31)
    3964                      .dwattr $C$DW$591, DW_AT_name("Ki_Id")
    3965                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_Ki_Id")
    3966                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3967                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3968              $C$DW$592       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$31)
    3970                      .dwattr $C$DW$592, DW_AT_name("Ki_Iq")
    3971                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_Ki_Iq")
    3972                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3973                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3974              $C$DW$593       .dwtag  DW_TAG_member
    3975                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$31)
    3976                      .dwattr $C$DW$593, DW_AT_name("Ki_spd")
    3977                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_Ki_spd")
    3978                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3979                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3980              $C$DW$594       .dwtag  DW_TAG_member
    3981                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$31)
    3982                      .dwattr $C$DW$594, DW_AT_name("Kd_Id")
    3983                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_Kd_Id")
    3984                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3985                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   79

    3986              $C$DW$595       .dwtag  DW_TAG_member
    3987                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$31)
    3988                      .dwattr $C$DW$595, DW_AT_name("Kd_Iq")
    3989                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_Kd_Iq")
    3990                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3991                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3992              $C$DW$596       .dwtag  DW_TAG_member
    3993                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$31)
    3994                      .dwattr $C$DW$596, DW_AT_name("Kd_spd")
    3995                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_Kd_spd")
    3996                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3997                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    3998              $C$DW$597       .dwtag  DW_TAG_member
    3999                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$31)
    4000                      .dwattr $C$DW$597, DW_AT_name("Ui_Id")
    4001                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_Ui_Id")
    4002                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4003                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4004              $C$DW$598       .dwtag  DW_TAG_member
    4005                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$31)
    4006                      .dwattr $C$DW$598, DW_AT_name("Ui_Iq")
    4007                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_Ui_Iq")
    4008                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4009                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4010              $C$DW$599       .dwtag  DW_TAG_member
    4011                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$31)
    4012                      .dwattr $C$DW$599, DW_AT_name("Ui_spd")
    4013                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_Ui_spd")
    4014                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4015                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4016              $C$DW$600       .dwtag  DW_TAG_member
    4017                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$71)
    4018                      .dwattr $C$DW$600, DW_AT_name("Idq_ref")
    4019                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_Idq_ref")
    4020                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4021                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4022              $C$DW$601       .dwtag  DW_TAG_member
    4023                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$31)
    4024                      .dwattr $C$DW$601, DW_AT_name("IdRated")
    4025                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_IdRated")
    4026                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4027                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4028              $C$DW$602       .dwtag  DW_TAG_member
    4029                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$31)
    4030                      .dwattr $C$DW$602, DW_AT_name("spd_ref")
    4031                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_spd_ref")
    4032                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4033                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4034              $C$DW$603       .dwtag  DW_TAG_member
    4035                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$31)
    4036                      .dwattr $C$DW$603, DW_AT_name("spd_max")
    4037                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_spd_max")
    4038                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4039                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4040              $C$DW$604       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   80

    4041                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$69)
    4042                      .dwattr $C$DW$604, DW_AT_name("counter_current")
    4043                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_counter_current")
    4044                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4045                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4046              $C$DW$605       .dwtag  DW_TAG_member
    4047                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$69)
    4048                      .dwattr $C$DW$605, DW_AT_name("counter_isr")
    4049                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_counter_isr")
    4050                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4051                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4052              $C$DW$606       .dwtag  DW_TAG_member
    4053                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$69)
    4054                      .dwattr $C$DW$606, DW_AT_name("counter_speed")
    4055                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_counter_speed")
    4056                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4057                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4058              $C$DW$607       .dwtag  DW_TAG_member
    4059                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$69)
    4060                      .dwattr $C$DW$607, DW_AT_name("counter_traj")
    4061                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_counter_traj")
    4062                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4063                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4064              $C$DW$608       .dwtag  DW_TAG_member
    4065                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$72)
    4066                      .dwattr $C$DW$608, DW_AT_name("flag_enableCtrl")
    4067                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4068                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4069                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4070              $C$DW$609       .dwtag  DW_TAG_member
    4071                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$72)
    4072                      .dwattr $C$DW$609, DW_AT_name("flag_enableDcBusComp")
    4073                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4074                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4075                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4076              $C$DW$610       .dwtag  DW_TAG_member
    4077                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$72)
    4078                      .dwattr $C$DW$610, DW_AT_name("flag_enablePowerWarp")
    4079                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4080                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4081                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4082              $C$DW$611       .dwtag  DW_TAG_member
    4083                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$72)
    4084                      .dwattr $C$DW$611, DW_AT_name("flag_enableOffset")
    4085                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_flag_enableOffset")
    4086                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4087                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4088              $C$DW$612       .dwtag  DW_TAG_member
    4089                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$72)
    4090                      .dwattr $C$DW$612, DW_AT_name("flag_enableSpeedCtrl")
    4091                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4092                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4093                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4094              $C$DW$613       .dwtag  DW_TAG_member
    4095                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$72)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   81

    4096                      .dwattr $C$DW$613, DW_AT_name("flag_enableUserMotorParams")
    4097                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4098                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4099                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4100              $C$DW$614       .dwtag  DW_TAG_member
    4101                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$71)
    4102                      .dwattr $C$DW$614, DW_AT_name("Idq_offset_pu")
    4103                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4104                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4105                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4106              $C$DW$615       .dwtag  DW_TAG_member
    4107                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$71)
    4108                      .dwattr $C$DW$615, DW_AT_name("Vdq_offset_pu")
    4109                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4110                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4111                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4112              $C$DW$616       .dwtag  DW_TAG_member
    4113                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$31)
    4114                      .dwattr $C$DW$616, DW_AT_name("angle_pu")
    4115                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_angle_pu")
    4116                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4117                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4118              $C$DW$617       .dwtag  DW_TAG_member
    4119                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$31)
    4120                      .dwattr $C$DW$617, DW_AT_name("speed_ref_pu")
    4121                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_speed_ref_pu")
    4122                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4123                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4124              $C$DW$618       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$31)
    4126                      .dwattr $C$DW$618, DW_AT_name("speed_fb_pu")
    4127                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_speed_fb_pu")
    4128                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4129                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4130              $C$DW$619       .dwtag  DW_TAG_member
    4131                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$31)
    4132                      .dwattr $C$DW$619, DW_AT_name("speed_outMax_pu")
    4133                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4134                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4135                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4136              $C$DW$620       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$72)
    4138                      .dwattr $C$DW$620, DW_AT_name("flag_enableCurrentCtrl")
    4139                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4140                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4141                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4142                      .dwendtag $C$DW$T$73
    4143              
    4144              $C$DW$T$196     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4145                      .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$73)
    4146                      .dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
    4147              $C$DW$T$197     .dwtag  DW_TAG_pointer_type
    4148                      .dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$196)
    4149                      .dwattr $C$DW$T$197, DW_AT_address_class(0x16)
    4150              $C$DW$T$166     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   82

    4151                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$73)
    4152                      .dwattr $C$DW$T$166, DW_AT_address_class(0x16)
    4153              $C$DW$T$167     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4154                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$166)
    4155                      .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    4156              $C$DW$621       .dwtag  DW_TAG_TI_far_type
    4157                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$167)
    4158              $C$DW$T$198     .dwtag  DW_TAG_const_type
    4159                      .dwattr $C$DW$T$198, DW_AT_type(*$C$DW$621)
    4160              
    4161              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4162                      .dwattr $C$DW$T$76, DW_AT_name("_CTRL_Version_")
    4163                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x04)
    4164              $C$DW$622       .dwtag  DW_TAG_member
    4165                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$22)
    4166                      .dwattr $C$DW$622, DW_AT_name("rsvd")
    4167                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_rsvd")
    4168                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4169                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4170              $C$DW$623       .dwtag  DW_TAG_member
    4171                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$75)
    4172                      .dwattr $C$DW$623, DW_AT_name("targetProc")
    4173                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_targetProc")
    4174                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4175                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4176              $C$DW$624       .dwtag  DW_TAG_member
    4177                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$22)
    4178                      .dwattr $C$DW$624, DW_AT_name("major")
    4179                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_major")
    4180                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4181                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4182              $C$DW$625       .dwtag  DW_TAG_member
    4183                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$22)
    4184                      .dwattr $C$DW$625, DW_AT_name("minor")
    4185                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_minor")
    4186                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4187                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4188                      .dwendtag $C$DW$T$76
    4189              
    4190              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4191                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$76)
    4192                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4193              $C$DW$T$206     .dwtag  DW_TAG_pointer_type
    4194                      .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$40)
    4195                      .dwattr $C$DW$T$206, DW_AT_address_class(0x16)
    4196              
    4197              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4198                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4199                      .dwattr $C$DW$T$19, DW_AT_declaration
    4200                      .dwendtag $C$DW$T$19
    4201              
    4202              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    4203                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    4204                      .dwattr $C$DW$T$48, DW_AT_address_class(0x16)
    4205              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   83

    4206                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4207                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4208              
    4209              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    4210                      .dwattr $C$DW$T$77, DW_AT_name("_FILTER_FO_")
    4211                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x0a)
    4212              $C$DW$626       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$31)
    4214                      .dwattr $C$DW$626, DW_AT_name("a1")
    4215                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_a1")
    4216                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4217                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4218              $C$DW$627       .dwtag  DW_TAG_member
    4219                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$31)
    4220                      .dwattr $C$DW$627, DW_AT_name("b0")
    4221                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_b0")
    4222                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4223                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4224              $C$DW$628       .dwtag  DW_TAG_member
    4225                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$31)
    4226                      .dwattr $C$DW$628, DW_AT_name("b1")
    4227                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_b1")
    4228                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4229                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4230              $C$DW$629       .dwtag  DW_TAG_member
    4231                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$31)
    4232                      .dwattr $C$DW$629, DW_AT_name("x1")
    4233                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_x1")
    4234                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4235                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4236              $C$DW$630       .dwtag  DW_TAG_member
    4237                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$31)
    4238                      .dwattr $C$DW$630, DW_AT_name("y1")
    4239                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_y1")
    4240                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4241                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4242                      .dwendtag $C$DW$T$77
    4243              
    4244              $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4245                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$77)
    4246                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    4247              
    4248              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4249                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    4250                      .dwattr $C$DW$T$20, DW_AT_declaration
    4251                      .dwendtag $C$DW$T$20
    4252              
    4253              $C$DW$T$136     .dwtag  DW_TAG_pointer_type
    4254                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$20)
    4255                      .dwattr $C$DW$T$136, DW_AT_address_class(0x16)
    4256              $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4257                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
    4258                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    4259              
    4260              $C$DW$T$78      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   84

    4261                      .dwattr $C$DW$T$78, DW_AT_name("_FLASH_Obj_")
    4262                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x08)
    4263              $C$DW$631       .dwtag  DW_TAG_member
    4264                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$23)
    4265                      .dwattr $C$DW$631, DW_AT_name("FOPT")
    4266                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_FOPT")
    4267                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4268                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4269              $C$DW$632       .dwtag  DW_TAG_member
    4270                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$23)
    4271                      .dwattr $C$DW$632, DW_AT_name("rsvd_1")
    4272                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_rsvd_1")
    4273                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4274                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4275              $C$DW$633       .dwtag  DW_TAG_member
    4276                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$23)
    4277                      .dwattr $C$DW$633, DW_AT_name("FPWR")
    4278                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_FPWR")
    4279                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4280                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4281              $C$DW$634       .dwtag  DW_TAG_member
    4282                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$23)
    4283                      .dwattr $C$DW$634, DW_AT_name("FSTATUS")
    4284                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_FSTATUS")
    4285                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4286                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4287              $C$DW$635       .dwtag  DW_TAG_member
    4288                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$23)
    4289                      .dwattr $C$DW$635, DW_AT_name("FSTDBYWAIT")
    4290                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4291                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4292                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4293              $C$DW$636       .dwtag  DW_TAG_member
    4294                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$23)
    4295                      .dwattr $C$DW$636, DW_AT_name("FACTIVEWAIT")
    4296                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4297                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4298                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4299              $C$DW$637       .dwtag  DW_TAG_member
    4300                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$23)
    4301                      .dwattr $C$DW$637, DW_AT_name("FBANKWAIT")
    4302                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_FBANKWAIT")
    4303                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4304                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4305              $C$DW$638       .dwtag  DW_TAG_member
    4306                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$23)
    4307                      .dwattr $C$DW$638, DW_AT_name("FOTPWAIT")
    4308                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_FOTPWAIT")
    4309                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4310                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4311                      .dwendtag $C$DW$T$78
    4312              
    4313              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    4314                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$78)
    4315                      .dwattr $C$DW$T$94, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   85

    4316              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4317                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    4318                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    4319              
    4320              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    4321                      .dwattr $C$DW$T$82, DW_AT_name("_GPIO_Obj_")
    4322                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x6a)
    4323              $C$DW$639       .dwtag  DW_TAG_member
    4324                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$79)
    4325                      .dwattr $C$DW$639, DW_AT_name("GPACTRL")
    4326                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_GPACTRL")
    4327                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4328                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4329              $C$DW$640       .dwtag  DW_TAG_member
    4330                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$79)
    4331                      .dwattr $C$DW$640, DW_AT_name("GPAQSEL1")
    4332                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_GPAQSEL1")
    4333                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4334                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4335              $C$DW$641       .dwtag  DW_TAG_member
    4336                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$79)
    4337                      .dwattr $C$DW$641, DW_AT_name("GPAQSEL2")
    4338                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_GPAQSEL2")
    4339                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4340                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4341              $C$DW$642       .dwtag  DW_TAG_member
    4342                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$79)
    4343                      .dwattr $C$DW$642, DW_AT_name("GPAMUX1")
    4344                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_GPAMUX1")
    4345                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4346                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4347              $C$DW$643       .dwtag  DW_TAG_member
    4348                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$79)
    4349                      .dwattr $C$DW$643, DW_AT_name("GPAMUX2")
    4350                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_GPAMUX2")
    4351                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4352                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4353              $C$DW$644       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$79)
    4355                      .dwattr $C$DW$644, DW_AT_name("GPADIR")
    4356                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_GPADIR")
    4357                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4358                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4359              $C$DW$645       .dwtag  DW_TAG_member
    4360                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$79)
    4361                      .dwattr $C$DW$645, DW_AT_name("GPAPUD")
    4362                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_GPAPUD")
    4363                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4364                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4365              $C$DW$646       .dwtag  DW_TAG_member
    4366                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$26)
    4367                      .dwattr $C$DW$646, DW_AT_name("rsvd_1")
    4368                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_rsvd_1")
    4369                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4370                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   86

    4371              $C$DW$647       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$79)
    4373                      .dwattr $C$DW$647, DW_AT_name("GPBCTRL")
    4374                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_GPBCTRL")
    4375                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4376                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4377              $C$DW$648       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$79)
    4379                      .dwattr $C$DW$648, DW_AT_name("GPBQSEL1")
    4380                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_GPBQSEL1")
    4381                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4382                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4383              $C$DW$649       .dwtag  DW_TAG_member
    4384                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$26)
    4385                      .dwattr $C$DW$649, DW_AT_name("rsvd_2")
    4386                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_rsvd_2")
    4387                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4388                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4389              $C$DW$650       .dwtag  DW_TAG_member
    4390                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$79)
    4391                      .dwattr $C$DW$650, DW_AT_name("GPBMUX1")
    4392                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_GPBMUX1")
    4393                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4394                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4395              $C$DW$651       .dwtag  DW_TAG_member
    4396                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$26)
    4397                      .dwattr $C$DW$651, DW_AT_name("rsvd_3")
    4398                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_rsvd_3")
    4399                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4400                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4401              $C$DW$652       .dwtag  DW_TAG_member
    4402                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$79)
    4403                      .dwattr $C$DW$652, DW_AT_name("GPBDIR")
    4404                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_GPBDIR")
    4405                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4406                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4407              $C$DW$653       .dwtag  DW_TAG_member
    4408                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$79)
    4409                      .dwattr $C$DW$653, DW_AT_name("GPBPUD")
    4410                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_GPBPUD")
    4411                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4412                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4413              $C$DW$654       .dwtag  DW_TAG_member
    4414                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$80)
    4415                      .dwattr $C$DW$654, DW_AT_name("rsvd_4")
    4416                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_rsvd_4")
    4417                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4418                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4419              $C$DW$655       .dwtag  DW_TAG_member
    4420                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$79)
    4421                      .dwattr $C$DW$655, DW_AT_name("AIOMUX1")
    4422                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_AIOMUX1")
    4423                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4424                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4425              $C$DW$656       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:42 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0692810                              PAGE   87

    4426                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$26)
    4427                      .dwattr $C$DW$656, DW_AT_name("rsvd_5")
    4428                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_rsvd_5")
    4429                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4430                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4431              $C$DW$657       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$79)
