TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Wed Jun 21 14:56:44 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_d_pu")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_d_pu")

    2881              $C$DW$334       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    2882              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    2883              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    2884              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    2885              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    2886              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    2887              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    2888              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    2889              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    2890              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    2891              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    2892              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    2893              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    2894              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    2895              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    2896              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    2897              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    2898              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    2899              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    2900              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    2901              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    2902              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    2903              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    2904              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    2905              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    2906              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    2907              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    2908                      .dwendtag $C$DW$T$74
    2909              
    2910              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    2911                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2912                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2913              $C$DW$361       .dwtag  DW_TAG_TI_far_type
    2914                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$75)
    2915              $C$DW$T$77      .dwtag  DW_TAG_const_type
    2916                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$361)
    2917              
    2918              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    2919                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    2920              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    2921              $C$DW$363       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    2922              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    2923                      .dwendtag $C$DW$T$82
    2924              
    2925              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    2926                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    2927                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   59

    2928              $C$DW$365       .dwtag  DW_TAG_TI_far_type
    2929                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$83)
    2930              $C$DW$T$84      .dwtag  DW_TAG_const_type
    2931                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$365)
    2932              
    2933              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2934                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    2935                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    2936              $C$DW$366       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    2938                      .dwattr $C$DW$366, DW_AT_name("alpha_sf")
    2939                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_alpha_sf")
    2940                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2941                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2942              $C$DW$367       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2944                      .dwattr $C$DW$367, DW_AT_name("beta_sf")
    2945                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_beta_sf")
    2946                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2947                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2948              $C$DW$368       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$22)
    2950                      .dwattr $C$DW$368, DW_AT_name("numSensors")
    2951                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_numSensors")
    2952                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2953                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2954                      .dwendtag $C$DW$T$23
    2955              
    2956              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    2957                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    2958                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2959              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2960                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    2961                      .dwattr $C$DW$T$29, DW_AT_address_class(0x16)
    2962              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    2963                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2964                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2965              
    2966              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2967                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    2968                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    2969              $C$DW$369       .dwtag  DW_TAG_member
    2970                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$24)
    2971                      .dwattr $C$DW$369, DW_AT_name("version")
    2972                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_version")
    2973                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2974                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2975              $C$DW$370       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$26)
    2977                      .dwattr $C$DW$370, DW_AT_name("state")
    2978                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_state")
    2979                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2980                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2981              $C$DW$371       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   60

    2983                      .dwattr $C$DW$371, DW_AT_name("prevState")
    2984                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_prevState")
    2985                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2986                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2987              $C$DW$372       .dwtag  DW_TAG_member
    2988                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$28)
    2989                      .dwattr $C$DW$372, DW_AT_name("errorCode")
    2990                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_errorCode")
    2991                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2992                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2993              $C$DW$373       .dwtag  DW_TAG_member
    2994                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$30)
    2995                      .dwattr $C$DW$373, DW_AT_name("clarkeHandle_I")
    2996                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_clarkeHandle_I")
    2997                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2998                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2999              $C$DW$374       .dwtag  DW_TAG_member
    3000                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$31)
    3001                      .dwattr $C$DW$374, DW_AT_name("clarke_I")
    3002                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_clarke_I")
    3003                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3004                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3005              $C$DW$375       .dwtag  DW_TAG_member
    3006                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$30)
    3007                      .dwattr $C$DW$375, DW_AT_name("clarkeHandle_V")
    3008                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3009                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3010                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3011              $C$DW$376       .dwtag  DW_TAG_member
    3012                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$31)
    3013                      .dwattr $C$DW$376, DW_AT_name("clarke_V")
    3014                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_clarke_V")
    3015                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3016                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3017              $C$DW$377       .dwtag  DW_TAG_member
    3018                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$33)
    3019                      .dwattr $C$DW$377, DW_AT_name("estHandle")
    3020                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_estHandle")
    3021                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3022                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3023              $C$DW$378       .dwtag  DW_TAG_member
    3024                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$35)
    3025                      .dwattr $C$DW$378, DW_AT_name("parkHandle")
    3026                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_parkHandle")
    3027                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3028                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3029              $C$DW$379       .dwtag  DW_TAG_member
    3030                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$36)
    3031                      .dwattr $C$DW$379, DW_AT_name("park")
    3032                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_park")
    3033                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3034                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3035              $C$DW$380       .dwtag  DW_TAG_member
    3036                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$38)
    3037                      .dwattr $C$DW$380, DW_AT_name("pidHandle_Id")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   61

    3038                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_pidHandle_Id")
    3039                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3040                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3041              $C$DW$381       .dwtag  DW_TAG_member
    3042                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$39)
    3043                      .dwattr $C$DW$381, DW_AT_name("pid_Id")
    3044                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_pid_Id")
    3045                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3046                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3047              $C$DW$382       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$38)
    3049                      .dwattr $C$DW$382, DW_AT_name("pidHandle_Iq")
    3050                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3051                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3052                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3053              $C$DW$383       .dwtag  DW_TAG_member
    3054                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$39)
    3055                      .dwattr $C$DW$383, DW_AT_name("pid_Iq")
    3056                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_pid_Iq")
    3057                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3058                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3059              $C$DW$384       .dwtag  DW_TAG_member
    3060                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$38)
    3061                      .dwattr $C$DW$384, DW_AT_name("pidHandle_spd")
    3062                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_pidHandle_spd")
    3063                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3064                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3065              $C$DW$385       .dwtag  DW_TAG_member
    3066                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$39)
    3067                      .dwattr $C$DW$385, DW_AT_name("pid_spd")
    3068                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_pid_spd")
    3069                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3070                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3071              $C$DW$386       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$41)
    3073                      .dwattr $C$DW$386, DW_AT_name("iparkHandle")
    3074                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_iparkHandle")
    3075                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3076                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3077              $C$DW$387       .dwtag  DW_TAG_member
    3078                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$42)
    3079                      .dwattr $C$DW$387, DW_AT_name("ipark")
    3080                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_ipark")
    3081                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3082                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3083              $C$DW$388       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$44)
    3085                      .dwattr $C$DW$388, DW_AT_name("svgenHandle")
    3086                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_svgenHandle")
    3087                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3088                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3089              $C$DW$389       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$45)
    3091                      .dwattr $C$DW$389, DW_AT_name("svgen")
    3092                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_svgen")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   62

    3093                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3094                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3095              $C$DW$390       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$47)
    3097                      .dwattr $C$DW$390, DW_AT_name("trajHandle_Id")
    3098                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_trajHandle_Id")
    3099                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3100                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3101              $C$DW$391       .dwtag  DW_TAG_member
    3102                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$48)
    3103                      .dwattr $C$DW$391, DW_AT_name("traj_Id")
    3104                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_traj_Id")
    3105                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3106                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3107              $C$DW$392       .dwtag  DW_TAG_member
    3108                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$47)
    3109                      .dwattr $C$DW$392, DW_AT_name("trajHandle_spd")
    3110                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_trajHandle_spd")
    3111                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3112                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3113              $C$DW$393       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$48)
    3115                      .dwattr $C$DW$393, DW_AT_name("traj_spd")
    3116                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_traj_spd")
    3117                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3118                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3119              $C$DW$394       .dwtag  DW_TAG_member
    3120                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$47)
    3121                      .dwattr $C$DW$394, DW_AT_name("trajHandle_spdMax")
    3122                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3123                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3124                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3125              $C$DW$395       .dwtag  DW_TAG_member
    3126                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$48)
    3127                      .dwattr $C$DW$395, DW_AT_name("traj_spdMax")
    3128                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_traj_spdMax")
    3129                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3130                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3131              $C$DW$396       .dwtag  DW_TAG_member
    3132                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$49)
    3133                      .dwattr $C$DW$396, DW_AT_name("motorParams")
    3134                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_motorParams")
    3135                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3136                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3137              $C$DW$397       .dwtag  DW_TAG_member
    3138                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$52)
    3139                      .dwattr $C$DW$397, DW_AT_name("waitTimes")
    3140                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_waitTimes")
    3141                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3142                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3143              $C$DW$398       .dwtag  DW_TAG_member
    3144                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$51)
    3145                      .dwattr $C$DW$398, DW_AT_name("counter_state")
    3146                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_counter_state")
    3147                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   63

    3148                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3149              $C$DW$399       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$53)
    3151                      .dwattr $C$DW$399, DW_AT_name("numIsrTicksPerCtrlTick")
    3152                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3153                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3154                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3155              $C$DW$400       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$53)
    3157                      .dwattr $C$DW$400, DW_AT_name("numCtrlTicksPerCurrentTick")
    3158                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3159                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3160                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3161              $C$DW$401       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$53)
    3163                      .dwattr $C$DW$401, DW_AT_name("numCtrlTicksPerSpeedTick")
    3164                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3165                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3166                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3167              $C$DW$402       .dwtag  DW_TAG_member
    3168                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$53)
    3169                      .dwattr $C$DW$402, DW_AT_name("numCtrlTicksPerTrajTick")
    3170                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3171                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3172                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3173              $C$DW$403       .dwtag  DW_TAG_member
    3174                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$51)
    3175                      .dwattr $C$DW$403, DW_AT_name("ctrlFreq_Hz")
    3176                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3177                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3178                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3179              $C$DW$404       .dwtag  DW_TAG_member
    3180                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$51)
    3181                      .dwattr $C$DW$404, DW_AT_name("trajFreq_Hz")
    3182                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3183                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3184                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3185              $C$DW$405       .dwtag  DW_TAG_member
    3186                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3187                      .dwattr $C$DW$405, DW_AT_name("trajPeriod_sec")
    3188                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3189                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3190                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3191              $C$DW$406       .dwtag  DW_TAG_member
    3192                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$54)
    3193                      .dwattr $C$DW$406, DW_AT_name("ctrlPeriod_sec")
    3194                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3195                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3196                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3197              $C$DW$407       .dwtag  DW_TAG_member
    3198                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    3199                      .dwattr $C$DW$407, DW_AT_name("maxVsMag_pu")
    3200                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3201                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3202                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   64

    3203              $C$DW$408       .dwtag  DW_TAG_member
    3204                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$55)
    3205                      .dwattr $C$DW$408, DW_AT_name("Iab_in")
    3206                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Iab_in")
    3207                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3208                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3209              $C$DW$409       .dwtag  DW_TAG_member
    3210                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$55)
    3211                      .dwattr $C$DW$409, DW_AT_name("Iab_filt")
    3212                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Iab_filt")
    3213                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3214                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3215              $C$DW$410       .dwtag  DW_TAG_member
    3216                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$55)
    3217                      .dwattr $C$DW$410, DW_AT_name("Idq_in")
    3218                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Idq_in")
    3219                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3220                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3221              $C$DW$411       .dwtag  DW_TAG_member
    3222                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$55)
    3223                      .dwattr $C$DW$411, DW_AT_name("Vab_in")
    3224                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Vab_in")
    3225                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3226                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3227              $C$DW$412       .dwtag  DW_TAG_member
    3228                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    3229                      .dwattr $C$DW$412, DW_AT_name("spd_out")
    3230                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_spd_out")
    3231                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3232                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3233              $C$DW$413       .dwtag  DW_TAG_member
    3234                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$55)
    3235                      .dwattr $C$DW$413, DW_AT_name("Vab_out")
    3236                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Vab_out")
    3237                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3238                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3239              $C$DW$414       .dwtag  DW_TAG_member
    3240                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$55)
    3241                      .dwattr $C$DW$414, DW_AT_name("Vdq_out")
    3242                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Vdq_out")
    3243                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3244                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3245              $C$DW$415       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$54)
    3247                      .dwattr $C$DW$415, DW_AT_name("Rhf")
    3248                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Rhf")
    3249                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3250                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3251              $C$DW$416       .dwtag  DW_TAG_member
    3252                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$54)
    3253                      .dwattr $C$DW$416, DW_AT_name("Lhf")
    3254                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Lhf")
    3255                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3256                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3257              $C$DW$417       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   65

    3258                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$54)
    3259                      .dwattr $C$DW$417, DW_AT_name("RoverL")
    3260                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_RoverL")
    3261                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3262                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3263              $C$DW$418       .dwtag  DW_TAG_member
    3264                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    3265                      .dwattr $C$DW$418, DW_AT_name("Kp_Id")
    3266                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Kp_Id")
    3267                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3268                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3269              $C$DW$419       .dwtag  DW_TAG_member
    3270                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    3271                      .dwattr $C$DW$419, DW_AT_name("Kp_Iq")
    3272                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Kp_Iq")
    3273                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3274                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3275              $C$DW$420       .dwtag  DW_TAG_member
    3276                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    3277                      .dwattr $C$DW$420, DW_AT_name("Kp_spd")
    3278                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Kp_spd")
    3279                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3280                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3281              $C$DW$421       .dwtag  DW_TAG_member
    3282                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    3283                      .dwattr $C$DW$421, DW_AT_name("Ki_Id")
    3284                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Ki_Id")
    3285                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3286                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3287              $C$DW$422       .dwtag  DW_TAG_member
    3288                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    3289                      .dwattr $C$DW$422, DW_AT_name("Ki_Iq")
    3290                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Ki_Iq")
    3291                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3292                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3293              $C$DW$423       .dwtag  DW_TAG_member
    3294                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3295                      .dwattr $C$DW$423, DW_AT_name("Ki_spd")
    3296                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Ki_spd")
    3297                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3298                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3299              $C$DW$424       .dwtag  DW_TAG_member
    3300                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3301                      .dwattr $C$DW$424, DW_AT_name("Kd_Id")
    3302                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_Kd_Id")
    3303                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3304                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3305              $C$DW$425       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3307                      .dwattr $C$DW$425, DW_AT_name("Kd_Iq")
    3308                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_Kd_Iq")
    3309                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3310                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3311              $C$DW$426       .dwtag  DW_TAG_member
    3312                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   66

    3313                      .dwattr $C$DW$426, DW_AT_name("Kd_spd")
    3314                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Kd_spd")
    3315                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3316                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3317              $C$DW$427       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    3319                      .dwattr $C$DW$427, DW_AT_name("Ui_Id")
    3320                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Ui_Id")
    3321                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3322                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3323              $C$DW$428       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    3325                      .dwattr $C$DW$428, DW_AT_name("Ui_Iq")
    3326                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Ui_Iq")
    3327                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3328                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3329              $C$DW$429       .dwtag  DW_TAG_member
    3330                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    3331                      .dwattr $C$DW$429, DW_AT_name("Ui_spd")
    3332                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Ui_spd")
    3333                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3334                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3335              $C$DW$430       .dwtag  DW_TAG_member
    3336                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$55)
    3337                      .dwattr $C$DW$430, DW_AT_name("Idq_ref")
    3338                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_Idq_ref")
    3339                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3340                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3341              $C$DW$431       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3343                      .dwattr $C$DW$431, DW_AT_name("IdRated")
    3344                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_IdRated")
    3345                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3346                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3347              $C$DW$432       .dwtag  DW_TAG_member
    3348                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    3349                      .dwattr $C$DW$432, DW_AT_name("spd_ref")
    3350                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_spd_ref")
    3351                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3352                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3353              $C$DW$433       .dwtag  DW_TAG_member
    3354                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    3355                      .dwattr $C$DW$433, DW_AT_name("spd_max")
    3356                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_spd_max")
    3357                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3358                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3359              $C$DW$434       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$53)
    3361                      .dwattr $C$DW$434, DW_AT_name("counter_current")
    3362                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_counter_current")
    3363                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3364                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3365              $C$DW$435       .dwtag  DW_TAG_member
    3366                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$53)
    3367                      .dwattr $C$DW$435, DW_AT_name("counter_isr")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   67

    3368                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_counter_isr")
    3369                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3370                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3371              $C$DW$436       .dwtag  DW_TAG_member
    3372                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$53)
    3373                      .dwattr $C$DW$436, DW_AT_name("counter_speed")
    3374                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_counter_speed")
    3375                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3376                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3377              $C$DW$437       .dwtag  DW_TAG_member
    3378                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$53)
    3379                      .dwattr $C$DW$437, DW_AT_name("counter_traj")
    3380                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_counter_traj")
    3381                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3382                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3383              $C$DW$438       .dwtag  DW_TAG_member
    3384                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$56)
    3385                      .dwattr $C$DW$438, DW_AT_name("flag_enableCtrl")
    3386                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3387                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3388                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3389              $C$DW$439       .dwtag  DW_TAG_member
    3390                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    3391                      .dwattr $C$DW$439, DW_AT_name("flag_enableDcBusComp")
    3392                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3393                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3394                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3395              $C$DW$440       .dwtag  DW_TAG_member
    3396                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$56)
    3397                      .dwattr $C$DW$440, DW_AT_name("flag_enablePowerWarp")
    3398                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3399                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3400                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3401              $C$DW$441       .dwtag  DW_TAG_member
    3402                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$56)
    3403                      .dwattr $C$DW$441, DW_AT_name("flag_enableOffset")
    3404                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_flag_enableOffset")
    3405                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3406                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3407              $C$DW$442       .dwtag  DW_TAG_member
    3408                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$56)
    3409                      .dwattr $C$DW$442, DW_AT_name("flag_enableSpeedCtrl")
    3410                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3411                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3412                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3413              $C$DW$443       .dwtag  DW_TAG_member
    3414                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    3415                      .dwattr $C$DW$443, DW_AT_name("flag_enableUserMotorParams")
    3416                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3417                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3418                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3419              $C$DW$444       .dwtag  DW_TAG_member
    3420                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$55)
    3421                      .dwattr $C$DW$444, DW_AT_name("Idq_offset_pu")
    3422                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_Idq_offset_pu")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   68

    3423                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3424                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3425              $C$DW$445       .dwtag  DW_TAG_member
    3426                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$55)
    3427                      .dwattr $C$DW$445, DW_AT_name("Vdq_offset_pu")
    3428                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3429                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3430                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3431              $C$DW$446       .dwtag  DW_TAG_member
    3432                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    3433                      .dwattr $C$DW$446, DW_AT_name("angle_pu")
    3434                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_angle_pu")
    3435                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3436                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3437              $C$DW$447       .dwtag  DW_TAG_member
    3438                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
    3439                      .dwattr $C$DW$447, DW_AT_name("speed_ref_pu")
    3440                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_speed_ref_pu")
    3441                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3442                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3443              $C$DW$448       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
    3445                      .dwattr $C$DW$448, DW_AT_name("speed_fb_pu")
    3446                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_speed_fb_pu")
    3447                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3448                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3449              $C$DW$449       .dwtag  DW_TAG_member
    3450                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    3451                      .dwattr $C$DW$449, DW_AT_name("speed_outMax_pu")
    3452                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3453                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3454                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3455              $C$DW$450       .dwtag  DW_TAG_member
    3456                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$56)
    3457                      .dwattr $C$DW$450, DW_AT_name("flag_enableCurrentCtrl")
    3458                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3459                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3460                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3461                      .dwendtag $C$DW$T$57
    3462              
    3463              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3464                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    3465                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3466              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3467                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    3468                      .dwattr $C$DW$T$86, DW_AT_address_class(0x16)
    3469              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3470                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3471                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3472              $C$DW$451       .dwtag  DW_TAG_TI_far_type
    3473                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$87)
    3474              $C$DW$T$88      .dwtag  DW_TAG_const_type
    3475                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$451)
    3476              
    3477              $C$DW$T$60      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   69

    3478                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3479                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3480              $C$DW$452       .dwtag  DW_TAG_member
    3481                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$21)
    3482                      .dwattr $C$DW$452, DW_AT_name("rsvd")
    3483                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_rsvd")
    3484                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3485                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3486              $C$DW$453       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$59)
    3488                      .dwattr $C$DW$453, DW_AT_name("targetProc")
    3489                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_targetProc")
    3490                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3491                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3492              $C$DW$454       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$21)
    3494                      .dwattr $C$DW$454, DW_AT_name("major")
    3495                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_major")
    3496                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3497                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3498              $C$DW$455       .dwtag  DW_TAG_member
    3499                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$21)
    3500                      .dwattr $C$DW$455, DW_AT_name("minor")
    3501                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_minor")
    3502                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3503                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3504                      .dwendtag $C$DW$T$60
    3505              
    3506              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3507                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    3508                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3509              
    3510              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3511                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3512                      .dwattr $C$DW$T$19, DW_AT_declaration
    3513                      .dwendtag $C$DW$T$19
    3514              
    3515              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3516                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3517                      .dwattr $C$DW$T$32, DW_AT_address_class(0x16)
    3518              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3519                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3520                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3521              
    3522              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3523                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3524                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3525              $C$DW$456       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    3527                      .dwattr $C$DW$456, DW_AT_name("sinTh")
    3528                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_sinTh")
    3529                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3530                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3531              $C$DW$457       .dwtag  DW_TAG_member
    3532                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   70

    3533                      .dwattr $C$DW$457, DW_AT_name("cosTh")
    3534                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_cosTh")
    3535                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3536                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3537                      .dwendtag $C$DW$T$61
    3538              
    3539              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3540                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3541                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3542              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3543                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3544                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    3545              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3546                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3547                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3548              
    3549              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3550                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3551                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3552              $C$DW$458       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$62)
    3554                      .dwattr $C$DW$458, DW_AT_name("value")
    3555                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_value")
    3556                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3557                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3558                      .dwendtag $C$DW$T$63
    3559              
    3560              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3561                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3562                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3563              
    3564              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3565                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    3566                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3567              $C$DW$459       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$65)
    3569                      .dwattr $C$DW$459, DW_AT_name("type")
    3570                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_type")
    3571                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3572                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3573              $C$DW$460       .dwtag  DW_TAG_member
    3574                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$53)
    3575                      .dwattr $C$DW$460, DW_AT_name("numPolePairs")
    3576                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_numPolePairs")
    3577                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3578                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3579              $C$DW$461       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$54)
    3581                      .dwattr $C$DW$461, DW_AT_name("Lr_H")
    3582                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_Lr_H")
    3583                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3584                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3585              $C$DW$462       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$54)
    3587                      .dwattr $C$DW$462, DW_AT_name("Ls_d_H")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   71

    3588                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_Ls_d_H")
    3589                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3590                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3591              $C$DW$463       .dwtag  DW_TAG_member
    3592                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$54)
    3593                      .dwattr $C$DW$463, DW_AT_name("Ls_q_H")
    3594                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_Ls_q_H")
    3595                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3596                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3597              $C$DW$464       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$54)
    3599                      .dwattr $C$DW$464, DW_AT_name("Rr_Ohm")
    3600                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_Rr_Ohm")
    3601                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3602                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3603              $C$DW$465       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    3605                      .dwattr $C$DW$465, DW_AT_name("Rs_Ohm")
    3606                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_Rs_Ohm")
    3607                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3608                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3609              $C$DW$466       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    3611                      .dwattr $C$DW$466, DW_AT_name("ratedFlux_VpHz")
    3612                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3613                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3614                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3615                      .dwendtag $C$DW$T$66
    3616              
    3617              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    3618                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3619                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3620              
    3621              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3622                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3623                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3624              $C$DW$467       .dwtag  DW_TAG_member
    3625                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$20)
    3626                      .dwattr $C$DW$467, DW_AT_name("sinTh")
    3627                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_sinTh")
    3628                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3629                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3630              $C$DW$468       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    3632                      .dwattr $C$DW$468, DW_AT_name("cosTh")
    3633                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_cosTh")
    3634                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3635                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3636                      .dwendtag $C$DW$T$67
    3637              
    3638              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3639                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3640                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3641              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3642                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   72

    3643                      .dwattr $C$DW$T$34, DW_AT_address_class(0x16)
    3644              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3645                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3646                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3647              
    3648              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3649                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3650                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3651              $C$DW$469       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    3653                      .dwattr $C$DW$469, DW_AT_name("Kp")
    3654                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_Kp")
    3655                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3656                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3657              $C$DW$470       .dwtag  DW_TAG_member
    3658                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
    3659                      .dwattr $C$DW$470, DW_AT_name("Ki")
    3660                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_Ki")
    3661                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3662                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3663              $C$DW$471       .dwtag  DW_TAG_member
    3664                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    3665                      .dwattr $C$DW$471, DW_AT_name("Kd")
    3666                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_Kd")
    3667                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3668                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3669              $C$DW$472       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    3671                      .dwattr $C$DW$472, DW_AT_name("Ui")
    3672                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_Ui")
    3673                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3674                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3675              $C$DW$473       .dwtag  DW_TAG_member
    3676                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    3677                      .dwattr $C$DW$473, DW_AT_name("refValue")
    3678                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_refValue")
    3679                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3680                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3681              $C$DW$474       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    3683                      .dwattr $C$DW$474, DW_AT_name("fbackValue")
    3684                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_fbackValue")
    3685                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3686                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3687              $C$DW$475       .dwtag  DW_TAG_member
    3688                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    3689                      .dwattr $C$DW$475, DW_AT_name("outMin")
    3690                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_outMin")
    3691                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3692                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3693              $C$DW$476       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
    3695                      .dwattr $C$DW$476, DW_AT_name("outMax")
    3696                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_outMax")
    3697                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   73

    3698                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3699                      .dwendtag $C$DW$T$68
    3700              
    3701              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3702                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3703                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3704              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3705                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3706                      .dwattr $C$DW$T$37, DW_AT_address_class(0x16)
    3707              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    3708                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3709                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3710              
    3711              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3712                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3713                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3714              $C$DW$477       .dwtag  DW_TAG_member
    3715                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    3716                      .dwattr $C$DW$477, DW_AT_name("maxModulation")
    3717                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_maxModulation")
    3718                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3719                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3720                      .dwendtag $C$DW$T$69
    3721              
    3722              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3723                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3724                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3725              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3726                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    3727                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    3728              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3729                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3730                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3731              
    3732              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3733                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3734                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3735              $C$DW$478       .dwtag  DW_TAG_member
    3736                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    3737                      .dwattr $C$DW$478, DW_AT_name("targetValue")
    3738                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_targetValue")
    3739                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3740                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3741              $C$DW$479       .dwtag  DW_TAG_member
    3742                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    3743                      .dwattr $C$DW$479, DW_AT_name("intValue")
    3744                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_intValue")
    3745                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3746                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3747              $C$DW$480       .dwtag  DW_TAG_member
    3748                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    3749                      .dwattr $C$DW$480, DW_AT_name("minValue")
    3750                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_minValue")
    3751                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3752                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   74

    3753              $C$DW$481       .dwtag  DW_TAG_member
    3754                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    3755                      .dwattr $C$DW$481, DW_AT_name("maxValue")
    3756                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_maxValue")
    3757                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3758                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3759              $C$DW$482       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    3761                      .dwattr $C$DW$482, DW_AT_name("maxDelta")
    3762                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_maxDelta")
    3763                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3764                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3765                      .dwendtag $C$DW$T$70
    3766              
    3767              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3768                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3769                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3770              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3771                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3772                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3773              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3774                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3775                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3776              
    3777              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3778                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    3779                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    3780              $C$DW$483       .dwtag  DW_TAG_member
    3781                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$54)
    3782                      .dwattr $C$DW$483, DW_AT_name("iqFullScaleCurrent_A")
    3783                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3784                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3785                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3786              $C$DW$484       .dwtag  DW_TAG_member
    3787                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$54)
    3788                      .dwattr $C$DW$484, DW_AT_name("iqFullScaleVoltage_V")
    3789                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3790                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3791                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3792              $C$DW$485       .dwtag  DW_TAG_member
    3793                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$54)
    3794                      .dwattr $C$DW$485, DW_AT_name("iqFullScaleFreq_Hz")
    3795                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3796                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3797                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3798              $C$DW$486       .dwtag  DW_TAG_member
    3799                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$53)
    3800                      .dwattr $C$DW$486, DW_AT_name("numIsrTicksPerCtrlTick")
    3801                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3802                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3803                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3804              $C$DW$487       .dwtag  DW_TAG_member
    3805                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$53)
    3806                      .dwattr $C$DW$487, DW_AT_name("numCtrlTicksPerCurrentTick")
    3807                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   75

    3808                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3809                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3810              $C$DW$488       .dwtag  DW_TAG_member
    3811                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$53)
    3812                      .dwattr $C$DW$488, DW_AT_name("numCtrlTicksPerEstTick")
    3813                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3814                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3815                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3816              $C$DW$489       .dwtag  DW_TAG_member
    3817                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$53)
    3818                      .dwattr $C$DW$489, DW_AT_name("numCtrlTicksPerSpeedTick")
    3819                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3820                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3821                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3822              $C$DW$490       .dwtag  DW_TAG_member
    3823                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$53)
    3824                      .dwattr $C$DW$490, DW_AT_name("numCtrlTicksPerTrajTick")
    3825                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3826                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3827                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3828              $C$DW$491       .dwtag  DW_TAG_member
    3829                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$22)
    3830                      .dwattr $C$DW$491, DW_AT_name("numCurrentSensors")
    3831                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_numCurrentSensors")
    3832                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3833                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3834              $C$DW$492       .dwtag  DW_TAG_member
    3835                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$22)
    3836                      .dwattr $C$DW$492, DW_AT_name("numVoltageSensors")
    3837                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_numVoltageSensors")
    3838                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3839                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3840              $C$DW$493       .dwtag  DW_TAG_member
    3841                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$54)
    3842                      .dwattr $C$DW$493, DW_AT_name("offsetPole_rps")
    3843                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_offsetPole_rps")
    3844                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3845                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3846              $C$DW$494       .dwtag  DW_TAG_member
    3847                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$54)
    3848                      .dwattr $C$DW$494, DW_AT_name("fluxPole_rps")
    3849                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_fluxPole_rps")
    3850                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3851                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3852              $C$DW$495       .dwtag  DW_TAG_member
    3853                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$54)
    3854                      .dwattr $C$DW$495, DW_AT_name("zeroSpeedLimit")
    3855                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3856                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3857                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3858              $C$DW$496       .dwtag  DW_TAG_member
    3859                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
    3860                      .dwattr $C$DW$496, DW_AT_name("forceAngleFreq_Hz")
    3861                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3862                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   76

    3863                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3864              $C$DW$497       .dwtag  DW_TAG_member
    3865                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$54)
    3866                      .dwattr $C$DW$497, DW_AT_name("maxAccel_Hzps")
    3867                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3868                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3869                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3870              $C$DW$498       .dwtag  DW_TAG_member
    3871                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    3872                      .dwattr $C$DW$498, DW_AT_name("maxAccel_est_Hzps")
    3873                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3874                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3875                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3876              $C$DW$499       .dwtag  DW_TAG_member
    3877                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    3878                      .dwattr $C$DW$499, DW_AT_name("directionPole_rps")
    3879                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_directionPole_rps")
    3880                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3881                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3882              $C$DW$500       .dwtag  DW_TAG_member
    3883                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    3884                      .dwattr $C$DW$500, DW_AT_name("speedPole_rps")
    3885                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_speedPole_rps")
    3886                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3887                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3888              $C$DW$501       .dwtag  DW_TAG_member
    3889                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    3890                      .dwattr $C$DW$501, DW_AT_name("dcBusPole_rps")
    3891                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_dcBusPole_rps")
    3892                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3893                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3894              $C$DW$502       .dwtag  DW_TAG_member
    3895                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$54)
    3896                      .dwattr $C$DW$502, DW_AT_name("fluxFraction")
    3897                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_fluxFraction")
    3898                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3899                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3900              $C$DW$503       .dwtag  DW_TAG_member
    3901                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$54)
    3902                      .dwattr $C$DW$503, DW_AT_name("indEst_speedMaxFraction")
    3903                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    3904                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3905                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3906              $C$DW$504       .dwtag  DW_TAG_member
    3907                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$54)
    3908                      .dwattr $C$DW$504, DW_AT_name("powerWarpGain")
    3909                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_powerWarpGain")
    3910                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3911                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3912              $C$DW$505       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$53)
    3914                      .dwattr $C$DW$505, DW_AT_name("systemFreq_MHz")
    3915                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_systemFreq_MHz")
    3916                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3917                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   77

    3918              $C$DW$506       .dwtag  DW_TAG_member
    3919                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$54)
    3920                      .dwattr $C$DW$506, DW_AT_name("pwmPeriod_usec")
    3921                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    3922                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3923                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3924              $C$DW$507       .dwtag  DW_TAG_member
    3925                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$54)
    3926                      .dwattr $C$DW$507, DW_AT_name("voltage_sf")
    3927                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_voltage_sf")
    3928                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3929                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3930              $C$DW$508       .dwtag  DW_TAG_member
    3931                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$54)
    3932                      .dwattr $C$DW$508, DW_AT_name("current_sf")
    3933                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_current_sf")
    3934                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3935                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3936              $C$DW$509       .dwtag  DW_TAG_member
    3937                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$54)
    3938                      .dwattr $C$DW$509, DW_AT_name("voltageFilterPole_rps")
    3939                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    3940                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3941                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3942              $C$DW$510       .dwtag  DW_TAG_member
    3943                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$54)
    3944                      .dwattr $C$DW$510, DW_AT_name("maxVsMag_pu")
    3945                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3946                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3947                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3948              $C$DW$511       .dwtag  DW_TAG_member
    3949                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$54)
    3950                      .dwattr $C$DW$511, DW_AT_name("estKappa")
    3951                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_estKappa")
    3952                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3953                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3954              $C$DW$512       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$65)
    3956                      .dwattr $C$DW$512, DW_AT_name("motor_type")
    3957                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_motor_type")
    3958                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3959                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3960              $C$DW$513       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$53)
    3962                      .dwattr $C$DW$513, DW_AT_name("motor_numPolePairs")
    3963                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_motor_numPolePairs")
    3964                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    3965                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3966              $C$DW$514       .dwtag  DW_TAG_member
    3967                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$54)
    3968                      .dwattr $C$DW$514, DW_AT_name("motor_ratedFlux")
    3969                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_motor_ratedFlux")
    3970                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3971                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3972              $C$DW$515       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   78

    3973                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$54)
    3974                      .dwattr $C$DW$515, DW_AT_name("motor_Rr")
    3975                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_motor_Rr")
    3976                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3977                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3978              $C$DW$516       .dwtag  DW_TAG_member
    3979                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$54)
    3980                      .dwattr $C$DW$516, DW_AT_name("motor_Rs")
    3981                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_motor_Rs")
    3982                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3983                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3984              $C$DW$517       .dwtag  DW_TAG_member
    3985                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$54)
    3986                      .dwattr $C$DW$517, DW_AT_name("motor_Ls_d")
    3987                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_motor_Ls_d")
    3988                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3989                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3990              $C$DW$518       .dwtag  DW_TAG_member
    3991                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$54)
    3992                      .dwattr $C$DW$518, DW_AT_name("motor_Ls_q")
    3993                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_motor_Ls_q")
    3994                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3995                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3996              $C$DW$519       .dwtag  DW_TAG_member
    3997                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$54)
    3998                      .dwattr $C$DW$519, DW_AT_name("maxCurrent")
    3999                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_maxCurrent")
    4000                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4001                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    4002              $C$DW$520       .dwtag  DW_TAG_member
    4003                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$54)
    4004                      .dwattr $C$DW$520, DW_AT_name("maxCurrent_resEst")
    4005                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    4006                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4007                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4008              $C$DW$521       .dwtag  DW_TAG_member
    4009                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$54)
    4010                      .dwattr $C$DW$521, DW_AT_name("maxCurrent_indEst")
    4011                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    4012                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4013                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4014              $C$DW$522       .dwtag  DW_TAG_member
    4015                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$54)
    4016                      .dwattr $C$DW$522, DW_AT_name("maxCurrentSlope")
    4017                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_maxCurrentSlope")
    4018                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4019                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4020              $C$DW$523       .dwtag  DW_TAG_member
    4021                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$54)
    4022                      .dwattr $C$DW$523, DW_AT_name("maxCurrentSlope_powerWarp")
    4023                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    4024                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4025                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4026              $C$DW$524       .dwtag  DW_TAG_member
    4027                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.2.5 Wed Jun 21 14:56:44 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1191211                              PAGE   79

    4028                      .dwattr $C$DW$524, DW_AT_name("IdRated")
    4029                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_IdRated")
    4030                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4031                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4032              $C$DW$525       .dwtag  DW_TAG_member
    4033                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$54)
    4034                      .dwattr $C$DW$525, DW_AT_name("IdRatedFraction_indEst")
    4035                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    4036                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4037                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4038              $C$DW$526       .dwtag  DW_TAG_member
    4039                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$54)
    4040                      .dwattr $C$DW$526, DW_AT_name("IdRatedFraction_ratedFlux")
    4041                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    4042                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4043                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4044              $C$DW$527       .dwtag  DW_TAG_member
    4045                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$54)
    4046                      .dwattr $C$DW$527, DW_AT_name("IdRated_delta")
    4047                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_IdRated_delta")
    4048                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4049                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4050              $C$DW$528       .dwtag  DW_TAG_member
    4051                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$54)
    4052                      .dwattr $C$DW$528, DW_AT_name("fluxEstFreq_Hz")
    4053                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    4054                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    4055                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4056              $C$DW$529       .dwtag  DW_TAG_member
    4057                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$52)
    4058                      .dwattr $C$DW$529, DW_AT_name("ctrlWaitTime")
    4059                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_ctrlWaitTime")
    4060                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4061                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4062              $C$DW$530       .dwtag  DW_TAG_member
    4063                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$71)
    4064                      .dwattr $C$DW$530, DW_AT_name("estWaitTime")
    4065                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_estWaitTime")
    4066                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4067                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4068              $C$DW$531       .dwtag  DW_TAG_member
    4069                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$72)
    4070                      .dwattr $C$DW$531, DW_AT_name("FluxWaitTime")
