TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jul 11 20:15:34 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/modules/brake/src/brake.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__IQsat")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___IQsat")

     616                      .dwpsn  file "D:/Foc/my_motor/sw/modules/pid/src/32b/pid.h",line 305,column 3,is_stmt
     617 000000a5 FF2F          MOV       ACC,#512 << 15        ; [CPU_] |305| 
         000000a6 0200 
     618 000000a7 FE84          SUBB      SP,#4                 ; [CPU_U] 
     619                      .dwcfi  cfa_offset, -4
     620 000000a8 1EC4          MOVL      *+XAR4[0],ACC         ; [CPU_] |305| 
     621                      .dwpsn  file "D:/Foc/my_motor/sw/modules/pid/src/32b/pid.h",line 307,column 3,is_stmt
     622 000000a9 0200          MOVB      ACC,#0                ; [CPU_] |307| 
     623                      .dwpsn  file "D:/Foc/my_motor/sw/modules/pid/src/32b/pid.h",line 306,column 3,is_stmt
     624 000000aa A0D4          MOVL      *+XAR4[2],XAR5        ; [CPU_] |306| 
     625                      .dwpsn  file "D:/Foc/my_motor/sw/modules/pid/src/32b/pid.h",line 307,column 3,is_stmt
     626 000000ab 1EE4          MOVL      *+XAR4[4],ACC         ; [CPU_] |307| 
     627 000000ac 8BBE          MOVL      XAR1,*--SP            ; [CPU_] 
     628                      .dwcfi  cfa_offset, -2
     629                      .dwcfi  restore_reg, 7
     630              $C$DW$57        .dwtag  DW_TAG_TI_branch
     631                      .dwattr $C$DW$57, DW_AT_low_pc(0x00)
     632                      .dwattr $C$DW$57, DW_AT_TI_return
     633 000000ad 0006          LRETR     ; [CPU_] 
     634                      ; return occurs ; [] 
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   13

     635                      .dwattr $C$DW$52, DW_AT_TI_end_file("D:/Foc/my_motor/sw/modules/brake/src/brake.c")
     636                      .dwattr $C$DW$52, DW_AT_TI_end_line(0x50)
     637                      .dwattr $C$DW$52, DW_AT_TI_end_column(0x01)
     638                      .dwendentry
     639                      .dwendtag $C$DW$52
     640              
     641              ;**************************************************************
     642              ;* UNDEFINED EXTERNAL REFERENCES                              *
     643              ;**************************************************************
     644                      .global _PID_init
     645                      .global L$$TOFS
     646                      .global FS$$TOL
     647              
     648              ;***************************************************************
     649              ;* TYPE INFORMATION                                            *
     650              ;***************************************************************
     651              
     652              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
     653                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     654              $C$DW$58        .dwtag  DW_TAG_enumerator, DW_AT_name("BRAKE_State_Error"), DW_AT_const_value(0x00)
     655              $C$DW$59        .dwtag  DW_TAG_enumerator, DW_AT_name("BRAKE_State_Idle"), DW_AT_const_value(0x01)
     656              $C$DW$60        .dwtag  DW_TAG_enumerator, DW_AT_name("BRAKE_State_OffLine"), DW_AT_const_value(0x02)
     657              $C$DW$61        .dwtag  DW_TAG_enumerator, DW_AT_name("BRAKE_State_OnLine"), DW_AT_const_value(0x03)
     658              $C$DW$62        .dwtag  DW_TAG_enumerator, DW_AT_name("BRAKE_numStates"), DW_AT_const_value(0x04)
     659                      .dwendtag $C$DW$T$31
     660              
     661              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_State_e")
     662                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
     663                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     664              
     665              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
     666                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     667              $C$DW$63        .dwtag  DW_TAG_enumerator, DW_AT_name("BRAKE_Type_Current"), DW_AT_const_value(0x00)
     668              $C$DW$64        .dwtag  DW_TAG_enumerator, DW_AT_name("BRAKE_Type_voltage"), DW_AT_const_value(0x01)
     669                      .dwendtag $C$DW$T$38
     670              
     671              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Type_e")
     672                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
     673                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
     674              
     675              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     676                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
     677                      .dwattr $C$DW$T$19, DW_AT_declaration
     678                      .dwendtag $C$DW$T$19
     679              
     680              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
     681                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$19)
     682                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
     683              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
     684                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
     685                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
     686              
     687              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     688                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
     689                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   14

     690              $C$DW$65        .dwtag  DW_TAG_member
     691                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$24)
     692                      .dwattr $C$DW$65, DW_AT_name("ADCRESULT")
     693                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_ADCRESULT")
     694                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     695                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     696              $C$DW$66        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$25)
     698                      .dwattr $C$DW$66, DW_AT_name("resvd_1")
     699                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_resvd_1")
     700                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     701                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     702              $C$DW$67        .dwtag  DW_TAG_member
     703                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$23)
     704                      .dwattr $C$DW$67, DW_AT_name("ADCCTL1")
     705                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_ADCCTL1")
     706                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
     707                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     708              $C$DW$68        .dwtag  DW_TAG_member
     709                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$23)
     710                      .dwattr $C$DW$68, DW_AT_name("ADCCTL2")
     711                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_ADCCTL2")
     712                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
     713                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     714              $C$DW$69        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$26)
     716                      .dwattr $C$DW$69, DW_AT_name("rsvd_2")
     717                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd_2")
     718                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
     719                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     720              $C$DW$70        .dwtag  DW_TAG_member
     721                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$23)
     722                      .dwattr $C$DW$70, DW_AT_name("ADCINTFLG")
     723                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_ADCINTFLG")
     724                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
     725                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     726              $C$DW$71        .dwtag  DW_TAG_member
     727                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$23)
     728                      .dwattr $C$DW$71, DW_AT_name("ADCINTFLGCLR")
     729                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
     730                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
     731                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     732              $C$DW$72        .dwtag  DW_TAG_member
     733                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$23)
     734                      .dwattr $C$DW$72, DW_AT_name("ADCINTOVF")
     735                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_ADCINTOVF")
     736                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
     737                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     738              $C$DW$73        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$23)
     740                      .dwattr $C$DW$73, DW_AT_name("ADCINTOVFCLR")
     741                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
     742                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
     743                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     744              $C$DW$74        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   15

     745                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$27)
     746                      .dwattr $C$DW$74, DW_AT_name("INTSELxNy")
     747                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_INTSELxNy")
     748                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
     749                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     750              $C$DW$75        .dwtag  DW_TAG_member
     751                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$28)
     752                      .dwattr $C$DW$75, DW_AT_name("rsvd_3")
     753                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd_3")
     754                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
     755                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     756              $C$DW$76        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$23)
     758                      .dwattr $C$DW$76, DW_AT_name("SOCPRICTRL")
     759                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_SOCPRICTRL")
     760                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
     761                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     762              $C$DW$77        .dwtag  DW_TAG_member
     763                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$23)
     764                      .dwattr $C$DW$77, DW_AT_name("rsvd_4")
     765                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd_4")
     766                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
     767                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     768              $C$DW$78        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$23)
     770                      .dwattr $C$DW$78, DW_AT_name("ADCSAMPLEMODE")
     771                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
     772                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
     773                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     774              $C$DW$79        .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$23)
     776                      .dwattr $C$DW$79, DW_AT_name("rsvd_5")
     777                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd_5")
     778                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
     779                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     780              $C$DW$80        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$23)
     782                      .dwattr $C$DW$80, DW_AT_name("ADCINTSOCSEL1")
     783                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
     784                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
     785                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     786              $C$DW$81        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$23)
     788                      .dwattr $C$DW$81, DW_AT_name("ADCINTSOCSEL2")
     789                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
     790                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
     791                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     792              $C$DW$82        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$26)
     794                      .dwattr $C$DW$82, DW_AT_name("rsvd_6")
     795                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd_6")
     796                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
     797                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     798              $C$DW$83        .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   16

     800                      .dwattr $C$DW$83, DW_AT_name("ADCSOCFLG1")
     801                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_ADCSOCFLG1")
     802                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
     803                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     804              $C$DW$84        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$23)
     806                      .dwattr $C$DW$84, DW_AT_name("rsvd_7")
     807                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd_7")
     808                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
     809                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     810              $C$DW$85        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$23)
     812                      .dwattr $C$DW$85, DW_AT_name("ADCSOCFRC1")
     813                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_ADCSOCFRC1")
     814                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
     815                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     816              $C$DW$86        .dwtag  DW_TAG_member
     817                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$23)
     818                      .dwattr $C$DW$86, DW_AT_name("rsvd_8")
     819                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd_8")
     820                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
     821                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     822              $C$DW$87        .dwtag  DW_TAG_member
     823                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$23)
     824                      .dwattr $C$DW$87, DW_AT_name("ADCSOCOVF1")
     825                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_ADCSOCOVF1")
     826                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
     827                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     828              $C$DW$88        .dwtag  DW_TAG_member
     829                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$23)
     830                      .dwattr $C$DW$88, DW_AT_name("rsvd_9")
     831                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd_9")
     832                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
     833                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     834              $C$DW$89        .dwtag  DW_TAG_member
     835                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$23)
     836                      .dwattr $C$DW$89, DW_AT_name("ADCSOCOVFCLR1")
     837                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
     838                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
     839                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     840              $C$DW$90        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$23)
     842                      .dwattr $C$DW$90, DW_AT_name("rsvd_10")
     843                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd_10")
     844                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
     845                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     846              $C$DW$91        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$24)
     848                      .dwattr $C$DW$91, DW_AT_name("ADCSOCxCTL")
     849                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ADCSOCxCTL")
     850                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
     851                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     852              $C$DW$92        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$24)
     854                      .dwattr $C$DW$92, DW_AT_name("rsvd_11")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   17

     855                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd_11")
     856                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
     857                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     858              $C$DW$93        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$23)
     860                      .dwattr $C$DW$93, DW_AT_name("ADCREFTRIM")
     861                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_ADCREFTRIM")
     862                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
     863                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     864              $C$DW$94        .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$23)
     866                      .dwattr $C$DW$94, DW_AT_name("ADCOFFTRIM")
     867                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_ADCOFFTRIM")
     868                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
     869                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     870              $C$DW$95        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$29)
     872                      .dwattr $C$DW$95, DW_AT_name("resvd_12")
     873                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_resvd_12")
     874                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
     875                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     876              $C$DW$96        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$23)
     878                      .dwattr $C$DW$96, DW_AT_name("ADCREV")
     879                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_ADCREV")
     880                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
     881                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     882                      .dwendtag $C$DW$T$30
     883              
     884              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
     885                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$30)
     886                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
     887              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
     888                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
     889                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     890              
     891              $C$DW$T$42      .dwtag  DW_TAG_structure_type
     892                      .dwattr $C$DW$T$42, DW_AT_name("_BRAKE_Obj_")
     893                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x2c)
     894              $C$DW$97        .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$32)
     896                      .dwattr $C$DW$97, DW_AT_name("state")
     897                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_state")
     898                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     899                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     900              $C$DW$98        .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$34)
     902                      .dwattr $C$DW$98, DW_AT_name("pidHandle_Ibrake")
     903                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_pidHandle_Ibrake")
     904                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     905                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     906              $C$DW$99        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$35)
     908                      .dwattr $C$DW$99, DW_AT_name("pid_Ibrake")
     909                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_pid_Ibrake")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   18

     910                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     911                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     912              $C$DW$100       .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$36)
     914                      .dwattr $C$DW$100, DW_AT_name("Kp_Ibrake")
     915                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Kp_Ibrake")
     916                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     917                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     918              $C$DW$101       .dwtag  DW_TAG_member
     919                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$36)
     920                      .dwattr $C$DW$101, DW_AT_name("Ki_Ibrake")
     921                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_Ki_Ibrake")
     922                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     923                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     924              $C$DW$102       .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$36)
     926                      .dwattr $C$DW$102, DW_AT_name("Kd_Ibrake")
     927                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Kd_Ibrake")
     928                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     929                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     930              $C$DW$103       .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$36)
     932                      .dwattr $C$DW$103, DW_AT_name("Ibrake_ref")
     933                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Ibrake_ref")
     934                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     935                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     936              $C$DW$104       .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$36)
     938                      .dwattr $C$DW$104, DW_AT_name("Ibrake_fbk")
     939                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_Ibrake_fbk")
     940                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     941                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     942              $C$DW$105       .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$37)
     944                      .dwattr $C$DW$105, DW_AT_name("AdcValue_I")
     945                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_AdcValue_I")
     946                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     947                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     948              $C$DW$106       .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$36)
     950                      .dwattr $C$DW$106, DW_AT_name("Ibrake_out")
     951                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_Ibrake_out")
     952                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     953                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     954              $C$DW$107       .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$36)
     956                      .dwattr $C$DW$107, DW_AT_name("Irated")
     957                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Irated")
     958                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     959                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     960              $C$DW$108       .dwtag  DW_TAG_member
     961                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$36)
     962                      .dwattr $C$DW$108, DW_AT_name("current_rate")
     963                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_current_rate")
     964                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   19

     965                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     966              $C$DW$109       .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$39)
     968                      .dwattr $C$DW$109, DW_AT_name("brake_type")
     969                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_brake_type")
     970                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     971                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     972              $C$DW$110       .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$40)
     974                      .dwattr $C$DW$110, DW_AT_name("counter_current")
     975                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_counter_current")
     976                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
     977                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     978              $C$DW$111       .dwtag  DW_TAG_member
     979                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$41)
     980                      .dwattr $C$DW$111, DW_AT_name("flag_enableBrake")
     981                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_flag_enableBrake")
     982                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     983                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     984              $C$DW$112       .dwtag  DW_TAG_member
     985                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$41)
     986                      .dwattr $C$DW$112, DW_AT_name("flag_enableOffset")
     987                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_flag_enableOffset")
     988                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
     989                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     990                      .dwendtag $C$DW$T$42
     991              
     992              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
     993                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$42)
     994                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
     995              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
     996                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$42)
     997                      .dwattr $C$DW$T$123, DW_AT_address_class(0x16)
     998              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
     999                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    1000                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    1001              $C$DW$113       .dwtag  DW_TAG_TI_far_type
    1002                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$124)
    1003              $C$DW$T$125     .dwtag  DW_TAG_const_type
    1004                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$113)
    1005              
    1006              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1007                      .dwattr $C$DW$T$44, DW_AT_name("_CLK_Obj_")
    1008                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x11)
    1009              $C$DW$114       .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$23)
    1011                      .dwattr $C$DW$114, DW_AT_name("XCLK")
    1012                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_XCLK")
    1013                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$115       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$23)
    1017                      .dwattr $C$DW$115, DW_AT_name("rsvd_1")
    1018                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd_1")
    1019                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   20

    1020                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$116       .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$23)
    1023                      .dwattr $C$DW$116, DW_AT_name("CLKCTL")
    1024                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_CLKCTL")
    1025                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1026                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1027              $C$DW$117       .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$43)
    1029                      .dwattr $C$DW$117, DW_AT_name("rsvd_2")
    1030                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd_2")
    1031                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1032                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1033              $C$DW$118       .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$23)
    1035                      .dwattr $C$DW$118, DW_AT_name("LOSPCP")
    1036                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_LOSPCP")
    1037                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1038                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$119       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$23)
    1041                      .dwattr $C$DW$119, DW_AT_name("PCLKCR0")
    1042                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PCLKCR0")
    1043                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1044                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$120       .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$23)
    1047                      .dwattr $C$DW$120, DW_AT_name("PCLKCR1")
    1048                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PCLKCR1")
    1049                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1050                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1051              $C$DW$121       .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$26)
    1053                      .dwattr $C$DW$121, DW_AT_name("rsvd_3")
    1054                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd_3")
    1055                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1056                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$122       .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$23)
    1059                      .dwattr $C$DW$122, DW_AT_name("PCLKCR3")
    1060                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PCLKCR3")
    1061                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1062                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1063                      .dwendtag $C$DW$T$44
    1064              
    1065              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    1066                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$44)
    1067                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    1068              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    1069                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1070                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1071              
    1072              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1073                      .dwattr $C$DW$T$46, DW_AT_name("_CPU_Obj_")
    1074                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   21

    1075              $C$DW$123       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$45)
    1077                      .dwattr $C$DW$123, DW_AT_name("tmp")
    1078                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_tmp")
    1079                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1081                      .dwendtag $C$DW$T$46
    1082              
    1083              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    1084                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$46)
    1085                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
    1086              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    1087                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    1088                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1089              
    1090              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1091                      .dwattr $C$DW$T$47, DW_AT_name("_FILTER_FO_")
    1092                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0a)
    1093              $C$DW$124       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$36)
    1095                      .dwattr $C$DW$124, DW_AT_name("a1")
    1096                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_a1")
    1097                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$125       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$36)
    1101                      .dwattr $C$DW$125, DW_AT_name("b0")
    1102                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_b0")
    1103                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1104                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1105              $C$DW$126       .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$36)
    1107                      .dwattr $C$DW$126, DW_AT_name("b1")
    1108                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_b1")
    1109                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1110                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1111              $C$DW$127       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$36)
    1113                      .dwattr $C$DW$127, DW_AT_name("x1")
    1114                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_x1")
    1115                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1116                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$128       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$36)
    1119                      .dwattr $C$DW$128, DW_AT_name("y1")
    1120                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_y1")
    1121                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1122                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1123                      .dwendtag $C$DW$T$47
    1124              
    1125              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    1126                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$47)
    1127                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    1128              
    1129              $C$DW$T$20      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   22

    1130                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    1131                      .dwattr $C$DW$T$20, DW_AT_declaration
    1132                      .dwendtag $C$DW$T$20
    1133              
    1134              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    1135                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$20)
    1136                      .dwattr $C$DW$T$99, DW_AT_address_class(0x16)
    1137              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    1138                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    1139                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    1140              
    1141              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1142                      .dwattr $C$DW$T$48, DW_AT_name("_FLASH_Obj_")
    1143                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x08)
    1144              $C$DW$129       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$23)
    1146                      .dwattr $C$DW$129, DW_AT_name("FOPT")
    1147                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_FOPT")
    1148                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1149                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1150              $C$DW$130       .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$23)
    1152                      .dwattr $C$DW$130, DW_AT_name("rsvd_1")
    1153                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd_1")
    1154                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1155                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$131       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$23)
    1158                      .dwattr $C$DW$131, DW_AT_name("FPWR")
    1159                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_FPWR")
    1160                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1161                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1162              $C$DW$132       .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$23)
    1164                      .dwattr $C$DW$132, DW_AT_name("FSTATUS")
    1165                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_FSTATUS")
    1166                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1167                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1168              $C$DW$133       .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$23)
    1170                      .dwattr $C$DW$133, DW_AT_name("FSTDBYWAIT")
    1171                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    1172                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1173                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1174              $C$DW$134       .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$23)
    1176                      .dwattr $C$DW$134, DW_AT_name("FACTIVEWAIT")
    1177                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    1178                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1179                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1180              $C$DW$135       .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$23)
    1182                      .dwattr $C$DW$135, DW_AT_name("FBANKWAIT")
    1183                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_FBANKWAIT")
    1184                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   23

    1185                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1186              $C$DW$136       .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$23)
    1188                      .dwattr $C$DW$136, DW_AT_name("FOTPWAIT")
    1189                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_FOTPWAIT")
    1190                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1191                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1192                      .dwendtag $C$DW$T$48
    1193              
    1194              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    1195                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$48)
    1196                      .dwattr $C$DW$T$62, DW_AT_address_class(0x16)
    1197              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    1198                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    1199                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1200              
    1201              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    1202                      .dwattr $C$DW$T$53, DW_AT_name("_GPIO_Obj_")
    1203                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x6a)
    1204              $C$DW$137       .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$50)
    1206                      .dwattr $C$DW$137, DW_AT_name("GPACTRL")
    1207                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPACTRL")
    1208                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1209                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1210              $C$DW$138       .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$50)
    1212                      .dwattr $C$DW$138, DW_AT_name("GPAQSEL1")
    1213                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPAQSEL1")
    1214                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1215                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1216              $C$DW$139       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$50)
    1218                      .dwattr $C$DW$139, DW_AT_name("GPAQSEL2")
    1219                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPAQSEL2")
    1220                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1221                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1222              $C$DW$140       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$50)
    1224                      .dwattr $C$DW$140, DW_AT_name("GPAMUX1")
    1225                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPAMUX1")
    1226                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1227                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1228              $C$DW$141       .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$50)
    1230                      .dwattr $C$DW$141, DW_AT_name("GPAMUX2")
    1231                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPAMUX2")
    1232                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1233                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1234              $C$DW$142       .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$50)
    1236                      .dwattr $C$DW$142, DW_AT_name("GPADIR")
    1237                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPADIR")
    1238                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1239                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   24

    1240              $C$DW$143       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$50)
    1242                      .dwattr $C$DW$143, DW_AT_name("GPAPUD")
    1243                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPAPUD")
    1244                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1245                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1246              $C$DW$144       .dwtag  DW_TAG_member
    1247                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$26)
    1248                      .dwattr $C$DW$144, DW_AT_name("rsvd_1")
    1249                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd_1")
    1250                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1251                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1252              $C$DW$145       .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$50)
    1254                      .dwattr $C$DW$145, DW_AT_name("GPBCTRL")
    1255                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPBCTRL")
    1256                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1257                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1258              $C$DW$146       .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$50)
    1260                      .dwattr $C$DW$146, DW_AT_name("GPBQSEL1")
    1261                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPBQSEL1")
    1262                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1263                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1264              $C$DW$147       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$26)
    1266                      .dwattr $C$DW$147, DW_AT_name("rsvd_2")
    1267                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd_2")
    1268                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1269                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1270              $C$DW$148       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$50)
    1272                      .dwattr $C$DW$148, DW_AT_name("GPBMUX1")
    1273                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPBMUX1")
    1274                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1275                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1276              $C$DW$149       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$26)
    1278                      .dwattr $C$DW$149, DW_AT_name("rsvd_3")
    1279                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd_3")
    1280                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1281                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$150       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$50)
    1284                      .dwattr $C$DW$150, DW_AT_name("GPBDIR")
    1285                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPBDIR")
    1286                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1287                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1288              $C$DW$151       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$50)
    1290                      .dwattr $C$DW$151, DW_AT_name("GPBPUD")
    1291                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPBPUD")
    1292                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1293                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1294              $C$DW$152       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   25

    1295                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$51)
    1296                      .dwattr $C$DW$152, DW_AT_name("rsvd_4")
    1297                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd_4")
    1298                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1299                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1300              $C$DW$153       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$50)
    1302                      .dwattr $C$DW$153, DW_AT_name("AIOMUX1")
    1303                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_AIOMUX1")
    1304                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1305                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1306              $C$DW$154       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$26)
    1308                      .dwattr $C$DW$154, DW_AT_name("rsvd_5")
    1309                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd_5")
    1310                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1311                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1312              $C$DW$155       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$50)
    1314                      .dwattr $C$DW$155, DW_AT_name("AIODIR")
    1315                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_AIODIR")
    1316                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1317                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1318              $C$DW$156       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$52)
    1320                      .dwattr $C$DW$156, DW_AT_name("rsvd_6")
    1321                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd_6")
    1322                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1323                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1324              $C$DW$157       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$50)
    1326                      .dwattr $C$DW$157, DW_AT_name("GPADAT")
    1327                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPADAT")
    1328                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1329                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1330              $C$DW$158       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$50)
    1332                      .dwattr $C$DW$158, DW_AT_name("GPASET")
    1333                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPASET")
    1334                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1335                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1336              $C$DW$159       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$50)
    1338                      .dwattr $C$DW$159, DW_AT_name("GPACLEAR")
    1339                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPACLEAR")
    1340                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1341                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1342              $C$DW$160       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$50)
    1344                      .dwattr $C$DW$160, DW_AT_name("GPATOGGLE")
    1345                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPATOGGLE")
    1346                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1347                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$161       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$50)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   26

    1350                      .dwattr $C$DW$161, DW_AT_name("GPBDAT")
    1351                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPBDAT")
    1352                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1353                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1354              $C$DW$162       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$50)
    1356                      .dwattr $C$DW$162, DW_AT_name("GPBSET")
    1357                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPBSET")
    1358                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1359                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1360              $C$DW$163       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$50)
    1362                      .dwattr $C$DW$163, DW_AT_name("GPBCLEAR")
    1363                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPBCLEAR")
    1364                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1365                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1366              $C$DW$164       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$50)
    1368                      .dwattr $C$DW$164, DW_AT_name("GPBTOGGLE")
    1369                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPBTOGGLE")
    1370                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1371                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1372              $C$DW$165       .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$43)
    1374                      .dwattr $C$DW$165, DW_AT_name("rsvd_7")
    1375                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd_7")
    1376                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1377                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$166       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$50)
    1380                      .dwattr $C$DW$166, DW_AT_name("AIODAT")
    1381                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_AIODAT")
    1382                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1383                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1384              $C$DW$167       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$50)
    1386                      .dwattr $C$DW$167, DW_AT_name("AIOSET")
    1387                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_AIOSET")
    1388                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1389                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$168       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$50)
    1392                      .dwattr $C$DW$168, DW_AT_name("AIOCLEAR")
    1393                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_AIOCLEAR")
    1394                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1395                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1396              $C$DW$169       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$50)
    1398                      .dwattr $C$DW$169, DW_AT_name("AIOTOGGLE")
    1399                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_AIOTOGGLE")
    1400                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1401                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1402              $C$DW$170       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$28)
    1404                      .dwattr $C$DW$170, DW_AT_name("GPIOXINTnSEL")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   27

    1405                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    1406                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1407                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1408              $C$DW$171       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$27)
    1410                      .dwattr $C$DW$171, DW_AT_name("rsvd_8")
    1411                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd_8")
    1412                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    1413                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1414              $C$DW$172       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$50)
    1416                      .dwattr $C$DW$172, DW_AT_name("GPIOLPMSEL")
    1417                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    1418                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1419                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1420                      .dwendtag $C$DW$T$53
    1421              
    1422              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    1423                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$53)
    1424                      .dwattr $C$DW$T$64, DW_AT_address_class(0x16)
    1425              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1426                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    1427                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1428              
    1429              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    1430                      .dwattr $C$DW$T$55, DW_AT_name("_HAL_AdcData_t_")
    1431                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x16)
    1432              $C$DW$173       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$54)
    1434                      .dwattr $C$DW$173, DW_AT_name("I")
    1435                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_I")
    1436                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1437                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1438              $C$DW$174       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$54)
    1440                      .dwattr $C$DW$174, DW_AT_name("V")
    1441                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_V")
    1442                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1443                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1444              $C$DW$175       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$36)
    1446                      .dwattr $C$DW$175, DW_AT_name("dcBus")
    1447                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_dcBus")
    1448                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1449                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1450              $C$DW$176       .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$36)
    1452                      .dwattr $C$DW$176, DW_AT_name("analogSensor1")
    1453                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_analogSensor1")
    1454                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1455                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1456              $C$DW$177       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$36)
    1458                      .dwattr $C$DW$177, DW_AT_name("analogSensor2")
    1459                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_analogSensor2")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   28

    1460                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1461                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1462              $C$DW$178       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$36)
    1464                      .dwattr $C$DW$178, DW_AT_name("igbtNTC")
    1465                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_igbtNTC")
    1466                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1467                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1468              $C$DW$179       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$36)
    1470                      .dwattr $C$DW$179, DW_AT_name("boardAddr")
    1471                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_boardAddr")
    1472                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1473                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1474                      .dwendtag $C$DW$T$55
    1475              
    1476              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    1477                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$55)
    1478                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1479              $C$DW$180       .dwtag  DW_TAG_TI_far_type
    1480                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$91)
    1481              $C$DW$T$131     .dwtag  DW_TAG_const_type
    1482                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$180)
    1483              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    1484                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    1485                      .dwattr $C$DW$T$132, DW_AT_address_class(0x16)
    1486              $C$DW$181       .dwtag  DW_TAG_TI_far_type
    1487                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$132)
    1488              $C$DW$T$133     .dwtag  DW_TAG_const_type
    1489                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$181)
    1490              
    1491              $C$DW$T$92      .dwtag  DW_TAG_structure_type
    1492                      .dwattr $C$DW$T$92, DW_AT_name("_HAL_Obj_")
    1493                      .dwattr $C$DW$T$92, DW_AT_byte_size(0xb2)
    1494              $C$DW$182       .dwtag  DW_TAG_member
    1495                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$57)
    1496                      .dwattr $C$DW$182, DW_AT_name("adcHandle")
    1497                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_adcHandle")
    1498                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1499                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1500              $C$DW$183       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$59)
    1502                      .dwattr $C$DW$183, DW_AT_name("clkHandle")
    1503                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_clkHandle")
    1504                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1505                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1506              $C$DW$184       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$61)
    1508                      .dwattr $C$DW$184, DW_AT_name("cpuHandle")
    1509                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_cpuHandle")
    1510                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1511                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1512              $C$DW$185       .dwtag  DW_TAG_member
    1513                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$63)
    1514                      .dwattr $C$DW$185, DW_AT_name("flashHandle")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   29

    1515                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_flashHandle")
    1516                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1517                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1518              $C$DW$186       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$65)
    1520                      .dwattr $C$DW$186, DW_AT_name("gpioHandle")
    1521                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_gpioHandle")
    1522                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1523                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1524              $C$DW$187       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$68)
    1526                      .dwattr $C$DW$187, DW_AT_name("offsetHandle_I")
    1527                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_offsetHandle_I")
    1528                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1529                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1530              $C$DW$188       .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$70)
    1532                      .dwattr $C$DW$188, DW_AT_name("offset_I")
    1533                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_offset_I")
    1534                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1535                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1536              $C$DW$189       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$68)
    1538                      .dwattr $C$DW$189, DW_AT_name("offsetHandle_V")
    1539                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_offsetHandle_V")
    1540                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1541                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1542              $C$DW$190       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$70)
    1544                      .dwattr $C$DW$190, DW_AT_name("offset_V")
    1545                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_offset_V")
    1546                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1547                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1548              $C$DW$191       .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$72)
    1550                      .dwattr $C$DW$191, DW_AT_name("oscHandle")
    1551                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_oscHandle")
    1552                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    1553                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1554              $C$DW$192       .dwtag  DW_TAG_member
    1555                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$74)
    1556                      .dwattr $C$DW$192, DW_AT_name("pieHandle")
    1557                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_pieHandle")
    1558                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1559                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1560              $C$DW$193       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$76)
    1562                      .dwattr $C$DW$193, DW_AT_name("pllHandle")
    1563                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_pllHandle")
    1564                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    1565                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1566              $C$DW$194       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$79)
    1568                      .dwattr $C$DW$194, DW_AT_name("pwmHandle")
    1569                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_pwmHandle")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   30

    1570                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1571                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1572              $C$DW$195       .dwtag  DW_TAG_member
    1573                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$79)
    1574                      .dwattr $C$DW$195, DW_AT_name("pwmDacHandle")
    1575                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_pwmDacHandle")
    1576                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    1577                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1578              $C$DW$196       .dwtag  DW_TAG_member
    1579                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$81)
    1580                      .dwattr $C$DW$196, DW_AT_name("pwrHandle")
    1581                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_pwrHandle")
    1582                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1583                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1584              $C$DW$197       .dwtag  DW_TAG_member
    1585                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$84)
    1586                      .dwattr $C$DW$197, DW_AT_name("timerHandle")
    1587                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_timerHandle")
    1588                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    1589                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1590              $C$DW$198       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$86)
    1592                      .dwattr $C$DW$198, DW_AT_name("i2cHandle")
    1593                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_i2cHandle")
    1594                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1595                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1596              $C$DW$199       .dwtag  DW_TAG_member
    1597                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$88)
    1598                      .dwattr $C$DW$199, DW_AT_name("spiAHandle")
    1599                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_spiAHandle")
    1600                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    1601                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1602              $C$DW$200       .dwtag  DW_TAG_member
    1603                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$90)
    1604                      .dwattr $C$DW$200, DW_AT_name("wdogHandle")
    1605                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_wdogHandle")
    1606                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1607                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1608              $C$DW$201       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$91)
    1610                      .dwattr $C$DW$201, DW_AT_name("adcBias")
    1611                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_adcBias")
    1612                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    1613                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1614              $C$DW$202       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$36)
    1616                      .dwattr $C$DW$202, DW_AT_name("current_sf")
    1617                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_current_sf")
    1618                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    1619                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1620              $C$DW$203       .dwtag  DW_TAG_member
    1621                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$36)
    1622                      .dwattr $C$DW$203, DW_AT_name("voltage_sf")
    1623                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_voltage_sf")
    1624                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   31

    1625                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1626              $C$DW$204       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$45)
    1628                      .dwattr $C$DW$204, DW_AT_name("numCurrentSensors")
    1629                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_numCurrentSensors")
    1630                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1631                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1632              $C$DW$205       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$45)
    1634                      .dwattr $C$DW$205, DW_AT_name("numVoltageSensors")
    1635                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_numVoltageSensors")
    1636                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
    1637                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1638                      .dwendtag $C$DW$T$92
    1639              
    1640              $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    1641                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$92)
    1642                      .dwattr $C$DW$T$138, DW_AT_address_class(0x16)
    1643              $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    1644                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    1645                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    1646              
    1647              $C$DW$T$93      .dwtag  DW_TAG_structure_type
    1648                      .dwattr $C$DW$T$93, DW_AT_name("_HAL_PwmData_t_")
    1649                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x06)
    1650              $C$DW$206       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$54)
    1652                      .dwattr $C$DW$206, DW_AT_name("Tabc")
    1653                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Tabc")
    1654                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1656                      .dwendtag $C$DW$T$93
    1657              
    1658              $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_PwmData_t")
    1659                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$93)
    1660                      .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    1661              $C$DW$T$141     .dwtag  DW_TAG_pointer_type
    1662                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$140)
    1663                      .dwattr $C$DW$T$141, DW_AT_address_class(0x16)
    1664              $C$DW$207       .dwtag  DW_TAG_TI_far_type
    1665                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$141)
    1666              $C$DW$T$142     .dwtag  DW_TAG_const_type
    1667                      .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$207)
    1668              
    1669              $C$DW$T$95      .dwtag  DW_TAG_structure_type
    1670                      .dwattr $C$DW$T$95, DW_AT_name("_MATH_vec2_")
    1671                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x04)
    1672              $C$DW$208       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$94)
    1674                      .dwattr $C$DW$208, DW_AT_name("value")
    1675                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_value")
    1676                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1677                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1678                      .dwendtag $C$DW$T$95
    1679              
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   32

    1680              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    1681                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$95)
    1682                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1683              
    1684              $C$DW$T$97      .dwtag  DW_TAG_structure_type
    1685                      .dwattr $C$DW$T$97, DW_AT_name("_MATH_vec3_")
    1686                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x06)
    1687              $C$DW$209       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$96)
    1689                      .dwattr $C$DW$209, DW_AT_name("value")
    1690                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_value")
    1691                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1693                      .dwendtag $C$DW$T$97
    1694              
    1695              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    1696                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$97)
    1697                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1698              
    1699              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    1700                      .dwattr $C$DW$T$101, DW_AT_name("_OFFSET_")
    1701                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x10)
    1702              $C$DW$210       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$36)
    1704                      .dwattr $C$DW$210, DW_AT_name("value")
    1705                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_value")
    1706                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1708              $C$DW$211       .dwtag  DW_TAG_member
    1709                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$36)
    1710                      .dwattr $C$DW$211, DW_AT_name("bias")
    1711                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_bias")
    1712                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1713                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1714              $C$DW$212       .dwtag  DW_TAG_member
    1715                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$98)
    1716                      .dwattr $C$DW$212, DW_AT_name("filter")
    1717                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_filter")
    1718                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1719                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1720              $C$DW$213       .dwtag  DW_TAG_member
    1721                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$100)
    1722                      .dwattr $C$DW$213, DW_AT_name("filterHandle")
    1723                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_filterHandle")
    1724                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1725                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1726                      .dwendtag $C$DW$T$101
    1727              
    1728              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
    1729                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$101)
    1730                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1731              
    1732              $C$DW$T$70      .dwtag  DW_TAG_array_type
    1733                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    1734                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   33

    1735                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x30)
    1736              $C$DW$214       .dwtag  DW_TAG_subrange_type
    1737                      .dwattr $C$DW$214, DW_AT_upper_bound(0x02)
    1738                      .dwendtag $C$DW$T$70
    1739              
    1740              
    1741              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1742                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
    1743                      .dwattr $C$DW$T$21, DW_AT_declaration
    1744                      .dwendtag $C$DW$T$21
    1745              
    1746              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    1747                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
    1748                      .dwattr $C$DW$T$66, DW_AT_address_class(0x16)
    1749              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
    1750                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    1751                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1752              
    1753              $C$DW$T$68      .dwtag  DW_TAG_array_type
    1754                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1755                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1756                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x06)
    1757              $C$DW$215       .dwtag  DW_TAG_subrange_type
    1758                      .dwattr $C$DW$215, DW_AT_upper_bound(0x02)
    1759                      .dwendtag $C$DW$T$68
    1760              
    1761              
    1762              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    1763                      .dwattr $C$DW$T$102, DW_AT_name("_OSC_Obj_")
    1764                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x03)
    1765              $C$DW$216       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$23)
    1767                      .dwattr $C$DW$216, DW_AT_name("INTOSC1TRIM")
    1768                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    1769                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1770                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1771              $C$DW$217       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$23)
    1773                      .dwattr $C$DW$217, DW_AT_name("rsvd_1")
    1774                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_rsvd_1")
    1775                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1776                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1777              $C$DW$218       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$23)
    1779                      .dwattr $C$DW$218, DW_AT_name("INTOSC2TRIM")
    1780                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    1781                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1782                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1783                      .dwendtag $C$DW$T$102
    1784              
    1785              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    1786                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$102)
    1787                      .dwattr $C$DW$T$71, DW_AT_address_class(0x16)
    1788              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
    1789                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   34

    1790                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1791              
    1792              $C$DW$T$103     .dwtag  DW_TAG_structure_type
    1793                      .dwattr $C$DW$T$103, DW_AT_name("_PID_Obj_")
    1794                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x10)
    1795              $C$DW$219       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$36)
    1797                      .dwattr $C$DW$219, DW_AT_name("Kp")
    1798                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_Kp")
    1799                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$220       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$36)
    1803                      .dwattr $C$DW$220, DW_AT_name("Ki")
    1804                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_Ki")
    1805                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1806                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$221       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$36)
    1809                      .dwattr $C$DW$221, DW_AT_name("Kd")
    1810                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_Kd")
    1811                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1812                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$222       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$36)
    1815                      .dwattr $C$DW$222, DW_AT_name("Ui")
    1816                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_Ui")
    1817                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1818                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$223       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$36)
    1821                      .dwattr $C$DW$223, DW_AT_name("refValue")
    1822                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_refValue")
    1823                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1824                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$224       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$36)
    1827                      .dwattr $C$DW$224, DW_AT_name("fbackValue")
    1828                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_fbackValue")
    1829                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1830                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1831              $C$DW$225       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$36)
    1833                      .dwattr $C$DW$225, DW_AT_name("outMin")
    1834                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_outMin")
    1835                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1836                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$226       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$36)
    1839                      .dwattr $C$DW$226, DW_AT_name("outMax")
    1840                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_outMax")
    1841                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1842                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1843                      .dwendtag $C$DW$T$103
    1844              
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:34 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0822010                              PAGE   35

    1845              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    1846                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$103)
    1847                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1848              $C$DW$T$145     .dwtag  DW_TAG_pointer_type
    1849                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$35)
    1850                      .dwattr $C$DW$T$145, DW_AT_address_class(0x16)
    1851              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1852                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$103)
    1853                      .dwattr $C$DW$T$33, DW_AT_address_class(0x16)
    1854              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
