TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:31 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0958811                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jul 11 19:04:31 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/drivers/clk/src/32b/f28x/f2802x/clk.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;       c:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\095883 C

    2777                      .dwendtag $C$DW$T$42
    2778              
    2779              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Osc2Src_e")
    2780                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2781                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2782              $C$DW$243       .dwtag  DW_TAG_TI_far_type
    2783                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$43)
    2784              $C$DW$T$44      .dwtag  DW_TAG_const_type
    2785                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$243)
    2786              
    2787              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    2788                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2789              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_XClkInSrc_Gpio38"), DW_AT_const_value(0x00)
    2790              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_XClkInSrc_Gpio19"), DW_AT_const_value(0x40)
    2791                      .dwendtag $C$DW$T$45
    2792              
    2793              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_XClkInSrc_e")
    2794                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2795                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2796              $C$DW$246       .dwtag  DW_TAG_TI_far_type
    2797                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$46)
    2798              $C$DW$T$47      .dwtag  DW_TAG_const_type
    2799                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$246)
    2800              
    2801              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    2802                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2803              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_1"), DW_AT_const_value(0x00)
    2804              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_2"), DW_AT_const_value(0x20)
    2805              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_4"), DW_AT_const_value(0x40)
    2806              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_8"), DW_AT_const_value(0x60)
    2807              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_16"), DW_AT_const_value(0x80)
    2808                      .dwendtag $C$DW$T$48
    2809              
    2810              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Timer2PreScaler_e")
    2811                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2812                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2813              $C$DW$252       .dwtag  DW_TAG_TI_far_type
    2814                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$49)
    2815              $C$DW$T$50      .dwtag  DW_TAG_const_type
    2816                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$252)
    2817              
    2818              $C$DW$T$51      .dwtag  DW_TAG_enumeration_type
    2819                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    2820              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_SysClk"), DW_AT_const_value(0x00)
    2821              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_ExtOsc"), DW_AT_const_value(0x08)
    2822              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_IntOsc1"), DW_AT_const_value(0x10)
    2823              $C$DW$256       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_IntOsc2"), DW_AT_const_value(0x18)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:31 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0958811                              PAGE   53

    2824                      .dwendtag $C$DW$T$51
    2825              
    2826              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Timer2Src_e")
    2827                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2828                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2829              $C$DW$257       .dwtag  DW_TAG_TI_far_type
    2830                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$52)
    2831              $C$DW$T$53      .dwtag  DW_TAG_const_type
    2832                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$257)
    2833              
    2834              $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
    2835                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    2836              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_WdClkSrc_IntOsc1"), DW_AT_const_value(0x00)
    2837              $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_WdClkSrc_ExtOscOrIntOsc2"), DW_AT_const_value(0x04
    2838                      .dwendtag $C$DW$T$54
    2839              
    2840              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_WdClkSrc_e")
    2841                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2842                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2843              $C$DW$260       .dwtag  DW_TAG_TI_far_type
    2844                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$55)
    2845              $C$DW$T$56      .dwtag  DW_TAG_const_type
    2846                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$260)
    2847              
    2848              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2849                      .dwattr $C$DW$T$23, DW_AT_name("_CLK_Obj_")
    2850                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x11)
    2851              $C$DW$261       .dwtag  DW_TAG_member
    2852                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    2853                      .dwattr $C$DW$261, DW_AT_name("XCLK")
    2854                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_XCLK")
    2855                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2856                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2857              $C$DW$262       .dwtag  DW_TAG_member
    2858                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2859                      .dwattr $C$DW$262, DW_AT_name("rsvd_1")
    2860                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_rsvd_1")
    2861                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2862                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2863              $C$DW$263       .dwtag  DW_TAG_member
    2864                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    2865                      .dwattr $C$DW$263, DW_AT_name("CLKCTL")
    2866                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_CLKCTL")
    2867                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2868                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2869              $C$DW$264       .dwtag  DW_TAG_member
    2870                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$21)
    2871                      .dwattr $C$DW$264, DW_AT_name("rsvd_2")
    2872                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_rsvd_2")
    2873                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2874                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2875              $C$DW$265       .dwtag  DW_TAG_member
    2876                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2877                      .dwattr $C$DW$265, DW_AT_name("LOSPCP")
    2878                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_LOSPCP")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:31 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0958811                              PAGE   54

    2879                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2880                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2881              $C$DW$266       .dwtag  DW_TAG_member
    2882                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2883                      .dwattr $C$DW$266, DW_AT_name("PCLKCR0")
    2884                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_PCLKCR0")
    2885                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2886                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2887              $C$DW$267       .dwtag  DW_TAG_member
    2888                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2889                      .dwattr $C$DW$267, DW_AT_name("PCLKCR1")
    2890                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_PCLKCR1")
    2891                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2892                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2893              $C$DW$268       .dwtag  DW_TAG_member
    2894                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$22)
    2895                      .dwattr $C$DW$268, DW_AT_name("rsvd_3")
    2896                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_rsvd_3")
    2897                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2898                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2899              $C$DW$269       .dwtag  DW_TAG_member
    2900                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2901                      .dwattr $C$DW$269, DW_AT_name("PCLKCR3")
    2902                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_PCLKCR3")
    2903                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2904                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2905                      .dwendtag $C$DW$T$23
    2906              
    2907              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Obj")
    2908                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$23)
    2909                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2910              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    2911                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    2912                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    2913              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    2914                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2915                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2916              $C$DW$270       .dwtag  DW_TAG_TI_far_type
    2917                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$59)
    2918              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2919                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$270)
    2920              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2921                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    2922              $C$DW$271       .dwtag  DW_TAG_TI_far_type
    2923                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$3)
    2924              $C$DW$T$66      .dwtag  DW_TAG_const_type
    2925                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$271)
    2926              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2927                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2928                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2929                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2930              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2931                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2932                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2933                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:31 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0958811                              PAGE   55

    2934              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2935                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2936                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2937                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2938              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2939                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2940                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2941                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2942              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2943                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2944                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2945                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2946              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2947                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2948                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2949                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2950              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2951                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2952                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2953              $C$DW$272       .dwtag  DW_TAG_TI_far_type
    2954                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    2955              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
