TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:31 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0086410                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jul 11 19:04:31 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/modules/cpu_time/src/32b/cpu_time.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;       c:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\008642 C

     106 00000014               .sect   ".text"
     107                      .clink
     108                      .global _CPU_TIME_init
     109              
     110              $C$DW$7 .dwtag  DW_TAG_subprogram, DW_AT_name("CPU_TIME_init")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:31 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0086410                              PAGE    3

     111                      .dwattr $C$DW$7, DW_AT_low_pc(_CPU_TIME_init)
     112                      .dwattr $C$DW$7, DW_AT_high_pc(0x00)
     113                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_CPU_TIME_init")
     114                      .dwattr $C$DW$7, DW_AT_external
     115                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$25)
     116                      .dwattr $C$DW$7, DW_AT_TI_begin_file("D:/Foc/my_motor/sw/modules/cpu_time/src/32b/cpu_time.c")
     117                      .dwattr $C$DW$7, DW_AT_TI_begin_line(0x15)
     118                      .dwattr $C$DW$7, DW_AT_TI_begin_column(0x11)
     119                      .dwattr $C$DW$7, DW_AT_TI_max_frame_size(-2)
     120                      .dwpsn  file "D:/Foc/my_motor/sw/modules/cpu_time/src/32b/cpu_time.c",line 22,column 1,is_stmt,addres
     121              
     122                      .dwfde $C$DW$CIE, _CPU_TIME_init
     123              $C$DW$8 .dwtag  DW_TAG_formal_parameter, DW_AT_name("pMemory")
     124                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_pMemory")
     125                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$3)
     126                      .dwattr $C$DW$8, DW_AT_location[DW_OP_reg12]
     127              $C$DW$9 .dwtag  DW_TAG_formal_parameter, DW_AT_name("numBytes")
     128                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_numBytes")
     129                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$28)
     130                      .dwattr $C$DW$9, DW_AT_location[DW_OP_reg0]
     131              
     132              ;***************************************************************
     133              ;* FNAME: _CPU_TIME_init                FR SIZE:   0           *
     134              ;*                                                             *
     135              ;* FUNCTION ENVIRONMENT                                        *
     136              ;*                                                             *
     137              ;* FUNCTION PROPERTIES                                         *
     138              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     139              ;***************************************************************
     140              
     141              _CPU_TIME_init:
     142              ;* AR6   assigned to _numBytes
     143              $C$DW$10        .dwtag  DW_TAG_variable, DW_AT_name("numBytes")
     144                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_numBytes")
     145                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$28)
     146                      .dwattr $C$DW$10, DW_AT_location[DW_OP_reg16]
     147              ;* AR4   assigned to _pMemory
     148              $C$DW$11        .dwtag  DW_TAG_variable, DW_AT_name("pMemory")
     149                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_pMemory")
     150                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$32)
     151                      .dwattr $C$DW$11, DW_AT_location[DW_OP_reg12]
     152                      .dwcfi  cfa_offset, -2
     153                      .dwcfi  save_reg_to_mem, 26, 0
     154                      .dwcfi  save_reg_to_reg, 78, 26
     155 00000014 1EA6          MOVL      XAR6,ACC              ; [CPU_] |22| 
     156                      .dwpsn  file "D:/Foc/my_motor/sw/modules/cpu_time/src/32b/cpu_time.c",line 26,column 5,is_stmt
     157 00000015 0218          MOVB      ACC,#24               ; [CPU_] |26| 
     158 00000016 0FA6          CMPL      ACC,XAR6              ; [CPU_] |26| 
     159 00000017 6902          B         $C$L1,LOS             ; [CPU_] |26| 
     160                      ; branchcc occurs ; [] |26| 
     161 00000018 D400          MOVB      XAR4,#0               ; [CPU_] |26| 
     162              $C$L1:    
     163              $C$DW$12        .dwtag  DW_TAG_TI_branch
     164                      .dwattr $C$DW$12, DW_AT_low_pc(0x00)
     165                      .dwattr $C$DW$12, DW_AT_TI_return
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:31 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0086410                              PAGE    4

     166 00000019 0006          LRETR     ; [CPU_] 
     167                      ; return occurs ; [] 
     168                      .dwattr $C$DW$7, DW_AT_TI_end_file("D:/Foc/my_motor/sw/modules/cpu_time/src/32b/cpu_time.c")
     169                      .dwattr $C$DW$7, DW_AT_TI_end_line(0x20)
     170                      .dwattr $C$DW$7, DW_AT_TI_end_column(0x01)
     171                      .dwendentry
     172                      .dwendtag $C$DW$7
     173              
     174              
     175              ;***************************************************************
     176              ;* TYPE INFORMATION                                            *
     177              ;***************************************************************
     178              
     179              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     180                      .dwattr $C$DW$T$22, DW_AT_name("_CPU_TIME_Obj_")
     181                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x18)
     182              $C$DW$13        .dwtag  DW_TAG_member
     183                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     184                      .dwattr $C$DW$13, DW_AT_name("pwm_period")
     185                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_pwm_period")
     186                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     187                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     188              $C$DW$14        .dwtag  DW_TAG_member
     189                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
     190                      .dwattr $C$DW$14, DW_AT_name("timer_cnt_now")
     191                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_timer_cnt_now")
     192                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     193                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     194              $C$DW$15        .dwtag  DW_TAG_member
     195                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
     196                      .dwattr $C$DW$15, DW_AT_name("timer_cnt_prev")
     197                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_timer_cnt_prev")
     198                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     199                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     200              $C$DW$16        .dwtag  DW_TAG_member
     201                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
     202                      .dwattr $C$DW$16, DW_AT_name("timer_delta_now")
     203                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_timer_delta_now")
     204                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     205                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     206              $C$DW$17        .dwtag  DW_TAG_member
     207                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$20)
     208                      .dwattr $C$DW$17, DW_AT_name("timer_delta_prev")
     209                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_timer_delta_prev")
     210                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     211                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     212              $C$DW$18        .dwtag  DW_TAG_member
     213                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$20)
     214                      .dwattr $C$DW$18, DW_AT_name("timer_delta_min")
     215                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_timer_delta_min")
     216                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     217                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     218              $C$DW$19        .dwtag  DW_TAG_member
     219                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
     220                      .dwattr $C$DW$19, DW_AT_name("timer_delta_max")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:31 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0086410                              PAGE    5

     221                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_timer_delta_max")
     222                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     223                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     224              $C$DW$20        .dwtag  DW_TAG_member
     225                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
     226                      .dwattr $C$DW$20, DW_AT_name("timer_delta_avg")
     227                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_timer_delta_avg")
     228                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     229                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     230              $C$DW$21        .dwtag  DW_TAG_member
     231                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$20)
     232                      .dwattr $C$DW$21, DW_AT_name("timer_band_max")
     233                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_timer_band_max")
     234                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     235                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     236              $C$DW$22        .dwtag  DW_TAG_member
     237                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
     238                      .dwattr $C$DW$22, DW_AT_name("timer_delta_CntAcc")
     239                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_timer_delta_CntAcc")
     240                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     241                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     242              $C$DW$23        .dwtag  DW_TAG_member
     243                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
     244                      .dwattr $C$DW$23, DW_AT_name("timer_delta_AccNum")
     245                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_timer_delta_AccNum")
     246                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     247                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     248              $C$DW$24        .dwtag  DW_TAG_member
     249                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$21)
     250                      .dwattr $C$DW$24, DW_AT_name("flag_resetStatus")
     251                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_flag_resetStatus")
     252                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     253                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     254                      .dwendtag $C$DW$T$22
     255              
     256              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_TIME_Obj")
     257                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     258                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     259              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     260                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$22)
     261                      .dwattr $C$DW$T$24, DW_AT_address_class(0x16)
     262              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_TIME_Handle")
     263                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     264                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     265              $C$DW$25        .dwtag  DW_TAG_TI_far_type
     266                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$25)
     267              $C$DW$T$26      .dwtag  DW_TAG_const_type
     268                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$25)
     269              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     270                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
     271              $C$DW$26        .dwtag  DW_TAG_TI_far_type
     272                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$3)
     273              $C$DW$T$32      .dwtag  DW_TAG_const_type
     274                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$26)
     275              $C$DW$T$4       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:31 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0086410                              PAGE    6

     276                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     277                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     278                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     279              $C$DW$T$5       .dwtag  DW_TAG_base_type
     280                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     281                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     282                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     283              $C$DW$T$6       .dwtag  DW_TAG_base_type
     284                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     285                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     286                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     287              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
     288                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$6)
     289                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     290              $C$DW$T$7       .dwtag  DW_TAG_base_type
     291                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     292                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     293                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     294              $C$DW$T$8       .dwtag  DW_TAG_base_type
     295                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     296                      .dwattr $C$DW$T$8, DW_AT_name("short")
     297                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     298              $C$DW$T$9       .dwtag  DW_TAG_base_type
     299                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     300                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     301                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     302              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
     303                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
     304                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
