TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jul 11 20:15:34 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    6630              $C$DW$623       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6631              $C$DW$624       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  128

    6632              $C$DW$625       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6633              $C$DW$626       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6634                      .dwendtag $C$DW$T$158
    6635              
    6636              $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6637                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$158)
    6638                      .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    6639              
    6640              $C$DW$T$168     .dwtag  DW_TAG_enumeration_type
    6641                      .dwattr $C$DW$T$168, DW_AT_byte_size(0x01)
    6642              $C$DW$627       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Error"), DW_AT_const_value(0x00)
    6643              $C$DW$628       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Idle"), DW_AT_const_value(0x01)
    6644              $C$DW$629       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RoverL"), DW_AT_const_value(0x02)
    6645              $C$DW$630       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rs"), DW_AT_const_value(0x03)
    6646              $C$DW$631       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampUp"), DW_AT_const_value(0x04)
    6647              $C$DW$632       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_IdRated"), DW_AT_const_value(0x05)
    6648              $C$DW$633       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux_OL"), DW_AT_const_value(0x06)
    6649              $C$DW$634       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux"), DW_AT_const_value(0x07)
    6650              $C$DW$635       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampDown"), DW_AT_const_value(0x08)
    6651              $C$DW$636       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_LockRotor"), DW_AT_const_value(0x09)
    6652              $C$DW$637       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Ls"), DW_AT_const_value(0x0a)
    6653              $C$DW$638       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rr"), DW_AT_const_value(0x0b)
    6654              $C$DW$639       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_MotorIdentified"), DW_AT_const_value(0x0c)
    6655              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_OnLine"), DW_AT_const_value(0x0d)
    6656              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_numStates"), DW_AT_const_value(0x0e)
    6657                      .dwendtag $C$DW$T$168
    6658              
    6659              $C$DW$T$169     .dwtag  DW_TAG_typedef, DW_AT_name("EST_State_e")
    6660                      .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$168)
    6661                      .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    6662              
    6663              $C$DW$T$173     .dwtag  DW_TAG_enumeration_type
    6664                      .dwattr $C$DW$T$173, DW_AT_byte_size(0x01)
    6665              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6666              $C$DW$643       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6667              $C$DW$644       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6668                      .dwendtag $C$DW$T$173
    6669              
    6670              $C$DW$T$174     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6671                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
    6672                      .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    6673              $C$DW$645       .dwtag  DW_TAG_TI_far_type
    6674                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$174)
    6675              $C$DW$T$175     .dwtag  DW_TAG_const_type
    6676                      .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$645)
    6677              
    6678              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6679                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    6680                      .dwattr $C$DW$T$19, DW_AT_declaration
    6681                      .dwendtag $C$DW$T$19
    6682              
    6683              $C$DW$T$112     .dwtag  DW_TAG_pointer_type
    6684                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$19)
    6685                      .dwattr $C$DW$T$112, DW_AT_address_class(0x16)
    6686              $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  129

    6687                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    6688                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    6689              
    6690              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6691                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    6692                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    6693              $C$DW$646       .dwtag  DW_TAG_member
    6694                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$25)
    6695                      .dwattr $C$DW$646, DW_AT_name("ADCRESULT")
    6696                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_ADCRESULT")
    6697                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6698                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6699              $C$DW$647       .dwtag  DW_TAG_member
    6700                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$26)
    6701                      .dwattr $C$DW$647, DW_AT_name("resvd_1")
    6702                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_resvd_1")
    6703                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6704                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6705              $C$DW$648       .dwtag  DW_TAG_member
    6706                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$24)
    6707                      .dwattr $C$DW$648, DW_AT_name("ADCCTL1")
    6708                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_ADCCTL1")
    6709                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6710                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    6711              $C$DW$649       .dwtag  DW_TAG_member
    6712                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$24)
    6713                      .dwattr $C$DW$649, DW_AT_name("ADCCTL2")
    6714                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_ADCCTL2")
    6715                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6716                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6717              $C$DW$650       .dwtag  DW_TAG_member
    6718                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$27)
    6719                      .dwattr $C$DW$650, DW_AT_name("rsvd_2")
    6720                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_rsvd_2")
    6721                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6722                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6723              $C$DW$651       .dwtag  DW_TAG_member
    6724                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$24)
    6725                      .dwattr $C$DW$651, DW_AT_name("ADCINTFLG")
    6726                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_ADCINTFLG")
    6727                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6728                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6729              $C$DW$652       .dwtag  DW_TAG_member
    6730                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$24)
    6731                      .dwattr $C$DW$652, DW_AT_name("ADCINTFLGCLR")
    6732                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6733                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6734                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6735              $C$DW$653       .dwtag  DW_TAG_member
    6736                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$24)
    6737                      .dwattr $C$DW$653, DW_AT_name("ADCINTOVF")
    6738                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_ADCINTOVF")
    6739                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6740                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6741              $C$DW$654       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  130

    6742                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$24)
    6743                      .dwattr $C$DW$654, DW_AT_name("ADCINTOVFCLR")
    6744                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6745                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6746                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6747              $C$DW$655       .dwtag  DW_TAG_member
    6748                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$28)
    6749                      .dwattr $C$DW$655, DW_AT_name("INTSELxNy")
    6750                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_INTSELxNy")
    6751                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6752                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6753              $C$DW$656       .dwtag  DW_TAG_member
    6754                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$29)
    6755                      .dwattr $C$DW$656, DW_AT_name("rsvd_3")
    6756                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_rsvd_3")
    6757                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6758                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6759              $C$DW$657       .dwtag  DW_TAG_member
    6760                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$24)
    6761                      .dwattr $C$DW$657, DW_AT_name("SOCPRICTRL")
    6762                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6763                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6764                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6765              $C$DW$658       .dwtag  DW_TAG_member
    6766                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$24)
    6767                      .dwattr $C$DW$658, DW_AT_name("rsvd_4")
    6768                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_rsvd_4")
    6769                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6770                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6771              $C$DW$659       .dwtag  DW_TAG_member
    6772                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$24)
    6773                      .dwattr $C$DW$659, DW_AT_name("ADCSAMPLEMODE")
    6774                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6775                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6776                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6777              $C$DW$660       .dwtag  DW_TAG_member
    6778                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$24)
    6779                      .dwattr $C$DW$660, DW_AT_name("rsvd_5")
    6780                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_rsvd_5")
    6781                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6782                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6783              $C$DW$661       .dwtag  DW_TAG_member
    6784                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$24)
    6785                      .dwattr $C$DW$661, DW_AT_name("ADCINTSOCSEL1")
    6786                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6787                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6788                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6789              $C$DW$662       .dwtag  DW_TAG_member
    6790                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$24)
    6791                      .dwattr $C$DW$662, DW_AT_name("ADCINTSOCSEL2")
    6792                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6793                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6794                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6795              $C$DW$663       .dwtag  DW_TAG_member
    6796                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  131

    6797                      .dwattr $C$DW$663, DW_AT_name("rsvd_6")
    6798                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_rsvd_6")
    6799                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6800                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6801              $C$DW$664       .dwtag  DW_TAG_member
    6802                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$24)
    6803                      .dwattr $C$DW$664, DW_AT_name("ADCSOCFLG1")
    6804                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6805                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6806                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6807              $C$DW$665       .dwtag  DW_TAG_member
    6808                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$24)
    6809                      .dwattr $C$DW$665, DW_AT_name("rsvd_7")
    6810                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_rsvd_7")
    6811                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6812                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6813              $C$DW$666       .dwtag  DW_TAG_member
    6814                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$24)
    6815                      .dwattr $C$DW$666, DW_AT_name("ADCSOCFRC1")
    6816                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6817                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6818                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6819              $C$DW$667       .dwtag  DW_TAG_member
    6820                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$24)
    6821                      .dwattr $C$DW$667, DW_AT_name("rsvd_8")
    6822                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_rsvd_8")
    6823                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6824                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6825              $C$DW$668       .dwtag  DW_TAG_member
    6826                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$24)
    6827                      .dwattr $C$DW$668, DW_AT_name("ADCSOCOVF1")
    6828                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6829                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6830                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6831              $C$DW$669       .dwtag  DW_TAG_member
    6832                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$24)
    6833                      .dwattr $C$DW$669, DW_AT_name("rsvd_9")
    6834                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_rsvd_9")
    6835                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6836                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6837              $C$DW$670       .dwtag  DW_TAG_member
    6838                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$24)
    6839                      .dwattr $C$DW$670, DW_AT_name("ADCSOCOVFCLR1")
    6840                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6841                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6842                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6843              $C$DW$671       .dwtag  DW_TAG_member
    6844                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$24)
    6845                      .dwattr $C$DW$671, DW_AT_name("rsvd_10")
    6846                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_rsvd_10")
    6847                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6848                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6849              $C$DW$672       .dwtag  DW_TAG_member
    6850                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$25)
    6851                      .dwattr $C$DW$672, DW_AT_name("ADCSOCxCTL")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  132

    6852                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6853                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6854                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6855              $C$DW$673       .dwtag  DW_TAG_member
    6856                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$25)
    6857                      .dwattr $C$DW$673, DW_AT_name("rsvd_11")
    6858                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_rsvd_11")
    6859                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6860                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6861              $C$DW$674       .dwtag  DW_TAG_member
    6862                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$24)
    6863                      .dwattr $C$DW$674, DW_AT_name("ADCREFTRIM")
    6864                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6865                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6866                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6867              $C$DW$675       .dwtag  DW_TAG_member
    6868                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$24)
    6869                      .dwattr $C$DW$675, DW_AT_name("ADCOFFTRIM")
    6870                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6871                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6872                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6873              $C$DW$676       .dwtag  DW_TAG_member
    6874                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$30)
    6875                      .dwattr $C$DW$676, DW_AT_name("resvd_12")
    6876                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_resvd_12")
    6877                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6878                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6879              $C$DW$677       .dwtag  DW_TAG_member
    6880                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$24)
    6881                      .dwattr $C$DW$677, DW_AT_name("ADCREV")
    6882                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_ADCREV")
    6883                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6884                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6885                      .dwendtag $C$DW$T$31
    6886              
    6887              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    6888                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$31)
    6889                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    6890              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6891                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    6892                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    6893              
    6894              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6895                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    6896                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    6897              $C$DW$678       .dwtag  DW_TAG_member
    6898                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$32)
    6899                      .dwattr $C$DW$678, DW_AT_name("alpha_sf")
    6900                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_alpha_sf")
    6901                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6902                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6903              $C$DW$679       .dwtag  DW_TAG_member
    6904                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$32)
    6905                      .dwattr $C$DW$679, DW_AT_name("beta_sf")
    6906                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_beta_sf")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  133

    6907                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6908                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6909              $C$DW$680       .dwtag  DW_TAG_member
    6910                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$33)
    6911                      .dwattr $C$DW$680, DW_AT_name("numSensors")
    6912                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_numSensors")
    6913                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6914                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6915                      .dwendtag $C$DW$T$34
    6916              
    6917              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6918                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    6919                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    6920              $C$DW$T$176     .dwtag  DW_TAG_pointer_type
    6921                      .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$45)
    6922                      .dwattr $C$DW$T$176, DW_AT_address_class(0x16)
    6923              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    6924                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    6925                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    6926              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6927                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    6928                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    6929              
    6930              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6931                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    6932                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    6933              $C$DW$681       .dwtag  DW_TAG_member
    6934                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$24)
    6935                      .dwattr $C$DW$681, DW_AT_name("XCLK")
    6936                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_XCLK")
    6937                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6938                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6939              $C$DW$682       .dwtag  DW_TAG_member
    6940                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$24)
    6941                      .dwattr $C$DW$682, DW_AT_name("rsvd_1")
    6942                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_rsvd_1")
    6943                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6944                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6945              $C$DW$683       .dwtag  DW_TAG_member
    6946                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$24)
    6947                      .dwattr $C$DW$683, DW_AT_name("CLKCTL")
    6948                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_CLKCTL")
    6949                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6950                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6951              $C$DW$684       .dwtag  DW_TAG_member
    6952                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$35)
    6953                      .dwattr $C$DW$684, DW_AT_name("rsvd_2")
    6954                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_rsvd_2")
    6955                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6956                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6957              $C$DW$685       .dwtag  DW_TAG_member
    6958                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$24)
    6959                      .dwattr $C$DW$685, DW_AT_name("LOSPCP")
    6960                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_LOSPCP")
    6961                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  134

    6962                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6963              $C$DW$686       .dwtag  DW_TAG_member
    6964                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$24)
    6965                      .dwattr $C$DW$686, DW_AT_name("PCLKCR0")
    6966                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_PCLKCR0")
    6967                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6968                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6969              $C$DW$687       .dwtag  DW_TAG_member
    6970                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$24)
    6971                      .dwattr $C$DW$687, DW_AT_name("PCLKCR1")
    6972                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_PCLKCR1")
    6973                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6974                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6975              $C$DW$688       .dwtag  DW_TAG_member
    6976                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$27)
    6977                      .dwattr $C$DW$688, DW_AT_name("rsvd_3")
    6978                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_rsvd_3")
    6979                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6980                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6981              $C$DW$689       .dwtag  DW_TAG_member
    6982                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$24)
    6983                      .dwattr $C$DW$689, DW_AT_name("PCLKCR3")
    6984                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_PCLKCR3")
    6985                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6986                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6987                      .dwendtag $C$DW$T$36
    6988              
    6989              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    6990                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$36)
    6991                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    6992              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6993                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    6994                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    6995              
    6996              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6997                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    6998                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    6999              $C$DW$690       .dwtag  DW_TAG_member
    7000                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$33)
    7001                      .dwattr $C$DW$690, DW_AT_name("tmp")
    7002                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_tmp")
    7003                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7004                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7005                      .dwendtag $C$DW$T$37
    7006              
    7007              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    7008                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$37)
    7009                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
    7010              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    7011                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    7012                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    7013              
    7014              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    7015                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    7016                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  135

    7017              $C$DW$691       .dwtag  DW_TAG_member
    7018                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$38)
    7019                      .dwattr $C$DW$691, DW_AT_name("version")
    7020                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_version")
    7021                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7022                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7023              $C$DW$692       .dwtag  DW_TAG_member
    7024                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$40)
    7025                      .dwattr $C$DW$692, DW_AT_name("state")
    7026                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_state")
    7027                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7028                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7029              $C$DW$693       .dwtag  DW_TAG_member
    7030                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$40)
    7031                      .dwattr $C$DW$693, DW_AT_name("prevState")
    7032                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_prevState")
    7033                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7034                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7035              $C$DW$694       .dwtag  DW_TAG_member
    7036                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$42)
    7037                      .dwattr $C$DW$694, DW_AT_name("errorCode")
    7038                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_errorCode")
    7039                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7040                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7041              $C$DW$695       .dwtag  DW_TAG_member
    7042                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$44)
    7043                      .dwattr $C$DW$695, DW_AT_name("clarkeHandle_I")
    7044                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_clarkeHandle_I")
    7045                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7046                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7047              $C$DW$696       .dwtag  DW_TAG_member
    7048                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$45)
    7049                      .dwattr $C$DW$696, DW_AT_name("clarke_I")
    7050                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_clarke_I")
    7051                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7052                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7053              $C$DW$697       .dwtag  DW_TAG_member
    7054                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$44)
    7055                      .dwattr $C$DW$697, DW_AT_name("clarkeHandle_V")
    7056                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7057                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7058                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7059              $C$DW$698       .dwtag  DW_TAG_member
    7060                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$45)
    7061                      .dwattr $C$DW$698, DW_AT_name("clarke_V")
    7062                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_clarke_V")
    7063                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7064                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7065              $C$DW$699       .dwtag  DW_TAG_member
    7066                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$47)
    7067                      .dwattr $C$DW$699, DW_AT_name("estHandle")
    7068                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_estHandle")
    7069                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7070                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7071              $C$DW$700       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  136

    7072                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$49)
    7073                      .dwattr $C$DW$700, DW_AT_name("parkHandle")
    7074                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_parkHandle")
    7075                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7076                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7077              $C$DW$701       .dwtag  DW_TAG_member
    7078                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$50)
    7079                      .dwattr $C$DW$701, DW_AT_name("park")
    7080                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_park")
    7081                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7082                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7083              $C$DW$702       .dwtag  DW_TAG_member
    7084                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$52)
    7085                      .dwattr $C$DW$702, DW_AT_name("pidHandle_Id")
    7086                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_pidHandle_Id")
    7087                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7088                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7089              $C$DW$703       .dwtag  DW_TAG_member
    7090                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$53)
    7091                      .dwattr $C$DW$703, DW_AT_name("pid_Id")
    7092                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_pid_Id")
    7093                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7094                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7095              $C$DW$704       .dwtag  DW_TAG_member
    7096                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$52)
    7097                      .dwattr $C$DW$704, DW_AT_name("pidHandle_Iq")
    7098                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7099                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7100                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7101              $C$DW$705       .dwtag  DW_TAG_member
    7102                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$53)
    7103                      .dwattr $C$DW$705, DW_AT_name("pid_Iq")
    7104                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_pid_Iq")
    7105                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7106                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7107              $C$DW$706       .dwtag  DW_TAG_member
    7108                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$52)
    7109                      .dwattr $C$DW$706, DW_AT_name("pidHandle_spd")
    7110                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_pidHandle_spd")
    7111                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7112                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7113              $C$DW$707       .dwtag  DW_TAG_member
    7114                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$53)
    7115                      .dwattr $C$DW$707, DW_AT_name("pid_spd")
    7116                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_pid_spd")
    7117                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7118                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7119              $C$DW$708       .dwtag  DW_TAG_member
    7120                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$55)
    7121                      .dwattr $C$DW$708, DW_AT_name("iparkHandle")
    7122                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_iparkHandle")
    7123                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7124                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7125              $C$DW$709       .dwtag  DW_TAG_member
    7126                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  137

    7127                      .dwattr $C$DW$709, DW_AT_name("ipark")
    7128                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_ipark")
    7129                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7130                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7131              $C$DW$710       .dwtag  DW_TAG_member
    7132                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$58)
    7133                      .dwattr $C$DW$710, DW_AT_name("svgenHandle")
    7134                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_svgenHandle")
    7135                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7136                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7137              $C$DW$711       .dwtag  DW_TAG_member
    7138                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$59)
    7139                      .dwattr $C$DW$711, DW_AT_name("svgen")
    7140                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_svgen")
    7141                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7142                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7143              $C$DW$712       .dwtag  DW_TAG_member
    7144                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$61)
    7145                      .dwattr $C$DW$712, DW_AT_name("trajHandle_Id")
    7146                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_trajHandle_Id")
    7147                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7148                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7149              $C$DW$713       .dwtag  DW_TAG_member
    7150                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$62)
    7151                      .dwattr $C$DW$713, DW_AT_name("traj_Id")
    7152                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_traj_Id")
    7153                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7154                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7155              $C$DW$714       .dwtag  DW_TAG_member
    7156                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$61)
    7157                      .dwattr $C$DW$714, DW_AT_name("trajHandle_spd")
    7158                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_trajHandle_spd")
    7159                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7160                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7161              $C$DW$715       .dwtag  DW_TAG_member
    7162                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$62)
    7163                      .dwattr $C$DW$715, DW_AT_name("traj_spd")
    7164                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_traj_spd")
    7165                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7166                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7167              $C$DW$716       .dwtag  DW_TAG_member
    7168                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$61)
    7169                      .dwattr $C$DW$716, DW_AT_name("trajHandle_spdMax")
    7170                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7171                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7172                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7173              $C$DW$717       .dwtag  DW_TAG_member
    7174                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$62)
    7175                      .dwattr $C$DW$717, DW_AT_name("traj_spdMax")
    7176                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_traj_spdMax")
    7177                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7178                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7179              $C$DW$718       .dwtag  DW_TAG_member
    7180                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$63)
    7181                      .dwattr $C$DW$718, DW_AT_name("motorParams")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  138

    7182                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_motorParams")
    7183                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7184                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7185              $C$DW$719       .dwtag  DW_TAG_member
    7186                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$66)
    7187                      .dwattr $C$DW$719, DW_AT_name("waitTimes")
    7188                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_waitTimes")
    7189                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7190                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7191              $C$DW$720       .dwtag  DW_TAG_member
    7192                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$65)
    7193                      .dwattr $C$DW$720, DW_AT_name("counter_state")
    7194                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_counter_state")
    7195                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7196                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7197              $C$DW$721       .dwtag  DW_TAG_member
    7198                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$67)
    7199                      .dwattr $C$DW$721, DW_AT_name("numIsrTicksPerCtrlTick")
    7200                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7201                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7202                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7203              $C$DW$722       .dwtag  DW_TAG_member
    7204                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$67)
    7205                      .dwattr $C$DW$722, DW_AT_name("numCtrlTicksPerCurrentTick")
    7206                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7207                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7208                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7209              $C$DW$723       .dwtag  DW_TAG_member
    7210                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$67)
    7211                      .dwattr $C$DW$723, DW_AT_name("numCtrlTicksPerSpeedTick")
    7212                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7213                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7214                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7215              $C$DW$724       .dwtag  DW_TAG_member
    7216                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$67)
    7217                      .dwattr $C$DW$724, DW_AT_name("numCtrlTicksPerTrajTick")
    7218                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7219                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7220                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7221              $C$DW$725       .dwtag  DW_TAG_member
    7222                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$65)
    7223                      .dwattr $C$DW$725, DW_AT_name("ctrlFreq_Hz")
    7224                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7225                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7226                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7227              $C$DW$726       .dwtag  DW_TAG_member
    7228                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$65)
    7229                      .dwattr $C$DW$726, DW_AT_name("trajFreq_Hz")
    7230                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7231                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7232                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7233              $C$DW$727       .dwtag  DW_TAG_member
    7234                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$32)
    7235                      .dwattr $C$DW$727, DW_AT_name("trajPeriod_sec")
    7236                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_trajPeriod_sec")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  139

    7237                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7238                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7239              $C$DW$728       .dwtag  DW_TAG_member
    7240                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$68)
    7241                      .dwattr $C$DW$728, DW_AT_name("ctrlPeriod_sec")
    7242                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7243                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7244                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7245              $C$DW$729       .dwtag  DW_TAG_member
    7246                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$32)
    7247                      .dwattr $C$DW$729, DW_AT_name("maxVsMag_pu")
    7248                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7249                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7250                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7251              $C$DW$730       .dwtag  DW_TAG_member
    7252                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$69)
    7253                      .dwattr $C$DW$730, DW_AT_name("Iab_in")
    7254                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_Iab_in")
    7255                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7256                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7257              $C$DW$731       .dwtag  DW_TAG_member
    7258                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$69)
    7259                      .dwattr $C$DW$731, DW_AT_name("Iab_filt")
    7260                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_Iab_filt")
    7261                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7262                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7263              $C$DW$732       .dwtag  DW_TAG_member
    7264                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$69)
    7265                      .dwattr $C$DW$732, DW_AT_name("Idq_in")
    7266                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_Idq_in")
    7267                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7268                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7269              $C$DW$733       .dwtag  DW_TAG_member
    7270                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$69)
    7271                      .dwattr $C$DW$733, DW_AT_name("Vab_in")
    7272                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_Vab_in")
    7273                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7274                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7275              $C$DW$734       .dwtag  DW_TAG_member
    7276                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$32)
    7277                      .dwattr $C$DW$734, DW_AT_name("spd_out")
    7278                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_spd_out")
    7279                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7280                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7281              $C$DW$735       .dwtag  DW_TAG_member
    7282                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$69)
    7283                      .dwattr $C$DW$735, DW_AT_name("Vab_out")
    7284                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_Vab_out")
    7285                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7286                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7287              $C$DW$736       .dwtag  DW_TAG_member
    7288                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$69)
    7289                      .dwattr $C$DW$736, DW_AT_name("Vdq_out")
    7290                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_Vdq_out")
    7291                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  140

    7292                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7293              $C$DW$737       .dwtag  DW_TAG_member
    7294                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$68)
    7295                      .dwattr $C$DW$737, DW_AT_name("Rhf")
    7296                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_Rhf")
    7297                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7298                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7299              $C$DW$738       .dwtag  DW_TAG_member
    7300                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$68)
    7301                      .dwattr $C$DW$738, DW_AT_name("Lhf")
    7302                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_Lhf")
    7303                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7304                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7305              $C$DW$739       .dwtag  DW_TAG_member
    7306                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$68)
    7307                      .dwattr $C$DW$739, DW_AT_name("RoverL")
    7308                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_RoverL")
    7309                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7310                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7311              $C$DW$740       .dwtag  DW_TAG_member
    7312                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$32)
    7313                      .dwattr $C$DW$740, DW_AT_name("Kp_Id")
    7314                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_Kp_Id")
    7315                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7316                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7317              $C$DW$741       .dwtag  DW_TAG_member
    7318                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$32)
    7319                      .dwattr $C$DW$741, DW_AT_name("Kp_Iq")
    7320                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_Kp_Iq")
    7321                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7322                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7323              $C$DW$742       .dwtag  DW_TAG_member
    7324                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$32)
    7325                      .dwattr $C$DW$742, DW_AT_name("Kp_spd")
    7326                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_Kp_spd")
    7327                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7328                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7329              $C$DW$743       .dwtag  DW_TAG_member
    7330                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$32)
    7331                      .dwattr $C$DW$743, DW_AT_name("Ki_Id")
    7332                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_Ki_Id")
    7333                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7334                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7335              $C$DW$744       .dwtag  DW_TAG_member
    7336                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$32)
    7337                      .dwattr $C$DW$744, DW_AT_name("Ki_Iq")
    7338                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_Ki_Iq")
    7339                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7340                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7341              $C$DW$745       .dwtag  DW_TAG_member
    7342                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$32)
    7343                      .dwattr $C$DW$745, DW_AT_name("Ki_spd")
    7344                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Ki_spd")
    7345                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7346                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  141

    7347              $C$DW$746       .dwtag  DW_TAG_member
    7348                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$32)
    7349                      .dwattr $C$DW$746, DW_AT_name("Kd_Id")
    7350                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_Kd_Id")
    7351                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7352                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7353              $C$DW$747       .dwtag  DW_TAG_member
    7354                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$32)
    7355                      .dwattr $C$DW$747, DW_AT_name("Kd_Iq")
    7356                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_Kd_Iq")
    7357                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7358                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7359              $C$DW$748       .dwtag  DW_TAG_member
    7360                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$32)
    7361                      .dwattr $C$DW$748, DW_AT_name("Kd_spd")
    7362                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_Kd_spd")
    7363                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7364                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7365              $C$DW$749       .dwtag  DW_TAG_member
    7366                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$32)
    7367                      .dwattr $C$DW$749, DW_AT_name("Ui_Id")
    7368                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_Ui_Id")
    7369                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7370                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7371              $C$DW$750       .dwtag  DW_TAG_member
    7372                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$32)
    7373                      .dwattr $C$DW$750, DW_AT_name("Ui_Iq")
    7374                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_Ui_Iq")
    7375                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7376                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7377              $C$DW$751       .dwtag  DW_TAG_member
    7378                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$32)
    7379                      .dwattr $C$DW$751, DW_AT_name("Ui_spd")
    7380                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_Ui_spd")
    7381                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7382                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7383              $C$DW$752       .dwtag  DW_TAG_member
    7384                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$69)
    7385                      .dwattr $C$DW$752, DW_AT_name("Idq_ref")
    7386                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_Idq_ref")
    7387                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7388                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7389              $C$DW$753       .dwtag  DW_TAG_member
    7390                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$32)
    7391                      .dwattr $C$DW$753, DW_AT_name("IdRated")
    7392                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_IdRated")
    7393                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7394                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7395              $C$DW$754       .dwtag  DW_TAG_member
    7396                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$32)
    7397                      .dwattr $C$DW$754, DW_AT_name("spd_ref")
    7398                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_spd_ref")
    7399                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7400                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7401              $C$DW$755       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  142

    7402                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$32)
    7403                      .dwattr $C$DW$755, DW_AT_name("spd_max")
    7404                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_spd_max")
    7405                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7406                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7407              $C$DW$756       .dwtag  DW_TAG_member
    7408                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$67)
    7409                      .dwattr $C$DW$756, DW_AT_name("counter_current")
    7410                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_counter_current")
    7411                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7412                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7413              $C$DW$757       .dwtag  DW_TAG_member
    7414                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$67)
    7415                      .dwattr $C$DW$757, DW_AT_name("counter_isr")
    7416                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_counter_isr")
    7417                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7418                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7419              $C$DW$758       .dwtag  DW_TAG_member
    7420                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$67)
    7421                      .dwattr $C$DW$758, DW_AT_name("counter_speed")
    7422                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_counter_speed")
    7423                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7424                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7425              $C$DW$759       .dwtag  DW_TAG_member
    7426                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$67)
    7427                      .dwattr $C$DW$759, DW_AT_name("counter_traj")
    7428                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_counter_traj")
    7429                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7430                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7431              $C$DW$760       .dwtag  DW_TAG_member
    7432                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$70)
    7433                      .dwattr $C$DW$760, DW_AT_name("flag_enableCtrl")
    7434                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7435                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7436                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7437              $C$DW$761       .dwtag  DW_TAG_member
    7438                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$70)
    7439                      .dwattr $C$DW$761, DW_AT_name("flag_enableDcBusComp")
    7440                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7441                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7442                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7443              $C$DW$762       .dwtag  DW_TAG_member
    7444                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$70)
    7445                      .dwattr $C$DW$762, DW_AT_name("flag_enablePowerWarp")
    7446                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7447                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7448                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7449              $C$DW$763       .dwtag  DW_TAG_member
    7450                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$70)
    7451                      .dwattr $C$DW$763, DW_AT_name("flag_enableOffset")
    7452                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_flag_enableOffset")
    7453                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7454                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7455              $C$DW$764       .dwtag  DW_TAG_member
    7456                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  143

    7457                      .dwattr $C$DW$764, DW_AT_name("flag_enableSpeedCtrl")
    7458                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7459                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7460                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7461              $C$DW$765       .dwtag  DW_TAG_member
    7462                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$70)
    7463                      .dwattr $C$DW$765, DW_AT_name("flag_enableUserMotorParams")
    7464                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7465                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7466                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7467              $C$DW$766       .dwtag  DW_TAG_member
    7468                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$69)
    7469                      .dwattr $C$DW$766, DW_AT_name("Idq_offset_pu")
    7470                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7471                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7472                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7473              $C$DW$767       .dwtag  DW_TAG_member
    7474                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$69)
    7475                      .dwattr $C$DW$767, DW_AT_name("Vdq_offset_pu")
    7476                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7477                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7478                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7479              $C$DW$768       .dwtag  DW_TAG_member
    7480                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$32)
    7481                      .dwattr $C$DW$768, DW_AT_name("angle_pu")
    7482                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_angle_pu")
    7483                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7484                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7485              $C$DW$769       .dwtag  DW_TAG_member
    7486                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$32)
    7487                      .dwattr $C$DW$769, DW_AT_name("speed_ref_pu")
    7488                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_speed_ref_pu")
    7489                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7490                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7491              $C$DW$770       .dwtag  DW_TAG_member
    7492                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$32)
    7493                      .dwattr $C$DW$770, DW_AT_name("speed_fb_pu")
    7494                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_speed_fb_pu")
    7495                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7496                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7497              $C$DW$771       .dwtag  DW_TAG_member
    7498                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$32)
    7499                      .dwattr $C$DW$771, DW_AT_name("speed_outMax_pu")
    7500                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7501                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7502                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7503              $C$DW$772       .dwtag  DW_TAG_member
    7504                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$70)
    7505                      .dwattr $C$DW$772, DW_AT_name("flag_enableCurrentCtrl")
    7506                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7507                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7508                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7509                      .dwendtag $C$DW$T$71
    7510              
    7511              $C$DW$T$177     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  144

    7512                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$71)
    7513                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    7514              $C$DW$T$163     .dwtag  DW_TAG_pointer_type
    7515                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$71)
    7516                      .dwattr $C$DW$T$163, DW_AT_address_class(0x16)
    7517              $C$DW$T$164     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7518                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$163)
    7519                      .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
    7520              $C$DW$773       .dwtag  DW_TAG_TI_far_type
    7521                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$164)
    7522              $C$DW$T$178     .dwtag  DW_TAG_const_type
    7523                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$773)
    7524              
    7525              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    7526                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    7527                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    7528              $C$DW$774       .dwtag  DW_TAG_member
    7529                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$23)
    7530                      .dwattr $C$DW$774, DW_AT_name("rsvd")
    7531                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_rsvd")
    7532                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7533                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7534              $C$DW$775       .dwtag  DW_TAG_member
    7535                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$73)
    7536                      .dwattr $C$DW$775, DW_AT_name("targetProc")
    7537                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_targetProc")
    7538                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7539                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7540              $C$DW$776       .dwtag  DW_TAG_member
    7541                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$23)
    7542                      .dwattr $C$DW$776, DW_AT_name("major")
    7543                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_major")
    7544                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7545                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7546              $C$DW$777       .dwtag  DW_TAG_member
    7547                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$23)
    7548                      .dwattr $C$DW$777, DW_AT_name("minor")
    7549                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_minor")
    7550                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7551                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7552                      .dwendtag $C$DW$T$74
    7553              
    7554              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7555                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    7556                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7557              
    7558              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7559                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    7560                      .dwattr $C$DW$T$20, DW_AT_declaration
    7561                      .dwendtag $C$DW$T$20
    7562              
    7563              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7564                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
    7565                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    7566              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  145

    7567                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    7568                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7569              
    7570              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    7571                      .dwattr $C$DW$T$75, DW_AT_name("_FILTER_FO_")
    7572                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x0a)
    7573              $C$DW$778       .dwtag  DW_TAG_member
    7574                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$32)
    7575                      .dwattr $C$DW$778, DW_AT_name("a1")
    7576                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_a1")
    7577                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7578                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7579              $C$DW$779       .dwtag  DW_TAG_member
    7580                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$32)
    7581                      .dwattr $C$DW$779, DW_AT_name("b0")
    7582                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_b0")
    7583                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7584                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7585              $C$DW$780       .dwtag  DW_TAG_member
    7586                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$32)
    7587                      .dwattr $C$DW$780, DW_AT_name("b1")
    7588                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_b1")
    7589                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7590                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7591              $C$DW$781       .dwtag  DW_TAG_member
    7592                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$32)
    7593                      .dwattr $C$DW$781, DW_AT_name("x1")
    7594                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_x1")
    7595                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7596                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7597              $C$DW$782       .dwtag  DW_TAG_member
    7598                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$32)
    7599                      .dwattr $C$DW$782, DW_AT_name("y1")
    7600                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_y1")
    7601                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7602                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7603                      .dwendtag $C$DW$T$75
    7604              
    7605              $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7606                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$75)
    7607                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    7608              $C$DW$T$180     .dwtag  DW_TAG_pointer_type
    7609                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$129)
    7610                      .dwattr $C$DW$T$180, DW_AT_address_class(0x16)
    7611              
    7612              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    7613                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    7614                      .dwattr $C$DW$T$21, DW_AT_declaration
    7615                      .dwendtag $C$DW$T$21
    7616              
    7617              $C$DW$T$130     .dwtag  DW_TAG_pointer_type
    7618                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$21)
    7619                      .dwattr $C$DW$T$130, DW_AT_address_class(0x16)
    7620              $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7621                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$130)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  146

    7622                      .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    7623              
    7624              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    7625                      .dwattr $C$DW$T$76, DW_AT_name("_FLASH_Obj_")
    7626                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    7627              $C$DW$783       .dwtag  DW_TAG_member
    7628                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$24)
    7629                      .dwattr $C$DW$783, DW_AT_name("FOPT")
    7630                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_FOPT")
    7631                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7632                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7633              $C$DW$784       .dwtag  DW_TAG_member
    7634                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$24)
    7635                      .dwattr $C$DW$784, DW_AT_name("rsvd_1")
    7636                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_rsvd_1")
    7637                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7638                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7639              $C$DW$785       .dwtag  DW_TAG_member
    7640                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$24)
    7641                      .dwattr $C$DW$785, DW_AT_name("FPWR")
    7642                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_FPWR")
    7643                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7644                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7645              $C$DW$786       .dwtag  DW_TAG_member
    7646                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$24)
    7647                      .dwattr $C$DW$786, DW_AT_name("FSTATUS")
    7648                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_FSTATUS")
    7649                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7650                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7651              $C$DW$787       .dwtag  DW_TAG_member
    7652                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$24)
    7653                      .dwattr $C$DW$787, DW_AT_name("FSTDBYWAIT")
    7654                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7655                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7656                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7657              $C$DW$788       .dwtag  DW_TAG_member
    7658                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$24)
    7659                      .dwattr $C$DW$788, DW_AT_name("FACTIVEWAIT")
    7660                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    7661                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7662                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7663              $C$DW$789       .dwtag  DW_TAG_member
    7664                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$24)
    7665                      .dwattr $C$DW$789, DW_AT_name("FBANKWAIT")
    7666                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_FBANKWAIT")
    7667                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7668                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7669              $C$DW$790       .dwtag  DW_TAG_member
    7670                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$24)
    7671                      .dwattr $C$DW$790, DW_AT_name("FOTPWAIT")
    7672                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_FOTPWAIT")
    7673                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7674                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7675                      .dwendtag $C$DW$T$76
    7676              
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  147

    7677              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    7678                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$76)
    7679                      .dwattr $C$DW$T$89, DW_AT_address_class(0x16)
    7680              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    7681                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    7682                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    7683              
    7684              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    7685                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
    7686                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
    7687              $C$DW$791       .dwtag  DW_TAG_member
    7688                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$77)
    7689                      .dwattr $C$DW$791, DW_AT_name("GPACTRL")
    7690                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_GPACTRL")
    7691                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7692                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7693              $C$DW$792       .dwtag  DW_TAG_member
    7694                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$77)
    7695                      .dwattr $C$DW$792, DW_AT_name("GPAQSEL1")
    7696                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_GPAQSEL1")
    7697                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7698                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7699              $C$DW$793       .dwtag  DW_TAG_member
    7700                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$77)
    7701                      .dwattr $C$DW$793, DW_AT_name("GPAQSEL2")
    7702                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_GPAQSEL2")
    7703                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7704                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7705              $C$DW$794       .dwtag  DW_TAG_member
    7706                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$77)
    7707                      .dwattr $C$DW$794, DW_AT_name("GPAMUX1")
    7708                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_GPAMUX1")
    7709                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7710                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7711              $C$DW$795       .dwtag  DW_TAG_member
    7712                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$77)
    7713                      .dwattr $C$DW$795, DW_AT_name("GPAMUX2")
    7714                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_GPAMUX2")
    7715                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7716                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7717              $C$DW$796       .dwtag  DW_TAG_member
    7718                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$77)
    7719                      .dwattr $C$DW$796, DW_AT_name("GPADIR")
    7720                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_GPADIR")
    7721                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7722                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7723              $C$DW$797       .dwtag  DW_TAG_member
    7724                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$77)
    7725                      .dwattr $C$DW$797, DW_AT_name("GPAPUD")
    7726                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_GPAPUD")
    7727                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7728                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7729              $C$DW$798       .dwtag  DW_TAG_member
    7730                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$27)
    7731                      .dwattr $C$DW$798, DW_AT_name("rsvd_1")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  148

    7732                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_rsvd_1")
    7733                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7734                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7735              $C$DW$799       .dwtag  DW_TAG_member
    7736                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$77)
    7737                      .dwattr $C$DW$799, DW_AT_name("GPBCTRL")
    7738                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_GPBCTRL")
    7739                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7740                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7741              $C$DW$800       .dwtag  DW_TAG_member
    7742                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$77)
    7743                      .dwattr $C$DW$800, DW_AT_name("GPBQSEL1")
    7744                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_GPBQSEL1")
    7745                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7746                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7747              $C$DW$801       .dwtag  DW_TAG_member
    7748                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$27)
    7749                      .dwattr $C$DW$801, DW_AT_name("rsvd_2")
    7750                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_rsvd_2")
    7751                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7752                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7753              $C$DW$802       .dwtag  DW_TAG_member
    7754                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$77)
    7755                      .dwattr $C$DW$802, DW_AT_name("GPBMUX1")
    7756                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_GPBMUX1")
    7757                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7758                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7759              $C$DW$803       .dwtag  DW_TAG_member
    7760                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$27)
    7761                      .dwattr $C$DW$803, DW_AT_name("rsvd_3")
    7762                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_rsvd_3")
    7763                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7764                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7765              $C$DW$804       .dwtag  DW_TAG_member
    7766                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$77)
    7767                      .dwattr $C$DW$804, DW_AT_name("GPBDIR")
    7768                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_GPBDIR")
    7769                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7770                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7771              $C$DW$805       .dwtag  DW_TAG_member
    7772                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$77)
    7773                      .dwattr $C$DW$805, DW_AT_name("GPBPUD")
    7774                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_GPBPUD")
    7775                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7776                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7777              $C$DW$806       .dwtag  DW_TAG_member
    7778                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$78)
    7779                      .dwattr $C$DW$806, DW_AT_name("rsvd_4")
    7780                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_rsvd_4")
    7781                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7782                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7783              $C$DW$807       .dwtag  DW_TAG_member
    7784                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$77)
    7785                      .dwattr $C$DW$807, DW_AT_name("AIOMUX1")
    7786                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_AIOMUX1")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:35 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0599210                              PAGE  149

    7787                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7788                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7789              $C$DW$808       .dwtag  DW_TAG_member
    7790                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$27)
    7791                      .dwattr $C$DW$808, DW_AT_name("rsvd_5")
    7792                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_rsvd_5")
    7793                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7794                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7795              $C$DW$809       .dwtag  DW_TAG_member
    7796                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$77)
    7797                      .dwattr $C$DW$809, DW_AT_name("AIODIR")
    7798                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_AIODIR")
    7799                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    7800                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7801              $C$DW$810       .dwtag  DW_TAG_member
    7802                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$79)
    7803                      .dwattr $C$DW$810, DW_AT_name("rsvd_6")
    7804                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_rsvd_6")
    7805                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7806                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7807              $C$DW$811       .dwtag  DW_TAG_member
    7808                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$77)
    7809                      .dwattr $C$DW$811, DW_AT_name("GPADAT")
    7810                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_GPADAT")
    7811                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7812                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7813              $C$DW$812       .dwtag  DW_TAG_member
    7814                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$77)
    7815                      .dwattr $C$DW$812, DW_AT_name("GPASET")
    7816                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_GPASET")
    7817                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    7818                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7819              $C$DW$813       .dwtag  DW_TAG_member
    7820                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$77)
    7821                      .dwattr $C$DW$813, DW_AT_name("GPACLEAR")
    7822                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_GPACLEAR")
    7823                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7824                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7825              $C$DW$814       .dwtag  DW_TAG_member
    7826                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$77)
    7827                      .dwattr $C$DW$814, DW_AT_name("GPATOGGLE")
    7828                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_GPATOGGLE")
    7829                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7830                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7831              $C$DW$815       .dwtag  DW_TAG_member
    7832                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$77)
    7833                      .dwattr $C$DW$815, DW_AT_name("GPBDAT")
    7834                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_GPBDAT")
