TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jul 11 20:15:36 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("TIMER_setDecimationFactor")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_TIMER_setDecimationFactor")

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  174

    9029                      .dwattr $C$DW$T$285, DW_AT_type(*$C$DW$T$284)
    9030                      .dwattr $C$DW$T$285, DW_AT_language(DW_LANG_C)
    9031              $C$DW$1594      .dwtag  DW_TAG_TI_far_type
    9032                      .dwattr $C$DW$1594, DW_AT_type(*$C$DW$T$285)
    9033              $C$DW$T$286     .dwtag  DW_TAG_const_type
    9034                      .dwattr $C$DW$T$286, DW_AT_type(*$C$DW$1594)
    9035              
    9036              $C$DW$T$287     .dwtag  DW_TAG_enumeration_type
    9037                      .dwattr $C$DW$T$287, DW_AT_byte_size(0x01)
    9038              $C$DW$1595      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputRisingEdge_InputFallingEdge"), D
    9039              $C$DW$1596      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputFallingEdge_InputRisingEdge"), D
    9040                      .dwendtag $C$DW$T$287
    9041              
    9042              $C$DW$T$288     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity_e")
    9043                      .dwattr $C$DW$T$288, DW_AT_type(*$C$DW$T$287)
    9044                      .dwattr $C$DW$T$288, DW_AT_language(DW_LANG_C)
    9045              $C$DW$1597      .dwtag  DW_TAG_TI_far_type
    9046                      .dwattr $C$DW$1597, DW_AT_type(*$C$DW$T$288)
    9047              $C$DW$T$289     .dwtag  DW_TAG_const_type
    9048                      .dwattr $C$DW$T$289, DW_AT_type(*$C$DW$1597)
    9049              
    9050              $C$DW$T$290     .dwtag  DW_TAG_enumeration_type
    9051                      .dwattr $C$DW$T$290, DW_AT_byte_size(0x01)
    9052              $C$DW$1598      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Slave"), DW_AT_const_value(0x00)
    9053              $C$DW$1599      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Master"), DW_AT_const_value(0x04)
    9054                      .dwendtag $C$DW$T$290
    9055              
    9056              $C$DW$T$291     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
    9057                      .dwattr $C$DW$T$291, DW_AT_type(*$C$DW$T$290)
    9058                      .dwattr $C$DW$T$291, DW_AT_language(DW_LANG_C)
    9059              $C$DW$1600      .dwtag  DW_TAG_TI_far_type
    9060                      .dwattr $C$DW$1600, DW_AT_type(*$C$DW$T$291)
    9061              $C$DW$T$292     .dwtag  DW_TAG_const_type
    9062                      .dwattr $C$DW$T$292, DW_AT_type(*$C$DW$1600)
    9063              
    9064              $C$DW$T$293     .dwtag  DW_TAG_enumeration_type
    9065                      .dwattr $C$DW$T$293, DW_AT_byte_size(0x01)
    9066              $C$DW$1601      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
    9067              $C$DW$1602      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
    9068              $C$DW$1603      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
    9069                      .dwendtag $C$DW$T$293
    9070              
    9071              $C$DW$T$294     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
    9072                      .dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$293)
    9073                      .dwattr $C$DW$T$294, DW_AT_language(DW_LANG_C)
    9074              $C$DW$1604      .dwtag  DW_TAG_TI_far_type
    9075                      .dwattr $C$DW$1604, DW_AT_type(*$C$DW$T$294)
    9076              $C$DW$T$295     .dwtag  DW_TAG_const_type
    9077                      .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$1604)
    9078              
    9079              $C$DW$T$296     .dwtag  DW_TAG_enumeration_type
    9080                      .dwattr $C$DW$T$296, DW_AT_byte_size(0x01)
    9081              $C$DW$1605      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    9082              $C$DW$1606      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    9083                      .dwendtag $C$DW$T$296
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  175

    9084              
    9085              $C$DW$T$297     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    9086                      .dwattr $C$DW$T$297, DW_AT_type(*$C$DW$T$296)
    9087                      .dwattr $C$DW$T$297, DW_AT_language(DW_LANG_C)
    9088              
    9089              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9090                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    9091                      .dwattr $C$DW$T$19, DW_AT_declaration
    9092                      .dwendtag $C$DW$T$19
    9093              
    9094              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9095                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
    9096                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
    9097              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    9098                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    9099                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    9100              
    9101              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    9102                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    9103                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    9104              $C$DW$1607      .dwtag  DW_TAG_member
    9105                      .dwattr $C$DW$1607, DW_AT_type(*$C$DW$T$24)
    9106                      .dwattr $C$DW$1607, DW_AT_name("ADCRESULT")
    9107                      .dwattr $C$DW$1607, DW_AT_TI_symbol_name("_ADCRESULT")
    9108                      .dwattr $C$DW$1607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9109                      .dwattr $C$DW$1607, DW_AT_accessibility(DW_ACCESS_public)
    9110              $C$DW$1608      .dwtag  DW_TAG_member
    9111                      .dwattr $C$DW$1608, DW_AT_type(*$C$DW$T$25)
    9112                      .dwattr $C$DW$1608, DW_AT_name("resvd_1")
    9113                      .dwattr $C$DW$1608, DW_AT_TI_symbol_name("_resvd_1")
    9114                      .dwattr $C$DW$1608, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9115                      .dwattr $C$DW$1608, DW_AT_accessibility(DW_ACCESS_public)
    9116              $C$DW$1609      .dwtag  DW_TAG_member
    9117                      .dwattr $C$DW$1609, DW_AT_type(*$C$DW$T$23)
    9118                      .dwattr $C$DW$1609, DW_AT_name("ADCCTL1")
    9119                      .dwattr $C$DW$1609, DW_AT_TI_symbol_name("_ADCCTL1")
    9120                      .dwattr $C$DW$1609, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9121                      .dwattr $C$DW$1609, DW_AT_accessibility(DW_ACCESS_public)
    9122              $C$DW$1610      .dwtag  DW_TAG_member
    9123                      .dwattr $C$DW$1610, DW_AT_type(*$C$DW$T$23)
    9124                      .dwattr $C$DW$1610, DW_AT_name("ADCCTL2")
    9125                      .dwattr $C$DW$1610, DW_AT_TI_symbol_name("_ADCCTL2")
    9126                      .dwattr $C$DW$1610, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9127                      .dwattr $C$DW$1610, DW_AT_accessibility(DW_ACCESS_public)
    9128              $C$DW$1611      .dwtag  DW_TAG_member
    9129                      .dwattr $C$DW$1611, DW_AT_type(*$C$DW$T$26)
    9130                      .dwattr $C$DW$1611, DW_AT_name("rsvd_2")
    9131                      .dwattr $C$DW$1611, DW_AT_TI_symbol_name("_rsvd_2")
    9132                      .dwattr $C$DW$1611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9133                      .dwattr $C$DW$1611, DW_AT_accessibility(DW_ACCESS_public)
    9134              $C$DW$1612      .dwtag  DW_TAG_member
    9135                      .dwattr $C$DW$1612, DW_AT_type(*$C$DW$T$23)
    9136                      .dwattr $C$DW$1612, DW_AT_name("ADCINTFLG")
    9137                      .dwattr $C$DW$1612, DW_AT_TI_symbol_name("_ADCINTFLG")
    9138                      .dwattr $C$DW$1612, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  176

    9139                      .dwattr $C$DW$1612, DW_AT_accessibility(DW_ACCESS_public)
    9140              $C$DW$1613      .dwtag  DW_TAG_member
    9141                      .dwattr $C$DW$1613, DW_AT_type(*$C$DW$T$23)
    9142                      .dwattr $C$DW$1613, DW_AT_name("ADCINTFLGCLR")
    9143                      .dwattr $C$DW$1613, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9144                      .dwattr $C$DW$1613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9145                      .dwattr $C$DW$1613, DW_AT_accessibility(DW_ACCESS_public)
    9146              $C$DW$1614      .dwtag  DW_TAG_member
    9147                      .dwattr $C$DW$1614, DW_AT_type(*$C$DW$T$23)
    9148                      .dwattr $C$DW$1614, DW_AT_name("ADCINTOVF")
    9149                      .dwattr $C$DW$1614, DW_AT_TI_symbol_name("_ADCINTOVF")
    9150                      .dwattr $C$DW$1614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9151                      .dwattr $C$DW$1614, DW_AT_accessibility(DW_ACCESS_public)
    9152              $C$DW$1615      .dwtag  DW_TAG_member
    9153                      .dwattr $C$DW$1615, DW_AT_type(*$C$DW$T$23)
    9154                      .dwattr $C$DW$1615, DW_AT_name("ADCINTOVFCLR")
    9155                      .dwattr $C$DW$1615, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9156                      .dwattr $C$DW$1615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9157                      .dwattr $C$DW$1615, DW_AT_accessibility(DW_ACCESS_public)
    9158              $C$DW$1616      .dwtag  DW_TAG_member
    9159                      .dwattr $C$DW$1616, DW_AT_type(*$C$DW$T$27)
    9160                      .dwattr $C$DW$1616, DW_AT_name("INTSELxNy")
    9161                      .dwattr $C$DW$1616, DW_AT_TI_symbol_name("_INTSELxNy")
    9162                      .dwattr $C$DW$1616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9163                      .dwattr $C$DW$1616, DW_AT_accessibility(DW_ACCESS_public)
    9164              $C$DW$1617      .dwtag  DW_TAG_member
    9165                      .dwattr $C$DW$1617, DW_AT_type(*$C$DW$T$28)
    9166                      .dwattr $C$DW$1617, DW_AT_name("rsvd_3")
    9167                      .dwattr $C$DW$1617, DW_AT_TI_symbol_name("_rsvd_3")
    9168                      .dwattr $C$DW$1617, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9169                      .dwattr $C$DW$1617, DW_AT_accessibility(DW_ACCESS_public)
    9170              $C$DW$1618      .dwtag  DW_TAG_member
    9171                      .dwattr $C$DW$1618, DW_AT_type(*$C$DW$T$23)
    9172                      .dwattr $C$DW$1618, DW_AT_name("SOCPRICTRL")
    9173                      .dwattr $C$DW$1618, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9174                      .dwattr $C$DW$1618, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9175                      .dwattr $C$DW$1618, DW_AT_accessibility(DW_ACCESS_public)
    9176              $C$DW$1619      .dwtag  DW_TAG_member
    9177                      .dwattr $C$DW$1619, DW_AT_type(*$C$DW$T$23)
    9178                      .dwattr $C$DW$1619, DW_AT_name("rsvd_4")
    9179                      .dwattr $C$DW$1619, DW_AT_TI_symbol_name("_rsvd_4")
    9180                      .dwattr $C$DW$1619, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9181                      .dwattr $C$DW$1619, DW_AT_accessibility(DW_ACCESS_public)
    9182              $C$DW$1620      .dwtag  DW_TAG_member
    9183                      .dwattr $C$DW$1620, DW_AT_type(*$C$DW$T$23)
    9184                      .dwattr $C$DW$1620, DW_AT_name("ADCSAMPLEMODE")
    9185                      .dwattr $C$DW$1620, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9186                      .dwattr $C$DW$1620, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9187                      .dwattr $C$DW$1620, DW_AT_accessibility(DW_ACCESS_public)
    9188              $C$DW$1621      .dwtag  DW_TAG_member
    9189                      .dwattr $C$DW$1621, DW_AT_type(*$C$DW$T$23)
    9190                      .dwattr $C$DW$1621, DW_AT_name("rsvd_5")
    9191                      .dwattr $C$DW$1621, DW_AT_TI_symbol_name("_rsvd_5")
    9192                      .dwattr $C$DW$1621, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9193                      .dwattr $C$DW$1621, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  177

    9194              $C$DW$1622      .dwtag  DW_TAG_member
    9195                      .dwattr $C$DW$1622, DW_AT_type(*$C$DW$T$23)
    9196                      .dwattr $C$DW$1622, DW_AT_name("ADCINTSOCSEL1")
    9197                      .dwattr $C$DW$1622, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9198                      .dwattr $C$DW$1622, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9199                      .dwattr $C$DW$1622, DW_AT_accessibility(DW_ACCESS_public)
    9200              $C$DW$1623      .dwtag  DW_TAG_member
    9201                      .dwattr $C$DW$1623, DW_AT_type(*$C$DW$T$23)
    9202                      .dwattr $C$DW$1623, DW_AT_name("ADCINTSOCSEL2")
    9203                      .dwattr $C$DW$1623, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9204                      .dwattr $C$DW$1623, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9205                      .dwattr $C$DW$1623, DW_AT_accessibility(DW_ACCESS_public)
    9206              $C$DW$1624      .dwtag  DW_TAG_member
    9207                      .dwattr $C$DW$1624, DW_AT_type(*$C$DW$T$26)
    9208                      .dwattr $C$DW$1624, DW_AT_name("rsvd_6")
    9209                      .dwattr $C$DW$1624, DW_AT_TI_symbol_name("_rsvd_6")
    9210                      .dwattr $C$DW$1624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9211                      .dwattr $C$DW$1624, DW_AT_accessibility(DW_ACCESS_public)
    9212              $C$DW$1625      .dwtag  DW_TAG_member
    9213                      .dwattr $C$DW$1625, DW_AT_type(*$C$DW$T$23)
    9214                      .dwattr $C$DW$1625, DW_AT_name("ADCSOCFLG1")
    9215                      .dwattr $C$DW$1625, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9216                      .dwattr $C$DW$1625, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9217                      .dwattr $C$DW$1625, DW_AT_accessibility(DW_ACCESS_public)
    9218              $C$DW$1626      .dwtag  DW_TAG_member
    9219                      .dwattr $C$DW$1626, DW_AT_type(*$C$DW$T$23)
    9220                      .dwattr $C$DW$1626, DW_AT_name("rsvd_7")
    9221                      .dwattr $C$DW$1626, DW_AT_TI_symbol_name("_rsvd_7")
    9222                      .dwattr $C$DW$1626, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9223                      .dwattr $C$DW$1626, DW_AT_accessibility(DW_ACCESS_public)
    9224              $C$DW$1627      .dwtag  DW_TAG_member
    9225                      .dwattr $C$DW$1627, DW_AT_type(*$C$DW$T$23)
    9226                      .dwattr $C$DW$1627, DW_AT_name("ADCSOCFRC1")
    9227                      .dwattr $C$DW$1627, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9228                      .dwattr $C$DW$1627, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9229                      .dwattr $C$DW$1627, DW_AT_accessibility(DW_ACCESS_public)
    9230              $C$DW$1628      .dwtag  DW_TAG_member
    9231                      .dwattr $C$DW$1628, DW_AT_type(*$C$DW$T$23)
    9232                      .dwattr $C$DW$1628, DW_AT_name("rsvd_8")
    9233                      .dwattr $C$DW$1628, DW_AT_TI_symbol_name("_rsvd_8")
    9234                      .dwattr $C$DW$1628, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9235                      .dwattr $C$DW$1628, DW_AT_accessibility(DW_ACCESS_public)
    9236              $C$DW$1629      .dwtag  DW_TAG_member
    9237                      .dwattr $C$DW$1629, DW_AT_type(*$C$DW$T$23)
    9238                      .dwattr $C$DW$1629, DW_AT_name("ADCSOCOVF1")
    9239                      .dwattr $C$DW$1629, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9240                      .dwattr $C$DW$1629, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9241                      .dwattr $C$DW$1629, DW_AT_accessibility(DW_ACCESS_public)
    9242              $C$DW$1630      .dwtag  DW_TAG_member
    9243                      .dwattr $C$DW$1630, DW_AT_type(*$C$DW$T$23)
    9244                      .dwattr $C$DW$1630, DW_AT_name("rsvd_9")
    9245                      .dwattr $C$DW$1630, DW_AT_TI_symbol_name("_rsvd_9")
    9246                      .dwattr $C$DW$1630, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9247                      .dwattr $C$DW$1630, DW_AT_accessibility(DW_ACCESS_public)
    9248              $C$DW$1631      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  178

    9249                      .dwattr $C$DW$1631, DW_AT_type(*$C$DW$T$23)
    9250                      .dwattr $C$DW$1631, DW_AT_name("ADCSOCOVFCLR1")
    9251                      .dwattr $C$DW$1631, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9252                      .dwattr $C$DW$1631, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9253                      .dwattr $C$DW$1631, DW_AT_accessibility(DW_ACCESS_public)
    9254              $C$DW$1632      .dwtag  DW_TAG_member
    9255                      .dwattr $C$DW$1632, DW_AT_type(*$C$DW$T$23)
    9256                      .dwattr $C$DW$1632, DW_AT_name("rsvd_10")
    9257                      .dwattr $C$DW$1632, DW_AT_TI_symbol_name("_rsvd_10")
    9258                      .dwattr $C$DW$1632, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9259                      .dwattr $C$DW$1632, DW_AT_accessibility(DW_ACCESS_public)
    9260              $C$DW$1633      .dwtag  DW_TAG_member
    9261                      .dwattr $C$DW$1633, DW_AT_type(*$C$DW$T$24)
    9262                      .dwattr $C$DW$1633, DW_AT_name("ADCSOCxCTL")
    9263                      .dwattr $C$DW$1633, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9264                      .dwattr $C$DW$1633, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9265                      .dwattr $C$DW$1633, DW_AT_accessibility(DW_ACCESS_public)
    9266              $C$DW$1634      .dwtag  DW_TAG_member
    9267                      .dwattr $C$DW$1634, DW_AT_type(*$C$DW$T$24)
    9268                      .dwattr $C$DW$1634, DW_AT_name("rsvd_11")
    9269                      .dwattr $C$DW$1634, DW_AT_TI_symbol_name("_rsvd_11")
    9270                      .dwattr $C$DW$1634, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9271                      .dwattr $C$DW$1634, DW_AT_accessibility(DW_ACCESS_public)
    9272              $C$DW$1635      .dwtag  DW_TAG_member
    9273                      .dwattr $C$DW$1635, DW_AT_type(*$C$DW$T$23)
    9274                      .dwattr $C$DW$1635, DW_AT_name("ADCREFTRIM")
    9275                      .dwattr $C$DW$1635, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9276                      .dwattr $C$DW$1635, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9277                      .dwattr $C$DW$1635, DW_AT_accessibility(DW_ACCESS_public)
    9278              $C$DW$1636      .dwtag  DW_TAG_member
    9279                      .dwattr $C$DW$1636, DW_AT_type(*$C$DW$T$23)
    9280                      .dwattr $C$DW$1636, DW_AT_name("ADCOFFTRIM")
    9281                      .dwattr $C$DW$1636, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9282                      .dwattr $C$DW$1636, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9283                      .dwattr $C$DW$1636, DW_AT_accessibility(DW_ACCESS_public)
    9284              $C$DW$1637      .dwtag  DW_TAG_member
    9285                      .dwattr $C$DW$1637, DW_AT_type(*$C$DW$T$29)
    9286                      .dwattr $C$DW$1637, DW_AT_name("resvd_12")
    9287                      .dwattr $C$DW$1637, DW_AT_TI_symbol_name("_resvd_12")
    9288                      .dwattr $C$DW$1637, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9289                      .dwattr $C$DW$1637, DW_AT_accessibility(DW_ACCESS_public)
    9290              $C$DW$1638      .dwtag  DW_TAG_member
    9291                      .dwattr $C$DW$1638, DW_AT_type(*$C$DW$T$23)
    9292                      .dwattr $C$DW$1638, DW_AT_name("ADCREV")
    9293                      .dwattr $C$DW$1638, DW_AT_TI_symbol_name("_ADCREV")
    9294                      .dwattr $C$DW$1638, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9295                      .dwattr $C$DW$1638, DW_AT_accessibility(DW_ACCESS_public)
    9296                      .dwendtag $C$DW$T$30
    9297              
    9298              $C$DW$T$304     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    9299                      .dwattr $C$DW$T$304, DW_AT_type(*$C$DW$T$30)
    9300                      .dwattr $C$DW$T$304, DW_AT_language(DW_LANG_C)
    9301              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    9302                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
    9303                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  179

    9304              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    9305                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    9306                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    9307              
    9308              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    9309                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
    9310                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
    9311              $C$DW$1639      .dwtag  DW_TAG_member
    9312                      .dwattr $C$DW$1639, DW_AT_type(*$C$DW$T$23)
    9313                      .dwattr $C$DW$1639, DW_AT_name("XCLK")
    9314                      .dwattr $C$DW$1639, DW_AT_TI_symbol_name("_XCLK")
    9315                      .dwattr $C$DW$1639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9316                      .dwattr $C$DW$1639, DW_AT_accessibility(DW_ACCESS_public)
    9317              $C$DW$1640      .dwtag  DW_TAG_member
    9318                      .dwattr $C$DW$1640, DW_AT_type(*$C$DW$T$23)
    9319                      .dwattr $C$DW$1640, DW_AT_name("rsvd_1")
    9320                      .dwattr $C$DW$1640, DW_AT_TI_symbol_name("_rsvd_1")
    9321                      .dwattr $C$DW$1640, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9322                      .dwattr $C$DW$1640, DW_AT_accessibility(DW_ACCESS_public)
    9323              $C$DW$1641      .dwtag  DW_TAG_member
    9324                      .dwattr $C$DW$1641, DW_AT_type(*$C$DW$T$23)
    9325                      .dwattr $C$DW$1641, DW_AT_name("CLKCTL")
    9326                      .dwattr $C$DW$1641, DW_AT_TI_symbol_name("_CLKCTL")
    9327                      .dwattr $C$DW$1641, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9328                      .dwattr $C$DW$1641, DW_AT_accessibility(DW_ACCESS_public)
    9329              $C$DW$1642      .dwtag  DW_TAG_member
    9330                      .dwattr $C$DW$1642, DW_AT_type(*$C$DW$T$31)
    9331                      .dwattr $C$DW$1642, DW_AT_name("rsvd_2")
    9332                      .dwattr $C$DW$1642, DW_AT_TI_symbol_name("_rsvd_2")
    9333                      .dwattr $C$DW$1642, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9334                      .dwattr $C$DW$1642, DW_AT_accessibility(DW_ACCESS_public)
    9335              $C$DW$1643      .dwtag  DW_TAG_member
    9336                      .dwattr $C$DW$1643, DW_AT_type(*$C$DW$T$23)
    9337                      .dwattr $C$DW$1643, DW_AT_name("LOSPCP")
    9338                      .dwattr $C$DW$1643, DW_AT_TI_symbol_name("_LOSPCP")
    9339                      .dwattr $C$DW$1643, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9340                      .dwattr $C$DW$1643, DW_AT_accessibility(DW_ACCESS_public)
    9341              $C$DW$1644      .dwtag  DW_TAG_member
    9342                      .dwattr $C$DW$1644, DW_AT_type(*$C$DW$T$23)
    9343                      .dwattr $C$DW$1644, DW_AT_name("PCLKCR0")
    9344                      .dwattr $C$DW$1644, DW_AT_TI_symbol_name("_PCLKCR0")
    9345                      .dwattr $C$DW$1644, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9346                      .dwattr $C$DW$1644, DW_AT_accessibility(DW_ACCESS_public)
    9347              $C$DW$1645      .dwtag  DW_TAG_member
    9348                      .dwattr $C$DW$1645, DW_AT_type(*$C$DW$T$23)
    9349                      .dwattr $C$DW$1645, DW_AT_name("PCLKCR1")
    9350                      .dwattr $C$DW$1645, DW_AT_TI_symbol_name("_PCLKCR1")
    9351                      .dwattr $C$DW$1645, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9352                      .dwattr $C$DW$1645, DW_AT_accessibility(DW_ACCESS_public)
    9353              $C$DW$1646      .dwtag  DW_TAG_member
    9354                      .dwattr $C$DW$1646, DW_AT_type(*$C$DW$T$26)
    9355                      .dwattr $C$DW$1646, DW_AT_name("rsvd_3")
    9356                      .dwattr $C$DW$1646, DW_AT_TI_symbol_name("_rsvd_3")
    9357                      .dwattr $C$DW$1646, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9358                      .dwattr $C$DW$1646, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  180

    9359              $C$DW$1647      .dwtag  DW_TAG_member
    9360                      .dwattr $C$DW$1647, DW_AT_type(*$C$DW$T$23)
    9361                      .dwattr $C$DW$1647, DW_AT_name("PCLKCR3")
    9362                      .dwattr $C$DW$1647, DW_AT_TI_symbol_name("_PCLKCR3")
    9363                      .dwattr $C$DW$1647, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9364                      .dwattr $C$DW$1647, DW_AT_accessibility(DW_ACCESS_public)
    9365                      .dwendtag $C$DW$T$32
    9366              
    9367              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    9368                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
    9369                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
    9370              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    9371                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    9372                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    9373              
    9374              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    9375                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
    9376                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    9377              $C$DW$1648      .dwtag  DW_TAG_member
    9378                      .dwattr $C$DW$1648, DW_AT_type(*$C$DW$T$33)
    9379                      .dwattr $C$DW$1648, DW_AT_name("tmp")
    9380                      .dwattr $C$DW$1648, DW_AT_TI_symbol_name("_tmp")
    9381                      .dwattr $C$DW$1648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9382                      .dwattr $C$DW$1648, DW_AT_accessibility(DW_ACCESS_public)
    9383                      .dwendtag $C$DW$T$34
    9384              
    9385              $C$DW$T$311     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
    9386                      .dwattr $C$DW$T$311, DW_AT_type(*$C$DW$T$34)
    9387                      .dwattr $C$DW$T$311, DW_AT_language(DW_LANG_C)
    9388              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    9389                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
    9390                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
    9391              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    9392                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    9393                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    9394              
    9395              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9396                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
    9397                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
    9398              $C$DW$1649      .dwtag  DW_TAG_member
    9399                      .dwattr $C$DW$1649, DW_AT_type(*$C$DW$T$35)
    9400                      .dwattr $C$DW$1649, DW_AT_name("a1")
    9401                      .dwattr $C$DW$1649, DW_AT_TI_symbol_name("_a1")
    9402                      .dwattr $C$DW$1649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9403                      .dwattr $C$DW$1649, DW_AT_accessibility(DW_ACCESS_public)
    9404              $C$DW$1650      .dwtag  DW_TAG_member
    9405                      .dwattr $C$DW$1650, DW_AT_type(*$C$DW$T$35)
    9406                      .dwattr $C$DW$1650, DW_AT_name("b0")
    9407                      .dwattr $C$DW$1650, DW_AT_TI_symbol_name("_b0")
    9408                      .dwattr $C$DW$1650, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9409                      .dwattr $C$DW$1650, DW_AT_accessibility(DW_ACCESS_public)
    9410              $C$DW$1651      .dwtag  DW_TAG_member
    9411                      .dwattr $C$DW$1651, DW_AT_type(*$C$DW$T$35)
    9412                      .dwattr $C$DW$1651, DW_AT_name("b1")
    9413                      .dwattr $C$DW$1651, DW_AT_TI_symbol_name("_b1")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  181

    9414                      .dwattr $C$DW$1651, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9415                      .dwattr $C$DW$1651, DW_AT_accessibility(DW_ACCESS_public)
    9416              $C$DW$1652      .dwtag  DW_TAG_member
    9417                      .dwattr $C$DW$1652, DW_AT_type(*$C$DW$T$35)
    9418                      .dwattr $C$DW$1652, DW_AT_name("x1")
    9419                      .dwattr $C$DW$1652, DW_AT_TI_symbol_name("_x1")
    9420                      .dwattr $C$DW$1652, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9421                      .dwattr $C$DW$1652, DW_AT_accessibility(DW_ACCESS_public)
    9422              $C$DW$1653      .dwtag  DW_TAG_member
    9423                      .dwattr $C$DW$1653, DW_AT_type(*$C$DW$T$35)
    9424                      .dwattr $C$DW$1653, DW_AT_name("y1")
    9425                      .dwattr $C$DW$1653, DW_AT_TI_symbol_name("_y1")
    9426                      .dwattr $C$DW$1653, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9427                      .dwattr $C$DW$1653, DW_AT_accessibility(DW_ACCESS_public)
    9428                      .dwendtag $C$DW$T$36
    9429              
    9430              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    9431                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$36)
    9432                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    9433              
    9434              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9435                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    9436                      .dwattr $C$DW$T$20, DW_AT_declaration
    9437                      .dwendtag $C$DW$T$20
    9438              
    9439              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    9440                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$20)
    9441                      .dwattr $C$DW$T$90, DW_AT_address_class(0x16)
    9442              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    9443                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    9444                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    9445              
    9446              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    9447                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
    9448                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    9449              $C$DW$1654      .dwtag  DW_TAG_member
    9450                      .dwattr $C$DW$1654, DW_AT_type(*$C$DW$T$23)
    9451                      .dwattr $C$DW$1654, DW_AT_name("FOPT")
    9452                      .dwattr $C$DW$1654, DW_AT_TI_symbol_name("_FOPT")
    9453                      .dwattr $C$DW$1654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9454                      .dwattr $C$DW$1654, DW_AT_accessibility(DW_ACCESS_public)
    9455              $C$DW$1655      .dwtag  DW_TAG_member
    9456                      .dwattr $C$DW$1655, DW_AT_type(*$C$DW$T$23)
    9457                      .dwattr $C$DW$1655, DW_AT_name("rsvd_1")
    9458                      .dwattr $C$DW$1655, DW_AT_TI_symbol_name("_rsvd_1")
    9459                      .dwattr $C$DW$1655, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9460                      .dwattr $C$DW$1655, DW_AT_accessibility(DW_ACCESS_public)
    9461              $C$DW$1656      .dwtag  DW_TAG_member
    9462                      .dwattr $C$DW$1656, DW_AT_type(*$C$DW$T$23)
    9463                      .dwattr $C$DW$1656, DW_AT_name("FPWR")
    9464                      .dwattr $C$DW$1656, DW_AT_TI_symbol_name("_FPWR")
    9465                      .dwattr $C$DW$1656, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9466                      .dwattr $C$DW$1656, DW_AT_accessibility(DW_ACCESS_public)
    9467              $C$DW$1657      .dwtag  DW_TAG_member
    9468                      .dwattr $C$DW$1657, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  182

    9469                      .dwattr $C$DW$1657, DW_AT_name("FSTATUS")
    9470                      .dwattr $C$DW$1657, DW_AT_TI_symbol_name("_FSTATUS")
    9471                      .dwattr $C$DW$1657, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9472                      .dwattr $C$DW$1657, DW_AT_accessibility(DW_ACCESS_public)
    9473              $C$DW$1658      .dwtag  DW_TAG_member
    9474                      .dwattr $C$DW$1658, DW_AT_type(*$C$DW$T$23)
    9475                      .dwattr $C$DW$1658, DW_AT_name("FSTDBYWAIT")
    9476                      .dwattr $C$DW$1658, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9477                      .dwattr $C$DW$1658, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9478                      .dwattr $C$DW$1658, DW_AT_accessibility(DW_ACCESS_public)
    9479              $C$DW$1659      .dwtag  DW_TAG_member
    9480                      .dwattr $C$DW$1659, DW_AT_type(*$C$DW$T$23)
    9481                      .dwattr $C$DW$1659, DW_AT_name("FACTIVEWAIT")
    9482                      .dwattr $C$DW$1659, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9483                      .dwattr $C$DW$1659, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9484                      .dwattr $C$DW$1659, DW_AT_accessibility(DW_ACCESS_public)
    9485              $C$DW$1660      .dwtag  DW_TAG_member
    9486                      .dwattr $C$DW$1660, DW_AT_type(*$C$DW$T$23)
    9487                      .dwattr $C$DW$1660, DW_AT_name("FBANKWAIT")
    9488                      .dwattr $C$DW$1660, DW_AT_TI_symbol_name("_FBANKWAIT")
    9489                      .dwattr $C$DW$1660, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9490                      .dwattr $C$DW$1660, DW_AT_accessibility(DW_ACCESS_public)
    9491              $C$DW$1661      .dwtag  DW_TAG_member
    9492                      .dwattr $C$DW$1661, DW_AT_type(*$C$DW$T$23)
    9493                      .dwattr $C$DW$1661, DW_AT_name("FOTPWAIT")
    9494                      .dwattr $C$DW$1661, DW_AT_TI_symbol_name("_FOTPWAIT")
    9495                      .dwattr $C$DW$1661, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9496                      .dwattr $C$DW$1661, DW_AT_accessibility(DW_ACCESS_public)
    9497                      .dwendtag $C$DW$T$37
    9498              
    9499              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    9500                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
    9501                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
    9502              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    9503                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    9504                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    9505              
    9506              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    9507                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
    9508                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
    9509              $C$DW$1662      .dwtag  DW_TAG_member
    9510                      .dwattr $C$DW$1662, DW_AT_type(*$C$DW$T$39)
    9511                      .dwattr $C$DW$1662, DW_AT_name("GPACTRL")
    9512                      .dwattr $C$DW$1662, DW_AT_TI_symbol_name("_GPACTRL")
    9513                      .dwattr $C$DW$1662, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9514                      .dwattr $C$DW$1662, DW_AT_accessibility(DW_ACCESS_public)
    9515              $C$DW$1663      .dwtag  DW_TAG_member
    9516                      .dwattr $C$DW$1663, DW_AT_type(*$C$DW$T$39)
    9517                      .dwattr $C$DW$1663, DW_AT_name("GPAQSEL1")
    9518                      .dwattr $C$DW$1663, DW_AT_TI_symbol_name("_GPAQSEL1")
    9519                      .dwattr $C$DW$1663, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9520                      .dwattr $C$DW$1663, DW_AT_accessibility(DW_ACCESS_public)
    9521              $C$DW$1664      .dwtag  DW_TAG_member
    9522                      .dwattr $C$DW$1664, DW_AT_type(*$C$DW$T$39)
    9523                      .dwattr $C$DW$1664, DW_AT_name("GPAQSEL2")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  183

    9524                      .dwattr $C$DW$1664, DW_AT_TI_symbol_name("_GPAQSEL2")
    9525                      .dwattr $C$DW$1664, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9526                      .dwattr $C$DW$1664, DW_AT_accessibility(DW_ACCESS_public)
    9527              $C$DW$1665      .dwtag  DW_TAG_member
    9528                      .dwattr $C$DW$1665, DW_AT_type(*$C$DW$T$39)
    9529                      .dwattr $C$DW$1665, DW_AT_name("GPAMUX1")
    9530                      .dwattr $C$DW$1665, DW_AT_TI_symbol_name("_GPAMUX1")
    9531                      .dwattr $C$DW$1665, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9532                      .dwattr $C$DW$1665, DW_AT_accessibility(DW_ACCESS_public)
    9533              $C$DW$1666      .dwtag  DW_TAG_member
    9534                      .dwattr $C$DW$1666, DW_AT_type(*$C$DW$T$39)
    9535                      .dwattr $C$DW$1666, DW_AT_name("GPAMUX2")
    9536                      .dwattr $C$DW$1666, DW_AT_TI_symbol_name("_GPAMUX2")
    9537                      .dwattr $C$DW$1666, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9538                      .dwattr $C$DW$1666, DW_AT_accessibility(DW_ACCESS_public)
    9539              $C$DW$1667      .dwtag  DW_TAG_member
    9540                      .dwattr $C$DW$1667, DW_AT_type(*$C$DW$T$39)
    9541                      .dwattr $C$DW$1667, DW_AT_name("GPADIR")
    9542                      .dwattr $C$DW$1667, DW_AT_TI_symbol_name("_GPADIR")
    9543                      .dwattr $C$DW$1667, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9544                      .dwattr $C$DW$1667, DW_AT_accessibility(DW_ACCESS_public)
    9545              $C$DW$1668      .dwtag  DW_TAG_member
    9546                      .dwattr $C$DW$1668, DW_AT_type(*$C$DW$T$39)
    9547                      .dwattr $C$DW$1668, DW_AT_name("GPAPUD")
    9548                      .dwattr $C$DW$1668, DW_AT_TI_symbol_name("_GPAPUD")
    9549                      .dwattr $C$DW$1668, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9550                      .dwattr $C$DW$1668, DW_AT_accessibility(DW_ACCESS_public)
    9551              $C$DW$1669      .dwtag  DW_TAG_member
    9552                      .dwattr $C$DW$1669, DW_AT_type(*$C$DW$T$26)
    9553                      .dwattr $C$DW$1669, DW_AT_name("rsvd_1")
    9554                      .dwattr $C$DW$1669, DW_AT_TI_symbol_name("_rsvd_1")
    9555                      .dwattr $C$DW$1669, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9556                      .dwattr $C$DW$1669, DW_AT_accessibility(DW_ACCESS_public)
    9557              $C$DW$1670      .dwtag  DW_TAG_member
    9558                      .dwattr $C$DW$1670, DW_AT_type(*$C$DW$T$39)
    9559                      .dwattr $C$DW$1670, DW_AT_name("GPBCTRL")
    9560                      .dwattr $C$DW$1670, DW_AT_TI_symbol_name("_GPBCTRL")
    9561                      .dwattr $C$DW$1670, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9562                      .dwattr $C$DW$1670, DW_AT_accessibility(DW_ACCESS_public)
    9563              $C$DW$1671      .dwtag  DW_TAG_member
    9564                      .dwattr $C$DW$1671, DW_AT_type(*$C$DW$T$39)
    9565                      .dwattr $C$DW$1671, DW_AT_name("GPBQSEL1")
    9566                      .dwattr $C$DW$1671, DW_AT_TI_symbol_name("_GPBQSEL1")
    9567                      .dwattr $C$DW$1671, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9568                      .dwattr $C$DW$1671, DW_AT_accessibility(DW_ACCESS_public)
    9569              $C$DW$1672      .dwtag  DW_TAG_member
    9570                      .dwattr $C$DW$1672, DW_AT_type(*$C$DW$T$26)
    9571                      .dwattr $C$DW$1672, DW_AT_name("rsvd_2")
    9572                      .dwattr $C$DW$1672, DW_AT_TI_symbol_name("_rsvd_2")
    9573                      .dwattr $C$DW$1672, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9574                      .dwattr $C$DW$1672, DW_AT_accessibility(DW_ACCESS_public)
    9575              $C$DW$1673      .dwtag  DW_TAG_member
    9576                      .dwattr $C$DW$1673, DW_AT_type(*$C$DW$T$39)
    9577                      .dwattr $C$DW$1673, DW_AT_name("GPBMUX1")
    9578                      .dwattr $C$DW$1673, DW_AT_TI_symbol_name("_GPBMUX1")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  184

    9579                      .dwattr $C$DW$1673, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9580                      .dwattr $C$DW$1673, DW_AT_accessibility(DW_ACCESS_public)
    9581              $C$DW$1674      .dwtag  DW_TAG_member
    9582                      .dwattr $C$DW$1674, DW_AT_type(*$C$DW$T$26)
    9583                      .dwattr $C$DW$1674, DW_AT_name("rsvd_3")
    9584                      .dwattr $C$DW$1674, DW_AT_TI_symbol_name("_rsvd_3")
    9585                      .dwattr $C$DW$1674, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9586                      .dwattr $C$DW$1674, DW_AT_accessibility(DW_ACCESS_public)
    9587              $C$DW$1675      .dwtag  DW_TAG_member
    9588                      .dwattr $C$DW$1675, DW_AT_type(*$C$DW$T$39)
    9589                      .dwattr $C$DW$1675, DW_AT_name("GPBDIR")
    9590                      .dwattr $C$DW$1675, DW_AT_TI_symbol_name("_GPBDIR")
    9591                      .dwattr $C$DW$1675, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9592                      .dwattr $C$DW$1675, DW_AT_accessibility(DW_ACCESS_public)
    9593              $C$DW$1676      .dwtag  DW_TAG_member
    9594                      .dwattr $C$DW$1676, DW_AT_type(*$C$DW$T$39)
    9595                      .dwattr $C$DW$1676, DW_AT_name("GPBPUD")
    9596                      .dwattr $C$DW$1676, DW_AT_TI_symbol_name("_GPBPUD")
    9597                      .dwattr $C$DW$1676, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9598                      .dwattr $C$DW$1676, DW_AT_accessibility(DW_ACCESS_public)
    9599              $C$DW$1677      .dwtag  DW_TAG_member
    9600                      .dwattr $C$DW$1677, DW_AT_type(*$C$DW$T$40)
    9601                      .dwattr $C$DW$1677, DW_AT_name("rsvd_4")
    9602                      .dwattr $C$DW$1677, DW_AT_TI_symbol_name("_rsvd_4")
    9603                      .dwattr $C$DW$1677, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9604                      .dwattr $C$DW$1677, DW_AT_accessibility(DW_ACCESS_public)
    9605              $C$DW$1678      .dwtag  DW_TAG_member
    9606                      .dwattr $C$DW$1678, DW_AT_type(*$C$DW$T$39)
    9607                      .dwattr $C$DW$1678, DW_AT_name("AIOMUX1")
    9608                      .dwattr $C$DW$1678, DW_AT_TI_symbol_name("_AIOMUX1")
    9609                      .dwattr $C$DW$1678, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9610                      .dwattr $C$DW$1678, DW_AT_accessibility(DW_ACCESS_public)
    9611              $C$DW$1679      .dwtag  DW_TAG_member
    9612                      .dwattr $C$DW$1679, DW_AT_type(*$C$DW$T$26)
    9613                      .dwattr $C$DW$1679, DW_AT_name("rsvd_5")
    9614                      .dwattr $C$DW$1679, DW_AT_TI_symbol_name("_rsvd_5")
    9615                      .dwattr $C$DW$1679, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9616                      .dwattr $C$DW$1679, DW_AT_accessibility(DW_ACCESS_public)
    9617              $C$DW$1680      .dwtag  DW_TAG_member
    9618                      .dwattr $C$DW$1680, DW_AT_type(*$C$DW$T$39)
    9619                      .dwattr $C$DW$1680, DW_AT_name("AIODIR")
    9620                      .dwattr $C$DW$1680, DW_AT_TI_symbol_name("_AIODIR")
    9621                      .dwattr $C$DW$1680, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9622                      .dwattr $C$DW$1680, DW_AT_accessibility(DW_ACCESS_public)
    9623              $C$DW$1681      .dwtag  DW_TAG_member
    9624                      .dwattr $C$DW$1681, DW_AT_type(*$C$DW$T$41)
    9625                      .dwattr $C$DW$1681, DW_AT_name("rsvd_6")
    9626                      .dwattr $C$DW$1681, DW_AT_TI_symbol_name("_rsvd_6")
    9627                      .dwattr $C$DW$1681, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9628                      .dwattr $C$DW$1681, DW_AT_accessibility(DW_ACCESS_public)
    9629              $C$DW$1682      .dwtag  DW_TAG_member
    9630                      .dwattr $C$DW$1682, DW_AT_type(*$C$DW$T$39)
    9631                      .dwattr $C$DW$1682, DW_AT_name("GPADAT")
    9632                      .dwattr $C$DW$1682, DW_AT_TI_symbol_name("_GPADAT")
    9633                      .dwattr $C$DW$1682, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  185

    9634                      .dwattr $C$DW$1682, DW_AT_accessibility(DW_ACCESS_public)
    9635              $C$DW$1683      .dwtag  DW_TAG_member
    9636                      .dwattr $C$DW$1683, DW_AT_type(*$C$DW$T$39)
    9637                      .dwattr $C$DW$1683, DW_AT_name("GPASET")
    9638                      .dwattr $C$DW$1683, DW_AT_TI_symbol_name("_GPASET")
    9639                      .dwattr $C$DW$1683, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    9640                      .dwattr $C$DW$1683, DW_AT_accessibility(DW_ACCESS_public)
    9641              $C$DW$1684      .dwtag  DW_TAG_member
    9642                      .dwattr $C$DW$1684, DW_AT_type(*$C$DW$T$39)
    9643                      .dwattr $C$DW$1684, DW_AT_name("GPACLEAR")
    9644                      .dwattr $C$DW$1684, DW_AT_TI_symbol_name("_GPACLEAR")
    9645                      .dwattr $C$DW$1684, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9646                      .dwattr $C$DW$1684, DW_AT_accessibility(DW_ACCESS_public)
    9647              $C$DW$1685      .dwtag  DW_TAG_member
    9648                      .dwattr $C$DW$1685, DW_AT_type(*$C$DW$T$39)
    9649                      .dwattr $C$DW$1685, DW_AT_name("GPATOGGLE")
    9650                      .dwattr $C$DW$1685, DW_AT_TI_symbol_name("_GPATOGGLE")
    9651                      .dwattr $C$DW$1685, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9652                      .dwattr $C$DW$1685, DW_AT_accessibility(DW_ACCESS_public)
    9653              $C$DW$1686      .dwtag  DW_TAG_member
    9654                      .dwattr $C$DW$1686, DW_AT_type(*$C$DW$T$39)
    9655                      .dwattr $C$DW$1686, DW_AT_name("GPBDAT")
    9656                      .dwattr $C$DW$1686, DW_AT_TI_symbol_name("_GPBDAT")
    9657                      .dwattr $C$DW$1686, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    9658                      .dwattr $C$DW$1686, DW_AT_accessibility(DW_ACCESS_public)
    9659              $C$DW$1687      .dwtag  DW_TAG_member
    9660                      .dwattr $C$DW$1687, DW_AT_type(*$C$DW$T$39)
    9661                      .dwattr $C$DW$1687, DW_AT_name("GPBSET")
    9662                      .dwattr $C$DW$1687, DW_AT_TI_symbol_name("_GPBSET")
    9663                      .dwattr $C$DW$1687, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    9664                      .dwattr $C$DW$1687, DW_AT_accessibility(DW_ACCESS_public)
    9665              $C$DW$1688      .dwtag  DW_TAG_member
    9666                      .dwattr $C$DW$1688, DW_AT_type(*$C$DW$T$39)
    9667                      .dwattr $C$DW$1688, DW_AT_name("GPBCLEAR")
    9668                      .dwattr $C$DW$1688, DW_AT_TI_symbol_name("_GPBCLEAR")
    9669                      .dwattr $C$DW$1688, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    9670                      .dwattr $C$DW$1688, DW_AT_accessibility(DW_ACCESS_public)
    9671              $C$DW$1689      .dwtag  DW_TAG_member
    9672                      .dwattr $C$DW$1689, DW_AT_type(*$C$DW$T$39)
    9673                      .dwattr $C$DW$1689, DW_AT_name("GPBTOGGLE")
    9674                      .dwattr $C$DW$1689, DW_AT_TI_symbol_name("_GPBTOGGLE")
    9675                      .dwattr $C$DW$1689, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    9676                      .dwattr $C$DW$1689, DW_AT_accessibility(DW_ACCESS_public)
    9677              $C$DW$1690      .dwtag  DW_TAG_member
    9678                      .dwattr $C$DW$1690, DW_AT_type(*$C$DW$T$31)
    9679                      .dwattr $C$DW$1690, DW_AT_name("rsvd_7")
    9680                      .dwattr $C$DW$1690, DW_AT_TI_symbol_name("_rsvd_7")
    9681                      .dwattr $C$DW$1690, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    9682                      .dwattr $C$DW$1690, DW_AT_accessibility(DW_ACCESS_public)
    9683              $C$DW$1691      .dwtag  DW_TAG_member
    9684                      .dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$39)
    9685                      .dwattr $C$DW$1691, DW_AT_name("AIODAT")
    9686                      .dwattr $C$DW$1691, DW_AT_TI_symbol_name("_AIODAT")
    9687                      .dwattr $C$DW$1691, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9688                      .dwattr $C$DW$1691, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  186

    9689              $C$DW$1692      .dwtag  DW_TAG_member
    9690                      .dwattr $C$DW$1692, DW_AT_type(*$C$DW$T$39)
    9691                      .dwattr $C$DW$1692, DW_AT_name("AIOSET")
    9692                      .dwattr $C$DW$1692, DW_AT_TI_symbol_name("_AIOSET")
    9693                      .dwattr $C$DW$1692, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    9694                      .dwattr $C$DW$1692, DW_AT_accessibility(DW_ACCESS_public)
    9695              $C$DW$1693      .dwtag  DW_TAG_member
    9696                      .dwattr $C$DW$1693, DW_AT_type(*$C$DW$T$39)
    9697                      .dwattr $C$DW$1693, DW_AT_name("AIOCLEAR")
    9698                      .dwattr $C$DW$1693, DW_AT_TI_symbol_name("_AIOCLEAR")
    9699                      .dwattr $C$DW$1693, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    9700                      .dwattr $C$DW$1693, DW_AT_accessibility(DW_ACCESS_public)
    9701              $C$DW$1694      .dwtag  DW_TAG_member
    9702                      .dwattr $C$DW$1694, DW_AT_type(*$C$DW$T$39)
    9703                      .dwattr $C$DW$1694, DW_AT_name("AIOTOGGLE")
    9704                      .dwattr $C$DW$1694, DW_AT_TI_symbol_name("_AIOTOGGLE")
    9705                      .dwattr $C$DW$1694, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    9706                      .dwattr $C$DW$1694, DW_AT_accessibility(DW_ACCESS_public)
    9707              $C$DW$1695      .dwtag  DW_TAG_member
    9708                      .dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$28)
    9709                      .dwattr $C$DW$1695, DW_AT_name("GPIOXINTnSEL")
    9710                      .dwattr $C$DW$1695, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    9711                      .dwattr $C$DW$1695, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    9712                      .dwattr $C$DW$1695, DW_AT_accessibility(DW_ACCESS_public)
    9713              $C$DW$1696      .dwtag  DW_TAG_member
    9714                      .dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$27)
    9715                      .dwattr $C$DW$1696, DW_AT_name("rsvd_8")
    9716                      .dwattr $C$DW$1696, DW_AT_TI_symbol_name("_rsvd_8")
    9717                      .dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    9718                      .dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
    9719              $C$DW$1697      .dwtag  DW_TAG_member
    9720                      .dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$39)
    9721                      .dwattr $C$DW$1697, DW_AT_name("GPIOLPMSEL")
    9722                      .dwattr $C$DW$1697, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    9723                      .dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    9724                      .dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
    9725                      .dwendtag $C$DW$T$42
    9726              
    9727              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    9728                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
    9729                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    9730              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    9731                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    9732                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    9733              
    9734              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9735                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
    9736                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
    9737              $C$DW$1698      .dwtag  DW_TAG_member
    9738                      .dwattr $C$DW$1698, DW_AT_type(*$C$DW$T$43)
    9739                      .dwattr $C$DW$1698, DW_AT_name("I")
    9740                      .dwattr $C$DW$1698, DW_AT_TI_symbol_name("_I")
    9741                      .dwattr $C$DW$1698, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9742                      .dwattr $C$DW$1698, DW_AT_accessibility(DW_ACCESS_public)
    9743              $C$DW$1699      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  187

    9744                      .dwattr $C$DW$1699, DW_AT_type(*$C$DW$T$43)
    9745                      .dwattr $C$DW$1699, DW_AT_name("V")
    9746                      .dwattr $C$DW$1699, DW_AT_TI_symbol_name("_V")
    9747                      .dwattr $C$DW$1699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9748                      .dwattr $C$DW$1699, DW_AT_accessibility(DW_ACCESS_public)
    9749              $C$DW$1700      .dwtag  DW_TAG_member
    9750                      .dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$35)
    9751                      .dwattr $C$DW$1700, DW_AT_name("dcBus")
    9752                      .dwattr $C$DW$1700, DW_AT_TI_symbol_name("_dcBus")
    9753                      .dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9754                      .dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
    9755              $C$DW$1701      .dwtag  DW_TAG_member
    9756                      .dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$35)
    9757                      .dwattr $C$DW$1701, DW_AT_name("analogSensor1")
    9758                      .dwattr $C$DW$1701, DW_AT_TI_symbol_name("_analogSensor1")
    9759                      .dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9760                      .dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
    9761              $C$DW$1702      .dwtag  DW_TAG_member
    9762                      .dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$35)
    9763                      .dwattr $C$DW$1702, DW_AT_name("analogSensor2")
    9764                      .dwattr $C$DW$1702, DW_AT_TI_symbol_name("_analogSensor2")
    9765                      .dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9766                      .dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
    9767              $C$DW$1703      .dwtag  DW_TAG_member
    9768                      .dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$35)
    9769                      .dwattr $C$DW$1703, DW_AT_name("igbtNTC")
    9770                      .dwattr $C$DW$1703, DW_AT_TI_symbol_name("_igbtNTC")
    9771                      .dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9772                      .dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
    9773              $C$DW$1704      .dwtag  DW_TAG_member
    9774                      .dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$35)
    9775                      .dwattr $C$DW$1704, DW_AT_name("boardAddr")
    9776                      .dwattr $C$DW$1704, DW_AT_TI_symbol_name("_boardAddr")
    9777                      .dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9778                      .dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
    9779                      .dwendtag $C$DW$T$44
    9780              
    9781              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    9782                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$44)
    9783                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    9784              
    9785              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    9786                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
    9787                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
    9788              $C$DW$1705      .dwtag  DW_TAG_member
    9789                      .dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$22)
    9790                      .dwattr $C$DW$1705, DW_AT_name("PeriodMax")
    9791                      .dwattr $C$DW$1705, DW_AT_TI_symbol_name("_PeriodMax")
    9792                      .dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9793                      .dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
    9794              $C$DW$1706      .dwtag  DW_TAG_member
    9795                      .dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$47)
    9796                      .dwattr $C$DW$1706, DW_AT_name("ptrData")
    9797                      .dwattr $C$DW$1706, DW_AT_TI_symbol_name("_ptrData")
    9798                      .dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  188

    9799                      .dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
    9800              $C$DW$1707      .dwtag  DW_TAG_member
    9801                      .dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$48)
    9802                      .dwattr $C$DW$1707, DW_AT_name("value")
    9803                      .dwattr $C$DW$1707, DW_AT_TI_symbol_name("_value")
    9804                      .dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9805                      .dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
    9806              $C$DW$1708      .dwtag  DW_TAG_member
    9807                      .dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$48)
    9808                      .dwattr $C$DW$1708, DW_AT_name("offset")
    9809                      .dwattr $C$DW$1708, DW_AT_TI_symbol_name("_offset")
    9810                      .dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9811                      .dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
    9812              $C$DW$1709      .dwtag  DW_TAG_member
    9813                      .dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$48)
    9814                      .dwattr $C$DW$1709, DW_AT_name("gain")
    9815                      .dwattr $C$DW$1709, DW_AT_TI_symbol_name("_gain")
    9816                      .dwattr $C$DW$1709, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9817                      .dwattr $C$DW$1709, DW_AT_accessibility(DW_ACCESS_public)
    9818                      .dwendtag $C$DW$T$49
    9819              
    9820              $C$DW$T$321     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_DacData_t")
    9821                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$T$49)
    9822                      .dwattr $C$DW$T$321, DW_AT_language(DW_LANG_C)
    9823              $C$DW$T$322     .dwtag  DW_TAG_pointer_type
    9824                      .dwattr $C$DW$T$322, DW_AT_type(*$C$DW$T$321)
    9825                      .dwattr $C$DW$T$322, DW_AT_address_class(0x16)
    9826              $C$DW$1710      .dwtag  DW_TAG_TI_far_type
    9827                      .dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$322)
    9828              $C$DW$T$323     .dwtag  DW_TAG_const_type
    9829                      .dwattr $C$DW$T$323, DW_AT_type(*$C$DW$1710)
    9830              
    9831              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9832                      .dwattr $C$DW$T$86, DW_AT_name("_HAL_Obj_")
    9833                      .dwattr $C$DW$T$86, DW_AT_byte_size(0xb2)
    9834              $C$DW$1711      .dwtag  DW_TAG_member
    9835                      .dwattr $C$DW$1711, DW_AT_type(*$C$DW$T$51)
    9836                      .dwattr $C$DW$1711, DW_AT_name("adcHandle")
    9837                      .dwattr $C$DW$1711, DW_AT_TI_symbol_name("_adcHandle")
    9838                      .dwattr $C$DW$1711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9839                      .dwattr $C$DW$1711, DW_AT_accessibility(DW_ACCESS_public)
    9840              $C$DW$1712      .dwtag  DW_TAG_member
    9841                      .dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$53)
    9842                      .dwattr $C$DW$1712, DW_AT_name("clkHandle")
    9843                      .dwattr $C$DW$1712, DW_AT_TI_symbol_name("_clkHandle")
    9844                      .dwattr $C$DW$1712, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9845                      .dwattr $C$DW$1712, DW_AT_accessibility(DW_ACCESS_public)
    9846              $C$DW$1713      .dwtag  DW_TAG_member
    9847                      .dwattr $C$DW$1713, DW_AT_type(*$C$DW$T$55)
    9848                      .dwattr $C$DW$1713, DW_AT_name("cpuHandle")
    9849                      .dwattr $C$DW$1713, DW_AT_TI_symbol_name("_cpuHandle")
    9850                      .dwattr $C$DW$1713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9851                      .dwattr $C$DW$1713, DW_AT_accessibility(DW_ACCESS_public)
    9852              $C$DW$1714      .dwtag  DW_TAG_member
    9853                      .dwattr $C$DW$1714, DW_AT_type(*$C$DW$T$57)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  189

    9854                      .dwattr $C$DW$1714, DW_AT_name("flashHandle")
    9855                      .dwattr $C$DW$1714, DW_AT_TI_symbol_name("_flashHandle")
    9856                      .dwattr $C$DW$1714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9857                      .dwattr $C$DW$1714, DW_AT_accessibility(DW_ACCESS_public)
    9858              $C$DW$1715      .dwtag  DW_TAG_member
    9859                      .dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$59)
    9860                      .dwattr $C$DW$1715, DW_AT_name("gpioHandle")
    9861                      .dwattr $C$DW$1715, DW_AT_TI_symbol_name("_gpioHandle")
    9862                      .dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9863                      .dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
    9864              $C$DW$1716      .dwtag  DW_TAG_member
    9865                      .dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$62)
    9866                      .dwattr $C$DW$1716, DW_AT_name("offsetHandle_I")
    9867                      .dwattr $C$DW$1716, DW_AT_TI_symbol_name("_offsetHandle_I")
    9868                      .dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9869                      .dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
    9870              $C$DW$1717      .dwtag  DW_TAG_member
    9871                      .dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$64)
    9872                      .dwattr $C$DW$1717, DW_AT_name("offset_I")
    9873                      .dwattr $C$DW$1717, DW_AT_TI_symbol_name("_offset_I")
    9874                      .dwattr $C$DW$1717, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9875                      .dwattr $C$DW$1717, DW_AT_accessibility(DW_ACCESS_public)
    9876              $C$DW$1718      .dwtag  DW_TAG_member
    9877                      .dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$62)
    9878                      .dwattr $C$DW$1718, DW_AT_name("offsetHandle_V")
    9879                      .dwattr $C$DW$1718, DW_AT_TI_symbol_name("_offsetHandle_V")
    9880                      .dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9881                      .dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
    9882              $C$DW$1719      .dwtag  DW_TAG_member
    9883                      .dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$64)
    9884                      .dwattr $C$DW$1719, DW_AT_name("offset_V")
    9885                      .dwattr $C$DW$1719, DW_AT_TI_symbol_name("_offset_V")
    9886                      .dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9887                      .dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
    9888              $C$DW$1720      .dwtag  DW_TAG_member
    9889                      .dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$66)
    9890                      .dwattr $C$DW$1720, DW_AT_name("oscHandle")
    9891                      .dwattr $C$DW$1720, DW_AT_TI_symbol_name("_oscHandle")
    9892                      .dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    9893                      .dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
    9894              $C$DW$1721      .dwtag  DW_TAG_member
    9895                      .dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$68)
    9896                      .dwattr $C$DW$1721, DW_AT_name("pieHandle")
    9897                      .dwattr $C$DW$1721, DW_AT_TI_symbol_name("_pieHandle")
    9898                      .dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9899                      .dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
    9900              $C$DW$1722      .dwtag  DW_TAG_member
    9901                      .dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$70)
    9902                      .dwattr $C$DW$1722, DW_AT_name("pllHandle")
    9903                      .dwattr $C$DW$1722, DW_AT_TI_symbol_name("_pllHandle")
    9904                      .dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9905                      .dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
    9906              $C$DW$1723      .dwtag  DW_TAG_member
    9907                      .dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$73)
    9908                      .dwattr $C$DW$1723, DW_AT_name("pwmHandle")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  190

    9909                      .dwattr $C$DW$1723, DW_AT_TI_symbol_name("_pwmHandle")
    9910                      .dwattr $C$DW$1723, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    9911                      .dwattr $C$DW$1723, DW_AT_accessibility(DW_ACCESS_public)
    9912              $C$DW$1724      .dwtag  DW_TAG_member
    9913                      .dwattr $C$DW$1724, DW_AT_type(*$C$DW$T$73)
    9914                      .dwattr $C$DW$1724, DW_AT_name("pwmDacHandle")
    9915                      .dwattr $C$DW$1724, DW_AT_TI_symbol_name("_pwmDacHandle")
    9916                      .dwattr $C$DW$1724, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    9917                      .dwattr $C$DW$1724, DW_AT_accessibility(DW_ACCESS_public)
    9918              $C$DW$1725      .dwtag  DW_TAG_member
    9919                      .dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$75)
    9920                      .dwattr $C$DW$1725, DW_AT_name("pwrHandle")
    9921                      .dwattr $C$DW$1725, DW_AT_TI_symbol_name("_pwrHandle")
    9922                      .dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    9923                      .dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
    9924              $C$DW$1726      .dwtag  DW_TAG_member
    9925                      .dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$78)
    9926                      .dwattr $C$DW$1726, DW_AT_name("timerHandle")
    9927                      .dwattr $C$DW$1726, DW_AT_TI_symbol_name("_timerHandle")
    9928                      .dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    9929                      .dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
    9930              $C$DW$1727      .dwtag  DW_TAG_member
    9931                      .dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$80)
    9932                      .dwattr $C$DW$1727, DW_AT_name("i2cHandle")
    9933                      .dwattr $C$DW$1727, DW_AT_TI_symbol_name("_i2cHandle")
    9934                      .dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    9935                      .dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
    9936              $C$DW$1728      .dwtag  DW_TAG_member
    9937                      .dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$82)
    9938                      .dwattr $C$DW$1728, DW_AT_name("spiAHandle")
    9939                      .dwattr $C$DW$1728, DW_AT_TI_symbol_name("_spiAHandle")
    9940                      .dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9941                      .dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
    9942              $C$DW$1729      .dwtag  DW_TAG_member
    9943                      .dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$84)
    9944                      .dwattr $C$DW$1729, DW_AT_name("wdogHandle")
    9945                      .dwattr $C$DW$1729, DW_AT_TI_symbol_name("_wdogHandle")
    9946                      .dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    9947                      .dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
    9948              $C$DW$1730      .dwtag  DW_TAG_member
    9949                      .dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$85)
    9950                      .dwattr $C$DW$1730, DW_AT_name("adcBias")
    9951                      .dwattr $C$DW$1730, DW_AT_TI_symbol_name("_adcBias")
    9952                      .dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    9953                      .dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
    9954              $C$DW$1731      .dwtag  DW_TAG_member
    9955                      .dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$35)
    9956                      .dwattr $C$DW$1731, DW_AT_name("current_sf")
    9957                      .dwattr $C$DW$1731, DW_AT_TI_symbol_name("_current_sf")
    9958                      .dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    9959                      .dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
    9960              $C$DW$1732      .dwtag  DW_TAG_member
    9961                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$35)
    9962                      .dwattr $C$DW$1732, DW_AT_name("voltage_sf")
    9963                      .dwattr $C$DW$1732, DW_AT_TI_symbol_name("_voltage_sf")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  191

    9964                      .dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9965                      .dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
    9966              $C$DW$1733      .dwtag  DW_TAG_member
    9967                      .dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$33)
    9968                      .dwattr $C$DW$1733, DW_AT_name("numCurrentSensors")
    9969                      .dwattr $C$DW$1733, DW_AT_TI_symbol_name("_numCurrentSensors")
    9970                      .dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    9971                      .dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
    9972              $C$DW$1734      .dwtag  DW_TAG_member
    9973                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$33)
    9974                      .dwattr $C$DW$1734, DW_AT_name("numVoltageSensors")
    9975                      .dwattr $C$DW$1734, DW_AT_TI_symbol_name("_numVoltageSensors")
    9976                      .dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
    9977                      .dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
    9978                      .dwendtag $C$DW$T$86
    9979              
    9980              $C$DW$T$326     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    9981                      .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$86)
    9982                      .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
    9983              $C$DW$T$327     .dwtag  DW_TAG_pointer_type
    9984                      .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$326)
    9985                      .dwattr $C$DW$T$327, DW_AT_address_class(0x16)
    9986              $C$DW$T$328     .dwtag  DW_TAG_pointer_type
    9987                      .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$86)
    9988                      .dwattr $C$DW$T$328, DW_AT_address_class(0x16)
    9989              $C$DW$T$329     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    9990                      .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$328)
    9991                      .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
    9992              $C$DW$1735      .dwtag  DW_TAG_TI_far_type
    9993                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$329)
    9994              $C$DW$T$330     .dwtag  DW_TAG_const_type
    9995                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$1735)
    9996              
    9997              $C$DW$T$88      .dwtag  DW_TAG_structure_type
    9998                      .dwattr $C$DW$T$88, DW_AT_name("_MATH_vec3_")
    9999                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x06)
   10000              $C$DW$1736      .dwtag  DW_TAG_member
   10001                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$87)
   10002                      .dwattr $C$DW$1736, DW_AT_name("value")
   10003                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_value")
   10004                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10005                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
   10006                      .dwendtag $C$DW$T$88
   10007              
   10008              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   10009                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$88)
   10010                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   10011              
   10012              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   10013                      .dwattr $C$DW$T$92, DW_AT_name("_OFFSET_")
   10014                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x10)
   10015              $C$DW$1737      .dwtag  DW_TAG_member
   10016                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$35)
   10017                      .dwattr $C$DW$1737, DW_AT_name("value")
   10018                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_value")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  192

   10019                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10020                      .dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
   10021              $C$DW$1738      .dwtag  DW_TAG_member
   10022                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$35)
   10023                      .dwattr $C$DW$1738, DW_AT_name("bias")
   10024                      .dwattr $C$DW$1738, DW_AT_TI_symbol_name("_bias")
   10025                      .dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10026                      .dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
   10027              $C$DW$1739      .dwtag  DW_TAG_member
   10028                      .dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$89)
   10029                      .dwattr $C$DW$1739, DW_AT_name("filter")
   10030                      .dwattr $C$DW$1739, DW_AT_TI_symbol_name("_filter")
   10031                      .dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10032                      .dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
   10033              $C$DW$1740      .dwtag  DW_TAG_member
   10034                      .dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$91)
   10035                      .dwattr $C$DW$1740, DW_AT_name("filterHandle")
   10036                      .dwattr $C$DW$1740, DW_AT_TI_symbol_name("_filterHandle")
   10037                      .dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10038                      .dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
   10039                      .dwendtag $C$DW$T$92
   10040              
   10041              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
   10042                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$92)
   10043                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   10044              
   10045              $C$DW$T$64      .dwtag  DW_TAG_array_type
   10046                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   10047                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   10048                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   10049              $C$DW$1741      .dwtag  DW_TAG_subrange_type
   10050                      .dwattr $C$DW$1741, DW_AT_upper_bound(0x02)
   10051                      .dwendtag $C$DW$T$64
   10052              
   10053              
   10054              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   10055                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   10056                      .dwattr $C$DW$T$21, DW_AT_declaration
   10057                      .dwendtag $C$DW$T$21
   10058              
   10059              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   10060                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   10061                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
   10062              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
   10063                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   10064                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   10065              
   10066              $C$DW$T$62      .dwtag  DW_TAG_array_type
   10067                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   10068                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   10069                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   10070              $C$DW$1742      .dwtag  DW_TAG_subrange_type
   10071                      .dwattr $C$DW$1742, DW_AT_upper_bound(0x02)
   10072                      .dwendtag $C$DW$T$62
   10073              
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  193

   10074              
   10075              $C$DW$T$93      .dwtag  DW_TAG_structure_type
   10076                      .dwattr $C$DW$T$93, DW_AT_name("_OSC_Obj_")
   10077                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x03)
   10078              $C$DW$1743      .dwtag  DW_TAG_member
   10079                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$23)
   10080                      .dwattr $C$DW$1743, DW_AT_name("INTOSC1TRIM")
   10081                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   10082                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10083                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
   10084              $C$DW$1744      .dwtag  DW_TAG_member
   10085                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$23)
   10086                      .dwattr $C$DW$1744, DW_AT_name("rsvd_1")
   10087                      .dwattr $C$DW$1744, DW_AT_TI_symbol_name("_rsvd_1")
   10088                      .dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10089                      .dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
   10090              $C$DW$1745      .dwtag  DW_TAG_member
   10091                      .dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$23)
   10092                      .dwattr $C$DW$1745, DW_AT_name("INTOSC2TRIM")
   10093                      .dwattr $C$DW$1745, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   10094                      .dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10095                      .dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
   10096                      .dwendtag $C$DW$T$93
   10097              
   10098              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   10099                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$93)
   10100                      .dwattr $C$DW$T$65, DW_AT_address_class(0x16)
   10101              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
   10102                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   10103                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   10104              
   10105              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   10106                      .dwattr $C$DW$T$94, DW_AT_name("_PIE_IERIFR_t")
   10107                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x02)
   10108              $C$DW$1746      .dwtag  DW_TAG_member
   10109                      .dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$23)
   10110                      .dwattr $C$DW$1746, DW_AT_name("IER")
   10111                      .dwattr $C$DW$1746, DW_AT_TI_symbol_name("_IER")
   10112                      .dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10113                      .dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
   10114              $C$DW$1747      .dwtag  DW_TAG_member
   10115                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$23)
   10116                      .dwattr $C$DW$1747, DW_AT_name("IFR")
   10117                      .dwattr $C$DW$1747, DW_AT_TI_symbol_name("_IFR")
   10118                      .dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10119                      .dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
   10120                      .dwendtag $C$DW$T$94
   10121              
   10122              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
   10123                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   10124                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   10125              $C$DW$1748      .dwtag  DW_TAG_TI_far_type
   10126                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$95)
   10127              $C$DW$T$96      .dwtag  DW_TAG_volatile_type
   10128                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$1748)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  194

   10129              
   10130              $C$DW$T$97      .dwtag  DW_TAG_array_type
   10131                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
   10132                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   10133                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x18)
   10134              $C$DW$1749      .dwtag  DW_TAG_subrange_type
   10135                      .dwattr $C$DW$1749, DW_AT_upper_bound(0x0b)
   10136                      .dwendtag $C$DW$T$97
   10137              
   10138              
   10139              $C$DW$T$104     .dwtag  DW_TAG_structure_type
   10140                      .dwattr $C$DW$T$104, DW_AT_name("_PIE_Obj_")
   10141                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x639c)
   10142              $C$DW$1750      .dwtag  DW_TAG_member
   10143                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$23)
   10144                      .dwattr $C$DW$1750, DW_AT_name("PIECTRL")
   10145                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_PIECTRL")
   10146                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10147                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
   10148              $C$DW$1751      .dwtag  DW_TAG_member
   10149                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$23)
   10150                      .dwattr $C$DW$1751, DW_AT_name("PIEACK")
   10151                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_PIEACK")
   10152                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10153                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
   10154              $C$DW$1752      .dwtag  DW_TAG_member
   10155                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$97)
   10156                      .dwattr $C$DW$1752, DW_AT_name("PIEIER_PIEIFR")
   10157                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   10158                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10159                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
   10160              $C$DW$1753      .dwtag  DW_TAG_member
   10161                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$98)
   10162                      .dwattr $C$DW$1753, DW_AT_name("rsvd_1")
   10163                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_rsvd_1")
   10164                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10165                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
   10166              $C$DW$1754      .dwtag  DW_TAG_member
   10167                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$102)
   10168                      .dwattr $C$DW$1754, DW_AT_name("Reset")
   10169                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_Reset")
   10170                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   10171                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
   10172              $C$DW$1755      .dwtag  DW_TAG_member
   10173                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$102)
   10174                      .dwattr $C$DW$1755, DW_AT_name("INT1")
   10175                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_INT1")
   10176                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   10177                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
   10178              $C$DW$1756      .dwtag  DW_TAG_member
   10179                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$102)
   10180                      .dwattr $C$DW$1756, DW_AT_name("INT2")
   10181                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_INT2")
   10182                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   10183                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  195

   10184              $C$DW$1757      .dwtag  DW_TAG_member
   10185                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$102)
   10186                      .dwattr $C$DW$1757, DW_AT_name("INT3")
   10187                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_INT3")
   10188                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   10189                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
   10190              $C$DW$1758      .dwtag  DW_TAG_member
   10191                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$102)
   10192                      .dwattr $C$DW$1758, DW_AT_name("INT4")
   10193                      .dwattr $C$DW$1758, DW_AT_TI_symbol_name("_INT4")
   10194                      .dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   10195                      .dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
   10196              $C$DW$1759      .dwtag  DW_TAG_member
   10197                      .dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$102)
   10198                      .dwattr $C$DW$1759, DW_AT_name("INT5")
   10199                      .dwattr $C$DW$1759, DW_AT_TI_symbol_name("_INT5")
   10200                      .dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   10201                      .dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
   10202              $C$DW$1760      .dwtag  DW_TAG_member
   10203                      .dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$102)
   10204                      .dwattr $C$DW$1760, DW_AT_name("INT6")
   10205                      .dwattr $C$DW$1760, DW_AT_TI_symbol_name("_INT6")
   10206                      .dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   10207                      .dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
   10208              $C$DW$1761      .dwtag  DW_TAG_member
   10209                      .dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$102)
   10210                      .dwattr $C$DW$1761, DW_AT_name("INT7")
   10211                      .dwattr $C$DW$1761, DW_AT_TI_symbol_name("_INT7")
   10212                      .dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   10213                      .dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
   10214              $C$DW$1762      .dwtag  DW_TAG_member
   10215                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$102)
   10216                      .dwattr $C$DW$1762, DW_AT_name("INT8")
   10217                      .dwattr $C$DW$1762, DW_AT_TI_symbol_name("_INT8")
   10218                      .dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   10219                      .dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
   10220              $C$DW$1763      .dwtag  DW_TAG_member
   10221                      .dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$102)
   10222                      .dwattr $C$DW$1763, DW_AT_name("INT9")
   10223                      .dwattr $C$DW$1763, DW_AT_TI_symbol_name("_INT9")
   10224                      .dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   10225                      .dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
   10226              $C$DW$1764      .dwtag  DW_TAG_member
   10227                      .dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$102)
   10228                      .dwattr $C$DW$1764, DW_AT_name("INT10")
   10229                      .dwattr $C$DW$1764, DW_AT_TI_symbol_name("_INT10")
   10230                      .dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   10231                      .dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
   10232              $C$DW$1765      .dwtag  DW_TAG_member
   10233                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$102)
   10234                      .dwattr $C$DW$1765, DW_AT_name("INT11")
   10235                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_INT11")
   10236                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10237                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
   10238              $C$DW$1766      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:15:36 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1089610                              PAGE  196

   10239                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$102)
   10240                      .dwattr $C$DW$1766, DW_AT_name("INT12")
   10241                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_INT12")
   10242                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10243                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
   10244              $C$DW$1767      .dwtag  DW_TAG_member
   10245                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$102)
   10246                      .dwattr $C$DW$1767, DW_AT_name("TINT1")
   10247                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_TINT1")
   10248                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10249                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
   10250              $C$DW$1768      .dwtag  DW_TAG_member
   10251                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$102)
   10252                      .dwattr $C$DW$1768, DW_AT_name("TINT2")
   10253                      .dwattr $C$DW$1768, DW_AT_TI_symbol_name("_TINT2")
   10254                      .dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10255                      .dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
   10256              $C$DW$1769      .dwtag  DW_TAG_member
   10257                      .dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$102)
