TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jul 11 20:23:14 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/solutions/instaspin_foc/src/proj_lab10e.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  133

    6627              
    6628              $C$DW$T$272     .dwtag  DW_TAG_enumeration_type
    6629                      .dwattr $C$DW$T$272, DW_AT_byte_size(0x01)
    6630              $C$DW$785       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6631              $C$DW$786       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6632              $C$DW$787       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6633                      .dwendtag $C$DW$T$272
    6634              
    6635              $C$DW$T$273     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6636                      .dwattr $C$DW$T$273, DW_AT_type(*$C$DW$T$272)
    6637                      .dwattr $C$DW$T$273, DW_AT_language(DW_LANG_C)
    6638              
    6639              $C$DW$T$275     .dwtag  DW_TAG_enumeration_type
    6640                      .dwattr $C$DW$T$275, DW_AT_byte_size(0x01)
    6641              $C$DW$788       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH0"), DW_AT_const_value(0x00)
    6642              $C$DW$789       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH1"), DW_AT_const_value(0x01)
    6643              $C$DW$790       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH2"), DW_AT_const_value(0x02)
    6644              $C$DW$791       .dwtag  DW_TAG_enumerator, DW_AT_name("LDC161x_ChNum_CH3"), DW_AT_const_value(0x03)
    6645                      .dwendtag $C$DW$T$275
    6646              
    6647              $C$DW$T$276     .dwtag  DW_TAG_typedef, DW_AT_name("LDC161x_ChNum_e")
    6648                      .dwattr $C$DW$T$276, DW_AT_type(*$C$DW$T$275)
    6649                      .dwattr $C$DW$T$276, DW_AT_language(DW_LANG_C)
    6650              $C$DW$792       .dwtag  DW_TAG_TI_far_type
    6651                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$276)
    6652              $C$DW$T$277     .dwtag  DW_TAG_const_type
    6653                      .dwattr $C$DW$T$277, DW_AT_type(*$C$DW$792)
    6654              
    6655              $C$DW$T$278     .dwtag  DW_TAG_enumeration_type
    6656                      .dwattr $C$DW$T$278, DW_AT_byte_size(0x01)
    6657              $C$DW$793       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port0"), DW_AT_const_value(0x00)
    6658              $C$DW$794       .dwtag  DW_TAG_enumerator, DW_AT_name("PCA955x_PortNum_Port1"), DW_AT_const_value(0x01)
    6659                      .dwendtag $C$DW$T$278
    6660              
    6661              $C$DW$T$279     .dwtag  DW_TAG_typedef, DW_AT_name("PCA955x_PortNum_e")
    6662                      .dwattr $C$DW$T$279, DW_AT_type(*$C$DW$T$278)
    6663                      .dwattr $C$DW$T$279, DW_AT_language(DW_LANG_C)
    6664              
    6665              $C$DW$T$280     .dwtag  DW_TAG_enumeration_type
    6666                      .dwattr $C$DW$T$280, DW_AT_byte_size(0x01)
    6667              $C$DW$795       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    6668              $C$DW$796       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    6669                      .dwendtag $C$DW$T$280
    6670              
    6671              $C$DW$T$281     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    6672                      .dwattr $C$DW$T$281, DW_AT_type(*$C$DW$T$280)
    6673                      .dwattr $C$DW$T$281, DW_AT_language(DW_LANG_C)
    6674              
    6675              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6676                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    6677                      .dwattr $C$DW$T$19, DW_AT_declaration
    6678                      .dwendtag $C$DW$T$19
    6679              
    6680              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    6681                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  134

    6682                      .dwattr $C$DW$T$132, DW_AT_address_class(0x16)
    6683              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    6684                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    6685                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    6686              
    6687              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    6688                      .dwattr $C$DW$T$20, DW_AT_name("LDC161x_REG_Obj")
    6689                      .dwattr $C$DW$T$20, DW_AT_declaration
    6690                      .dwendtag $C$DW$T$20
    6691              
    6692              $C$DW$T$147     .dwtag  DW_TAG_pointer_type
    6693                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$20)
    6694                      .dwattr $C$DW$T$147, DW_AT_address_class(0x16)
    6695              $C$DW$T$148     .dwtag  DW_TAG_typedef, DW_AT_name("LDC_Handle")
    6696                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    6697                      .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    6698              
    6699              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    6700                      .dwattr $C$DW$T$32, DW_AT_name("_ADC_Obj_")
    6701                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x6650)
    6702              $C$DW$797       .dwtag  DW_TAG_member
    6703                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$26)
    6704                      .dwattr $C$DW$797, DW_AT_name("ADCRESULT")
    6705                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_ADCRESULT")
    6706                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6707                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    6708              $C$DW$798       .dwtag  DW_TAG_member
    6709                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$27)
    6710                      .dwattr $C$DW$798, DW_AT_name("resvd_1")
    6711                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_resvd_1")
    6712                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6713                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    6714              $C$DW$799       .dwtag  DW_TAG_member
    6715                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$25)
    6716                      .dwattr $C$DW$799, DW_AT_name("ADCCTL1")
    6717                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_ADCCTL1")
    6718                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6719                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    6720              $C$DW$800       .dwtag  DW_TAG_member
    6721                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$25)
    6722                      .dwattr $C$DW$800, DW_AT_name("ADCCTL2")
    6723                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_ADCCTL2")
    6724                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6725                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    6726              $C$DW$801       .dwtag  DW_TAG_member
    6727                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$28)
    6728                      .dwattr $C$DW$801, DW_AT_name("rsvd_2")
    6729                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_rsvd_2")
    6730                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6731                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    6732              $C$DW$802       .dwtag  DW_TAG_member
    6733                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$25)
    6734                      .dwattr $C$DW$802, DW_AT_name("ADCINTFLG")
    6735                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_ADCINTFLG")
    6736                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  135

    6737                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    6738              $C$DW$803       .dwtag  DW_TAG_member
    6739                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$25)
    6740                      .dwattr $C$DW$803, DW_AT_name("ADCINTFLGCLR")
    6741                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6742                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6743                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    6744              $C$DW$804       .dwtag  DW_TAG_member
    6745                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$25)
    6746                      .dwattr $C$DW$804, DW_AT_name("ADCINTOVF")
    6747                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_ADCINTOVF")
    6748                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6749                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    6750              $C$DW$805       .dwtag  DW_TAG_member
    6751                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$25)
    6752                      .dwattr $C$DW$805, DW_AT_name("ADCINTOVFCLR")
    6753                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6754                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6755                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    6756              $C$DW$806       .dwtag  DW_TAG_member
    6757                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$29)
    6758                      .dwattr $C$DW$806, DW_AT_name("INTSELxNy")
    6759                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_INTSELxNy")
    6760                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6761                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    6762              $C$DW$807       .dwtag  DW_TAG_member
    6763                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$30)
    6764                      .dwattr $C$DW$807, DW_AT_name("rsvd_3")
    6765                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_rsvd_3")
    6766                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6767                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    6768              $C$DW$808       .dwtag  DW_TAG_member
    6769                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$25)
    6770                      .dwattr $C$DW$808, DW_AT_name("SOCPRICTRL")
    6771                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6772                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6773                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    6774              $C$DW$809       .dwtag  DW_TAG_member
    6775                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$25)
    6776                      .dwattr $C$DW$809, DW_AT_name("rsvd_4")
    6777                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_rsvd_4")
    6778                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6779                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    6780              $C$DW$810       .dwtag  DW_TAG_member
    6781                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$25)
    6782                      .dwattr $C$DW$810, DW_AT_name("ADCSAMPLEMODE")
    6783                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6784                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6785                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    6786              $C$DW$811       .dwtag  DW_TAG_member
    6787                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$25)
    6788                      .dwattr $C$DW$811, DW_AT_name("rsvd_5")
    6789                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_rsvd_5")
    6790                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6791                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  136

    6792              $C$DW$812       .dwtag  DW_TAG_member
    6793                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$25)
    6794                      .dwattr $C$DW$812, DW_AT_name("ADCINTSOCSEL1")
    6795                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6796                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6797                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    6798              $C$DW$813       .dwtag  DW_TAG_member
    6799                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$25)
    6800                      .dwattr $C$DW$813, DW_AT_name("ADCINTSOCSEL2")
    6801                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6802                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6803                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    6804              $C$DW$814       .dwtag  DW_TAG_member
    6805                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$28)
    6806                      .dwattr $C$DW$814, DW_AT_name("rsvd_6")
    6807                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_rsvd_6")
    6808                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6809                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    6810              $C$DW$815       .dwtag  DW_TAG_member
    6811                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$25)
    6812                      .dwattr $C$DW$815, DW_AT_name("ADCSOCFLG1")
    6813                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6814                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6815                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    6816              $C$DW$816       .dwtag  DW_TAG_member
    6817                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$25)
    6818                      .dwattr $C$DW$816, DW_AT_name("rsvd_7")
    6819                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_rsvd_7")
    6820                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6821                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    6822              $C$DW$817       .dwtag  DW_TAG_member
    6823                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$25)
    6824                      .dwattr $C$DW$817, DW_AT_name("ADCSOCFRC1")
    6825                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6826                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6827                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    6828              $C$DW$818       .dwtag  DW_TAG_member
    6829                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$25)
    6830                      .dwattr $C$DW$818, DW_AT_name("rsvd_8")
    6831                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_rsvd_8")
    6832                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6833                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    6834              $C$DW$819       .dwtag  DW_TAG_member
    6835                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$25)
    6836                      .dwattr $C$DW$819, DW_AT_name("ADCSOCOVF1")
    6837                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6838                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6839                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    6840              $C$DW$820       .dwtag  DW_TAG_member
    6841                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$25)
    6842                      .dwattr $C$DW$820, DW_AT_name("rsvd_9")
    6843                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_rsvd_9")
    6844                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6845                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    6846              $C$DW$821       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  137

    6847                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$25)
    6848                      .dwattr $C$DW$821, DW_AT_name("ADCSOCOVFCLR1")
    6849                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6850                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6851                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    6852              $C$DW$822       .dwtag  DW_TAG_member
    6853                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$25)
    6854                      .dwattr $C$DW$822, DW_AT_name("rsvd_10")
    6855                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_rsvd_10")
    6856                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6857                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    6858              $C$DW$823       .dwtag  DW_TAG_member
    6859                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$26)
    6860                      .dwattr $C$DW$823, DW_AT_name("ADCSOCxCTL")
    6861                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6862                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6863                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    6864              $C$DW$824       .dwtag  DW_TAG_member
    6865                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$26)
    6866                      .dwattr $C$DW$824, DW_AT_name("rsvd_11")
    6867                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_rsvd_11")
    6868                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6869                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    6870              $C$DW$825       .dwtag  DW_TAG_member
    6871                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$25)
    6872                      .dwattr $C$DW$825, DW_AT_name("ADCREFTRIM")
    6873                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6874                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6875                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    6876              $C$DW$826       .dwtag  DW_TAG_member
    6877                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$25)
    6878                      .dwattr $C$DW$826, DW_AT_name("ADCOFFTRIM")
    6879                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6880                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6881                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    6882              $C$DW$827       .dwtag  DW_TAG_member
    6883                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$31)
    6884                      .dwattr $C$DW$827, DW_AT_name("resvd_12")
    6885                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_resvd_12")
    6886                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6887                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    6888              $C$DW$828       .dwtag  DW_TAG_member
    6889                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$25)
    6890                      .dwattr $C$DW$828, DW_AT_name("ADCREV")
    6891                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_ADCREV")
    6892                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6893                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    6894                      .dwendtag $C$DW$T$32
    6895              
    6896              $C$DW$T$283     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    6897                      .dwattr $C$DW$T$283, DW_AT_type(*$C$DW$T$32)
    6898                      .dwattr $C$DW$T$283, DW_AT_language(DW_LANG_C)
    6899              $C$DW$T$105     .dwtag  DW_TAG_pointer_type
    6900                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$32)
    6901                      .dwattr $C$DW$T$105, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  138

    6902              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6903                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
    6904                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    6905              
    6906              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6907                      .dwattr $C$DW$T$44, DW_AT_name("_BRAKE_Obj_")
    6908                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x2c)
    6909              $C$DW$829       .dwtag  DW_TAG_member
    6910                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$34)
    6911                      .dwattr $C$DW$829, DW_AT_name("state")
    6912                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_state")
    6913                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6914                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    6915              $C$DW$830       .dwtag  DW_TAG_member
    6916                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$36)
    6917                      .dwattr $C$DW$830, DW_AT_name("pidHandle_Ibrake")
    6918                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_pidHandle_Ibrake")
    6919                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6920                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    6921              $C$DW$831       .dwtag  DW_TAG_member
    6922                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$37)
    6923                      .dwattr $C$DW$831, DW_AT_name("pid_Ibrake")
    6924                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_pid_Ibrake")
    6925                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6926                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    6927              $C$DW$832       .dwtag  DW_TAG_member
    6928                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$38)
    6929                      .dwattr $C$DW$832, DW_AT_name("Kp_Ibrake")
    6930                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_Kp_Ibrake")
    6931                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6932                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    6933              $C$DW$833       .dwtag  DW_TAG_member
    6934                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$38)
    6935                      .dwattr $C$DW$833, DW_AT_name("Ki_Ibrake")
    6936                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_Ki_Ibrake")
    6937                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6938                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    6939              $C$DW$834       .dwtag  DW_TAG_member
    6940                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$38)
    6941                      .dwattr $C$DW$834, DW_AT_name("Kd_Ibrake")
    6942                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_Kd_Ibrake")
    6943                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6944                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    6945              $C$DW$835       .dwtag  DW_TAG_member
    6946                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$38)
    6947                      .dwattr $C$DW$835, DW_AT_name("Ibrake_ref")
    6948                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_Ibrake_ref")
    6949                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6950                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    6951              $C$DW$836       .dwtag  DW_TAG_member
    6952                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$38)
    6953                      .dwattr $C$DW$836, DW_AT_name("Ibrake_fbk")
    6954                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_Ibrake_fbk")
    6955                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6956                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  139

    6957              $C$DW$837       .dwtag  DW_TAG_member
    6958                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$39)
    6959                      .dwattr $C$DW$837, DW_AT_name("AdcValue_I")
    6960                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_AdcValue_I")
    6961                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6962                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    6963              $C$DW$838       .dwtag  DW_TAG_member
    6964                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$38)
    6965                      .dwattr $C$DW$838, DW_AT_name("Ibrake_out")
    6966                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_Ibrake_out")
    6967                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6968                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    6969              $C$DW$839       .dwtag  DW_TAG_member
    6970                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$38)
    6971                      .dwattr $C$DW$839, DW_AT_name("Irated")
    6972                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_Irated")
    6973                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6974                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    6975              $C$DW$840       .dwtag  DW_TAG_member
    6976                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$38)
    6977                      .dwattr $C$DW$840, DW_AT_name("current_rate")
    6978                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_current_rate")
    6979                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6980                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    6981              $C$DW$841       .dwtag  DW_TAG_member
    6982                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$41)
    6983                      .dwattr $C$DW$841, DW_AT_name("brake_type")
    6984                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_brake_type")
    6985                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6986                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    6987              $C$DW$842       .dwtag  DW_TAG_member
    6988                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$42)
    6989                      .dwattr $C$DW$842, DW_AT_name("counter_current")
    6990                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_counter_current")
    6991                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6992                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    6993              $C$DW$843       .dwtag  DW_TAG_member
    6994                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$43)
    6995                      .dwattr $C$DW$843, DW_AT_name("flag_enableBrake")
    6996                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_flag_enableBrake")
    6997                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6998                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    6999              $C$DW$844       .dwtag  DW_TAG_member
    7000                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$43)
    7001                      .dwattr $C$DW$844, DW_AT_name("flag_enableOffset")
    7002                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_flag_enableOffset")
    7003                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    7004                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    7005                      .dwendtag $C$DW$T$44
    7006              
    7007              $C$DW$T$284     .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Obj")
    7008                      .dwattr $C$DW$T$284, DW_AT_type(*$C$DW$T$44)
    7009                      .dwattr $C$DW$T$284, DW_AT_language(DW_LANG_C)
    7010              $C$DW$T$285     .dwtag  DW_TAG_pointer_type
    7011                      .dwattr $C$DW$T$285, DW_AT_type(*$C$DW$T$44)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  140

    7012                      .dwattr $C$DW$T$285, DW_AT_address_class(0x16)
    7013              $C$DW$T$286     .dwtag  DW_TAG_typedef, DW_AT_name("BRAKE_Handle")
    7014                      .dwattr $C$DW$T$286, DW_AT_type(*$C$DW$T$285)
    7015                      .dwattr $C$DW$T$286, DW_AT_language(DW_LANG_C)
    7016              
    7017              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    7018                      .dwattr $C$DW$T$46, DW_AT_name("_CLARKE_Obj_")
    7019                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x06)
    7020              $C$DW$845       .dwtag  DW_TAG_member
    7021                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$38)
    7022                      .dwattr $C$DW$845, DW_AT_name("alpha_sf")
    7023                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_alpha_sf")
    7024                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7025                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    7026              $C$DW$846       .dwtag  DW_TAG_member
    7027                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$38)
    7028                      .dwattr $C$DW$846, DW_AT_name("beta_sf")
    7029                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_beta_sf")
    7030                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7031                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    7032              $C$DW$847       .dwtag  DW_TAG_member
    7033                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$45)
    7034                      .dwattr $C$DW$847, DW_AT_name("numSensors")
    7035                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_numSensors")
    7036                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7037                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    7038                      .dwendtag $C$DW$T$46
    7039              
    7040              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    7041                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$46)
    7042                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    7043              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    7044                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$46)
    7045                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    7046              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    7047                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    7048                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    7049              
    7050              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    7051                      .dwattr $C$DW$T$47, DW_AT_name("_CLK_DIV_t_")
    7052                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    7053              $C$DW$848       .dwtag  DW_TAG_member
    7054                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$24)
    7055                      .dwattr $C$DW$848, DW_AT_name("FREF_DIVIDER")
    7056                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_FREF_DIVIDER")
    7057                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7058                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    7059              $C$DW$849       .dwtag  DW_TAG_member
    7060                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$24)
    7061                      .dwattr $C$DW$849, DW_AT_name("FIN_DIVIDER")
    7062                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_FIN_DIVIDER")
    7063                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7064                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    7065                      .dwendtag $C$DW$T$47
    7066              
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  141

    7067              $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_DIV_t_")
    7068                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$47)
    7069                      .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    7070              
    7071              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    7072                      .dwattr $C$DW$T$49, DW_AT_name("_CLK_Obj_")
    7073                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x11)
    7074              $C$DW$850       .dwtag  DW_TAG_member
    7075                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$25)
    7076                      .dwattr $C$DW$850, DW_AT_name("XCLK")
    7077                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_XCLK")
    7078                      .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7079                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
    7080              $C$DW$851       .dwtag  DW_TAG_member
    7081                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$25)
    7082                      .dwattr $C$DW$851, DW_AT_name("rsvd_1")
    7083                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_rsvd_1")
    7084                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7085                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
    7086              $C$DW$852       .dwtag  DW_TAG_member
    7087                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$25)
    7088                      .dwattr $C$DW$852, DW_AT_name("CLKCTL")
    7089                      .dwattr $C$DW$852, DW_AT_TI_symbol_name("_CLKCTL")
    7090                      .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7091                      .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
    7092              $C$DW$853       .dwtag  DW_TAG_member
    7093                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$48)
    7094                      .dwattr $C$DW$853, DW_AT_name("rsvd_2")
    7095                      .dwattr $C$DW$853, DW_AT_TI_symbol_name("_rsvd_2")
    7096                      .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7097                      .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
    7098              $C$DW$854       .dwtag  DW_TAG_member
    7099                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$25)
    7100                      .dwattr $C$DW$854, DW_AT_name("LOSPCP")
    7101                      .dwattr $C$DW$854, DW_AT_TI_symbol_name("_LOSPCP")
    7102                      .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7103                      .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
    7104              $C$DW$855       .dwtag  DW_TAG_member
    7105                      .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$25)
    7106                      .dwattr $C$DW$855, DW_AT_name("PCLKCR0")
    7107                      .dwattr $C$DW$855, DW_AT_TI_symbol_name("_PCLKCR0")
    7108                      .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7109                      .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
    7110              $C$DW$856       .dwtag  DW_TAG_member
    7111                      .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$25)
    7112                      .dwattr $C$DW$856, DW_AT_name("PCLKCR1")
    7113                      .dwattr $C$DW$856, DW_AT_TI_symbol_name("_PCLKCR1")
    7114                      .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7115                      .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
    7116              $C$DW$857       .dwtag  DW_TAG_member
    7117                      .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$28)
    7118                      .dwattr $C$DW$857, DW_AT_name("rsvd_3")
    7119                      .dwattr $C$DW$857, DW_AT_TI_symbol_name("_rsvd_3")
    7120                      .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7121                      .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  142

    7122              $C$DW$858       .dwtag  DW_TAG_member
    7123                      .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$25)
    7124                      .dwattr $C$DW$858, DW_AT_name("PCLKCR3")
    7125                      .dwattr $C$DW$858, DW_AT_TI_symbol_name("_PCLKCR3")
    7126                      .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7127                      .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
    7128                      .dwendtag $C$DW$T$49
    7129              
    7130              $C$DW$T$107     .dwtag  DW_TAG_pointer_type
    7131                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$49)
    7132                      .dwattr $C$DW$T$107, DW_AT_address_class(0x16)
    7133              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    7134                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    7135                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    7136              
    7137              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    7138                      .dwattr $C$DW$T$50, DW_AT_name("_CPU_Obj_")
    7139                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    7140              $C$DW$859       .dwtag  DW_TAG_member
    7141                      .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$45)
    7142                      .dwattr $C$DW$859, DW_AT_name("tmp")
    7143                      .dwattr $C$DW$859, DW_AT_TI_symbol_name("_tmp")
    7144                      .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7145                      .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
    7146                      .dwendtag $C$DW$T$50
    7147              
    7148              $C$DW$T$109     .dwtag  DW_TAG_pointer_type
    7149                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$50)
    7150                      .dwattr $C$DW$T$109, DW_AT_address_class(0x16)
    7151              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    7152                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    7153                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    7154              
    7155              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    7156                      .dwattr $C$DW$T$52, DW_AT_name("_CPU_TIME_Obj_")
    7157                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x18)
    7158              $C$DW$860       .dwtag  DW_TAG_member
    7159                      .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$24)
    7160                      .dwattr $C$DW$860, DW_AT_name("pwm_period")
    7161                      .dwattr $C$DW$860, DW_AT_TI_symbol_name("_pwm_period")
    7162                      .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7163                      .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
    7164              $C$DW$861       .dwtag  DW_TAG_member
    7165                      .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$51)
    7166                      .dwattr $C$DW$861, DW_AT_name("timer_cnt_now")
    7167                      .dwattr $C$DW$861, DW_AT_TI_symbol_name("_timer_cnt_now")
    7168                      .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7169                      .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
    7170              $C$DW$862       .dwtag  DW_TAG_member
    7171                      .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$51)
    7172                      .dwattr $C$DW$862, DW_AT_name("timer_cnt_prev")
    7173                      .dwattr $C$DW$862, DW_AT_TI_symbol_name("_timer_cnt_prev")
    7174                      .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7175                      .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
    7176              $C$DW$863       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  143

    7177                      .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$51)
    7178                      .dwattr $C$DW$863, DW_AT_name("timer_delta_now")
    7179                      .dwattr $C$DW$863, DW_AT_TI_symbol_name("_timer_delta_now")
    7180                      .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7181                      .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
    7182              $C$DW$864       .dwtag  DW_TAG_member
    7183                      .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$51)
    7184                      .dwattr $C$DW$864, DW_AT_name("timer_delta_prev")
    7185                      .dwattr $C$DW$864, DW_AT_TI_symbol_name("_timer_delta_prev")
    7186                      .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7187                      .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
    7188              $C$DW$865       .dwtag  DW_TAG_member
    7189                      .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$51)
    7190                      .dwattr $C$DW$865, DW_AT_name("timer_delta_min")
    7191                      .dwattr $C$DW$865, DW_AT_TI_symbol_name("_timer_delta_min")
    7192                      .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7193                      .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
    7194              $C$DW$866       .dwtag  DW_TAG_member
    7195                      .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$51)
    7196                      .dwattr $C$DW$866, DW_AT_name("timer_delta_max")
    7197                      .dwattr $C$DW$866, DW_AT_TI_symbol_name("_timer_delta_max")
    7198                      .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7199                      .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
    7200              $C$DW$867       .dwtag  DW_TAG_member
    7201                      .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$51)
    7202                      .dwattr $C$DW$867, DW_AT_name("timer_delta_avg")
    7203                      .dwattr $C$DW$867, DW_AT_TI_symbol_name("_timer_delta_avg")
    7204                      .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7205                      .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
    7206              $C$DW$868       .dwtag  DW_TAG_member
    7207                      .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$51)
    7208                      .dwattr $C$DW$868, DW_AT_name("timer_band_max")
    7209                      .dwattr $C$DW$868, DW_AT_TI_symbol_name("_timer_band_max")
    7210                      .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7211                      .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
    7212              $C$DW$869       .dwtag  DW_TAG_member
    7213                      .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$51)
    7214                      .dwattr $C$DW$869, DW_AT_name("timer_delta_CntAcc")
    7215                      .dwattr $C$DW$869, DW_AT_TI_symbol_name("_timer_delta_CntAcc")
    7216                      .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7217                      .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
    7218              $C$DW$870       .dwtag  DW_TAG_member
    7219                      .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$51)
    7220                      .dwattr $C$DW$870, DW_AT_name("timer_delta_AccNum")
    7221                      .dwattr $C$DW$870, DW_AT_TI_symbol_name("_timer_delta_AccNum")
    7222                      .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7223                      .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
    7224              $C$DW$871       .dwtag  DW_TAG_member
    7225                      .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$43)
    7226                      .dwattr $C$DW$871, DW_AT_name("flag_resetStatus")
    7227                      .dwattr $C$DW$871, DW_AT_TI_symbol_name("_flag_resetStatus")
    7228                      .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7229                      .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
    7230                      .dwendtag $C$DW$T$52
    7231              
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  144

    7232              $C$DW$T$292     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_TIME_Obj")
    7233                      .dwattr $C$DW$T$292, DW_AT_type(*$C$DW$T$52)
    7234                      .dwattr $C$DW$T$292, DW_AT_language(DW_LANG_C)
    7235              $C$DW$T$293     .dwtag  DW_TAG_pointer_type
    7236                      .dwattr $C$DW$T$293, DW_AT_type(*$C$DW$T$292)
    7237                      .dwattr $C$DW$T$293, DW_AT_address_class(0x16)
    7238              $C$DW$T$294     .dwtag  DW_TAG_pointer_type
    7239                      .dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$52)
    7240                      .dwattr $C$DW$T$294, DW_AT_address_class(0x16)
    7241              $C$DW$T$295     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_TIME_Handle")
    7242                      .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$294)
    7243                      .dwattr $C$DW$T$295, DW_AT_language(DW_LANG_C)
    7244              
    7245              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    7246                      .dwattr $C$DW$T$79, DW_AT_name("_CTRL_Obj_")
    7247                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x108)
    7248              $C$DW$872       .dwtag  DW_TAG_member
    7249                      .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$53)
    7250                      .dwattr $C$DW$872, DW_AT_name("version")
    7251                      .dwattr $C$DW$872, DW_AT_TI_symbol_name("_version")
    7252                      .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7253                      .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
    7254              $C$DW$873       .dwtag  DW_TAG_member
    7255                      .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$55)
    7256                      .dwattr $C$DW$873, DW_AT_name("state")
    7257                      .dwattr $C$DW$873, DW_AT_TI_symbol_name("_state")
    7258                      .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7259                      .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
    7260              $C$DW$874       .dwtag  DW_TAG_member
    7261                      .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$55)
    7262                      .dwattr $C$DW$874, DW_AT_name("prevState")
    7263                      .dwattr $C$DW$874, DW_AT_TI_symbol_name("_prevState")
    7264                      .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7265                      .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
    7266              $C$DW$875       .dwtag  DW_TAG_member
    7267                      .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$57)
    7268                      .dwattr $C$DW$875, DW_AT_name("errorCode")
    7269                      .dwattr $C$DW$875, DW_AT_TI_symbol_name("_errorCode")
    7270                      .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7271                      .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
    7272              $C$DW$876       .dwtag  DW_TAG_member
    7273                      .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$59)
    7274                      .dwattr $C$DW$876, DW_AT_name("clarkeHandle_I")
    7275                      .dwattr $C$DW$876, DW_AT_TI_symbol_name("_clarkeHandle_I")
    7276                      .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7277                      .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
    7278              $C$DW$877       .dwtag  DW_TAG_member
    7279                      .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$60)
    7280                      .dwattr $C$DW$877, DW_AT_name("clarke_I")
    7281                      .dwattr $C$DW$877, DW_AT_TI_symbol_name("_clarke_I")
    7282                      .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7283                      .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
    7284              $C$DW$878       .dwtag  DW_TAG_member
    7285                      .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$59)
    7286                      .dwattr $C$DW$878, DW_AT_name("clarkeHandle_V")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  145

    7287                      .dwattr $C$DW$878, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7288                      .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7289                      .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
    7290              $C$DW$879       .dwtag  DW_TAG_member
    7291                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$60)
    7292                      .dwattr $C$DW$879, DW_AT_name("clarke_V")
    7293                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_clarke_V")
    7294                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7295                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
    7296              $C$DW$880       .dwtag  DW_TAG_member
    7297                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$62)
    7298                      .dwattr $C$DW$880, DW_AT_name("estHandle")
    7299                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_estHandle")
    7300                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7301                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
    7302              $C$DW$881       .dwtag  DW_TAG_member
    7303                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$64)
    7304                      .dwattr $C$DW$881, DW_AT_name("parkHandle")
    7305                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_parkHandle")
    7306                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7307                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    7308              $C$DW$882       .dwtag  DW_TAG_member
    7309                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$65)
    7310                      .dwattr $C$DW$882, DW_AT_name("park")
    7311                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_park")
    7312                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7313                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    7314              $C$DW$883       .dwtag  DW_TAG_member
    7315                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$36)
    7316                      .dwattr $C$DW$883, DW_AT_name("pidHandle_Id")
    7317                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_pidHandle_Id")
    7318                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7319                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    7320              $C$DW$884       .dwtag  DW_TAG_member
    7321                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$37)
    7322                      .dwattr $C$DW$884, DW_AT_name("pid_Id")
    7323                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_pid_Id")
    7324                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7325                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    7326              $C$DW$885       .dwtag  DW_TAG_member
    7327                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$36)
    7328                      .dwattr $C$DW$885, DW_AT_name("pidHandle_Iq")
    7329                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7330                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7331                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    7332              $C$DW$886       .dwtag  DW_TAG_member
    7333                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$37)
    7334                      .dwattr $C$DW$886, DW_AT_name("pid_Iq")
    7335                      .dwattr $C$DW$886, DW_AT_TI_symbol_name("_pid_Iq")
    7336                      .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7337                      .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
    7338              $C$DW$887       .dwtag  DW_TAG_member
    7339                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$36)
    7340                      .dwattr $C$DW$887, DW_AT_name("pidHandle_spd")
    7341                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_pidHandle_spd")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  146

    7342                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7343                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
    7344              $C$DW$888       .dwtag  DW_TAG_member
    7345                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$37)
    7346                      .dwattr $C$DW$888, DW_AT_name("pid_spd")
    7347                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_pid_spd")
    7348                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7349                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
    7350              $C$DW$889       .dwtag  DW_TAG_member
    7351                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$67)
    7352                      .dwattr $C$DW$889, DW_AT_name("iparkHandle")
    7353                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_iparkHandle")
    7354                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7355                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
    7356              $C$DW$890       .dwtag  DW_TAG_member
    7357                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$68)
    7358                      .dwattr $C$DW$890, DW_AT_name("ipark")
    7359                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_ipark")
    7360                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7361                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
    7362              $C$DW$891       .dwtag  DW_TAG_member
    7363                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$70)
    7364                      .dwattr $C$DW$891, DW_AT_name("svgenHandle")
    7365                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_svgenHandle")
    7366                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7367                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
    7368              $C$DW$892       .dwtag  DW_TAG_member
    7369                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$71)
    7370                      .dwattr $C$DW$892, DW_AT_name("svgen")
    7371                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_svgen")
    7372                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7373                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    7374              $C$DW$893       .dwtag  DW_TAG_member
    7375                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$73)
    7376                      .dwattr $C$DW$893, DW_AT_name("trajHandle_Id")
    7377                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_trajHandle_Id")
    7378                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7379                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    7380              $C$DW$894       .dwtag  DW_TAG_member
    7381                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$74)
    7382                      .dwattr $C$DW$894, DW_AT_name("traj_Id")
    7383                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_traj_Id")
    7384                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7385                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    7386              $C$DW$895       .dwtag  DW_TAG_member
    7387                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$73)
    7388                      .dwattr $C$DW$895, DW_AT_name("trajHandle_spd")
    7389                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_trajHandle_spd")
    7390                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7391                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    7392              $C$DW$896       .dwtag  DW_TAG_member
    7393                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$74)
    7394                      .dwattr $C$DW$896, DW_AT_name("traj_spd")
    7395                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_traj_spd")
    7396                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  147

    7397                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    7398              $C$DW$897       .dwtag  DW_TAG_member
    7399                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$73)
    7400                      .dwattr $C$DW$897, DW_AT_name("trajHandle_spdMax")
    7401                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7402                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7403                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    7404              $C$DW$898       .dwtag  DW_TAG_member
    7405                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$74)
    7406                      .dwattr $C$DW$898, DW_AT_name("traj_spdMax")
    7407                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_traj_spdMax")
    7408                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7409                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    7410              $C$DW$899       .dwtag  DW_TAG_member
    7411                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$75)
    7412                      .dwattr $C$DW$899, DW_AT_name("motorParams")
    7413                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_motorParams")
    7414                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7415                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    7416              $C$DW$900       .dwtag  DW_TAG_member
    7417                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$77)
    7418                      .dwattr $C$DW$900, DW_AT_name("waitTimes")
    7419                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_waitTimes")
    7420                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7421                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    7422              $C$DW$901       .dwtag  DW_TAG_member
    7423                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$76)
    7424                      .dwattr $C$DW$901, DW_AT_name("counter_state")
    7425                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_counter_state")
    7426                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7427                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    7428              $C$DW$902       .dwtag  DW_TAG_member
    7429                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$42)
    7430                      .dwattr $C$DW$902, DW_AT_name("numIsrTicksPerCtrlTick")
    7431                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7432                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7433                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    7434              $C$DW$903       .dwtag  DW_TAG_member
    7435                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$42)
    7436                      .dwattr $C$DW$903, DW_AT_name("numCtrlTicksPerCurrentTick")
    7437                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7438                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7439                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    7440              $C$DW$904       .dwtag  DW_TAG_member
    7441                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$42)
    7442                      .dwattr $C$DW$904, DW_AT_name("numCtrlTicksPerSpeedTick")
    7443                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7444                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7445                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    7446              $C$DW$905       .dwtag  DW_TAG_member
    7447                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$42)
    7448                      .dwattr $C$DW$905, DW_AT_name("numCtrlTicksPerTrajTick")
    7449                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7450                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7451                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  148

    7452              $C$DW$906       .dwtag  DW_TAG_member
    7453                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$76)
    7454                      .dwattr $C$DW$906, DW_AT_name("ctrlFreq_Hz")
    7455                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7456                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7457                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    7458              $C$DW$907       .dwtag  DW_TAG_member
    7459                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$76)
    7460                      .dwattr $C$DW$907, DW_AT_name("trajFreq_Hz")
    7461                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7462                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7463                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    7464              $C$DW$908       .dwtag  DW_TAG_member
    7465                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$38)
    7466                      .dwattr $C$DW$908, DW_AT_name("trajPeriod_sec")
    7467                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7468                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7469                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    7470              $C$DW$909       .dwtag  DW_TAG_member
    7471                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$78)
    7472                      .dwattr $C$DW$909, DW_AT_name("ctrlPeriod_sec")
    7473                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7474                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7475                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    7476              $C$DW$910       .dwtag  DW_TAG_member
    7477                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$38)
    7478                      .dwattr $C$DW$910, DW_AT_name("maxVsMag_pu")
    7479                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7480                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7481                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    7482              $C$DW$911       .dwtag  DW_TAG_member
    7483                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$39)
    7484                      .dwattr $C$DW$911, DW_AT_name("Iab_in")
    7485                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_Iab_in")
    7486                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7487                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    7488              $C$DW$912       .dwtag  DW_TAG_member
    7489                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$39)
    7490                      .dwattr $C$DW$912, DW_AT_name("Iab_filt")
    7491                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_Iab_filt")
    7492                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7493                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    7494              $C$DW$913       .dwtag  DW_TAG_member
    7495                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$39)
    7496                      .dwattr $C$DW$913, DW_AT_name("Idq_in")
    7497                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_Idq_in")
    7498                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7499                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    7500              $C$DW$914       .dwtag  DW_TAG_member
    7501                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$39)
    7502                      .dwattr $C$DW$914, DW_AT_name("Vab_in")
    7503                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_Vab_in")
    7504                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7505                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    7506              $C$DW$915       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  149

    7507                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$38)
    7508                      .dwattr $C$DW$915, DW_AT_name("spd_out")
    7509                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_spd_out")
    7510                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7511                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    7512              $C$DW$916       .dwtag  DW_TAG_member
    7513                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$39)
    7514                      .dwattr $C$DW$916, DW_AT_name("Vab_out")
    7515                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_Vab_out")
    7516                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7517                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    7518              $C$DW$917       .dwtag  DW_TAG_member
    7519                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$39)
    7520                      .dwattr $C$DW$917, DW_AT_name("Vdq_out")
    7521                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_Vdq_out")
    7522                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7523                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    7524              $C$DW$918       .dwtag  DW_TAG_member
    7525                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$78)
    7526                      .dwattr $C$DW$918, DW_AT_name("Rhf")
    7527                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_Rhf")
    7528                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7529                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    7530              $C$DW$919       .dwtag  DW_TAG_member
    7531                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$78)
    7532                      .dwattr $C$DW$919, DW_AT_name("Lhf")
    7533                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_Lhf")
    7534                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7535                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    7536              $C$DW$920       .dwtag  DW_TAG_member
    7537                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$78)
    7538                      .dwattr $C$DW$920, DW_AT_name("RoverL")
    7539                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_RoverL")
    7540                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7541                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    7542              $C$DW$921       .dwtag  DW_TAG_member
    7543                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$38)
    7544                      .dwattr $C$DW$921, DW_AT_name("Kp_Id")
    7545                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_Kp_Id")
    7546                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7547                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    7548              $C$DW$922       .dwtag  DW_TAG_member
    7549                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$38)
    7550                      .dwattr $C$DW$922, DW_AT_name("Kp_Iq")
    7551                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_Kp_Iq")
    7552                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7553                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    7554              $C$DW$923       .dwtag  DW_TAG_member
    7555                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$38)
    7556                      .dwattr $C$DW$923, DW_AT_name("Kp_spd")
    7557                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_Kp_spd")
    7558                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7559                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    7560              $C$DW$924       .dwtag  DW_TAG_member
    7561                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$38)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  150

    7562                      .dwattr $C$DW$924, DW_AT_name("Ki_Id")
    7563                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_Ki_Id")
    7564                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7565                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    7566              $C$DW$925       .dwtag  DW_TAG_member
    7567                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$38)
    7568                      .dwattr $C$DW$925, DW_AT_name("Ki_Iq")
    7569                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_Ki_Iq")
    7570                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7571                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    7572              $C$DW$926       .dwtag  DW_TAG_member
    7573                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$38)
    7574                      .dwattr $C$DW$926, DW_AT_name("Ki_spd")
    7575                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_Ki_spd")
    7576                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7577                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    7578              $C$DW$927       .dwtag  DW_TAG_member
    7579                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$38)
    7580                      .dwattr $C$DW$927, DW_AT_name("Kd_Id")
    7581                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_Kd_Id")
    7582                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7583                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    7584              $C$DW$928       .dwtag  DW_TAG_member
    7585                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$38)
    7586                      .dwattr $C$DW$928, DW_AT_name("Kd_Iq")
    7587                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_Kd_Iq")
    7588                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7589                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    7590              $C$DW$929       .dwtag  DW_TAG_member
    7591                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$38)
    7592                      .dwattr $C$DW$929, DW_AT_name("Kd_spd")
    7593                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_Kd_spd")
    7594                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7595                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    7596              $C$DW$930       .dwtag  DW_TAG_member
    7597                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$38)
    7598                      .dwattr $C$DW$930, DW_AT_name("Ui_Id")
    7599                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_Ui_Id")
    7600                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7601                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    7602              $C$DW$931       .dwtag  DW_TAG_member
    7603                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$38)
    7604                      .dwattr $C$DW$931, DW_AT_name("Ui_Iq")
    7605                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_Ui_Iq")
    7606                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7607                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    7608              $C$DW$932       .dwtag  DW_TAG_member
    7609                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$38)
    7610                      .dwattr $C$DW$932, DW_AT_name("Ui_spd")
    7611                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_Ui_spd")
    7612                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7613                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    7614              $C$DW$933       .dwtag  DW_TAG_member
    7615                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$39)
    7616                      .dwattr $C$DW$933, DW_AT_name("Idq_ref")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  151

    7617                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_Idq_ref")
    7618                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7619                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    7620              $C$DW$934       .dwtag  DW_TAG_member
    7621                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$38)
    7622                      .dwattr $C$DW$934, DW_AT_name("IdRated")
    7623                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_IdRated")
    7624                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7625                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    7626              $C$DW$935       .dwtag  DW_TAG_member
    7627                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$38)
    7628                      .dwattr $C$DW$935, DW_AT_name("spd_ref")
    7629                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_spd_ref")
    7630                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7631                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    7632              $C$DW$936       .dwtag  DW_TAG_member
    7633                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$38)
    7634                      .dwattr $C$DW$936, DW_AT_name("spd_max")
    7635                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_spd_max")
    7636                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7637                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    7638              $C$DW$937       .dwtag  DW_TAG_member
    7639                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$42)
    7640                      .dwattr $C$DW$937, DW_AT_name("counter_current")
    7641                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_counter_current")
    7642                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7643                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    7644              $C$DW$938       .dwtag  DW_TAG_member
    7645                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$42)
    7646                      .dwattr $C$DW$938, DW_AT_name("counter_isr")
    7647                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_counter_isr")
    7648                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7649                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    7650              $C$DW$939       .dwtag  DW_TAG_member
    7651                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$42)
    7652                      .dwattr $C$DW$939, DW_AT_name("counter_speed")
    7653                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_counter_speed")
    7654                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7655                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    7656              $C$DW$940       .dwtag  DW_TAG_member
    7657                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$42)
    7658                      .dwattr $C$DW$940, DW_AT_name("counter_traj")
    7659                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_counter_traj")
    7660                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7661                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    7662              $C$DW$941       .dwtag  DW_TAG_member
    7663                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$43)
    7664                      .dwattr $C$DW$941, DW_AT_name("flag_enableCtrl")
    7665                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7666                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7667                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    7668              $C$DW$942       .dwtag  DW_TAG_member
    7669                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$43)
    7670                      .dwattr $C$DW$942, DW_AT_name("flag_enableDcBusComp")
    7671                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  152

    7672                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7673                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    7674              $C$DW$943       .dwtag  DW_TAG_member
    7675                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$43)
    7676                      .dwattr $C$DW$943, DW_AT_name("flag_enablePowerWarp")
    7677                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7678                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7679                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    7680              $C$DW$944       .dwtag  DW_TAG_member
    7681                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$43)
    7682                      .dwattr $C$DW$944, DW_AT_name("flag_enableOffset")
    7683                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_flag_enableOffset")
    7684                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7685                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    7686              $C$DW$945       .dwtag  DW_TAG_member
    7687                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$43)
    7688                      .dwattr $C$DW$945, DW_AT_name("flag_enableSpeedCtrl")
    7689                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7690                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7691                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    7692              $C$DW$946       .dwtag  DW_TAG_member
    7693                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$43)
    7694                      .dwattr $C$DW$946, DW_AT_name("flag_enableUserMotorParams")
    7695                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7696                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7697                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    7698              $C$DW$947       .dwtag  DW_TAG_member
    7699                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$39)
    7700                      .dwattr $C$DW$947, DW_AT_name("Idq_offset_pu")
    7701                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7702                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7703                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    7704              $C$DW$948       .dwtag  DW_TAG_member
    7705                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$39)
    7706                      .dwattr $C$DW$948, DW_AT_name("Vdq_offset_pu")
    7707                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7708                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7709                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    7710              $C$DW$949       .dwtag  DW_TAG_member
    7711                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$38)
    7712                      .dwattr $C$DW$949, DW_AT_name("angle_pu")
    7713                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_angle_pu")
    7714                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7715                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    7716              $C$DW$950       .dwtag  DW_TAG_member
    7717                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$38)
    7718                      .dwattr $C$DW$950, DW_AT_name("speed_ref_pu")
    7719                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_speed_ref_pu")
    7720                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7721                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    7722              $C$DW$951       .dwtag  DW_TAG_member
    7723                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$38)
    7724                      .dwattr $C$DW$951, DW_AT_name("speed_fb_pu")
    7725                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_speed_fb_pu")
    7726                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  153

    7727                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    7728              $C$DW$952       .dwtag  DW_TAG_member
    7729                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$38)
    7730                      .dwattr $C$DW$952, DW_AT_name("speed_outMax_pu")
    7731                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7732                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7733                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    7734              $C$DW$953       .dwtag  DW_TAG_member
    7735                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$43)
    7736                      .dwattr $C$DW$953, DW_AT_name("flag_enableCurrentCtrl")
    7737                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7738                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7739                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    7740                      .dwendtag $C$DW$T$79
    7741              
    7742              $C$DW$T$299     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7743                      .dwattr $C$DW$T$299, DW_AT_type(*$C$DW$T$79)
    7744                      .dwattr $C$DW$T$299, DW_AT_language(DW_LANG_C)
    7745              $C$DW$T$300     .dwtag  DW_TAG_pointer_type
    7746                      .dwattr $C$DW$T$300, DW_AT_type(*$C$DW$T$299)
    7747                      .dwattr $C$DW$T$300, DW_AT_address_class(0x16)
    7748              $C$DW$T$237     .dwtag  DW_TAG_pointer_type
    7749                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$79)
    7750                      .dwattr $C$DW$T$237, DW_AT_address_class(0x16)
    7751              $C$DW$T$238     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7752                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$237)
    7753                      .dwattr $C$DW$T$238, DW_AT_language(DW_LANG_C)
    7754              $C$DW$954       .dwtag  DW_TAG_TI_far_type
    7755                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$238)
    7756              $C$DW$T$301     .dwtag  DW_TAG_const_type
    7757                      .dwattr $C$DW$T$301, DW_AT_type(*$C$DW$954)
    7758              
    7759              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    7760                      .dwattr $C$DW$T$82, DW_AT_name("_CTRL_Version_")
    7761                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x04)
    7762              $C$DW$955       .dwtag  DW_TAG_member
    7763                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$24)
    7764                      .dwattr $C$DW$955, DW_AT_name("rsvd")
    7765                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_rsvd")
    7766                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7767                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    7768              $C$DW$956       .dwtag  DW_TAG_member
    7769                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$81)
    7770                      .dwattr $C$DW$956, DW_AT_name("targetProc")
    7771                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_targetProc")
    7772                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7773                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    7774              $C$DW$957       .dwtag  DW_TAG_member
    7775                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$24)
    7776                      .dwattr $C$DW$957, DW_AT_name("major")
    7777                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_major")
    7778                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7779                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    7780              $C$DW$958       .dwtag  DW_TAG_member
    7781                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1323611                              PAGE  154

    7782                      .dwattr $C$DW$958, DW_AT_name("minor")
    7783                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_minor")
    7784                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7785                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    7786                      .dwendtag $C$DW$T$82
    7787              
    7788              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7789                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$82)
    7790                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    7791              $C$DW$T$307     .dwtag  DW_TAG_pointer_type
    7792                      .dwattr $C$DW$T$307, DW_AT_type(*$C$DW$T$53)
    7793                      .dwattr $C$DW$T$307, DW_AT_address_class(0x16)
    7794              
    7795              $C$DW$T$89      .dwtag  DW_TAG_structure_type
    7796                      .dwattr $C$DW$T$89, DW_AT_name("_DECODER_Obj_")
    7797                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x06)
    7798              $C$DW$959       .dwtag  DW_TAG_member
    7799                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$84)
    7800                      .dwattr $C$DW$959, DW_AT_name("spiHandle")
    7801                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_spiHandle")
    7802                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7803                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    7804              $C$DW$960       .dwtag  DW_TAG_member
    7805                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$86)
    7806                      .dwattr $C$DW$960, DW_AT_name("gpioHandle")
    7807                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_gpioHandle")
    7808                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7809                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    7810              $C$DW$961       .dwtag  DW_TAG_member
    7811                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$88)
    7812                      .dwattr $C$DW$961, DW_AT_name("gpioNumber")
    7813                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_gpioNumber")
    7814                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7815                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    7816              $C$DW$962       .dwtag  DW_TAG_member
    7817                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$43)
    7818                      .dwattr $C$DW$962, DW_AT_name("RxTimeOut")
    7819                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_RxTimeOut")
    7820                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7821                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    7822                      .dwendtag $C$DW$T$89
    7823              
    7824              $C$DW$T$310     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Obj")
    7825                      .dwattr $C$DW$T$310, DW_AT_type(*$C$DW$T$89)
    7826                      .dwattr $C$DW$T$310, DW_AT_language(DW_LANG_C)
    7827              $C$DW$T$311     .dwtag  DW_TAG_pointer_type
    7828                      .dwattr $C$DW$T$311, DW_AT_type(*$C$DW$T$89)
    7829                      .dwattr $C$DW$T$311, DW_AT_address_class(0x16)
    7830              $C$DW$T$312     .dwtag  DW_TAG_typedef, DW_AT_name("DECODER_Handle")
    7831                      .dwattr $C$DW$T$312, DW_AT_type(*$C$DW$T$311)
    7832                      .dwattr $C$DW$T$312, DW_AT_language(DW_LANG_C)
    7833              
    7834              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    7835                      .dwattr $C$DW$T$90, DW_AT_name("_DRIVE_CURRENT_t_")
    7836                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 20:23:15 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
