TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:41 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1188810                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Tue Jul 11 19:04:41 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/drivers/spi/src/32b/f28x/f2802x/spi.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;       c:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\118882 C

    2525              $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Priority_AfterRxRxSeq"), DW_AT_const_value(0x20)
    2526                      .dwendtag $C$DW$T$52
    2527              
    2528              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Priority_e")
    2529                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2530                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2531              $C$DW$240       .dwtag  DW_TAG_TI_far_type
    2532                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$53)
    2533              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2534                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$240)
    2535              
    2536              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    2537                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    2538              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_Empty"), DW_AT_const_value(0x00)
    2539              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_1_Word"), DW_AT_const_value(0x01)
    2540              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_2_Words"), DW_AT_const_value(0x02)
    2541              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_3_Words"), DW_AT_const_value(0x03)
    2542              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_4_Words"), DW_AT_const_value(0x04)
    2543                      .dwendtag $C$DW$T$55
    2544              
    2545              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FifoLevel_e")
    2546                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2547                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2548              $C$DW$246       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:41 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1188810                              PAGE   48

    2549                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$56)
    2550              $C$DW$T$57      .dwtag  DW_TAG_const_type
    2551                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$246)
    2552              
    2553              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
    2554                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    2555              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_SteInv_ActiveLow"), DW_AT_const_value(0x00)
    2556              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_SteInv_ActiveHigh"), DW_AT_const_value(0x02)
    2557                      .dwendtag $C$DW$T$58
    2558              
    2559              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_SteInv_e")
    2560                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2561                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2562              $C$DW$249       .dwtag  DW_TAG_TI_far_type
    2563                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$59)
    2564              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2565                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$249)
    2566              
    2567              $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    2568                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
    2569              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
    2570              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
    2571              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
    2572                      .dwendtag $C$DW$T$61
    2573              
    2574              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
    2575                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2576                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2577              $C$DW$253       .dwtag  DW_TAG_TI_far_type
    2578                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$62)
    2579              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2580                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$253)
    2581              
    2582              $C$DW$T$64      .dwtag  DW_TAG_enumeration_type
    2583                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    2584              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TriWire_NormalFourWire"), DW_AT_const_value(0x00)
    2585              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TriWire_ThreeWire"), DW_AT_const_value(0x01)
    2586                      .dwendtag $C$DW$T$64
    2587              
    2588              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_TriWire_e")
    2589                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2590                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2591              $C$DW$256       .dwtag  DW_TAG_TI_far_type
    2592                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$65)
    2593              $C$DW$T$66      .dwtag  DW_TAG_const_type
    2594                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$256)
    2595              
    2596              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2597                      .dwattr $C$DW$T$22, DW_AT_name("_SPI_Obj_")
    2598                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2599              $C$DW$257       .dwtag  DW_TAG_member
    2600                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2601                      .dwattr $C$DW$257, DW_AT_name("SPICCR")
    2602                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_SPICCR")
    2603                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:41 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1188810                              PAGE   49

    2604                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2605              $C$DW$258       .dwtag  DW_TAG_member
    2606                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    2607                      .dwattr $C$DW$258, DW_AT_name("SPICTL")
    2608                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_SPICTL")
    2609                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2610                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2611              $C$DW$259       .dwtag  DW_TAG_member
    2612                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2613                      .dwattr $C$DW$259, DW_AT_name("SPIST")
    2614                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_SPIST")
    2615                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2616                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2617              $C$DW$260       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    2619                      .dwattr $C$DW$260, DW_AT_name("rsvd_1")
    2620                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_rsvd_1")
    2621                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2622                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2623              $C$DW$261       .dwtag  DW_TAG_member
    2624                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    2625                      .dwattr $C$DW$261, DW_AT_name("SPIBRR")
    2626                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_SPIBRR")
    2627                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2628                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2629              $C$DW$262       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2631                      .dwattr $C$DW$262, DW_AT_name("rsvd_2")
    2632                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_rsvd_2")
    2633                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2634                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2635              $C$DW$263       .dwtag  DW_TAG_member
    2636                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    2637                      .dwattr $C$DW$263, DW_AT_name("SPIEMU")
    2638                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_SPIEMU")
    2639                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2640                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2641              $C$DW$264       .dwtag  DW_TAG_member
    2642                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2643                      .dwattr $C$DW$264, DW_AT_name("SPIRXBUF")
    2644                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_SPIRXBUF")
    2645                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2646                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2647              $C$DW$265       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2649                      .dwattr $C$DW$265, DW_AT_name("SPITXBUF")
    2650                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_SPITXBUF")
    2651                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2652                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2653              $C$DW$266       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2655                      .dwattr $C$DW$266, DW_AT_name("SPIDAT")
    2656                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_SPIDAT")
    2657                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2658                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:41 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1188810                              PAGE   50

    2659              $C$DW$267       .dwtag  DW_TAG_member
    2660                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    2661                      .dwattr $C$DW$267, DW_AT_name("SPIFFTX")
    2662                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_SPIFFTX")
    2663                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2664                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2665              $C$DW$268       .dwtag  DW_TAG_member
    2666                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    2667                      .dwattr $C$DW$268, DW_AT_name("SPIFFRX")
    2668                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_SPIFFRX")
    2669                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2670                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2671              $C$DW$269       .dwtag  DW_TAG_member
    2672                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2673                      .dwattr $C$DW$269, DW_AT_name("SPIFFCT")
    2674                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_SPIFFCT")
    2675                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2676                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2677              $C$DW$270       .dwtag  DW_TAG_member
    2678                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$21)
    2679                      .dwattr $C$DW$270, DW_AT_name("rsvd_3")
    2680                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd_3")
    2681                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2682                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2683              $C$DW$271       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    2685                      .dwattr $C$DW$271, DW_AT_name("SPIPRI")
    2686                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_SPIPRI")
    2687                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2688                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2689                      .dwendtag $C$DW$T$22
    2690              
    2691              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Obj")
    2692                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
    2693                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2694              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    2695                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
    2696                      .dwattr $C$DW$T$25, DW_AT_address_class(0x16)
    2697              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Handle")
    2698                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2699                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2700              $C$DW$272       .dwtag  DW_TAG_TI_far_type
    2701                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$26)
    2702              $C$DW$T$68      .dwtag  DW_TAG_const_type
    2703                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$272)
    2704              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2705                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    2706              $C$DW$273       .dwtag  DW_TAG_TI_far_type
    2707                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$3)
    2708              $C$DW$T$74      .dwtag  DW_TAG_const_type
    2709                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$273)
    2710              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2711                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2712                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2713                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.2.5 Tue Jul 11 19:04:41 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1188810                              PAGE   51

    2714              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2715                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2716                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2717                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2718              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2719                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2720                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2721                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2722              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2723                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2724                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2725                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2726              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2727                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2728                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2729                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2730              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2731                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2732                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2733                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2734              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2735                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2736                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2737              $C$DW$274       .dwtag  DW_TAG_TI_far_type
    2738                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    2739              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
