TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:09 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0595210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 10:43:09 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/drivers/gpio/src/32b/f28x/f2802
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;       c:\ti\ccsv6\tools\compiler\c2000_6.2.5\bin\opt2000.exe C:\\Users\\wmj\\AppData\\Local\\Temp\\059522 C

    1652              $C$DW$221       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1653              $C$DW$222       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_SDAA"), DW_AT_const_value(0x01)
    1654              $C$DW$223       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_EPWMSYNCI"), DW_AT_const_value(0x02)
    1655              $C$DW$224       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_ADCSOCAO_NOT"), DW_AT_const_value(0x03)
    1656              $C$DW$225       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1657              $C$DW$226       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_SCLA"), DW_AT_const_value(0x01)
    1658              $C$DW$227       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_EPWMSYNCO"), DW_AT_const_value(0x02)
    1659              $C$DW$228       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_ADCSOCBO_NOT"), DW_AT_const_value(0x03)
    1660              $C$DW$229       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1661              $C$DW$230       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_COMP2OUT"), DW_AT_const_value(0x01)
    1662              $C$DW$231       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1663              $C$DW$232       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1664              $C$DW$233       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_JTAG_TDI"), DW_AT_const_value(0x00)
    1665              $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1666              $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1667              $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1668              $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_JTAG_TMS"), DW_AT_const_value(0x00)
    1669              $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1670              $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1671              $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1672              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_JTAG_TDO"), DW_AT_const_value(0x00)
    1673              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1674              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1675              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1676              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_JTAG_TCK"), DW_AT_const_value(0x00)
    1677              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1678              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1679              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1680                      .dwendtag $C$DW$T$45
    1681              
    1682              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Mode_e")
    1683                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1684                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1685              $C$DW$249       .dwtag  DW_TAG_TI_far_type
    1686                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$46)
    1687              $C$DW$T$47      .dwtag  DW_TAG_const_type
    1688                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$249)
    1689              
    1690              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:09 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0595210                              PAGE   32

    1691                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1692              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sync"), DW_AT_const_value(0x00)
    1693              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_3"), DW_AT_const_value(0x01)
    1694              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_6"), DW_AT_const_value(0x02)
    1695              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_ASync"), DW_AT_const_value(0x03)
    1696                      .dwendtag $C$DW$T$48
    1697              
    1698              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Qual_e")
    1699                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1700                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1701              $C$DW$254       .dwtag  DW_TAG_TI_far_type
    1702                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$49)
    1703              $C$DW$T$50      .dwtag  DW_TAG_const_type
    1704                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$254)
    1705              
    1706              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1707                      .dwattr $C$DW$T$29, DW_AT_name("_GPIO_Obj_")
    1708                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6a)
    1709              $C$DW$255       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    1711                      .dwattr $C$DW$255, DW_AT_name("GPACTRL")
    1712                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_GPACTRL")
    1713                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1715              $C$DW$256       .dwtag  DW_TAG_member
    1716                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    1717                      .dwattr $C$DW$256, DW_AT_name("GPAQSEL1")
    1718                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_GPAQSEL1")
    1719                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1720                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    1721              $C$DW$257       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    1723                      .dwattr $C$DW$257, DW_AT_name("GPAQSEL2")
    1724                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_GPAQSEL2")
    1725                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1726                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    1727              $C$DW$258       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    1729                      .dwattr $C$DW$258, DW_AT_name("GPAMUX1")
    1730                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_GPAMUX1")
    1731                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1732                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    1733              $C$DW$259       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    1735                      .dwattr $C$DW$259, DW_AT_name("GPAMUX2")
    1736                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_GPAMUX2")
    1737                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1738                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    1739              $C$DW$260       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    1741                      .dwattr $C$DW$260, DW_AT_name("GPADIR")
    1742                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_GPADIR")
    1743                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1744                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    1745              $C$DW$261       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:09 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0595210                              PAGE   33

    1746                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    1747                      .dwattr $C$DW$261, DW_AT_name("GPAPUD")
    1748                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_GPAPUD")
    1749                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1750                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1751              $C$DW$262       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$23)
    1753                      .dwattr $C$DW$262, DW_AT_name("rsvd_1")
    1754                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_rsvd_1")
    1755                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1756                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1757              $C$DW$263       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    1759                      .dwattr $C$DW$263, DW_AT_name("GPBCTRL")
    1760                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_GPBCTRL")
    1761                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1762                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    1763              $C$DW$264       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    1765                      .dwattr $C$DW$264, DW_AT_name("GPBQSEL1")
    1766                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_GPBQSEL1")
    1767                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1768                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    1769              $C$DW$265       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$23)
    1771                      .dwattr $C$DW$265, DW_AT_name("rsvd_2")
    1772                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_rsvd_2")
    1773                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1774                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    1775              $C$DW$266       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    1777                      .dwattr $C$DW$266, DW_AT_name("GPBMUX1")
    1778                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_GPBMUX1")
    1779                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1780                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    1781              $C$DW$267       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$23)
    1783                      .dwattr $C$DW$267, DW_AT_name("rsvd_3")
    1784                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_rsvd_3")
    1785                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1786                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    1787              $C$DW$268       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    1789                      .dwattr $C$DW$268, DW_AT_name("GPBDIR")
    1790                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_GPBDIR")
    1791                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1792                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    1793              $C$DW$269       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    1795                      .dwattr $C$DW$269, DW_AT_name("GPBPUD")
    1796                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_GPBPUD")
    1797                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1798                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    1799              $C$DW$270       .dwtag  DW_TAG_member
    1800                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:09 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0595210                              PAGE   34

    1801                      .dwattr $C$DW$270, DW_AT_name("rsvd_4")
    1802                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd_4")
    1803                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1804                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    1805              $C$DW$271       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    1807                      .dwattr $C$DW$271, DW_AT_name("AIOMUX1")
    1808                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_AIOMUX1")
    1809                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1810                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    1811              $C$DW$272       .dwtag  DW_TAG_member
    1812                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$23)
    1813                      .dwattr $C$DW$272, DW_AT_name("rsvd_5")
    1814                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_rsvd_5")
    1815                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1816                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    1817              $C$DW$273       .dwtag  DW_TAG_member
    1818                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    1819                      .dwattr $C$DW$273, DW_AT_name("AIODIR")
    1820                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_AIODIR")
    1821                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1822                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    1823              $C$DW$274       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$25)
    1825                      .dwattr $C$DW$274, DW_AT_name("rsvd_6")
    1826                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_rsvd_6")
    1827                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1828                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    1829              $C$DW$275       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    1831                      .dwattr $C$DW$275, DW_AT_name("GPADAT")
    1832                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_GPADAT")
    1833                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1834                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    1835              $C$DW$276       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    1837                      .dwattr $C$DW$276, DW_AT_name("GPASET")
    1838                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_GPASET")
    1839                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1840                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    1841              $C$DW$277       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    1843                      .dwattr $C$DW$277, DW_AT_name("GPACLEAR")
    1844                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_GPACLEAR")
    1845                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1846                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    1847              $C$DW$278       .dwtag  DW_TAG_member
    1848                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    1849                      .dwattr $C$DW$278, DW_AT_name("GPATOGGLE")
    1850                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_GPATOGGLE")
    1851                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1852                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    1853              $C$DW$279       .dwtag  DW_TAG_member
    1854                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    1855                      .dwattr $C$DW$279, DW_AT_name("GPBDAT")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:09 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0595210                              PAGE   35

    1856                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_GPBDAT")
    1857                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1858                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    1859              $C$DW$280       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    1861                      .dwattr $C$DW$280, DW_AT_name("GPBSET")
    1862                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_GPBSET")
    1863                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1864                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    1865              $C$DW$281       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    1867                      .dwattr $C$DW$281, DW_AT_name("GPBCLEAR")
    1868                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_GPBCLEAR")
    1869                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1870                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    1871              $C$DW$282       .dwtag  DW_TAG_member
    1872                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    1873                      .dwattr $C$DW$282, DW_AT_name("GPBTOGGLE")
    1874                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_GPBTOGGLE")
    1875                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1876                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    1877              $C$DW$283       .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$26)
    1879                      .dwattr $C$DW$283, DW_AT_name("rsvd_7")
    1880                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_rsvd_7")
    1881                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1882                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    1883              $C$DW$284       .dwtag  DW_TAG_member
    1884                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    1885                      .dwattr $C$DW$284, DW_AT_name("AIODAT")
    1886                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_AIODAT")
    1887                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1888                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    1889              $C$DW$285       .dwtag  DW_TAG_member
    1890                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    1891                      .dwattr $C$DW$285, DW_AT_name("AIOSET")
    1892                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_AIOSET")
    1893                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1894                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    1895              $C$DW$286       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    1897                      .dwattr $C$DW$286, DW_AT_name("AIOCLEAR")
    1898                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_AIOCLEAR")
    1899                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1900                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    1901              $C$DW$287       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    1903                      .dwattr $C$DW$287, DW_AT_name("AIOTOGGLE")
    1904                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_AIOTOGGLE")
    1905                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1906                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    1907              $C$DW$288       .dwtag  DW_TAG_member
    1908                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$27)
    1909                      .dwattr $C$DW$288, DW_AT_name("GPIOXINTnSEL")
    1910                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:09 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0595210                              PAGE   36

    1911                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1912                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    1913              $C$DW$289       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$28)
    1915                      .dwattr $C$DW$289, DW_AT_name("rsvd_8")
    1916                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_rsvd_8")
    1917                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    1918                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    1919              $C$DW$290       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    1921                      .dwattr $C$DW$290, DW_AT_name("GPIOLPMSEL")
    1922                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    1923                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1924                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    1925                      .dwendtag $C$DW$T$29
    1926              
    1927              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Obj")
    1928                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$29)
    1929                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1930              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    1931                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
    1932                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
    1933              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1934                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1935                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1936              $C$DW$291       .dwtag  DW_TAG_TI_far_type
    1937                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$53)
    1938              $C$DW$T$54      .dwtag  DW_TAG_const_type
    1939                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$291)
    1940              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1941                      .dwattr $C$DW$T$3, DW_AT_address_class(0x16)
    1942              $C$DW$292       .dwtag  DW_TAG_TI_far_type
    1943                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$3)
    1944              $C$DW$T$60      .dwtag  DW_TAG_const_type
    1945                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$292)
    1946              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1947                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1948                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1949                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1950              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1951                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1952                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1953                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1954              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1955                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1956                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1957                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1958              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("_Bool")
    1959                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$6)
    1960                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1961              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1962                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1963                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1964                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1965              $C$DW$T$8       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:09 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0595210                              PAGE   37

    1966                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1967                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1968                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1969              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1970                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1971                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1972                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1973              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1974                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    1975                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
