TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Thu Jun 22 10:43:12 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_18/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_18\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8024              $C$DW$856       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualPeriod"), DW_AT_const_valu
    8025              $C$DW$857       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualZeroOrPeriod"), DW_AT_cons
    8026              $C$DW$858       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpAIncr"), DW_AT_const_va
    8027              $C$DW$859       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpADecr"), DW_AT_const_va
    8028              $C$DW$860       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpBIncr"), DW_AT_const_va
    8029              $C$DW$861       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpBDecr"), DW_AT_const_va
    8030                      .dwendtag $C$DW$T$173
    8031              
    8032              $C$DW$T$174     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_SocPulseSrc_e")
    8033                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
    8034                      .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    8035              $C$DW$862       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  162

    8036                      .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$174)
    8037              $C$DW$T$175     .dwtag  DW_TAG_const_type
    8038                      .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$862)
    8039              
    8040              $C$DW$T$176     .dwtag  DW_TAG_enumeration_type
    8041                      .dwattr $C$DW$T$176, DW_AT_byte_size(0x01)
    8042              $C$DW$863       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    8043              $C$DW$864       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    8044              $C$DW$865       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    8045              $C$DW$866       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    8046              $C$DW$867       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    8047              $C$DW$868       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    8048              $C$DW$869       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    8049              $C$DW$870       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    8050              $C$DW$871       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    8051              $C$DW$872       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    8052              $C$DW$873       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    8053              $C$DW$874       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    8054                      .dwendtag $C$DW$T$176
    8055              
    8056              $C$DW$T$177     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    8057                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    8058                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    8059              
    8060              $C$DW$T$179     .dwtag  DW_TAG_enumeration_type
    8061                      .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    8062              $C$DW$875       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_1"), DW_AT_const_value(0x00)
    8063              $C$DW$876       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_2"), DW_AT_const_value(0x01)
    8064              $C$DW$877       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_3"), DW_AT_const_value(0x02)
    8065              $C$DW$878       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_4"), DW_AT_const_value(0x03)
    8066                      .dwendtag $C$DW$T$179
    8067              
    8068              $C$DW$T$180     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Number_e")
    8069                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
    8070                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    8071              
    8072              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8073                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    8074                      .dwattr $C$DW$T$19, DW_AT_declaration
    8075                      .dwendtag $C$DW$T$19
    8076              
    8077              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    8078                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$19)
    8079                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    8080              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    8081                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    8082                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    8083              
    8084              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    8085                      .dwattr $C$DW$T$32, DW_AT_name("_ADC_Obj_")
    8086                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x6650)
    8087              $C$DW$879       .dwtag  DW_TAG_member
    8088                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$26)
    8089                      .dwattr $C$DW$879, DW_AT_name("ADCRESULT")
    8090                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_ADCRESULT")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  163

    8091                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8092                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
    8093              $C$DW$880       .dwtag  DW_TAG_member
    8094                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$27)
    8095                      .dwattr $C$DW$880, DW_AT_name("resvd_1")
    8096                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_resvd_1")
    8097                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8098                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
    8099              $C$DW$881       .dwtag  DW_TAG_member
    8100                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$25)
    8101                      .dwattr $C$DW$881, DW_AT_name("ADCCTL1")
    8102                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_ADCCTL1")
    8103                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8104                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    8105              $C$DW$882       .dwtag  DW_TAG_member
    8106                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$25)
    8107                      .dwattr $C$DW$882, DW_AT_name("ADCCTL2")
    8108                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_ADCCTL2")
    8109                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8110                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    8111              $C$DW$883       .dwtag  DW_TAG_member
    8112                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$28)
    8113                      .dwattr $C$DW$883, DW_AT_name("rsvd_2")
    8114                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_rsvd_2")
    8115                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8116                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    8117              $C$DW$884       .dwtag  DW_TAG_member
    8118                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$25)
    8119                      .dwattr $C$DW$884, DW_AT_name("ADCINTFLG")
    8120                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_ADCINTFLG")
    8121                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8122                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    8123              $C$DW$885       .dwtag  DW_TAG_member
    8124                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$25)
    8125                      .dwattr $C$DW$885, DW_AT_name("ADCINTFLGCLR")
    8126                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8127                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8128                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    8129              $C$DW$886       .dwtag  DW_TAG_member
    8130                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$25)
    8131                      .dwattr $C$DW$886, DW_AT_name("ADCINTOVF")
    8132                      .dwattr $C$DW$886, DW_AT_TI_symbol_name("_ADCINTOVF")
    8133                      .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8134                      .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
    8135              $C$DW$887       .dwtag  DW_TAG_member
    8136                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$25)
    8137                      .dwattr $C$DW$887, DW_AT_name("ADCINTOVFCLR")
    8138                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8139                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8140                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
    8141              $C$DW$888       .dwtag  DW_TAG_member
    8142                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$29)
    8143                      .dwattr $C$DW$888, DW_AT_name("INTSELxNy")
    8144                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_INTSELxNy")
    8145                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  164

    8146                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
    8147              $C$DW$889       .dwtag  DW_TAG_member
    8148                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$30)
    8149                      .dwattr $C$DW$889, DW_AT_name("rsvd_3")
    8150                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_rsvd_3")
    8151                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8152                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
    8153              $C$DW$890       .dwtag  DW_TAG_member
    8154                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$25)
    8155                      .dwattr $C$DW$890, DW_AT_name("SOCPRICTRL")
    8156                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8157                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8158                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
    8159              $C$DW$891       .dwtag  DW_TAG_member
    8160                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$25)
    8161                      .dwattr $C$DW$891, DW_AT_name("rsvd_4")
    8162                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_rsvd_4")
    8163                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8164                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
    8165              $C$DW$892       .dwtag  DW_TAG_member
    8166                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$25)
    8167                      .dwattr $C$DW$892, DW_AT_name("ADCSAMPLEMODE")
    8168                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8169                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8170                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    8171              $C$DW$893       .dwtag  DW_TAG_member
    8172                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$25)
    8173                      .dwattr $C$DW$893, DW_AT_name("rsvd_5")
    8174                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_rsvd_5")
    8175                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8176                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    8177              $C$DW$894       .dwtag  DW_TAG_member
    8178                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$25)
    8179                      .dwattr $C$DW$894, DW_AT_name("ADCINTSOCSEL1")
    8180                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8181                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8182                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    8183              $C$DW$895       .dwtag  DW_TAG_member
    8184                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$25)
    8185                      .dwattr $C$DW$895, DW_AT_name("ADCINTSOCSEL2")
    8186                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8187                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8188                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    8189              $C$DW$896       .dwtag  DW_TAG_member
    8190                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$28)
    8191                      .dwattr $C$DW$896, DW_AT_name("rsvd_6")
    8192                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_rsvd_6")
    8193                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8194                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    8195              $C$DW$897       .dwtag  DW_TAG_member
    8196                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$25)
    8197                      .dwattr $C$DW$897, DW_AT_name("ADCSOCFLG1")
    8198                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8199                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8200                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  165

    8201              $C$DW$898       .dwtag  DW_TAG_member
    8202                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$25)
    8203                      .dwattr $C$DW$898, DW_AT_name("rsvd_7")
    8204                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_rsvd_7")
    8205                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8206                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    8207              $C$DW$899       .dwtag  DW_TAG_member
    8208                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$25)
    8209                      .dwattr $C$DW$899, DW_AT_name("ADCSOCFRC1")
    8210                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8211                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8212                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    8213              $C$DW$900       .dwtag  DW_TAG_member
    8214                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$25)
    8215                      .dwattr $C$DW$900, DW_AT_name("rsvd_8")
    8216                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_rsvd_8")
    8217                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8218                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    8219              $C$DW$901       .dwtag  DW_TAG_member
    8220                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$25)
    8221                      .dwattr $C$DW$901, DW_AT_name("ADCSOCOVF1")
    8222                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8223                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8224                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    8225              $C$DW$902       .dwtag  DW_TAG_member
    8226                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$25)
    8227                      .dwattr $C$DW$902, DW_AT_name("rsvd_9")
    8228                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_rsvd_9")
    8229                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8230                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    8231              $C$DW$903       .dwtag  DW_TAG_member
    8232                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$25)
    8233                      .dwattr $C$DW$903, DW_AT_name("ADCSOCOVFCLR1")
    8234                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8235                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8236                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    8237              $C$DW$904       .dwtag  DW_TAG_member
    8238                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$25)
    8239                      .dwattr $C$DW$904, DW_AT_name("rsvd_10")
    8240                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_rsvd_10")
    8241                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    8242                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    8243              $C$DW$905       .dwtag  DW_TAG_member
    8244                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$26)
    8245                      .dwattr $C$DW$905, DW_AT_name("ADCSOCxCTL")
    8246                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    8247                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    8248                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    8249              $C$DW$906       .dwtag  DW_TAG_member
    8250                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$26)
    8251                      .dwattr $C$DW$906, DW_AT_name("rsvd_11")
    8252                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_rsvd_11")
    8253                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    8254                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    8255              $C$DW$907       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  166

    8256                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$25)
    8257                      .dwattr $C$DW$907, DW_AT_name("ADCREFTRIM")
    8258                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_ADCREFTRIM")
    8259                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    8260                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    8261              $C$DW$908       .dwtag  DW_TAG_member
    8262                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$25)
    8263                      .dwattr $C$DW$908, DW_AT_name("ADCOFFTRIM")
    8264                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    8265                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    8266                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    8267              $C$DW$909       .dwtag  DW_TAG_member
    8268                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$31)
    8269                      .dwattr $C$DW$909, DW_AT_name("resvd_12")
    8270                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_resvd_12")
    8271                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    8272                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    8273              $C$DW$910       .dwtag  DW_TAG_member
    8274                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$25)
    8275                      .dwattr $C$DW$910, DW_AT_name("ADCREV")
    8276                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_ADCREV")
    8277                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    8278                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    8279                      .dwendtag $C$DW$T$32
    8280              
    8281              $C$DW$T$182     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    8282                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$32)
    8283                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    8284              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    8285                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$32)
    8286                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
    8287              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    8288                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    8289                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    8290              
    8291              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8292                      .dwattr $C$DW$T$35, DW_AT_name("_CLARKE_Obj_")
    8293                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    8294              $C$DW$911       .dwtag  DW_TAG_member
    8295                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$33)
    8296                      .dwattr $C$DW$911, DW_AT_name("alpha_sf")
    8297                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_alpha_sf")
    8298                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8299                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    8300              $C$DW$912       .dwtag  DW_TAG_member
    8301                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$33)
    8302                      .dwattr $C$DW$912, DW_AT_name("beta_sf")
    8303                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_beta_sf")
    8304                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8305                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    8306              $C$DW$913       .dwtag  DW_TAG_member
    8307                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$34)
    8308                      .dwattr $C$DW$913, DW_AT_name("numSensors")
    8309                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_numSensors")
    8310                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  167

    8311                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    8312                      .dwendtag $C$DW$T$35
    8313              
    8314              $C$DW$T$183     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    8315                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$35)
    8316                      .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    8317              $C$DW$T$184     .dwtag  DW_TAG_pointer_type
    8318                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$35)
    8319                      .dwattr $C$DW$T$184, DW_AT_address_class(0x16)
    8320              $C$DW$T$185     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    8321                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    8322                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    8323              $C$DW$914       .dwtag  DW_TAG_TI_far_type
    8324                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$185)
    8325              $C$DW$T$186     .dwtag  DW_TAG_const_type
    8326                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$914)
    8327              
    8328              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    8329                      .dwattr $C$DW$T$37, DW_AT_name("_CLK_Obj_")
    8330                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x11)
    8331              $C$DW$915       .dwtag  DW_TAG_member
    8332                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$25)
    8333                      .dwattr $C$DW$915, DW_AT_name("XCLK")
    8334                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_XCLK")
    8335                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8336                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    8337              $C$DW$916       .dwtag  DW_TAG_member
    8338                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$25)
    8339                      .dwattr $C$DW$916, DW_AT_name("rsvd_1")
    8340                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_rsvd_1")
    8341                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8342                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    8343              $C$DW$917       .dwtag  DW_TAG_member
    8344                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$25)
    8345                      .dwattr $C$DW$917, DW_AT_name("CLKCTL")
    8346                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_CLKCTL")
    8347                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8348                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    8349              $C$DW$918       .dwtag  DW_TAG_member
    8350                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$36)
    8351                      .dwattr $C$DW$918, DW_AT_name("rsvd_2")
    8352                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_rsvd_2")
    8353                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8354                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    8355              $C$DW$919       .dwtag  DW_TAG_member
    8356                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$25)
    8357                      .dwattr $C$DW$919, DW_AT_name("LOSPCP")
    8358                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_LOSPCP")
    8359                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8360                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    8361              $C$DW$920       .dwtag  DW_TAG_member
    8362                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$25)
    8363                      .dwattr $C$DW$920, DW_AT_name("PCLKCR0")
    8364                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_PCLKCR0")
    8365                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  168

    8366                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    8367              $C$DW$921       .dwtag  DW_TAG_member
    8368                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$25)
    8369                      .dwattr $C$DW$921, DW_AT_name("PCLKCR1")
    8370                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_PCLKCR1")
    8371                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8372                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    8373              $C$DW$922       .dwtag  DW_TAG_member
    8374                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$28)
    8375                      .dwattr $C$DW$922, DW_AT_name("rsvd_3")
    8376                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_rsvd_3")
    8377                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8378                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    8379              $C$DW$923       .dwtag  DW_TAG_member
    8380                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$25)
    8381                      .dwattr $C$DW$923, DW_AT_name("PCLKCR3")
    8382                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_PCLKCR3")
    8383                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8384                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    8385                      .dwendtag $C$DW$T$37
    8386              
    8387              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    8388                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
    8389                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
    8390              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    8391                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    8392                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    8393              
    8394              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8395                      .dwattr $C$DW$T$38, DW_AT_name("_CPU_Obj_")
    8396                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    8397              $C$DW$924       .dwtag  DW_TAG_member
    8398                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$34)
    8399                      .dwattr $C$DW$924, DW_AT_name("tmp")
    8400                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_tmp")
    8401                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8402                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    8403                      .dwendtag $C$DW$T$38
    8404              
    8405              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    8406                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$38)
    8407                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
    8408              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    8409                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    8410                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    8411              
    8412              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    8413                      .dwattr $C$DW$T$41, DW_AT_name("_CPU_USAGE_Obj_")
    8414                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x16)
    8415              $C$DW$925       .dwtag  DW_TAG_member
    8416                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$39)
    8417                      .dwattr $C$DW$925, DW_AT_name("timerPeriod_cnts")
    8418                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    8419                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8420                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  169

    8421              $C$DW$926       .dwtag  DW_TAG_member
    8422                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$39)
    8423                      .dwattr $C$DW$926, DW_AT_name("cnt_z0")
    8424                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_cnt_z0")
    8425                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8426                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    8427              $C$DW$927       .dwtag  DW_TAG_member
    8428                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$39)
    8429                      .dwattr $C$DW$927, DW_AT_name("cnt_z1")
    8430                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_cnt_z1")
    8431                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8432                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    8433              $C$DW$928       .dwtag  DW_TAG_member
    8434                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$39)
    8435                      .dwattr $C$DW$928, DW_AT_name("deltaCnt")
    8436                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_deltaCnt")
    8437                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8438                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    8439              $C$DW$929       .dwtag  DW_TAG_member
    8440                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$39)
    8441                      .dwattr $C$DW$929, DW_AT_name("deltaCntAcc")
    8442                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_deltaCntAcc")
    8443                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8444                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    8445              $C$DW$930       .dwtag  DW_TAG_member
    8446                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$39)
    8447                      .dwattr $C$DW$930, DW_AT_name("deltaCntAccNum")
    8448                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_deltaCntAccNum")
    8449                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8450                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    8451              $C$DW$931       .dwtag  DW_TAG_member
    8452                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$39)
    8453                      .dwattr $C$DW$931, DW_AT_name("deltaCntAccNumMax")
    8454                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
    8455                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8456                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    8457              $C$DW$932       .dwtag  DW_TAG_member
    8458                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$39)
    8459                      .dwattr $C$DW$932, DW_AT_name("minDeltaCntObserved")
    8460                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_minDeltaCntObserved")
    8461                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8462                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    8463              $C$DW$933       .dwtag  DW_TAG_member
    8464                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$39)
    8465                      .dwattr $C$DW$933, DW_AT_name("avgDeltaCntObserved")
    8466                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
    8467                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8468                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    8469              $C$DW$934       .dwtag  DW_TAG_member
    8470                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$39)
    8471                      .dwattr $C$DW$934, DW_AT_name("maxDeltaCntObserved")
    8472                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
    8473                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8474                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    8475              $C$DW$935       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  170

    8476                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$40)
    8477                      .dwattr $C$DW$935, DW_AT_name("flag_resetStats")
    8478                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_flag_resetStats")
    8479                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8480                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    8481                      .dwendtag $C$DW$T$41
    8482              
    8483              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Obj")
    8484                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$41)
    8485                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    8486              $C$DW$T$194     .dwtag  DW_TAG_pointer_type
    8487                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$41)
    8488                      .dwattr $C$DW$T$194, DW_AT_address_class(0x16)
    8489              $C$DW$T$195     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Handle")
    8490                      .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$194)
    8491                      .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    8492              
    8493              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    8494                      .dwattr $C$DW$T$44, DW_AT_name("_CTRL_Version_")
    8495                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    8496              $C$DW$936       .dwtag  DW_TAG_member
    8497                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$24)
    8498                      .dwattr $C$DW$936, DW_AT_name("rsvd")
    8499                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_rsvd")
    8500                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8501                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    8502              $C$DW$937       .dwtag  DW_TAG_member
    8503                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$43)
    8504                      .dwattr $C$DW$937, DW_AT_name("targetProc")
    8505                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_targetProc")
    8506                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8507                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    8508              $C$DW$938       .dwtag  DW_TAG_member
    8509                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$24)
    8510                      .dwattr $C$DW$938, DW_AT_name("major")
    8511                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_major")
    8512                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8513                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    8514              $C$DW$939       .dwtag  DW_TAG_member
    8515                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$24)
    8516                      .dwattr $C$DW$939, DW_AT_name("minor")
    8517                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_minor")
    8518                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8519                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    8520                      .dwendtag $C$DW$T$44
    8521              
    8522              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    8523                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$44)
    8524                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    8525              
    8526              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8527                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    8528                      .dwattr $C$DW$T$20, DW_AT_declaration
    8529                      .dwendtag $C$DW$T$20
    8530              
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  171

    8531              $C$DW$T$146     .dwtag  DW_TAG_pointer_type
    8532                      .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$20)
    8533                      .dwattr $C$DW$T$146, DW_AT_address_class(0x16)
    8534              $C$DW$T$147     .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    8535                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
    8536                      .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
    8537              $C$DW$940       .dwtag  DW_TAG_TI_far_type
    8538                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$147)
    8539              $C$DW$T$199     .dwtag  DW_TAG_const_type
    8540                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$940)
    8541              
    8542              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    8543                      .dwattr $C$DW$T$45, DW_AT_name("_FILTER_FO_")
    8544                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x0a)
    8545              $C$DW$941       .dwtag  DW_TAG_member
    8546                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$33)
    8547                      .dwattr $C$DW$941, DW_AT_name("a1")
    8548                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_a1")
    8549                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8550                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    8551              $C$DW$942       .dwtag  DW_TAG_member
    8552                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$33)
    8553                      .dwattr $C$DW$942, DW_AT_name("b0")
    8554                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_b0")
    8555                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8556                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    8557              $C$DW$943       .dwtag  DW_TAG_member
    8558                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$33)
    8559                      .dwattr $C$DW$943, DW_AT_name("b1")
    8560                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_b1")
    8561                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8562                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    8563              $C$DW$944       .dwtag  DW_TAG_member
    8564                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$33)
    8565                      .dwattr $C$DW$944, DW_AT_name("x1")
    8566                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_x1")
    8567                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8568                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    8569              $C$DW$945       .dwtag  DW_TAG_member
    8570                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$33)
    8571                      .dwattr $C$DW$945, DW_AT_name("y1")
    8572                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_y1")
    8573                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8574                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    8575                      .dwendtag $C$DW$T$45
    8576              
    8577              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    8578                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$45)
    8579                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    8580              
    8581              $C$DW$T$204     .dwtag  DW_TAG_array_type
    8582                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$104)
    8583                      .dwattr $C$DW$T$204, DW_AT_language(DW_LANG_C)
    8584                      .dwattr $C$DW$T$204, DW_AT_byte_size(0x3c)
    8585              $C$DW$946       .dwtag  DW_TAG_subrange_type
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  172

    8586                      .dwattr $C$DW$946, DW_AT_upper_bound(0x05)
    8587                      .dwendtag $C$DW$T$204
    8588              
    8589              $C$DW$T$205     .dwtag  DW_TAG_pointer_type
    8590                      .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$104)
    8591                      .dwattr $C$DW$T$205, DW_AT_address_class(0x16)
    8592              
    8593              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    8594                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    8595                      .dwattr $C$DW$T$21, DW_AT_declaration
    8596                      .dwendtag $C$DW$T$21
    8597              
    8598              $C$DW$T$105     .dwtag  DW_TAG_pointer_type
    8599                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$21)
    8600                      .dwattr $C$DW$T$105, DW_AT_address_class(0x16)
    8601              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    8602                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
    8603                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    8604              
    8605              $C$DW$T$209     .dwtag  DW_TAG_array_type
    8606                      .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$106)
    8607                      .dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
    8608                      .dwattr $C$DW$T$209, DW_AT_byte_size(0x0c)
    8609              $C$DW$947       .dwtag  DW_TAG_subrange_type
    8610                      .dwattr $C$DW$947, DW_AT_upper_bound(0x05)
    8611                      .dwendtag $C$DW$T$209
    8612              
    8613              
    8614              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    8615                      .dwattr $C$DW$T$46, DW_AT_name("_FLASH_Obj_")
    8616                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x08)
    8617              $C$DW$948       .dwtag  DW_TAG_member
    8618                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$25)
    8619                      .dwattr $C$DW$948, DW_AT_name("FOPT")
    8620                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_FOPT")
    8621                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8622                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    8623              $C$DW$949       .dwtag  DW_TAG_member
    8624                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$25)
    8625                      .dwattr $C$DW$949, DW_AT_name("rsvd_1")
    8626                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_rsvd_1")
    8627                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8628                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    8629              $C$DW$950       .dwtag  DW_TAG_member
    8630                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$25)
    8631                      .dwattr $C$DW$950, DW_AT_name("FPWR")
    8632                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_FPWR")
    8633                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8634                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    8635              $C$DW$951       .dwtag  DW_TAG_member
    8636                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$25)
    8637                      .dwattr $C$DW$951, DW_AT_name("FSTATUS")
    8638                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_FSTATUS")
    8639                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8640                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  173

    8641              $C$DW$952       .dwtag  DW_TAG_member
    8642                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$25)
    8643                      .dwattr $C$DW$952, DW_AT_name("FSTDBYWAIT")
    8644                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    8645                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8646                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    8647              $C$DW$953       .dwtag  DW_TAG_member
    8648                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$25)
    8649                      .dwattr $C$DW$953, DW_AT_name("FACTIVEWAIT")
    8650                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    8651                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8652                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    8653              $C$DW$954       .dwtag  DW_TAG_member
    8654                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$25)
    8655                      .dwattr $C$DW$954, DW_AT_name("FBANKWAIT")
    8656                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_FBANKWAIT")
    8657                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8658                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    8659              $C$DW$955       .dwtag  DW_TAG_member
    8660                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$25)
    8661                      .dwattr $C$DW$955, DW_AT_name("FOTPWAIT")
    8662                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_FOTPWAIT")
    8663                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8664                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    8665                      .dwendtag $C$DW$T$46
    8666              
    8667              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    8668                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$46)
    8669                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
    8670              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    8671                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    8672                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    8673              
    8674              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    8675                      .dwattr $C$DW$T$47, DW_AT_name("_FW_Obj_")
    8676                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x14)
    8677              $C$DW$956       .dwtag  DW_TAG_member
    8678                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$39)
    8679                      .dwattr $C$DW$956, DW_AT_name("numIsrTicksPerFwTick")
    8680                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_numIsrTicksPerFwTick")
    8681                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8682                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    8683              $C$DW$957       .dwtag  DW_TAG_member
    8684                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$39)
    8685                      .dwattr $C$DW$957, DW_AT_name("counter_fw")
    8686                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_counter_fw")
    8687                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8688                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    8689              $C$DW$958       .dwtag  DW_TAG_member
    8690                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$33)
    8691                      .dwattr $C$DW$958, DW_AT_name("delta_inc")
    8692                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_delta_inc")
    8693                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8694                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    8695              $C$DW$959       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  174

    8696                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$33)
    8697                      .dwattr $C$DW$959, DW_AT_name("delta_dec")
    8698                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_delta_dec")
    8699                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8700                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    8701              $C$DW$960       .dwtag  DW_TAG_member
    8702                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$33)
    8703                      .dwattr $C$DW$960, DW_AT_name("refValue")
    8704                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_refValue")
    8705                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8706                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    8707              $C$DW$961       .dwtag  DW_TAG_member
    8708                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$33)
    8709                      .dwattr $C$DW$961, DW_AT_name("fbackValue")
    8710                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_fbackValue")
    8711                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8712                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    8713              $C$DW$962       .dwtag  DW_TAG_member
    8714                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$33)
    8715                      .dwattr $C$DW$962, DW_AT_name("output")
    8716                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_output")
    8717                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8718                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    8719              $C$DW$963       .dwtag  DW_TAG_member
    8720                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$33)
    8721                      .dwattr $C$DW$963, DW_AT_name("outMin")
    8722                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_outMin")
    8723                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8724                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    8725              $C$DW$964       .dwtag  DW_TAG_member
    8726                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$33)
    8727                      .dwattr $C$DW$964, DW_AT_name("outMax")
    8728                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_outMax")
    8729                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8730                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    8731              $C$DW$965       .dwtag  DW_TAG_member
    8732                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$40)
    8733                      .dwattr $C$DW$965, DW_AT_name("flag_enableFw")
    8734                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_flag_enableFw")
    8735                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8736                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    8737                      .dwendtag $C$DW$T$47
    8738              
    8739              $C$DW$T$214     .dwtag  DW_TAG_typedef, DW_AT_name("FW_Obj")
    8740                      .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$47)
    8741                      .dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
    8742              $C$DW$T$215     .dwtag  DW_TAG_pointer_type
    8743                      .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$214)
    8744                      .dwattr $C$DW$T$215, DW_AT_address_class(0x16)
    8745              $C$DW$T$216     .dwtag  DW_TAG_pointer_type
    8746                      .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$47)
    8747                      .dwattr $C$DW$T$216, DW_AT_address_class(0x16)
    8748              $C$DW$T$217     .dwtag  DW_TAG_typedef, DW_AT_name("FW_Handle")
    8749                      .dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$216)
    8750                      .dwattr $C$DW$T$217, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  175

    8751              
    8752              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    8753                      .dwattr $C$DW$T$51, DW_AT_name("_GPIO_Obj_")
    8754                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x6a)
    8755              $C$DW$966       .dwtag  DW_TAG_member
    8756                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$48)
    8757                      .dwattr $C$DW$966, DW_AT_name("GPACTRL")
    8758                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_GPACTRL")
    8759                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8760                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    8761              $C$DW$967       .dwtag  DW_TAG_member
    8762                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$48)
    8763                      .dwattr $C$DW$967, DW_AT_name("GPAQSEL1")
    8764                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_GPAQSEL1")
    8765                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8766                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    8767              $C$DW$968       .dwtag  DW_TAG_member
    8768                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$48)
    8769                      .dwattr $C$DW$968, DW_AT_name("GPAQSEL2")
    8770                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_GPAQSEL2")
    8771                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8772                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    8773              $C$DW$969       .dwtag  DW_TAG_member
    8774                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$48)
    8775                      .dwattr $C$DW$969, DW_AT_name("GPAMUX1")
    8776                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_GPAMUX1")
    8777                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8778                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    8779              $C$DW$970       .dwtag  DW_TAG_member
    8780                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$48)
    8781                      .dwattr $C$DW$970, DW_AT_name("GPAMUX2")
    8782                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_GPAMUX2")
    8783                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8784                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    8785              $C$DW$971       .dwtag  DW_TAG_member
    8786                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$48)
    8787                      .dwattr $C$DW$971, DW_AT_name("GPADIR")
    8788                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_GPADIR")
    8789                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8790                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    8791              $C$DW$972       .dwtag  DW_TAG_member
    8792                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$48)
    8793                      .dwattr $C$DW$972, DW_AT_name("GPAPUD")
    8794                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_GPAPUD")
    8795                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8796                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    8797              $C$DW$973       .dwtag  DW_TAG_member
    8798                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$28)
    8799                      .dwattr $C$DW$973, DW_AT_name("rsvd_1")
    8800                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_rsvd_1")
    8801                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8802                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    8803              $C$DW$974       .dwtag  DW_TAG_member
    8804                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$48)
    8805                      .dwattr $C$DW$974, DW_AT_name("GPBCTRL")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  176

    8806                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_GPBCTRL")
    8807                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8808                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    8809              $C$DW$975       .dwtag  DW_TAG_member
    8810                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$48)
    8811                      .dwattr $C$DW$975, DW_AT_name("GPBQSEL1")
    8812                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_GPBQSEL1")
    8813                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8814                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    8815              $C$DW$976       .dwtag  DW_TAG_member
    8816                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$28)
    8817                      .dwattr $C$DW$976, DW_AT_name("rsvd_2")
    8818                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_rsvd_2")
    8819                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8820                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    8821              $C$DW$977       .dwtag  DW_TAG_member
    8822                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$48)
    8823                      .dwattr $C$DW$977, DW_AT_name("GPBMUX1")
    8824                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_GPBMUX1")
    8825                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8826                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    8827              $C$DW$978       .dwtag  DW_TAG_member
    8828                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$28)
    8829                      .dwattr $C$DW$978, DW_AT_name("rsvd_3")
    8830                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_rsvd_3")
    8831                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8832                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    8833              $C$DW$979       .dwtag  DW_TAG_member
    8834                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$48)
    8835                      .dwattr $C$DW$979, DW_AT_name("GPBDIR")
    8836                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_GPBDIR")
    8837                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8838                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    8839              $C$DW$980       .dwtag  DW_TAG_member
    8840                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$48)
    8841                      .dwattr $C$DW$980, DW_AT_name("GPBPUD")
    8842                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_GPBPUD")
    8843                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8844                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    8845              $C$DW$981       .dwtag  DW_TAG_member
    8846                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$49)
    8847                      .dwattr $C$DW$981, DW_AT_name("rsvd_4")
    8848                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_rsvd_4")
    8849                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8850                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    8851              $C$DW$982       .dwtag  DW_TAG_member
    8852                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$48)
    8853                      .dwattr $C$DW$982, DW_AT_name("AIOMUX1")
    8854                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_AIOMUX1")
    8855                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    8856                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    8857              $C$DW$983       .dwtag  DW_TAG_member
    8858                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$28)
    8859                      .dwattr $C$DW$983, DW_AT_name("rsvd_5")
    8860                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_rsvd_5")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  177

    8861                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8862                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    8863              $C$DW$984       .dwtag  DW_TAG_member
    8864                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$48)
    8865                      .dwattr $C$DW$984, DW_AT_name("AIODIR")
    8866                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_AIODIR")
    8867                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    8868                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    8869              $C$DW$985       .dwtag  DW_TAG_member
    8870                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$50)
    8871                      .dwattr $C$DW$985, DW_AT_name("rsvd_6")
    8872                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_rsvd_6")
    8873                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    8874                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    8875              $C$DW$986       .dwtag  DW_TAG_member
    8876                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$48)
    8877                      .dwattr $C$DW$986, DW_AT_name("GPADAT")
    8878                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_GPADAT")
    8879                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8880                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    8881              $C$DW$987       .dwtag  DW_TAG_member
    8882                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$48)
    8883                      .dwattr $C$DW$987, DW_AT_name("GPASET")
    8884                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_GPASET")
    8885                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    8886                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    8887              $C$DW$988       .dwtag  DW_TAG_member
    8888                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$48)
    8889                      .dwattr $C$DW$988, DW_AT_name("GPACLEAR")
    8890                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_GPACLEAR")
    8891                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8892                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    8893              $C$DW$989       .dwtag  DW_TAG_member
    8894                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$48)
    8895                      .dwattr $C$DW$989, DW_AT_name("GPATOGGLE")
    8896                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_GPATOGGLE")
    8897                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8898                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    8899              $C$DW$990       .dwtag  DW_TAG_member
    8900                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$48)
    8901                      .dwattr $C$DW$990, DW_AT_name("GPBDAT")
    8902                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_GPBDAT")
    8903                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8904                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    8905              $C$DW$991       .dwtag  DW_TAG_member
    8906                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$48)
    8907                      .dwattr $C$DW$991, DW_AT_name("GPBSET")
    8908                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_GPBSET")
    8909                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    8910                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    8911              $C$DW$992       .dwtag  DW_TAG_member
    8912                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$48)
    8913                      .dwattr $C$DW$992, DW_AT_name("GPBCLEAR")
    8914                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_GPBCLEAR")
    8915                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  178

    8916                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    8917              $C$DW$993       .dwtag  DW_TAG_member
    8918                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$48)
    8919                      .dwattr $C$DW$993, DW_AT_name("GPBTOGGLE")
    8920                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_GPBTOGGLE")
    8921                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    8922                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    8923              $C$DW$994       .dwtag  DW_TAG_member
    8924                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$36)
    8925                      .dwattr $C$DW$994, DW_AT_name("rsvd_7")
    8926                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_rsvd_7")
    8927                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    8928                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    8929              $C$DW$995       .dwtag  DW_TAG_member
    8930                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$48)
    8931                      .dwattr $C$DW$995, DW_AT_name("AIODAT")
    8932                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_AIODAT")
    8933                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8934                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    8935              $C$DW$996       .dwtag  DW_TAG_member
    8936                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$48)
    8937                      .dwattr $C$DW$996, DW_AT_name("AIOSET")
    8938                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_AIOSET")
    8939                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    8940                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    8941              $C$DW$997       .dwtag  DW_TAG_member
    8942                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$48)
    8943                      .dwattr $C$DW$997, DW_AT_name("AIOCLEAR")
    8944                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_AIOCLEAR")
    8945                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8946                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    8947              $C$DW$998       .dwtag  DW_TAG_member
    8948                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$48)
    8949                      .dwattr $C$DW$998, DW_AT_name("AIOTOGGLE")
    8950                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_AIOTOGGLE")
    8951                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8952                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    8953              $C$DW$999       .dwtag  DW_TAG_member
    8954                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$30)
    8955                      .dwattr $C$DW$999, DW_AT_name("GPIOXINTnSEL")
    8956                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    8957                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8958                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    8959              $C$DW$1000      .dwtag  DW_TAG_member
    8960                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$29)
    8961                      .dwattr $C$DW$1000, DW_AT_name("rsvd_8")
    8962                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_rsvd_8")
    8963                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    8964                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    8965              $C$DW$1001      .dwtag  DW_TAG_member
    8966                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$48)
    8967                      .dwattr $C$DW$1001, DW_AT_name("GPIOLPMSEL")
    8968                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    8969                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    8970                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  179

    8971                      .dwendtag $C$DW$T$51
    8972              
    8973              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    8974                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$51)
    8975                      .dwattr $C$DW$T$62, DW_AT_address_class(0x16)
    8976              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    8977                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    8978                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    8979              
    8980              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    8981                      .dwattr $C$DW$T$53, DW_AT_name("_HAL_AdcData_t_")
    8982                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x0e)
    8983              $C$DW$1002      .dwtag  DW_TAG_member
    8984                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$52)
    8985                      .dwattr $C$DW$1002, DW_AT_name("I")
    8986                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_I")
    8987                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8988                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    8989              $C$DW$1003      .dwtag  DW_TAG_member
    8990                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$52)
    8991                      .dwattr $C$DW$1003, DW_AT_name("V")
    8992                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_V")
    8993                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8994                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    8995              $C$DW$1004      .dwtag  DW_TAG_member
    8996                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$33)
    8997                      .dwattr $C$DW$1004, DW_AT_name("dcBus")
    8998                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_dcBus")
    8999                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9000                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    9001                      .dwendtag $C$DW$T$53
    9002              
    9003              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    9004                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$53)
    9005                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    9006              
    9007              $C$DW$T$88      .dwtag  DW_TAG_structure_type
    9008                      .dwattr $C$DW$T$88, DW_AT_name("_HAL_Obj_")
    9009                      .dwattr $C$DW$T$88, DW_AT_byte_size(0xa8)
    9010              $C$DW$1005      .dwtag  DW_TAG_member
    9011                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$55)
    9012                      .dwattr $C$DW$1005, DW_AT_name("adcHandle")
    9013                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_adcHandle")
    9014                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9015                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    9016              $C$DW$1006      .dwtag  DW_TAG_member
    9017                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$57)
    9018                      .dwattr $C$DW$1006, DW_AT_name("clkHandle")
    9019                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_clkHandle")
    9020                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9021                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    9022              $C$DW$1007      .dwtag  DW_TAG_member
    9023                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$59)
    9024                      .dwattr $C$DW$1007, DW_AT_name("cpuHandle")
    9025                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_cpuHandle")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  180

    9026                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9027                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    9028              $C$DW$1008      .dwtag  DW_TAG_member
    9029                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$61)
    9030                      .dwattr $C$DW$1008, DW_AT_name("flashHandle")
    9031                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_flashHandle")
    9032                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9033                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    9034              $C$DW$1009      .dwtag  DW_TAG_member
    9035                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$63)
    9036                      .dwattr $C$DW$1009, DW_AT_name("gpioHandle")
    9037                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_gpioHandle")
    9038                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9039                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    9040              $C$DW$1010      .dwtag  DW_TAG_member
    9041                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$66)
    9042                      .dwattr $C$DW$1010, DW_AT_name("offsetHandle_I")
    9043                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_offsetHandle_I")
    9044                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9045                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    9046              $C$DW$1011      .dwtag  DW_TAG_member
    9047                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$68)
    9048                      .dwattr $C$DW$1011, DW_AT_name("offset_I")
    9049                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_offset_I")
    9050                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9051                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    9052              $C$DW$1012      .dwtag  DW_TAG_member
    9053                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$66)
    9054                      .dwattr $C$DW$1012, DW_AT_name("offsetHandle_V")
    9055                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_offsetHandle_V")
    9056                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9057                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    9058              $C$DW$1013      .dwtag  DW_TAG_member
    9059                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$68)
    9060                      .dwattr $C$DW$1013, DW_AT_name("offset_V")
    9061                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_offset_V")
    9062                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9063                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    9064              $C$DW$1014      .dwtag  DW_TAG_member
    9065                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$70)
    9066                      .dwattr $C$DW$1014, DW_AT_name("oscHandle")
    9067                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_oscHandle")
    9068                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    9069                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    9070              $C$DW$1015      .dwtag  DW_TAG_member
    9071                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$72)
    9072                      .dwattr $C$DW$1015, DW_AT_name("pieHandle")
    9073                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_pieHandle")
    9074                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    9075                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    9076              $C$DW$1016      .dwtag  DW_TAG_member
    9077                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$74)
    9078                      .dwattr $C$DW$1016, DW_AT_name("pllHandle")
    9079                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_pllHandle")
    9080                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  181

    9081                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    9082              $C$DW$1017      .dwtag  DW_TAG_member
    9083                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$77)
    9084                      .dwattr $C$DW$1017, DW_AT_name("pwmHandle")
    9085                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_pwmHandle")
    9086                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    9087                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    9088              $C$DW$1018      .dwtag  DW_TAG_member
    9089                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$77)
    9090                      .dwattr $C$DW$1018, DW_AT_name("pwmDacHandle")
    9091                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_pwmDacHandle")
    9092                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    9093                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    9094              $C$DW$1019      .dwtag  DW_TAG_member
    9095                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$79)
    9096                      .dwattr $C$DW$1019, DW_AT_name("pwrHandle")
    9097                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_pwrHandle")
    9098                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    9099                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    9100              $C$DW$1020      .dwtag  DW_TAG_member
    9101                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$82)
    9102                      .dwattr $C$DW$1020, DW_AT_name("timerHandle")
    9103                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_timerHandle")
    9104                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    9105                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    9106              $C$DW$1021      .dwtag  DW_TAG_member
    9107                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$84)
    9108                      .dwattr $C$DW$1021, DW_AT_name("i2cHandle")
    9109                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_i2cHandle")
    9110                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    9111                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    9112              $C$DW$1022      .dwtag  DW_TAG_member
    9113                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$86)
    9114                      .dwattr $C$DW$1022, DW_AT_name("wdogHandle")
    9115                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_wdogHandle")
    9116                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9117                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    9118              $C$DW$1023      .dwtag  DW_TAG_member
    9119                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$87)
    9120                      .dwattr $C$DW$1023, DW_AT_name("adcBias")
    9121                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_adcBias")
    9122                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    9123                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    9124              $C$DW$1024      .dwtag  DW_TAG_member
    9125                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$33)
    9126                      .dwattr $C$DW$1024, DW_AT_name("current_sf")
    9127                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_current_sf")
    9128                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    9129                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    9130              $C$DW$1025      .dwtag  DW_TAG_member
    9131                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$33)
    9132                      .dwattr $C$DW$1025, DW_AT_name("voltage_sf")
    9133                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_voltage_sf")
    9134                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9135                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  182

    9136              $C$DW$1026      .dwtag  DW_TAG_member
    9137                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$34)
    9138                      .dwattr $C$DW$1026, DW_AT_name("numCurrentSensors")
    9139                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_numCurrentSensors")
    9140                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    9141                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    9142              $C$DW$1027      .dwtag  DW_TAG_member
    9143                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$34)
    9144                      .dwattr $C$DW$1027, DW_AT_name("numVoltageSensors")
    9145                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_numVoltageSensors")
    9146                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0xa7]
    9147                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    9148                      .dwendtag $C$DW$T$88
    9149              
    9150              $C$DW$T$221     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    9151                      .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$88)
    9152                      .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    9153              $C$DW$T$222     .dwtag  DW_TAG_pointer_type
    9154                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    9155                      .dwattr $C$DW$T$222, DW_AT_address_class(0x16)
    9156              $C$DW$T$223     .dwtag  DW_TAG_pointer_type
    9157                      .dwattr $C$DW$T$223, DW_AT_type(*$C$DW$T$88)
    9158                      .dwattr $C$DW$T$223, DW_AT_address_class(0x16)
    9159              $C$DW$T$224     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    9160                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$223)
    9161                      .dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
    9162              
    9163              $C$DW$T$89      .dwtag  DW_TAG_structure_type
    9164                      .dwattr $C$DW$T$89, DW_AT_name("_HAL_PwmData_t_")
    9165                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x06)
    9166              $C$DW$1028      .dwtag  DW_TAG_member
    9167                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$52)
    9168                      .dwattr $C$DW$1028, DW_AT_name("Tabc")
    9169                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_Tabc")
    9170                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9171                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    9172                      .dwendtag $C$DW$T$89
    9173              
    9174              $C$DW$T$228     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_PwmData_t")
    9175                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$89)
    9176                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    9177              
    9178              $C$DW$T$90      .dwtag  DW_TAG_structure_type
    9179                      .dwattr $C$DW$T$90, DW_AT_name("_IPARK_Obj_")
    9180                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x04)
    9181              $C$DW$1029      .dwtag  DW_TAG_member
    9182                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$33)
    9183                      .dwattr $C$DW$1029, DW_AT_name("sinTh")
    9184                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_sinTh")
    9185                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9186                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    9187              $C$DW$1030      .dwtag  DW_TAG_member
    9188                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$33)
    9189                      .dwattr $C$DW$1030, DW_AT_name("cosTh")
    9190                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_cosTh")
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  183

    9191                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9192                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    9193                      .dwendtag $C$DW$T$90
    9194              
    9195              $C$DW$T$231     .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    9196                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$90)
    9197                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    9198              $C$DW$T$232     .dwtag  DW_TAG_pointer_type
    9199                      .dwattr $C$DW$T$232, DW_AT_type(*$C$DW$T$231)
    9200                      .dwattr $C$DW$T$232, DW_AT_address_class(0x16)
    9201              $C$DW$T$233     .dwtag  DW_TAG_pointer_type
    9202                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$T$90)
    9203                      .dwattr $C$DW$T$233, DW_AT_address_class(0x16)
    9204              $C$DW$T$234     .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    9205                      .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$233)
    9206                      .dwattr $C$DW$T$234, DW_AT_language(DW_LANG_C)
    9207              
    9208              $C$DW$T$92      .dwtag  DW_TAG_structure_type
    9209                      .dwattr $C$DW$T$92, DW_AT_name("_MATH_vec2_")
    9210                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x04)
    9211              $C$DW$1031      .dwtag  DW_TAG_member
    9212                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$91)
    9213                      .dwattr $C$DW$1031, DW_AT_name("value")
    9214                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_value")
    9215                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9216                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    9217                      .dwendtag $C$DW$T$92
    9218              
    9219              $C$DW$T$238     .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    9220                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$92)
    9221                      .dwattr $C$DW$T$238, DW_AT_language(DW_LANG_C)
    9222              $C$DW$1032      .dwtag  DW_TAG_TI_far_type
    9223                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$238)
    9224              $C$DW$T$239     .dwtag  DW_TAG_const_type
    9225                      .dwattr $C$DW$T$239, DW_AT_type(*$C$DW$1032)
    9226              $C$DW$T$240     .dwtag  DW_TAG_pointer_type
    9227                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$239)
    9228                      .dwattr $C$DW$T$240, DW_AT_address_class(0x16)
    9229              $C$DW$T$241     .dwtag  DW_TAG_pointer_type
    9230                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$238)
    9231                      .dwattr $C$DW$T$241, DW_AT_address_class(0x16)
    9232              
    9233              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    9234                      .dwattr $C$DW$T$94, DW_AT_name("_MATH_vec3_")
    9235                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x06)
    9236              $C$DW$1033      .dwtag  DW_TAG_member
    9237                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$93)
    9238                      .dwattr $C$DW$1033, DW_AT_name("value")
    9239                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_value")
    9240                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9241                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    9242                      .dwendtag $C$DW$T$94
    9243              
    9244              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
    9245                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$94)
TMS320C2000 Assembler PC v6.2.5 Thu Jun 22 10:43:13 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\0793610                              PAGE  184

    9246                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    9247              
    9248              $C$DW$T$103     .dwtag  DW_TAG_structure_type
    9249                      .dwattr $C$DW$T$103, DW_AT_name("_MOTOR_Vars_t_")
