TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Jul 08 16:16:11 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/modules/hal/boards/hvkit_rev1p1/f28x/f2802x/src/hal.
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("TIMER_setPreScaler")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_TIMER_setPreScaler")

    9578                      .dwattr $C$DW$T$297, DW_AT_language(DW_LANG_C)
    9579              
    9580              $C$DW$T$298     .dwtag  DW_TAG_enumeration_type
    9581                      .dwattr $C$DW$T$298, DW_AT_byte_size(0x01)
    9582              $C$DW$1665      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_1_Bit"), DW_AT_const_value(0x01)
    9583              $C$DW$1666      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_2_Bits"), DW_AT_const_value(0x02)
    9584              $C$DW$1667      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_3_Bits"), DW_AT_const_value(0x03)
    9585              $C$DW$1668      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_4_Bits"), DW_AT_const_value(0x04)
    9586              $C$DW$1669      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_5_Bits"), DW_AT_const_value(0x05)
    9587              $C$DW$1670      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_6_Bits"), DW_AT_const_value(0x06)
    9588              $C$DW$1671      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_7_Bits"), DW_AT_const_value(0x07)
    9589              $C$DW$1672      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_BitCount_8_Bits"), DW_AT_const_value(0x00)
    9590                      .dwendtag $C$DW$T$298
    9591              
    9592              $C$DW$T$299     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_BitCount_e")
    9593                      .dwattr $C$DW$T$299, DW_AT_type(*$C$DW$T$298)
    9594                      .dwattr $C$DW$T$299, DW_AT_language(DW_LANG_C)
    9595              
    9596              $C$DW$T$300     .dwtag  DW_TAG_enumeration_type
    9597                      .dwattr $C$DW$T$300, DW_AT_byte_size(0x01)
    9598              $C$DW$1673      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_None"), DW_AT_const_value(0x00)
    9599              $C$DW$1674      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Arb_Lost"), DW_AT_const_value(0x01)
    9600              $C$DW$1675      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_NACK"), DW_AT_const_value(0x02)
    9601              $C$DW$1676      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Reg_Rdy"), DW_AT_const_value(0x04)
    9602              $C$DW$1677      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Rx_Rdy"), DW_AT_const_value(0x08)
    9603              $C$DW$1678      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Tx_Rdy"), DW_AT_const_value(0x10)
    9604              $C$DW$1679      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Stop"), DW_AT_const_value(0x20)
    9605              $C$DW$1680      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_AD0"), DW_AT_const_value(0x100)
    9606              $C$DW$1681      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Slave_Addr"), DW_AT_const_value(0x200)
    9607              $C$DW$1682      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Tx_Empty"), DW_AT_const_value(0x400)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  185

    9608              $C$DW$1683      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Rx_Full"), DW_AT_const_value(0x800)
    9609              $C$DW$1684      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Busy"), DW_AT_const_value(0x1000)
    9610              $C$DW$1685      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_NACK_Sent"), DW_AT_const_value(0x2000)
    9611              $C$DW$1686      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Slave_Dir"), DW_AT_const_value(0x4000)
    9612                      .dwendtag $C$DW$T$300
    9613              
    9614              $C$DW$T$301     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Status_e")
    9615                      .dwattr $C$DW$T$301, DW_AT_type(*$C$DW$T$300)
    9616                      .dwattr $C$DW$T$301, DW_AT_language(DW_LANG_C)
    9617              
    9618              $C$DW$T$305     .dwtag  DW_TAG_enumeration_type
    9619                      .dwattr $C$DW$T$305, DW_AT_byte_size(0x01)
    9620              $C$DW$1687      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    9621              $C$DW$1688      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    9622                      .dwendtag $C$DW$T$305
    9623              
    9624              $C$DW$T$306     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    9625                      .dwattr $C$DW$T$306, DW_AT_type(*$C$DW$T$305)
    9626                      .dwattr $C$DW$T$306, DW_AT_language(DW_LANG_C)
    9627              
    9628              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9629                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
    9630                      .dwattr $C$DW$T$19, DW_AT_declaration
    9631                      .dwendtag $C$DW$T$19
    9632              
    9633              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9634                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$19)
    9635                      .dwattr $C$DW$T$79, DW_AT_address_class(0x16)
    9636              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    9637                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    9638                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    9639              
    9640              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    9641                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    9642                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    9643              $C$DW$1689      .dwtag  DW_TAG_member
    9644                      .dwattr $C$DW$1689, DW_AT_type(*$C$DW$T$24)
    9645                      .dwattr $C$DW$1689, DW_AT_name("ADCRESULT")
    9646                      .dwattr $C$DW$1689, DW_AT_TI_symbol_name("_ADCRESULT")
    9647                      .dwattr $C$DW$1689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9648                      .dwattr $C$DW$1689, DW_AT_accessibility(DW_ACCESS_public)
    9649              $C$DW$1690      .dwtag  DW_TAG_member
    9650                      .dwattr $C$DW$1690, DW_AT_type(*$C$DW$T$25)
    9651                      .dwattr $C$DW$1690, DW_AT_name("resvd_1")
    9652                      .dwattr $C$DW$1690, DW_AT_TI_symbol_name("_resvd_1")
    9653                      .dwattr $C$DW$1690, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9654                      .dwattr $C$DW$1690, DW_AT_accessibility(DW_ACCESS_public)
    9655              $C$DW$1691      .dwtag  DW_TAG_member
    9656                      .dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$23)
    9657                      .dwattr $C$DW$1691, DW_AT_name("ADCCTL1")
    9658                      .dwattr $C$DW$1691, DW_AT_TI_symbol_name("_ADCCTL1")
    9659                      .dwattr $C$DW$1691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9660                      .dwattr $C$DW$1691, DW_AT_accessibility(DW_ACCESS_public)
    9661              $C$DW$1692      .dwtag  DW_TAG_member
    9662                      .dwattr $C$DW$1692, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  186

    9663                      .dwattr $C$DW$1692, DW_AT_name("ADCCTL2")
    9664                      .dwattr $C$DW$1692, DW_AT_TI_symbol_name("_ADCCTL2")
    9665                      .dwattr $C$DW$1692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9666                      .dwattr $C$DW$1692, DW_AT_accessibility(DW_ACCESS_public)
    9667              $C$DW$1693      .dwtag  DW_TAG_member
    9668                      .dwattr $C$DW$1693, DW_AT_type(*$C$DW$T$26)
    9669                      .dwattr $C$DW$1693, DW_AT_name("rsvd_2")
    9670                      .dwattr $C$DW$1693, DW_AT_TI_symbol_name("_rsvd_2")
    9671                      .dwattr $C$DW$1693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9672                      .dwattr $C$DW$1693, DW_AT_accessibility(DW_ACCESS_public)
    9673              $C$DW$1694      .dwtag  DW_TAG_member
    9674                      .dwattr $C$DW$1694, DW_AT_type(*$C$DW$T$23)
    9675                      .dwattr $C$DW$1694, DW_AT_name("ADCINTFLG")
    9676                      .dwattr $C$DW$1694, DW_AT_TI_symbol_name("_ADCINTFLG")
    9677                      .dwattr $C$DW$1694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9678                      .dwattr $C$DW$1694, DW_AT_accessibility(DW_ACCESS_public)
    9679              $C$DW$1695      .dwtag  DW_TAG_member
    9680                      .dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$23)
    9681                      .dwattr $C$DW$1695, DW_AT_name("ADCINTFLGCLR")
    9682                      .dwattr $C$DW$1695, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9683                      .dwattr $C$DW$1695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9684                      .dwattr $C$DW$1695, DW_AT_accessibility(DW_ACCESS_public)
    9685              $C$DW$1696      .dwtag  DW_TAG_member
    9686                      .dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$23)
    9687                      .dwattr $C$DW$1696, DW_AT_name("ADCINTOVF")
    9688                      .dwattr $C$DW$1696, DW_AT_TI_symbol_name("_ADCINTOVF")
    9689                      .dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9690                      .dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
    9691              $C$DW$1697      .dwtag  DW_TAG_member
    9692                      .dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$23)
    9693                      .dwattr $C$DW$1697, DW_AT_name("ADCINTOVFCLR")
    9694                      .dwattr $C$DW$1697, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9695                      .dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9696                      .dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
    9697              $C$DW$1698      .dwtag  DW_TAG_member
    9698                      .dwattr $C$DW$1698, DW_AT_type(*$C$DW$T$27)
    9699                      .dwattr $C$DW$1698, DW_AT_name("INTSELxNy")
    9700                      .dwattr $C$DW$1698, DW_AT_TI_symbol_name("_INTSELxNy")
    9701                      .dwattr $C$DW$1698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9702                      .dwattr $C$DW$1698, DW_AT_accessibility(DW_ACCESS_public)
    9703              $C$DW$1699      .dwtag  DW_TAG_member
    9704                      .dwattr $C$DW$1699, DW_AT_type(*$C$DW$T$28)
    9705                      .dwattr $C$DW$1699, DW_AT_name("rsvd_3")
    9706                      .dwattr $C$DW$1699, DW_AT_TI_symbol_name("_rsvd_3")
    9707                      .dwattr $C$DW$1699, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9708                      .dwattr $C$DW$1699, DW_AT_accessibility(DW_ACCESS_public)
    9709              $C$DW$1700      .dwtag  DW_TAG_member
    9710                      .dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$23)
    9711                      .dwattr $C$DW$1700, DW_AT_name("SOCPRICTRL")
    9712                      .dwattr $C$DW$1700, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9713                      .dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9714                      .dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
    9715              $C$DW$1701      .dwtag  DW_TAG_member
    9716                      .dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$23)
    9717                      .dwattr $C$DW$1701, DW_AT_name("rsvd_4")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  187

    9718                      .dwattr $C$DW$1701, DW_AT_TI_symbol_name("_rsvd_4")
    9719                      .dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9720                      .dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
    9721              $C$DW$1702      .dwtag  DW_TAG_member
    9722                      .dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$23)
    9723                      .dwattr $C$DW$1702, DW_AT_name("ADCSAMPLEMODE")
    9724                      .dwattr $C$DW$1702, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9725                      .dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9726                      .dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
    9727              $C$DW$1703      .dwtag  DW_TAG_member
    9728                      .dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$23)
    9729                      .dwattr $C$DW$1703, DW_AT_name("rsvd_5")
    9730                      .dwattr $C$DW$1703, DW_AT_TI_symbol_name("_rsvd_5")
    9731                      .dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9732                      .dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
    9733              $C$DW$1704      .dwtag  DW_TAG_member
    9734                      .dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$23)
    9735                      .dwattr $C$DW$1704, DW_AT_name("ADCINTSOCSEL1")
    9736                      .dwattr $C$DW$1704, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9737                      .dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9738                      .dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
    9739              $C$DW$1705      .dwtag  DW_TAG_member
    9740                      .dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$23)
    9741                      .dwattr $C$DW$1705, DW_AT_name("ADCINTSOCSEL2")
    9742                      .dwattr $C$DW$1705, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9743                      .dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9744                      .dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
    9745              $C$DW$1706      .dwtag  DW_TAG_member
    9746                      .dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$26)
    9747                      .dwattr $C$DW$1706, DW_AT_name("rsvd_6")
    9748                      .dwattr $C$DW$1706, DW_AT_TI_symbol_name("_rsvd_6")
    9749                      .dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9750                      .dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
    9751              $C$DW$1707      .dwtag  DW_TAG_member
    9752                      .dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$23)
    9753                      .dwattr $C$DW$1707, DW_AT_name("ADCSOCFLG1")
    9754                      .dwattr $C$DW$1707, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9755                      .dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9756                      .dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
    9757              $C$DW$1708      .dwtag  DW_TAG_member
    9758                      .dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$23)
    9759                      .dwattr $C$DW$1708, DW_AT_name("rsvd_7")
    9760                      .dwattr $C$DW$1708, DW_AT_TI_symbol_name("_rsvd_7")
    9761                      .dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9762                      .dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
    9763              $C$DW$1709      .dwtag  DW_TAG_member
    9764                      .dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$23)
    9765                      .dwattr $C$DW$1709, DW_AT_name("ADCSOCFRC1")
    9766                      .dwattr $C$DW$1709, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9767                      .dwattr $C$DW$1709, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9768                      .dwattr $C$DW$1709, DW_AT_accessibility(DW_ACCESS_public)
    9769              $C$DW$1710      .dwtag  DW_TAG_member
    9770                      .dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$23)
    9771                      .dwattr $C$DW$1710, DW_AT_name("rsvd_8")
    9772                      .dwattr $C$DW$1710, DW_AT_TI_symbol_name("_rsvd_8")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  188

    9773                      .dwattr $C$DW$1710, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9774                      .dwattr $C$DW$1710, DW_AT_accessibility(DW_ACCESS_public)
    9775              $C$DW$1711      .dwtag  DW_TAG_member
    9776                      .dwattr $C$DW$1711, DW_AT_type(*$C$DW$T$23)
    9777                      .dwattr $C$DW$1711, DW_AT_name("ADCSOCOVF1")
    9778                      .dwattr $C$DW$1711, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9779                      .dwattr $C$DW$1711, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9780                      .dwattr $C$DW$1711, DW_AT_accessibility(DW_ACCESS_public)
    9781              $C$DW$1712      .dwtag  DW_TAG_member
    9782                      .dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$23)
    9783                      .dwattr $C$DW$1712, DW_AT_name("rsvd_9")
    9784                      .dwattr $C$DW$1712, DW_AT_TI_symbol_name("_rsvd_9")
    9785                      .dwattr $C$DW$1712, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9786                      .dwattr $C$DW$1712, DW_AT_accessibility(DW_ACCESS_public)
    9787              $C$DW$1713      .dwtag  DW_TAG_member
    9788                      .dwattr $C$DW$1713, DW_AT_type(*$C$DW$T$23)
    9789                      .dwattr $C$DW$1713, DW_AT_name("ADCSOCOVFCLR1")
    9790                      .dwattr $C$DW$1713, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9791                      .dwattr $C$DW$1713, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9792                      .dwattr $C$DW$1713, DW_AT_accessibility(DW_ACCESS_public)
    9793              $C$DW$1714      .dwtag  DW_TAG_member
    9794                      .dwattr $C$DW$1714, DW_AT_type(*$C$DW$T$23)
    9795                      .dwattr $C$DW$1714, DW_AT_name("rsvd_10")
    9796                      .dwattr $C$DW$1714, DW_AT_TI_symbol_name("_rsvd_10")
    9797                      .dwattr $C$DW$1714, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9798                      .dwattr $C$DW$1714, DW_AT_accessibility(DW_ACCESS_public)
    9799              $C$DW$1715      .dwtag  DW_TAG_member
    9800                      .dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$24)
    9801                      .dwattr $C$DW$1715, DW_AT_name("ADCSOCxCTL")
    9802                      .dwattr $C$DW$1715, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9803                      .dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9804                      .dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
    9805              $C$DW$1716      .dwtag  DW_TAG_member
    9806                      .dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$24)
    9807                      .dwattr $C$DW$1716, DW_AT_name("rsvd_11")
    9808                      .dwattr $C$DW$1716, DW_AT_TI_symbol_name("_rsvd_11")
    9809                      .dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9810                      .dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
    9811              $C$DW$1717      .dwtag  DW_TAG_member
    9812                      .dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$23)
    9813                      .dwattr $C$DW$1717, DW_AT_name("ADCREFTRIM")
    9814                      .dwattr $C$DW$1717, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9815                      .dwattr $C$DW$1717, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9816                      .dwattr $C$DW$1717, DW_AT_accessibility(DW_ACCESS_public)
    9817              $C$DW$1718      .dwtag  DW_TAG_member
    9818                      .dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$23)
    9819                      .dwattr $C$DW$1718, DW_AT_name("ADCOFFTRIM")
    9820                      .dwattr $C$DW$1718, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9821                      .dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9822                      .dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
    9823              $C$DW$1719      .dwtag  DW_TAG_member
    9824                      .dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$29)
    9825                      .dwattr $C$DW$1719, DW_AT_name("resvd_12")
    9826                      .dwattr $C$DW$1719, DW_AT_TI_symbol_name("_resvd_12")
    9827                      .dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  189

    9828                      .dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
    9829              $C$DW$1720      .dwtag  DW_TAG_member
    9830                      .dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$23)
    9831                      .dwattr $C$DW$1720, DW_AT_name("ADCREV")
    9832                      .dwattr $C$DW$1720, DW_AT_TI_symbol_name("_ADCREV")
    9833                      .dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9834                      .dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
    9835                      .dwendtag $C$DW$T$30
    9836              
    9837              $C$DW$T$313     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    9838                      .dwattr $C$DW$T$313, DW_AT_type(*$C$DW$T$30)
    9839                      .dwattr $C$DW$T$313, DW_AT_language(DW_LANG_C)
    9840              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    9841                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$30)
    9842                      .dwattr $C$DW$T$50, DW_AT_address_class(0x16)
    9843              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    9844                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    9845                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    9846              
    9847              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    9848                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
    9849                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
    9850              $C$DW$1721      .dwtag  DW_TAG_member
    9851                      .dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$23)
    9852                      .dwattr $C$DW$1721, DW_AT_name("XCLK")
    9853                      .dwattr $C$DW$1721, DW_AT_TI_symbol_name("_XCLK")
    9854                      .dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9855                      .dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
    9856              $C$DW$1722      .dwtag  DW_TAG_member
    9857                      .dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$23)
    9858                      .dwattr $C$DW$1722, DW_AT_name("rsvd_1")
    9859                      .dwattr $C$DW$1722, DW_AT_TI_symbol_name("_rsvd_1")
    9860                      .dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9861                      .dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
    9862              $C$DW$1723      .dwtag  DW_TAG_member
    9863                      .dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$23)
    9864                      .dwattr $C$DW$1723, DW_AT_name("CLKCTL")
    9865                      .dwattr $C$DW$1723, DW_AT_TI_symbol_name("_CLKCTL")
    9866                      .dwattr $C$DW$1723, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9867                      .dwattr $C$DW$1723, DW_AT_accessibility(DW_ACCESS_public)
    9868              $C$DW$1724      .dwtag  DW_TAG_member
    9869                      .dwattr $C$DW$1724, DW_AT_type(*$C$DW$T$31)
    9870                      .dwattr $C$DW$1724, DW_AT_name("rsvd_2")
    9871                      .dwattr $C$DW$1724, DW_AT_TI_symbol_name("_rsvd_2")
    9872                      .dwattr $C$DW$1724, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9873                      .dwattr $C$DW$1724, DW_AT_accessibility(DW_ACCESS_public)
    9874              $C$DW$1725      .dwtag  DW_TAG_member
    9875                      .dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$23)
    9876                      .dwattr $C$DW$1725, DW_AT_name("LOSPCP")
    9877                      .dwattr $C$DW$1725, DW_AT_TI_symbol_name("_LOSPCP")
    9878                      .dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9879                      .dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
    9880              $C$DW$1726      .dwtag  DW_TAG_member
    9881                      .dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$23)
    9882                      .dwattr $C$DW$1726, DW_AT_name("PCLKCR0")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  190

    9883                      .dwattr $C$DW$1726, DW_AT_TI_symbol_name("_PCLKCR0")
    9884                      .dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9885                      .dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
    9886              $C$DW$1727      .dwtag  DW_TAG_member
    9887                      .dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$23)
    9888                      .dwattr $C$DW$1727, DW_AT_name("PCLKCR1")
    9889                      .dwattr $C$DW$1727, DW_AT_TI_symbol_name("_PCLKCR1")
    9890                      .dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9891                      .dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
    9892              $C$DW$1728      .dwtag  DW_TAG_member
    9893                      .dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$26)
    9894                      .dwattr $C$DW$1728, DW_AT_name("rsvd_3")
    9895                      .dwattr $C$DW$1728, DW_AT_TI_symbol_name("_rsvd_3")
    9896                      .dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9897                      .dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
    9898              $C$DW$1729      .dwtag  DW_TAG_member
    9899                      .dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$23)
    9900                      .dwattr $C$DW$1729, DW_AT_name("PCLKCR3")
    9901                      .dwattr $C$DW$1729, DW_AT_TI_symbol_name("_PCLKCR3")
    9902                      .dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9903                      .dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
    9904                      .dwendtag $C$DW$T$32
    9905              
    9906              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    9907                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$32)
    9908                      .dwattr $C$DW$T$52, DW_AT_address_class(0x16)
    9909              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    9910                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    9911                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    9912              
    9913              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    9914                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
    9915                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    9916              $C$DW$1730      .dwtag  DW_TAG_member
    9917                      .dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$33)
    9918                      .dwattr $C$DW$1730, DW_AT_name("tmp")
    9919                      .dwattr $C$DW$1730, DW_AT_TI_symbol_name("_tmp")
    9920                      .dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9921                      .dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
    9922                      .dwendtag $C$DW$T$34
    9923              
    9924              $C$DW$T$320     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
    9925                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$T$34)
    9926                      .dwattr $C$DW$T$320, DW_AT_language(DW_LANG_C)
    9927              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    9928                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
    9929                      .dwattr $C$DW$T$54, DW_AT_address_class(0x16)
    9930              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    9931                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    9932                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    9933              
    9934              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9935                      .dwattr $C$DW$T$36, DW_AT_name("_FILTER_FO_")
    9936                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
    9937              $C$DW$1731      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  191

    9938                      .dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$35)
    9939                      .dwattr $C$DW$1731, DW_AT_name("a1")
    9940                      .dwattr $C$DW$1731, DW_AT_TI_symbol_name("_a1")
    9941                      .dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9942                      .dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
    9943              $C$DW$1732      .dwtag  DW_TAG_member
    9944                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$35)
    9945                      .dwattr $C$DW$1732, DW_AT_name("b0")
    9946                      .dwattr $C$DW$1732, DW_AT_TI_symbol_name("_b0")
    9947                      .dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9948                      .dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
    9949              $C$DW$1733      .dwtag  DW_TAG_member
    9950                      .dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$35)
    9951                      .dwattr $C$DW$1733, DW_AT_name("b1")
    9952                      .dwattr $C$DW$1733, DW_AT_TI_symbol_name("_b1")
    9953                      .dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9954                      .dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
    9955              $C$DW$1734      .dwtag  DW_TAG_member
    9956                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$35)
    9957                      .dwattr $C$DW$1734, DW_AT_name("x1")
    9958                      .dwattr $C$DW$1734, DW_AT_TI_symbol_name("_x1")
    9959                      .dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9960                      .dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
    9961              $C$DW$1735      .dwtag  DW_TAG_member
    9962                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$35)
    9963                      .dwattr $C$DW$1735, DW_AT_name("y1")
    9964                      .dwattr $C$DW$1735, DW_AT_TI_symbol_name("_y1")
    9965                      .dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9966                      .dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
    9967                      .dwendtag $C$DW$T$36
    9968              
    9969              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    9970                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$36)
    9971                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    9972              
    9973              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    9974                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    9975                      .dwattr $C$DW$T$20, DW_AT_declaration
    9976                      .dwendtag $C$DW$T$20
    9977              
    9978              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    9979                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$20)
    9980                      .dwattr $C$DW$T$90, DW_AT_address_class(0x16)
    9981              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    9982                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    9983                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    9984              
    9985              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    9986                      .dwattr $C$DW$T$37, DW_AT_name("_FLASH_Obj_")
    9987                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    9988              $C$DW$1736      .dwtag  DW_TAG_member
    9989                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$23)
    9990                      .dwattr $C$DW$1736, DW_AT_name("FOPT")
    9991                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_FOPT")
    9992                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  192

    9993                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
    9994              $C$DW$1737      .dwtag  DW_TAG_member
    9995                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$23)
    9996                      .dwattr $C$DW$1737, DW_AT_name("rsvd_1")
    9997                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_rsvd_1")
    9998                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9999                      .dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
   10000              $C$DW$1738      .dwtag  DW_TAG_member
   10001                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$23)
   10002                      .dwattr $C$DW$1738, DW_AT_name("FPWR")
   10003                      .dwattr $C$DW$1738, DW_AT_TI_symbol_name("_FPWR")
   10004                      .dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10005                      .dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
   10006              $C$DW$1739      .dwtag  DW_TAG_member
   10007                      .dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$23)
   10008                      .dwattr $C$DW$1739, DW_AT_name("FSTATUS")
   10009                      .dwattr $C$DW$1739, DW_AT_TI_symbol_name("_FSTATUS")
   10010                      .dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10011                      .dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
   10012              $C$DW$1740      .dwtag  DW_TAG_member
   10013                      .dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$23)
   10014                      .dwattr $C$DW$1740, DW_AT_name("FSTDBYWAIT")
   10015                      .dwattr $C$DW$1740, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   10016                      .dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10017                      .dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
   10018              $C$DW$1741      .dwtag  DW_TAG_member
   10019                      .dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$23)
   10020                      .dwattr $C$DW$1741, DW_AT_name("FACTIVEWAIT")
   10021                      .dwattr $C$DW$1741, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   10022                      .dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10023                      .dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
   10024              $C$DW$1742      .dwtag  DW_TAG_member
   10025                      .dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$23)
   10026                      .dwattr $C$DW$1742, DW_AT_name("FBANKWAIT")
   10027                      .dwattr $C$DW$1742, DW_AT_TI_symbol_name("_FBANKWAIT")
   10028                      .dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10029                      .dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
   10030              $C$DW$1743      .dwtag  DW_TAG_member
   10031                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$23)
   10032                      .dwattr $C$DW$1743, DW_AT_name("FOTPWAIT")
   10033                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_FOTPWAIT")
   10034                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10035                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
   10036                      .dwendtag $C$DW$T$37
   10037              
   10038              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
   10039                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$37)
   10040                      .dwattr $C$DW$T$56, DW_AT_address_class(0x16)
   10041              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   10042                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
   10043                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
   10044              
   10045              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   10046                      .dwattr $C$DW$T$42, DW_AT_name("_GPIO_Obj_")
   10047                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x6a)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  193

   10048              $C$DW$1744      .dwtag  DW_TAG_member
   10049                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$39)
   10050                      .dwattr $C$DW$1744, DW_AT_name("GPACTRL")
   10051                      .dwattr $C$DW$1744, DW_AT_TI_symbol_name("_GPACTRL")
   10052                      .dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10053                      .dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
   10054              $C$DW$1745      .dwtag  DW_TAG_member
   10055                      .dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$39)
   10056                      .dwattr $C$DW$1745, DW_AT_name("GPAQSEL1")
   10057                      .dwattr $C$DW$1745, DW_AT_TI_symbol_name("_GPAQSEL1")
   10058                      .dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10059                      .dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
   10060              $C$DW$1746      .dwtag  DW_TAG_member
   10061                      .dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$39)
   10062                      .dwattr $C$DW$1746, DW_AT_name("GPAQSEL2")
   10063                      .dwattr $C$DW$1746, DW_AT_TI_symbol_name("_GPAQSEL2")
   10064                      .dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10065                      .dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
   10066              $C$DW$1747      .dwtag  DW_TAG_member
   10067                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$39)
   10068                      .dwattr $C$DW$1747, DW_AT_name("GPAMUX1")
   10069                      .dwattr $C$DW$1747, DW_AT_TI_symbol_name("_GPAMUX1")
   10070                      .dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10071                      .dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
   10072              $C$DW$1748      .dwtag  DW_TAG_member
   10073                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$39)
   10074                      .dwattr $C$DW$1748, DW_AT_name("GPAMUX2")
   10075                      .dwattr $C$DW$1748, DW_AT_TI_symbol_name("_GPAMUX2")
   10076                      .dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10077                      .dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
   10078              $C$DW$1749      .dwtag  DW_TAG_member
   10079                      .dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$39)
   10080                      .dwattr $C$DW$1749, DW_AT_name("GPADIR")
   10081                      .dwattr $C$DW$1749, DW_AT_TI_symbol_name("_GPADIR")
   10082                      .dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10083                      .dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
   10084              $C$DW$1750      .dwtag  DW_TAG_member
   10085                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$39)
   10086                      .dwattr $C$DW$1750, DW_AT_name("GPAPUD")
   10087                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_GPAPUD")
   10088                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10089                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
   10090              $C$DW$1751      .dwtag  DW_TAG_member
   10091                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$26)
   10092                      .dwattr $C$DW$1751, DW_AT_name("rsvd_1")
   10093                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_rsvd_1")
   10094                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10095                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
   10096              $C$DW$1752      .dwtag  DW_TAG_member
   10097                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$39)
   10098                      .dwattr $C$DW$1752, DW_AT_name("GPBCTRL")
   10099                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_GPBCTRL")
   10100                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10101                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
   10102              $C$DW$1753      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  194

   10103                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$39)
   10104                      .dwattr $C$DW$1753, DW_AT_name("GPBQSEL1")
   10105                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_GPBQSEL1")
   10106                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10107                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
   10108              $C$DW$1754      .dwtag  DW_TAG_member
   10109                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$26)
   10110                      .dwattr $C$DW$1754, DW_AT_name("rsvd_2")
   10111                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_rsvd_2")
   10112                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10113                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
   10114              $C$DW$1755      .dwtag  DW_TAG_member
   10115                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$39)
   10116                      .dwattr $C$DW$1755, DW_AT_name("GPBMUX1")
   10117                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_GPBMUX1")
   10118                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10119                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
   10120              $C$DW$1756      .dwtag  DW_TAG_member
   10121                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$26)
   10122                      .dwattr $C$DW$1756, DW_AT_name("rsvd_3")
   10123                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_rsvd_3")
   10124                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   10125                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
   10126              $C$DW$1757      .dwtag  DW_TAG_member
   10127                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$39)
   10128                      .dwattr $C$DW$1757, DW_AT_name("GPBDIR")
   10129                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_GPBDIR")
   10130                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10131                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
   10132              $C$DW$1758      .dwtag  DW_TAG_member
   10133                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$39)
   10134                      .dwattr $C$DW$1758, DW_AT_name("GPBPUD")
   10135                      .dwattr $C$DW$1758, DW_AT_TI_symbol_name("_GPBPUD")
   10136                      .dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   10137                      .dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
   10138              $C$DW$1759      .dwtag  DW_TAG_member
   10139                      .dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$40)
   10140                      .dwattr $C$DW$1759, DW_AT_name("rsvd_4")
   10141                      .dwattr $C$DW$1759, DW_AT_TI_symbol_name("_rsvd_4")
   10142                      .dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   10143                      .dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
   10144              $C$DW$1760      .dwtag  DW_TAG_member
   10145                      .dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$39)
   10146                      .dwattr $C$DW$1760, DW_AT_name("AIOMUX1")
   10147                      .dwattr $C$DW$1760, DW_AT_TI_symbol_name("_AIOMUX1")
   10148                      .dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10149                      .dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
   10150              $C$DW$1761      .dwtag  DW_TAG_member
   10151                      .dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$26)
   10152                      .dwattr $C$DW$1761, DW_AT_name("rsvd_5")
   10153                      .dwattr $C$DW$1761, DW_AT_TI_symbol_name("_rsvd_5")
   10154                      .dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10155                      .dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
   10156              $C$DW$1762      .dwtag  DW_TAG_member
   10157                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  195

   10158                      .dwattr $C$DW$1762, DW_AT_name("AIODIR")
   10159                      .dwattr $C$DW$1762, DW_AT_TI_symbol_name("_AIODIR")
   10160                      .dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10161                      .dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
   10162              $C$DW$1763      .dwtag  DW_TAG_member
   10163                      .dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$41)
   10164                      .dwattr $C$DW$1763, DW_AT_name("rsvd_6")
   10165                      .dwattr $C$DW$1763, DW_AT_TI_symbol_name("_rsvd_6")
   10166                      .dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10167                      .dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
   10168              $C$DW$1764      .dwtag  DW_TAG_member
   10169                      .dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$39)
   10170                      .dwattr $C$DW$1764, DW_AT_name("GPADAT")
   10171                      .dwattr $C$DW$1764, DW_AT_TI_symbol_name("_GPADAT")
   10172                      .dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10173                      .dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
   10174              $C$DW$1765      .dwtag  DW_TAG_member
   10175                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$39)
   10176                      .dwattr $C$DW$1765, DW_AT_name("GPASET")
   10177                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_GPASET")
   10178                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   10179                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
   10180              $C$DW$1766      .dwtag  DW_TAG_member
   10181                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$39)
   10182                      .dwattr $C$DW$1766, DW_AT_name("GPACLEAR")
   10183                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_GPACLEAR")
   10184                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10185                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
   10186              $C$DW$1767      .dwtag  DW_TAG_member
   10187                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$39)
   10188                      .dwattr $C$DW$1767, DW_AT_name("GPATOGGLE")
   10189                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_GPATOGGLE")
   10190                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10191                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
   10192              $C$DW$1768      .dwtag  DW_TAG_member
   10193                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$39)
   10194                      .dwattr $C$DW$1768, DW_AT_name("GPBDAT")
   10195                      .dwattr $C$DW$1768, DW_AT_TI_symbol_name("_GPBDAT")
   10196                      .dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   10197                      .dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
   10198              $C$DW$1769      .dwtag  DW_TAG_member
   10199                      .dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$39)
   10200                      .dwattr $C$DW$1769, DW_AT_name("GPBSET")
   10201                      .dwattr $C$DW$1769, DW_AT_TI_symbol_name("_GPBSET")
   10202                      .dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   10203                      .dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
   10204              $C$DW$1770      .dwtag  DW_TAG_member
   10205                      .dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$39)
   10206                      .dwattr $C$DW$1770, DW_AT_name("GPBCLEAR")
   10207                      .dwattr $C$DW$1770, DW_AT_TI_symbol_name("_GPBCLEAR")
   10208                      .dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   10209                      .dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
   10210              $C$DW$1771      .dwtag  DW_TAG_member
   10211                      .dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$39)
   10212                      .dwattr $C$DW$1771, DW_AT_name("GPBTOGGLE")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  196

   10213                      .dwattr $C$DW$1771, DW_AT_TI_symbol_name("_GPBTOGGLE")
   10214                      .dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   10215                      .dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
   10216              $C$DW$1772      .dwtag  DW_TAG_member
   10217                      .dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$31)
   10218                      .dwattr $C$DW$1772, DW_AT_name("rsvd_7")
   10219                      .dwattr $C$DW$1772, DW_AT_TI_symbol_name("_rsvd_7")
   10220                      .dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   10221                      .dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
   10222              $C$DW$1773      .dwtag  DW_TAG_member
   10223                      .dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$39)
   10224                      .dwattr $C$DW$1773, DW_AT_name("AIODAT")
   10225                      .dwattr $C$DW$1773, DW_AT_TI_symbol_name("_AIODAT")
   10226                      .dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   10227                      .dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
   10228              $C$DW$1774      .dwtag  DW_TAG_member
   10229                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$39)
   10230                      .dwattr $C$DW$1774, DW_AT_name("AIOSET")
   10231                      .dwattr $C$DW$1774, DW_AT_TI_symbol_name("_AIOSET")
   10232                      .dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   10233                      .dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
   10234              $C$DW$1775      .dwtag  DW_TAG_member
   10235                      .dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$39)
   10236                      .dwattr $C$DW$1775, DW_AT_name("AIOCLEAR")
   10237                      .dwattr $C$DW$1775, DW_AT_TI_symbol_name("_AIOCLEAR")
   10238                      .dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10239                      .dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
   10240              $C$DW$1776      .dwtag  DW_TAG_member
   10241                      .dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$39)
   10242                      .dwattr $C$DW$1776, DW_AT_name("AIOTOGGLE")
   10243                      .dwattr $C$DW$1776, DW_AT_TI_symbol_name("_AIOTOGGLE")
   10244                      .dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10245                      .dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
   10246              $C$DW$1777      .dwtag  DW_TAG_member
   10247                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$28)
   10248                      .dwattr $C$DW$1777, DW_AT_name("GPIOXINTnSEL")
   10249                      .dwattr $C$DW$1777, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   10250                      .dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10251                      .dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
   10252              $C$DW$1778      .dwtag  DW_TAG_member
   10253                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$27)
   10254                      .dwattr $C$DW$1778, DW_AT_name("rsvd_8")
   10255                      .dwattr $C$DW$1778, DW_AT_TI_symbol_name("_rsvd_8")
   10256                      .dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   10257                      .dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
   10258              $C$DW$1779      .dwtag  DW_TAG_member
   10259                      .dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$39)
   10260                      .dwattr $C$DW$1779, DW_AT_name("GPIOLPMSEL")
   10261                      .dwattr $C$DW$1779, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   10262                      .dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   10263                      .dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
   10264                      .dwendtag $C$DW$T$42
   10265              
   10266              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
   10267                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  197

   10268                      .dwattr $C$DW$T$58, DW_AT_address_class(0x16)
   10269              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   10270                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
   10271                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
   10272              
   10273              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   10274                      .dwattr $C$DW$T$44, DW_AT_name("_HAL_AdcData_t_")
   10275                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x16)
   10276              $C$DW$1780      .dwtag  DW_TAG_member
   10277                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$43)
   10278                      .dwattr $C$DW$1780, DW_AT_name("I")
   10279                      .dwattr $C$DW$1780, DW_AT_TI_symbol_name("_I")
   10280                      .dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10281                      .dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
   10282              $C$DW$1781      .dwtag  DW_TAG_member
   10283                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$43)
   10284                      .dwattr $C$DW$1781, DW_AT_name("V")
   10285                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_V")
   10286                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10287                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
   10288              $C$DW$1782      .dwtag  DW_TAG_member
   10289                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$35)
   10290                      .dwattr $C$DW$1782, DW_AT_name("dcBus")
   10291                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_dcBus")
   10292                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10293                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
   10294              $C$DW$1783      .dwtag  DW_TAG_member
   10295                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$35)
   10296                      .dwattr $C$DW$1783, DW_AT_name("analogSensor1")
   10297                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_analogSensor1")
   10298                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10299                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   10300              $C$DW$1784      .dwtag  DW_TAG_member
   10301                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$35)
   10302                      .dwattr $C$DW$1784, DW_AT_name("analogSensor2")
   10303                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_analogSensor2")
   10304                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10305                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   10306              $C$DW$1785      .dwtag  DW_TAG_member
   10307                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$35)
   10308                      .dwattr $C$DW$1785, DW_AT_name("igbtNTC")
   10309                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_igbtNTC")
   10310                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10311                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   10312              $C$DW$1786      .dwtag  DW_TAG_member
   10313                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$35)
   10314                      .dwattr $C$DW$1786, DW_AT_name("boardAddr")
   10315                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_boardAddr")
   10316                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10317                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   10318                      .dwendtag $C$DW$T$44
   10319              
   10320              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   10321                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$44)
   10322                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  198

   10323              
   10324              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   10325                      .dwattr $C$DW$T$49, DW_AT_name("_HAL_DacData_t_")
   10326                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x22)
   10327              $C$DW$1787      .dwtag  DW_TAG_member
   10328                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$22)
   10329                      .dwattr $C$DW$1787, DW_AT_name("PeriodMax")
   10330                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_PeriodMax")
   10331                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10332                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   10333              $C$DW$1788      .dwtag  DW_TAG_member
   10334                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$47)
   10335                      .dwattr $C$DW$1788, DW_AT_name("ptrData")
   10336                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_ptrData")
   10337                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10338                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   10339              $C$DW$1789      .dwtag  DW_TAG_member
   10340                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$48)
   10341                      .dwattr $C$DW$1789, DW_AT_name("value")
   10342                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_value")
   10343                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10344                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   10345              $C$DW$1790      .dwtag  DW_TAG_member
   10346                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$48)
   10347                      .dwattr $C$DW$1790, DW_AT_name("offset")
   10348                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_offset")
   10349                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10350                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   10351              $C$DW$1791      .dwtag  DW_TAG_member
   10352                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$48)
   10353                      .dwattr $C$DW$1791, DW_AT_name("gain")
   10354                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_gain")
   10355                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10356                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   10357                      .dwendtag $C$DW$T$49
   10358              
   10359              $C$DW$T$330     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_DacData_t")
   10360                      .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$49)
   10361                      .dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
   10362              $C$DW$T$331     .dwtag  DW_TAG_pointer_type
   10363                      .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$330)
   10364                      .dwattr $C$DW$T$331, DW_AT_address_class(0x16)
   10365              $C$DW$1792      .dwtag  DW_TAG_TI_far_type
   10366                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$331)
   10367              $C$DW$T$332     .dwtag  DW_TAG_const_type
   10368                      .dwattr $C$DW$T$332, DW_AT_type(*$C$DW$1792)
   10369              
   10370              $C$DW$T$86      .dwtag  DW_TAG_structure_type
   10371                      .dwattr $C$DW$T$86, DW_AT_name("_HAL_Obj_")
   10372                      .dwattr $C$DW$T$86, DW_AT_byte_size(0xb2)
   10373              $C$DW$1793      .dwtag  DW_TAG_member
   10374                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$51)
   10375                      .dwattr $C$DW$1793, DW_AT_name("adcHandle")
   10376                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_adcHandle")
   10377                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  199

   10378                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   10379              $C$DW$1794      .dwtag  DW_TAG_member
   10380                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$53)
   10381                      .dwattr $C$DW$1794, DW_AT_name("clkHandle")
   10382                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_clkHandle")
   10383                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10384                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   10385              $C$DW$1795      .dwtag  DW_TAG_member
   10386                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$55)
   10387                      .dwattr $C$DW$1795, DW_AT_name("cpuHandle")
   10388                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_cpuHandle")
   10389                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10390                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   10391              $C$DW$1796      .dwtag  DW_TAG_member
   10392                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$57)
   10393                      .dwattr $C$DW$1796, DW_AT_name("flashHandle")
   10394                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_flashHandle")
   10395                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10396                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   10397              $C$DW$1797      .dwtag  DW_TAG_member
   10398                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$59)
   10399                      .dwattr $C$DW$1797, DW_AT_name("gpioHandle")
   10400                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_gpioHandle")
   10401                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10402                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   10403              $C$DW$1798      .dwtag  DW_TAG_member
   10404                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$62)
   10405                      .dwattr $C$DW$1798, DW_AT_name("offsetHandle_I")
   10406                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_offsetHandle_I")
   10407                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10408                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   10409              $C$DW$1799      .dwtag  DW_TAG_member
   10410                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$64)
   10411                      .dwattr $C$DW$1799, DW_AT_name("offset_I")
   10412                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_offset_I")
   10413                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10414                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   10415              $C$DW$1800      .dwtag  DW_TAG_member
   10416                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$62)
   10417                      .dwattr $C$DW$1800, DW_AT_name("offsetHandle_V")
   10418                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_offsetHandle_V")
   10419                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10420                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   10421              $C$DW$1801      .dwtag  DW_TAG_member
   10422                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$64)
   10423                      .dwattr $C$DW$1801, DW_AT_name("offset_V")
   10424                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_offset_V")
   10425                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10426                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   10427              $C$DW$1802      .dwtag  DW_TAG_member
   10428                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$66)
   10429                      .dwattr $C$DW$1802, DW_AT_name("oscHandle")
   10430                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_oscHandle")
   10431                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   10432                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  200

   10433              $C$DW$1803      .dwtag  DW_TAG_member
   10434                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$68)
   10435                      .dwattr $C$DW$1803, DW_AT_name("pieHandle")
   10436                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_pieHandle")
   10437                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   10438                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   10439              $C$DW$1804      .dwtag  DW_TAG_member
   10440                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$70)
   10441                      .dwattr $C$DW$1804, DW_AT_name("pllHandle")
   10442                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_pllHandle")
   10443                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   10444                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   10445              $C$DW$1805      .dwtag  DW_TAG_member
   10446                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$73)
   10447                      .dwattr $C$DW$1805, DW_AT_name("pwmHandle")
   10448                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_pwmHandle")
   10449                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   10450                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   10451              $C$DW$1806      .dwtag  DW_TAG_member
   10452                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$73)
   10453                      .dwattr $C$DW$1806, DW_AT_name("pwmDacHandle")
   10454                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_pwmDacHandle")
   10455                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   10456                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   10457              $C$DW$1807      .dwtag  DW_TAG_member
   10458                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$75)
   10459                      .dwattr $C$DW$1807, DW_AT_name("pwrHandle")
   10460                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_pwrHandle")
   10461                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   10462                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   10463              $C$DW$1808      .dwtag  DW_TAG_member
   10464                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$78)
   10465                      .dwattr $C$DW$1808, DW_AT_name("timerHandle")
   10466                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_timerHandle")
   10467                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   10468                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   10469              $C$DW$1809      .dwtag  DW_TAG_member
   10470                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$80)
   10471                      .dwattr $C$DW$1809, DW_AT_name("i2cHandle")
   10472                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_i2cHandle")
   10473                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   10474                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   10475              $C$DW$1810      .dwtag  DW_TAG_member
   10476                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$82)
   10477                      .dwattr $C$DW$1810, DW_AT_name("spiAHandle")
   10478                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_spiAHandle")
   10479                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   10480                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   10481              $C$DW$1811      .dwtag  DW_TAG_member
   10482                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$84)
   10483                      .dwattr $C$DW$1811, DW_AT_name("wdogHandle")
   10484                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_wdogHandle")
   10485                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   10486                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   10487              $C$DW$1812      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  201

   10488                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$85)
   10489                      .dwattr $C$DW$1812, DW_AT_name("adcBias")
   10490                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_adcBias")
   10491                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   10492                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   10493              $C$DW$1813      .dwtag  DW_TAG_member
   10494                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$35)
   10495                      .dwattr $C$DW$1813, DW_AT_name("current_sf")
   10496                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_current_sf")
   10497                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
   10498                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   10499              $C$DW$1814      .dwtag  DW_TAG_member
   10500                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$35)
   10501                      .dwattr $C$DW$1814, DW_AT_name("voltage_sf")
   10502                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_voltage_sf")
   10503                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
   10504                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   10505              $C$DW$1815      .dwtag  DW_TAG_member
   10506                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$33)
   10507                      .dwattr $C$DW$1815, DW_AT_name("numCurrentSensors")
   10508                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_numCurrentSensors")
   10509                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
   10510                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   10511              $C$DW$1816      .dwtag  DW_TAG_member
   10512                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$33)
   10513                      .dwattr $C$DW$1816, DW_AT_name("numVoltageSensors")
   10514                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_numVoltageSensors")
   10515                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
   10516                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   10517                      .dwendtag $C$DW$T$86
   10518              
   10519              $C$DW$T$335     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   10520                      .dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$86)
   10521                      .dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
   10522              $C$DW$T$336     .dwtag  DW_TAG_pointer_type
   10523                      .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$335)
   10524                      .dwattr $C$DW$T$336, DW_AT_address_class(0x16)
   10525              $C$DW$T$337     .dwtag  DW_TAG_pointer_type
   10526                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$86)
   10527                      .dwattr $C$DW$T$337, DW_AT_address_class(0x16)
   10528              $C$DW$T$338     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
   10529                      .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$337)
   10530                      .dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
   10531              $C$DW$1817      .dwtag  DW_TAG_TI_far_type
   10532                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$338)
   10533              $C$DW$T$339     .dwtag  DW_TAG_const_type
   10534                      .dwattr $C$DW$T$339, DW_AT_type(*$C$DW$1817)
   10535              
   10536              $C$DW$T$88      .dwtag  DW_TAG_structure_type
   10537                      .dwattr $C$DW$T$88, DW_AT_name("_MATH_vec3_")
   10538                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x06)
   10539              $C$DW$1818      .dwtag  DW_TAG_member
   10540                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$87)
   10541                      .dwattr $C$DW$1818, DW_AT_name("value")
   10542                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_value")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  202

   10543                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10544                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   10545                      .dwendtag $C$DW$T$88
   10546              
   10547              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   10548                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$88)
   10549                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
   10550              
   10551              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   10552                      .dwattr $C$DW$T$92, DW_AT_name("_OFFSET_")
   10553                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x10)
   10554              $C$DW$1819      .dwtag  DW_TAG_member
   10555                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$35)
   10556                      .dwattr $C$DW$1819, DW_AT_name("value")
   10557                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_value")
   10558                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10559                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   10560              $C$DW$1820      .dwtag  DW_TAG_member
   10561                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$35)
   10562                      .dwattr $C$DW$1820, DW_AT_name("bias")
   10563                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_bias")
   10564                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10565                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   10566              $C$DW$1821      .dwtag  DW_TAG_member
   10567                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$89)
   10568                      .dwattr $C$DW$1821, DW_AT_name("filter")
   10569                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_filter")
   10570                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10571                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   10572              $C$DW$1822      .dwtag  DW_TAG_member
   10573                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$91)
   10574                      .dwattr $C$DW$1822, DW_AT_name("filterHandle")
   10575                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_filterHandle")
   10576                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10577                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   10578                      .dwendtag $C$DW$T$92
   10579              
   10580              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
   10581                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$92)
   10582                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   10583              
   10584              $C$DW$T$64      .dwtag  DW_TAG_array_type
   10585                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   10586                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   10587                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x30)
   10588              $C$DW$1823      .dwtag  DW_TAG_subrange_type
   10589                      .dwattr $C$DW$1823, DW_AT_upper_bound(0x02)
   10590                      .dwendtag $C$DW$T$64
   10591              
   10592              
   10593              $C$DW$T$21      .dwtag  DW_TAG_structure_type
   10594                      .dwattr $C$DW$T$21, DW_AT_name("_OFFSET_Obj_")
   10595                      .dwattr $C$DW$T$21, DW_AT_declaration
   10596                      .dwendtag $C$DW$T$21
   10597              
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  203

   10598              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
   10599                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$21)
   10600                      .dwattr $C$DW$T$60, DW_AT_address_class(0x16)
   10601              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
   10602                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
   10603                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
   10604              
   10605              $C$DW$T$62      .dwtag  DW_TAG_array_type
   10606                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   10607                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   10608                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
   10609              $C$DW$1824      .dwtag  DW_TAG_subrange_type
   10610                      .dwattr $C$DW$1824, DW_AT_upper_bound(0x02)
   10611                      .dwendtag $C$DW$T$62
   10612              
   10613              
   10614              $C$DW$T$93      .dwtag  DW_TAG_structure_type
   10615                      .dwattr $C$DW$T$93, DW_AT_name("_OSC_Obj_")
   10616                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x03)
   10617              $C$DW$1825      .dwtag  DW_TAG_member
   10618                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$23)
   10619                      .dwattr $C$DW$1825, DW_AT_name("INTOSC1TRIM")
   10620                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_INTOSC1TRIM")
   10621                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10622                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   10623              $C$DW$1826      .dwtag  DW_TAG_member
   10624                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$23)
   10625                      .dwattr $C$DW$1826, DW_AT_name("rsvd_1")
   10626                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_rsvd_1")
   10627                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10628                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   10629              $C$DW$1827      .dwtag  DW_TAG_member
   10630                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$23)
   10631                      .dwattr $C$DW$1827, DW_AT_name("INTOSC2TRIM")
   10632                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_INTOSC2TRIM")
   10633                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10634                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   10635                      .dwendtag $C$DW$T$93
   10636              
   10637              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
   10638                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$93)
   10639                      .dwattr $C$DW$T$65, DW_AT_address_class(0x16)
   10640              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("OSC_Handle")
   10641                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   10642                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   10643              
   10644              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   10645                      .dwattr $C$DW$T$94, DW_AT_name("_PIE_IERIFR_t")
   10646                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x02)
   10647              $C$DW$1828      .dwtag  DW_TAG_member
   10648                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$23)
   10649                      .dwattr $C$DW$1828, DW_AT_name("IER")
   10650                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_IER")
   10651                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10652                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  204

   10653              $C$DW$1829      .dwtag  DW_TAG_member
   10654                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$23)
   10655                      .dwattr $C$DW$1829, DW_AT_name("IFR")
   10656                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_IFR")
   10657                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10658                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   10659                      .dwendtag $C$DW$T$94
   10660              
   10661              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
   10662                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   10663                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   10664              $C$DW$1830      .dwtag  DW_TAG_TI_far_type
   10665                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$95)
   10666              $C$DW$T$96      .dwtag  DW_TAG_volatile_type
   10667                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$1830)
   10668              
   10669              $C$DW$T$97      .dwtag  DW_TAG_array_type
   10670                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
   10671                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   10672                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x18)
   10673              $C$DW$1831      .dwtag  DW_TAG_subrange_type
   10674                      .dwattr $C$DW$1831, DW_AT_upper_bound(0x0b)
   10675                      .dwendtag $C$DW$T$97
   10676              
   10677              
   10678              $C$DW$T$104     .dwtag  DW_TAG_structure_type
   10679                      .dwattr $C$DW$T$104, DW_AT_name("_PIE_Obj_")
   10680                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x639c)
   10681              $C$DW$1832      .dwtag  DW_TAG_member
   10682                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$23)
   10683                      .dwattr $C$DW$1832, DW_AT_name("PIECTRL")
   10684                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_PIECTRL")
   10685                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10686                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   10687              $C$DW$1833      .dwtag  DW_TAG_member
   10688                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$23)
   10689                      .dwattr $C$DW$1833, DW_AT_name("PIEACK")
   10690                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_PIEACK")
   10691                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10692                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   10693              $C$DW$1834      .dwtag  DW_TAG_member
   10694                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$97)
   10695                      .dwattr $C$DW$1834, DW_AT_name("PIEIER_PIEIFR")
   10696                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
   10697                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10698                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   10699              $C$DW$1835      .dwtag  DW_TAG_member
   10700                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$98)
   10701                      .dwattr $C$DW$1835, DW_AT_name("rsvd_1")
   10702                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_rsvd_1")
   10703                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10704                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   10705              $C$DW$1836      .dwtag  DW_TAG_member
   10706                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$102)
   10707                      .dwattr $C$DW$1836, DW_AT_name("Reset")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  205

   10708                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_Reset")
   10709                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   10710                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   10711              $C$DW$1837      .dwtag  DW_TAG_member
   10712                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$102)
   10713                      .dwattr $C$DW$1837, DW_AT_name("INT1")
   10714                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_INT1")
   10715                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   10716                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   10717              $C$DW$1838      .dwtag  DW_TAG_member
   10718                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$102)
   10719                      .dwattr $C$DW$1838, DW_AT_name("INT2")
   10720                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_INT2")
   10721                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   10722                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   10723              $C$DW$1839      .dwtag  DW_TAG_member
   10724                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$102)
   10725                      .dwattr $C$DW$1839, DW_AT_name("INT3")
   10726                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_INT3")
   10727                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   10728                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   10729              $C$DW$1840      .dwtag  DW_TAG_member
   10730                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$102)
   10731                      .dwattr $C$DW$1840, DW_AT_name("INT4")
   10732                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_INT4")
   10733                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   10734                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   10735              $C$DW$1841      .dwtag  DW_TAG_member
   10736                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$102)
   10737                      .dwattr $C$DW$1841, DW_AT_name("INT5")
   10738                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_INT5")
   10739                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   10740                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   10741              $C$DW$1842      .dwtag  DW_TAG_member
   10742                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$102)
   10743                      .dwattr $C$DW$1842, DW_AT_name("INT6")
   10744                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_INT6")
   10745                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   10746                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   10747              $C$DW$1843      .dwtag  DW_TAG_member
   10748                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$102)
   10749                      .dwattr $C$DW$1843, DW_AT_name("INT7")
   10750                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_INT7")
   10751                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   10752                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   10753              $C$DW$1844      .dwtag  DW_TAG_member
   10754                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$102)
   10755                      .dwattr $C$DW$1844, DW_AT_name("INT8")
   10756                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_INT8")
   10757                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   10758                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   10759              $C$DW$1845      .dwtag  DW_TAG_member
   10760                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$102)
   10761                      .dwattr $C$DW$1845, DW_AT_name("INT9")
   10762                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_INT9")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:12 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1204010                              PAGE  206

   10763                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   10764                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   10765              $C$DW$1846      .dwtag  DW_TAG_member
   10766                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$102)
   10767                      .dwattr $C$DW$1846, DW_AT_name("INT10")
   10768                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_INT10")
   10769                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   10770                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   10771              $C$DW$1847      .dwtag  DW_TAG_member
   10772                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$102)
   10773                      .dwattr $C$DW$1847, DW_AT_name("INT11")
   10774                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_INT11")
   10775                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10776                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   10777              $C$DW$1848      .dwtag  DW_TAG_member
   10778                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$102)
   10779                      .dwattr $C$DW$1848, DW_AT_name("INT12")
   10780                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_INT12")
   10781                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10782                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   10783              $C$DW$1849      .dwtag  DW_TAG_member
   10784                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$102)
   10785                      .dwattr $C$DW$1849, DW_AT_name("TINT1")
   10786                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_TINT1")
   10787                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10788                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   10789              $C$DW$1850      .dwtag  DW_TAG_member
   10790                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$102)
   10791                      .dwattr $C$DW$1850, DW_AT_name("TINT2")
   10792                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_TINT2")
   10793                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10794                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   10795              $C$DW$1851      .dwtag  DW_TAG_member
   10796                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$102)
