TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.5 *
       3              ;* Date/Time created: Sat Jul 08 16:16:11 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/Foc/my_motor/sw/solutions/instaspin_foc/src/proj_lab05a.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.5 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\Foc\my_motor\sw\solutions\instaspin_foc\boards\hvkit_rev1p1\f28x
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3017              $C$DW$417       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    3018              $C$DW$418       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    3019              $C$DW$419       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    3020              $C$DW$420       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    3021              $C$DW$421       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    3022                      .dwendtag $C$DW$T$179
    3023              
    3024              $C$DW$T$180     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    3025                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$179)
    3026                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    3027              
    3028              $C$DW$T$182     .dwtag  DW_TAG_enumeration_type
    3029                      .dwattr $C$DW$T$182, DW_AT_byte_size(0x01)
    3030              $C$DW$422       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3031              $C$DW$423       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3032              $C$DW$424       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3033              $C$DW$425       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3034              $C$DW$426       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3035              $C$DW$427       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3036              $C$DW$428       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3037              $C$DW$429       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3038              $C$DW$430       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3039              $C$DW$431       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3040              $C$DW$432       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3041              $C$DW$433       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3042                      .dwendtag $C$DW$T$182
    3043              
    3044              $C$DW$T$183     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3045                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$182)
    3046                      .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    3047              
    3048              $C$DW$T$185     .dwtag  DW_TAG_enumeration_type
    3049                      .dwattr $C$DW$T$185, DW_AT_byte_size(0x01)
    3050              $C$DW$434       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3051              $C$DW$435       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3052              $C$DW$436       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3053                      .dwendtag $C$DW$T$185
    3054              
    3055              $C$DW$T$186     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3056                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$185)
    3057                      .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    3058              
    3059              $C$DW$T$188     .dwtag  DW_TAG_enumeration_type
    3060                      .dwattr $C$DW$T$188, DW_AT_byte_size(0x01)
    3061              $C$DW$437       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3062              $C$DW$438       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3063                      .dwendtag $C$DW$T$188
    3064              
    3065              $C$DW$T$189     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3066                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$188)
    3067                      .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    3068              
    3069              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3070                      .dwattr $C$DW$T$19, DW_AT_name("I2C_Obj")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   62

    3071                      .dwattr $C$DW$T$19, DW_AT_declaration
    3072                      .dwendtag $C$DW$T$19
    3073              
    3074              $C$DW$T$112     .dwtag  DW_TAG_pointer_type
    3075                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$19)
    3076                      .dwattr $C$DW$T$112, DW_AT_address_class(0x16)
    3077              $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    3078                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    3079                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3080              
    3081              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3082                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3083                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3084              $C$DW$439       .dwtag  DW_TAG_member
    3085                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$25)
    3086                      .dwattr $C$DW$439, DW_AT_name("ADCRESULT")
    3087                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_ADCRESULT")
    3088                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3089                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3090              $C$DW$440       .dwtag  DW_TAG_member
    3091                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$26)
    3092                      .dwattr $C$DW$440, DW_AT_name("resvd_1")
    3093                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_resvd_1")
    3094                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3095                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3096              $C$DW$441       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$24)
    3098                      .dwattr $C$DW$441, DW_AT_name("ADCCTL1")
    3099                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_ADCCTL1")
    3100                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3101                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3102              $C$DW$442       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    3104                      .dwattr $C$DW$442, DW_AT_name("ADCCTL2")
    3105                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_ADCCTL2")
    3106                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3107                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3108              $C$DW$443       .dwtag  DW_TAG_member
    3109                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$27)
    3110                      .dwattr $C$DW$443, DW_AT_name("rsvd_2")
    3111                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_rsvd_2")
    3112                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3113                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3114              $C$DW$444       .dwtag  DW_TAG_member
    3115                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
    3116                      .dwattr $C$DW$444, DW_AT_name("ADCINTFLG")
    3117                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_ADCINTFLG")
    3118                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3119                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3120              $C$DW$445       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$24)
    3122                      .dwattr $C$DW$445, DW_AT_name("ADCINTFLGCLR")
    3123                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3124                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3125                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   63

    3126              $C$DW$446       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$24)
    3128                      .dwattr $C$DW$446, DW_AT_name("ADCINTOVF")
    3129                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_ADCINTOVF")
    3130                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3131                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3132              $C$DW$447       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$24)
    3134                      .dwattr $C$DW$447, DW_AT_name("ADCINTOVFCLR")
    3135                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3136                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3137                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3138              $C$DW$448       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$28)
    3140                      .dwattr $C$DW$448, DW_AT_name("INTSELxNy")
    3141                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_INTSELxNy")
    3142                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3143                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3144              $C$DW$449       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$29)
    3146                      .dwattr $C$DW$449, DW_AT_name("rsvd_3")
    3147                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_rsvd_3")
    3148                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3149                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3150              $C$DW$450       .dwtag  DW_TAG_member
    3151                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$24)
    3152                      .dwattr $C$DW$450, DW_AT_name("SOCPRICTRL")
    3153                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3154                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3155                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3156              $C$DW$451       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$24)
    3158                      .dwattr $C$DW$451, DW_AT_name("rsvd_4")
    3159                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_rsvd_4")
    3160                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3161                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3162              $C$DW$452       .dwtag  DW_TAG_member
    3163                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$24)
    3164                      .dwattr $C$DW$452, DW_AT_name("ADCSAMPLEMODE")
    3165                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3166                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3167                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3168              $C$DW$453       .dwtag  DW_TAG_member
    3169                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$24)
    3170                      .dwattr $C$DW$453, DW_AT_name("rsvd_5")
    3171                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_rsvd_5")
    3172                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3173                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3174              $C$DW$454       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$24)
    3176                      .dwattr $C$DW$454, DW_AT_name("ADCINTSOCSEL1")
    3177                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3178                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3179                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3180              $C$DW$455       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   64

    3181                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$24)
    3182                      .dwattr $C$DW$455, DW_AT_name("ADCINTSOCSEL2")
    3183                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3184                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3185                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3186              $C$DW$456       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$27)
    3188                      .dwattr $C$DW$456, DW_AT_name("rsvd_6")
    3189                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_rsvd_6")
    3190                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3191                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3192              $C$DW$457       .dwtag  DW_TAG_member
    3193                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$24)
    3194                      .dwattr $C$DW$457, DW_AT_name("ADCSOCFLG1")
    3195                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3196                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3197                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3198              $C$DW$458       .dwtag  DW_TAG_member
    3199                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$24)
    3200                      .dwattr $C$DW$458, DW_AT_name("rsvd_7")
    3201                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_rsvd_7")
    3202                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3203                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3204              $C$DW$459       .dwtag  DW_TAG_member
    3205                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$24)
    3206                      .dwattr $C$DW$459, DW_AT_name("ADCSOCFRC1")
    3207                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3208                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3209                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3210              $C$DW$460       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$24)
    3212                      .dwattr $C$DW$460, DW_AT_name("rsvd_8")
    3213                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_rsvd_8")
    3214                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3215                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3216              $C$DW$461       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$24)
    3218                      .dwattr $C$DW$461, DW_AT_name("ADCSOCOVF1")
    3219                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3220                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3221                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3222              $C$DW$462       .dwtag  DW_TAG_member
    3223                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$24)
    3224                      .dwattr $C$DW$462, DW_AT_name("rsvd_9")
    3225                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_rsvd_9")
    3226                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3227                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3228              $C$DW$463       .dwtag  DW_TAG_member
    3229                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$24)
    3230                      .dwattr $C$DW$463, DW_AT_name("ADCSOCOVFCLR1")
    3231                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3232                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3233                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3234              $C$DW$464       .dwtag  DW_TAG_member
    3235                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   65

    3236                      .dwattr $C$DW$464, DW_AT_name("rsvd_10")
    3237                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_rsvd_10")
    3238                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3239                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3240              $C$DW$465       .dwtag  DW_TAG_member
    3241                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$25)
    3242                      .dwattr $C$DW$465, DW_AT_name("ADCSOCxCTL")
    3243                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3244                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3245                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3246              $C$DW$466       .dwtag  DW_TAG_member
    3247                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$25)
    3248                      .dwattr $C$DW$466, DW_AT_name("rsvd_11")
    3249                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_rsvd_11")
    3250                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3251                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3252              $C$DW$467       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$24)
    3254                      .dwattr $C$DW$467, DW_AT_name("ADCREFTRIM")
    3255                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3256                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3257                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3258              $C$DW$468       .dwtag  DW_TAG_member
    3259                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$24)
    3260                      .dwattr $C$DW$468, DW_AT_name("ADCOFFTRIM")
    3261                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3262                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3263                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3264              $C$DW$469       .dwtag  DW_TAG_member
    3265                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$30)
    3266                      .dwattr $C$DW$469, DW_AT_name("resvd_12")
    3267                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_resvd_12")
    3268                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3269                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3270              $C$DW$470       .dwtag  DW_TAG_member
    3271                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$24)
    3272                      .dwattr $C$DW$470, DW_AT_name("ADCREV")
    3273                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_ADCREV")
    3274                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3275                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3276                      .dwendtag $C$DW$T$31
    3277              
    3278              $C$DW$T$191     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3279                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$31)
    3280                      .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    3281              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    3282                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$31)
    3283                      .dwattr $C$DW$T$83, DW_AT_address_class(0x16)
    3284              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3285                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3286                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3287              
    3288              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3289                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    3290                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   66

    3291              $C$DW$471       .dwtag  DW_TAG_member
    3292                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$32)
    3293                      .dwattr $C$DW$471, DW_AT_name("alpha_sf")
    3294                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_alpha_sf")
    3295                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3296                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3297              $C$DW$472       .dwtag  DW_TAG_member
    3298                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$32)
    3299                      .dwattr $C$DW$472, DW_AT_name("beta_sf")
    3300                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_beta_sf")
    3301                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3302                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3303              $C$DW$473       .dwtag  DW_TAG_member
    3304                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$33)
    3305                      .dwattr $C$DW$473, DW_AT_name("numSensors")
    3306                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_numSensors")
    3307                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3308                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3309                      .dwendtag $C$DW$T$34
    3310              
    3311              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3312                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    3313                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3314              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3315                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    3316                      .dwattr $C$DW$T$43, DW_AT_address_class(0x16)
    3317              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3318                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3319                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3320              
    3321              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3322                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    3323                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    3324              $C$DW$474       .dwtag  DW_TAG_member
    3325                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$24)
    3326                      .dwattr $C$DW$474, DW_AT_name("XCLK")
    3327                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_XCLK")
    3328                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3329                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3330              $C$DW$475       .dwtag  DW_TAG_member
    3331                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$24)
    3332                      .dwattr $C$DW$475, DW_AT_name("rsvd_1")
    3333                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_rsvd_1")
    3334                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3335                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3336              $C$DW$476       .dwtag  DW_TAG_member
    3337                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$24)
    3338                      .dwattr $C$DW$476, DW_AT_name("CLKCTL")
    3339                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_CLKCTL")
    3340                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3341                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3342              $C$DW$477       .dwtag  DW_TAG_member
    3343                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$35)
    3344                      .dwattr $C$DW$477, DW_AT_name("rsvd_2")
    3345                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_rsvd_2")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   67

    3346                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3347                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3348              $C$DW$478       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$24)
    3350                      .dwattr $C$DW$478, DW_AT_name("LOSPCP")
    3351                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_LOSPCP")
    3352                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3353                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3354              $C$DW$479       .dwtag  DW_TAG_member
    3355                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$24)
    3356                      .dwattr $C$DW$479, DW_AT_name("PCLKCR0")
    3357                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_PCLKCR0")
    3358                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3359                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3360              $C$DW$480       .dwtag  DW_TAG_member
    3361                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$24)
    3362                      .dwattr $C$DW$480, DW_AT_name("PCLKCR1")
    3363                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_PCLKCR1")
    3364                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3365                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3366              $C$DW$481       .dwtag  DW_TAG_member
    3367                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$27)
    3368                      .dwattr $C$DW$481, DW_AT_name("rsvd_3")
    3369                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_rsvd_3")
    3370                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3371                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3372              $C$DW$482       .dwtag  DW_TAG_member
    3373                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$24)
    3374                      .dwattr $C$DW$482, DW_AT_name("PCLKCR3")
    3375                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_PCLKCR3")
    3376                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3377                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3378                      .dwendtag $C$DW$T$36
    3379              
    3380              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    3381                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$36)
    3382                      .dwattr $C$DW$T$85, DW_AT_address_class(0x16)
    3383              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3384                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3385                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3386              
    3387              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3388                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    3389                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3390              $C$DW$483       .dwtag  DW_TAG_member
    3391                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$33)
    3392                      .dwattr $C$DW$483, DW_AT_name("tmp")
    3393                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_tmp")
    3394                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3395                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3396                      .dwendtag $C$DW$T$37
    3397              
    3398              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    3399                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$37)
    3400                      .dwattr $C$DW$T$87, DW_AT_address_class(0x16)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   68

    3401              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3402                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    3403                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3404              
    3405              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    3406                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    3407                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    3408              $C$DW$484       .dwtag  DW_TAG_member
    3409                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$38)
    3410                      .dwattr $C$DW$484, DW_AT_name("version")
    3411                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_version")
    3412                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3413                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3414              $C$DW$485       .dwtag  DW_TAG_member
    3415                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$40)
    3416                      .dwattr $C$DW$485, DW_AT_name("state")
    3417                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_state")
    3418                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3419                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3420              $C$DW$486       .dwtag  DW_TAG_member
    3421                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$40)
    3422                      .dwattr $C$DW$486, DW_AT_name("prevState")
    3423                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_prevState")
    3424                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3425                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3426              $C$DW$487       .dwtag  DW_TAG_member
    3427                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$42)
    3428                      .dwattr $C$DW$487, DW_AT_name("errorCode")
    3429                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_errorCode")
    3430                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3431                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3432              $C$DW$488       .dwtag  DW_TAG_member
    3433                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$44)
    3434                      .dwattr $C$DW$488, DW_AT_name("clarkeHandle_I")
    3435                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3436                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3437                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3438              $C$DW$489       .dwtag  DW_TAG_member
    3439                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$45)
    3440                      .dwattr $C$DW$489, DW_AT_name("clarke_I")
    3441                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_clarke_I")
    3442                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3443                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3444              $C$DW$490       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$44)
    3446                      .dwattr $C$DW$490, DW_AT_name("clarkeHandle_V")
    3447                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3448                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3449                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3450              $C$DW$491       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$45)
    3452                      .dwattr $C$DW$491, DW_AT_name("clarke_V")
    3453                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_clarke_V")
    3454                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3455                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   69

    3456              $C$DW$492       .dwtag  DW_TAG_member
    3457                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$47)
    3458                      .dwattr $C$DW$492, DW_AT_name("estHandle")
    3459                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_estHandle")
    3460                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3461                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3462              $C$DW$493       .dwtag  DW_TAG_member
    3463                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$49)
    3464                      .dwattr $C$DW$493, DW_AT_name("parkHandle")
    3465                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_parkHandle")
    3466                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3467                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3468              $C$DW$494       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$50)
    3470                      .dwattr $C$DW$494, DW_AT_name("park")
    3471                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_park")
    3472                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3473                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3474              $C$DW$495       .dwtag  DW_TAG_member
    3475                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$52)
    3476                      .dwattr $C$DW$495, DW_AT_name("pidHandle_Id")
    3477                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_pidHandle_Id")
    3478                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3479                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3480              $C$DW$496       .dwtag  DW_TAG_member
    3481                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$53)
    3482                      .dwattr $C$DW$496, DW_AT_name("pid_Id")
    3483                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_pid_Id")
    3484                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3485                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3486              $C$DW$497       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$52)
    3488                      .dwattr $C$DW$497, DW_AT_name("pidHandle_Iq")
    3489                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3490                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3491                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3492              $C$DW$498       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$53)
    3494                      .dwattr $C$DW$498, DW_AT_name("pid_Iq")
    3495                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_pid_Iq")
    3496                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3497                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3498              $C$DW$499       .dwtag  DW_TAG_member
    3499                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$52)
    3500                      .dwattr $C$DW$499, DW_AT_name("pidHandle_spd")
    3501                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_pidHandle_spd")
    3502                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3503                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3504              $C$DW$500       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$53)
    3506                      .dwattr $C$DW$500, DW_AT_name("pid_spd")
    3507                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_pid_spd")
    3508                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3509                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3510              $C$DW$501       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   70

    3511                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$55)
    3512                      .dwattr $C$DW$501, DW_AT_name("iparkHandle")
    3513                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_iparkHandle")
    3514                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3515                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3516              $C$DW$502       .dwtag  DW_TAG_member
    3517                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$56)
    3518                      .dwattr $C$DW$502, DW_AT_name("ipark")
    3519                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_ipark")
    3520                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3521                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3522              $C$DW$503       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$58)
    3524                      .dwattr $C$DW$503, DW_AT_name("svgenHandle")
    3525                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_svgenHandle")
    3526                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3527                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3528              $C$DW$504       .dwtag  DW_TAG_member
    3529                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$59)
    3530                      .dwattr $C$DW$504, DW_AT_name("svgen")
    3531                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_svgen")
    3532                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3533                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3534              $C$DW$505       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$61)
    3536                      .dwattr $C$DW$505, DW_AT_name("trajHandle_Id")
    3537                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_trajHandle_Id")
    3538                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3539                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3540              $C$DW$506       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$62)
    3542                      .dwattr $C$DW$506, DW_AT_name("traj_Id")
    3543                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_traj_Id")
    3544                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3545                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3546              $C$DW$507       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$61)
    3548                      .dwattr $C$DW$507, DW_AT_name("trajHandle_spd")
    3549                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_trajHandle_spd")
    3550                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3551                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3552              $C$DW$508       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$62)
    3554                      .dwattr $C$DW$508, DW_AT_name("traj_spd")
    3555                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_traj_spd")
    3556                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3557                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    3558              $C$DW$509       .dwtag  DW_TAG_member
    3559                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$61)
    3560                      .dwattr $C$DW$509, DW_AT_name("trajHandle_spdMax")
    3561                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3562                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3563                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3564              $C$DW$510       .dwtag  DW_TAG_member
    3565                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$62)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   71

    3566                      .dwattr $C$DW$510, DW_AT_name("traj_spdMax")
    3567                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_traj_spdMax")
    3568                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3569                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3570              $C$DW$511       .dwtag  DW_TAG_member
    3571                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$63)
    3572                      .dwattr $C$DW$511, DW_AT_name("motorParams")
    3573                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_motorParams")
    3574                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3575                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3576              $C$DW$512       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$66)
    3578                      .dwattr $C$DW$512, DW_AT_name("waitTimes")
    3579                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_waitTimes")
    3580                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3581                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3582              $C$DW$513       .dwtag  DW_TAG_member
    3583                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$65)
    3584                      .dwattr $C$DW$513, DW_AT_name("counter_state")
    3585                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_counter_state")
    3586                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3587                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3588              $C$DW$514       .dwtag  DW_TAG_member
    3589                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$67)
    3590                      .dwattr $C$DW$514, DW_AT_name("numIsrTicksPerCtrlTick")
    3591                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3592                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3593                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    3594              $C$DW$515       .dwtag  DW_TAG_member
    3595                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$67)
    3596                      .dwattr $C$DW$515, DW_AT_name("numCtrlTicksPerCurrentTick")
    3597                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3598                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3599                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    3600              $C$DW$516       .dwtag  DW_TAG_member
    3601                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$67)
    3602                      .dwattr $C$DW$516, DW_AT_name("numCtrlTicksPerSpeedTick")
    3603                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3604                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3605                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    3606              $C$DW$517       .dwtag  DW_TAG_member
    3607                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$67)
    3608                      .dwattr $C$DW$517, DW_AT_name("numCtrlTicksPerTrajTick")
    3609                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3610                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3611                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    3612              $C$DW$518       .dwtag  DW_TAG_member
    3613                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$65)
    3614                      .dwattr $C$DW$518, DW_AT_name("ctrlFreq_Hz")
    3615                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3616                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3617                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    3618              $C$DW$519       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$65)
    3620                      .dwattr $C$DW$519, DW_AT_name("trajFreq_Hz")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   72

    3621                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3622                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3623                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    3624              $C$DW$520       .dwtag  DW_TAG_member
    3625                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$32)
    3626                      .dwattr $C$DW$520, DW_AT_name("trajPeriod_sec")
    3627                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3628                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3629                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    3630              $C$DW$521       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$68)
    3632                      .dwattr $C$DW$521, DW_AT_name("ctrlPeriod_sec")
    3633                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3634                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3635                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    3636              $C$DW$522       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$32)
    3638                      .dwattr $C$DW$522, DW_AT_name("maxVsMag_pu")
    3639                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3640                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3641                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    3642              $C$DW$523       .dwtag  DW_TAG_member
    3643                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$69)
    3644                      .dwattr $C$DW$523, DW_AT_name("Iab_in")
    3645                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_Iab_in")
    3646                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3647                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    3648              $C$DW$524       .dwtag  DW_TAG_member
    3649                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$69)
    3650                      .dwattr $C$DW$524, DW_AT_name("Iab_filt")
    3651                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_Iab_filt")
    3652                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3653                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    3654              $C$DW$525       .dwtag  DW_TAG_member
    3655                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$69)
    3656                      .dwattr $C$DW$525, DW_AT_name("Idq_in")
    3657                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_Idq_in")
    3658                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3659                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    3660              $C$DW$526       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$69)
    3662                      .dwattr $C$DW$526, DW_AT_name("Vab_in")
    3663                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_Vab_in")
    3664                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3665                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    3666              $C$DW$527       .dwtag  DW_TAG_member
    3667                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$32)
    3668                      .dwattr $C$DW$527, DW_AT_name("spd_out")
    3669                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_spd_out")
    3670                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3671                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    3672              $C$DW$528       .dwtag  DW_TAG_member
    3673                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$69)
    3674                      .dwattr $C$DW$528, DW_AT_name("Vab_out")
    3675                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_Vab_out")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   73

    3676                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3677                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    3678              $C$DW$529       .dwtag  DW_TAG_member
    3679                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$69)
    3680                      .dwattr $C$DW$529, DW_AT_name("Vdq_out")
    3681                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_Vdq_out")
    3682                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3683                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    3684              $C$DW$530       .dwtag  DW_TAG_member
    3685                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$68)
    3686                      .dwattr $C$DW$530, DW_AT_name("Rhf")
    3687                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_Rhf")
    3688                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3689                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    3690              $C$DW$531       .dwtag  DW_TAG_member
    3691                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$68)
    3692                      .dwattr $C$DW$531, DW_AT_name("Lhf")
    3693                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_Lhf")
    3694                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3695                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    3696              $C$DW$532       .dwtag  DW_TAG_member
    3697                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$68)
    3698                      .dwattr $C$DW$532, DW_AT_name("RoverL")
    3699                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_RoverL")
    3700                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3701                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    3702              $C$DW$533       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$32)
    3704                      .dwattr $C$DW$533, DW_AT_name("Kp_Id")
    3705                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_Kp_Id")
    3706                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3707                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    3708              $C$DW$534       .dwtag  DW_TAG_member
    3709                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$32)
    3710                      .dwattr $C$DW$534, DW_AT_name("Kp_Iq")
    3711                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_Kp_Iq")
    3712                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3713                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    3714              $C$DW$535       .dwtag  DW_TAG_member
    3715                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$32)
    3716                      .dwattr $C$DW$535, DW_AT_name("Kp_spd")
    3717                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_Kp_spd")
    3718                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3719                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    3720              $C$DW$536       .dwtag  DW_TAG_member
    3721                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$32)
    3722                      .dwattr $C$DW$536, DW_AT_name("Ki_Id")
    3723                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_Ki_Id")
    3724                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3725                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    3726              $C$DW$537       .dwtag  DW_TAG_member
    3727                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$32)
    3728                      .dwattr $C$DW$537, DW_AT_name("Ki_Iq")
    3729                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_Ki_Iq")
    3730                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   74

    3731                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    3732              $C$DW$538       .dwtag  DW_TAG_member
    3733                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$32)
    3734                      .dwattr $C$DW$538, DW_AT_name("Ki_spd")
    3735                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_Ki_spd")
    3736                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3737                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    3738              $C$DW$539       .dwtag  DW_TAG_member
    3739                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$32)
    3740                      .dwattr $C$DW$539, DW_AT_name("Kd_Id")
    3741                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_Kd_Id")
    3742                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3743                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    3744              $C$DW$540       .dwtag  DW_TAG_member
    3745                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$32)
    3746                      .dwattr $C$DW$540, DW_AT_name("Kd_Iq")
    3747                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_Kd_Iq")
    3748                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3749                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    3750              $C$DW$541       .dwtag  DW_TAG_member
    3751                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$32)
    3752                      .dwattr $C$DW$541, DW_AT_name("Kd_spd")
    3753                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_Kd_spd")
    3754                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3755                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3756              $C$DW$542       .dwtag  DW_TAG_member
    3757                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$32)
    3758                      .dwattr $C$DW$542, DW_AT_name("Ui_Id")
    3759                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_Ui_Id")
    3760                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3761                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3762              $C$DW$543       .dwtag  DW_TAG_member
    3763                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$32)
    3764                      .dwattr $C$DW$543, DW_AT_name("Ui_Iq")
    3765                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_Ui_Iq")
    3766                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3767                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3768              $C$DW$544       .dwtag  DW_TAG_member
    3769                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$32)
    3770                      .dwattr $C$DW$544, DW_AT_name("Ui_spd")
    3771                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_Ui_spd")
    3772                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3773                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3774              $C$DW$545       .dwtag  DW_TAG_member
    3775                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$69)
    3776                      .dwattr $C$DW$545, DW_AT_name("Idq_ref")
    3777                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_Idq_ref")
    3778                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3779                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3780              $C$DW$546       .dwtag  DW_TAG_member
    3781                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$32)
    3782                      .dwattr $C$DW$546, DW_AT_name("IdRated")
    3783                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_IdRated")
    3784                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3785                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   75

    3786              $C$DW$547       .dwtag  DW_TAG_member
    3787                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$32)
    3788                      .dwattr $C$DW$547, DW_AT_name("spd_ref")
    3789                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_spd_ref")
    3790                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3791                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3792              $C$DW$548       .dwtag  DW_TAG_member
    3793                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$32)
    3794                      .dwattr $C$DW$548, DW_AT_name("spd_max")
    3795                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_spd_max")
    3796                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3797                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    3798              $C$DW$549       .dwtag  DW_TAG_member
    3799                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$67)
    3800                      .dwattr $C$DW$549, DW_AT_name("counter_current")
    3801                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_counter_current")
    3802                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3803                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3804              $C$DW$550       .dwtag  DW_TAG_member
    3805                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$67)
    3806                      .dwattr $C$DW$550, DW_AT_name("counter_isr")
    3807                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_counter_isr")
    3808                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3809                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3810              $C$DW$551       .dwtag  DW_TAG_member
    3811                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$67)
    3812                      .dwattr $C$DW$551, DW_AT_name("counter_speed")
    3813                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_counter_speed")
    3814                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3815                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3816              $C$DW$552       .dwtag  DW_TAG_member
    3817                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$67)
    3818                      .dwattr $C$DW$552, DW_AT_name("counter_traj")
    3819                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_counter_traj")
    3820                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3821                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3822              $C$DW$553       .dwtag  DW_TAG_member
    3823                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$70)
    3824                      .dwattr $C$DW$553, DW_AT_name("flag_enableCtrl")
    3825                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3826                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3827                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3828              $C$DW$554       .dwtag  DW_TAG_member
    3829                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$70)
    3830                      .dwattr $C$DW$554, DW_AT_name("flag_enableDcBusComp")
    3831                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3832                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3833                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3834              $C$DW$555       .dwtag  DW_TAG_member
    3835                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$70)
    3836                      .dwattr $C$DW$555, DW_AT_name("flag_enablePowerWarp")
    3837                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3838                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3839                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3840              $C$DW$556       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   76

    3841                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$70)
    3842                      .dwattr $C$DW$556, DW_AT_name("flag_enableOffset")
    3843                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_flag_enableOffset")
    3844                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3845                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3846              $C$DW$557       .dwtag  DW_TAG_member
    3847                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$70)
    3848                      .dwattr $C$DW$557, DW_AT_name("flag_enableSpeedCtrl")
    3849                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3850                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3851                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3852              $C$DW$558       .dwtag  DW_TAG_member
    3853                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$70)
    3854                      .dwattr $C$DW$558, DW_AT_name("flag_enableUserMotorParams")
    3855                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3856                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3857                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3858              $C$DW$559       .dwtag  DW_TAG_member
    3859                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$69)
    3860                      .dwattr $C$DW$559, DW_AT_name("Idq_offset_pu")
    3861                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3862                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3863                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3864              $C$DW$560       .dwtag  DW_TAG_member
    3865                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$69)
    3866                      .dwattr $C$DW$560, DW_AT_name("Vdq_offset_pu")
    3867                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3868                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3869                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3870              $C$DW$561       .dwtag  DW_TAG_member
    3871                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$32)
    3872                      .dwattr $C$DW$561, DW_AT_name("angle_pu")
    3873                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_angle_pu")
    3874                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3875                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3876              $C$DW$562       .dwtag  DW_TAG_member
    3877                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$32)
    3878                      .dwattr $C$DW$562, DW_AT_name("speed_ref_pu")
    3879                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_speed_ref_pu")
    3880                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3881                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3882              $C$DW$563       .dwtag  DW_TAG_member
    3883                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$32)
    3884                      .dwattr $C$DW$563, DW_AT_name("speed_fb_pu")
    3885                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_speed_fb_pu")
    3886                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3887                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3888              $C$DW$564       .dwtag  DW_TAG_member
    3889                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$32)
    3890                      .dwattr $C$DW$564, DW_AT_name("speed_outMax_pu")
    3891                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3892                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3893                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3894              $C$DW$565       .dwtag  DW_TAG_member
    3895                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   77

    3896                      .dwattr $C$DW$565, DW_AT_name("flag_enableCurrentCtrl")
    3897                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3898                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3899                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3900                      .dwendtag $C$DW$T$71
    3901              
    3902              $C$DW$T$192     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3903                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$71)
    3904                      .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    3905              $C$DW$T$193     .dwtag  DW_TAG_pointer_type
    3906                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
    3907                      .dwattr $C$DW$T$193, DW_AT_address_class(0x16)
    3908              $C$DW$T$165     .dwtag  DW_TAG_pointer_type
    3909                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$71)
    3910                      .dwattr $C$DW$T$165, DW_AT_address_class(0x16)
    3911              $C$DW$T$166     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3912                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$165)
    3913                      .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    3914              $C$DW$566       .dwtag  DW_TAG_TI_far_type
    3915                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$166)
    3916              $C$DW$T$194     .dwtag  DW_TAG_const_type
    3917                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$566)
    3918              
    3919              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    3920                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    3921                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    3922              $C$DW$567       .dwtag  DW_TAG_member
    3923                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$23)
    3924                      .dwattr $C$DW$567, DW_AT_name("rsvd")
    3925                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_rsvd")
    3926                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3927                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3928              $C$DW$568       .dwtag  DW_TAG_member
    3929                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$73)
    3930                      .dwattr $C$DW$568, DW_AT_name("targetProc")
    3931                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_targetProc")
    3932                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3933                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3934              $C$DW$569       .dwtag  DW_TAG_member
    3935                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$23)
    3936                      .dwattr $C$DW$569, DW_AT_name("major")
    3937                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_major")
    3938                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3939                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3940              $C$DW$570       .dwtag  DW_TAG_member
    3941                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$23)
    3942                      .dwattr $C$DW$570, DW_AT_name("minor")
    3943                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_minor")
    3944                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3945                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3946                      .dwendtag $C$DW$T$74
    3947              
    3948              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3949                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    3950                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   78

    3951              $C$DW$T$202     .dwtag  DW_TAG_pointer_type
    3952                      .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$38)
    3953                      .dwattr $C$DW$T$202, DW_AT_address_class(0x16)
    3954              
    3955              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3956                      .dwattr $C$DW$T$20, DW_AT_name("_EST_Obj_")
    3957                      .dwattr $C$DW$T$20, DW_AT_declaration
    3958                      .dwendtag $C$DW$T$20
    3959              
    3960              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3961                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$20)
    3962                      .dwattr $C$DW$T$46, DW_AT_address_class(0x16)
    3963              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3964                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3965                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3966              
    3967              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    3968                      .dwattr $C$DW$T$75, DW_AT_name("_FILTER_FO_")
    3969                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x0a)
    3970              $C$DW$571       .dwtag  DW_TAG_member
    3971                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$32)
    3972                      .dwattr $C$DW$571, DW_AT_name("a1")
    3973                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_a1")
    3974                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3975                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3976              $C$DW$572       .dwtag  DW_TAG_member
    3977                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$32)
    3978                      .dwattr $C$DW$572, DW_AT_name("b0")
    3979                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_b0")
    3980                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3981                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3982              $C$DW$573       .dwtag  DW_TAG_member
    3983                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$32)
    3984                      .dwattr $C$DW$573, DW_AT_name("b1")
    3985                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_b1")
    3986                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3987                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3988              $C$DW$574       .dwtag  DW_TAG_member
    3989                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$32)
    3990                      .dwattr $C$DW$574, DW_AT_name("x1")
    3991                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_x1")
    3992                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3993                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3994              $C$DW$575       .dwtag  DW_TAG_member
    3995                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$32)
    3996                      .dwattr $C$DW$575, DW_AT_name("y1")
    3997                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_y1")
    3998                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3999                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    4000                      .dwendtag $C$DW$T$75
    4001              
    4002              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    4003                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$75)
    4004                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    4005              
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   79

    4006              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4007                      .dwattr $C$DW$T$21, DW_AT_name("_FILTER_FO_Obj_")
    4008                      .dwattr $C$DW$T$21, DW_AT_declaration
    4009                      .dwendtag $C$DW$T$21
    4010              
    4011              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    4012                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$21)
    4013                      .dwattr $C$DW$T$135, DW_AT_address_class(0x16)
    4014              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    4015                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
    4016                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    4017              
    4018              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    4019                      .dwattr $C$DW$T$76, DW_AT_name("_FLASH_Obj_")
    4020                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
    4021              $C$DW$576       .dwtag  DW_TAG_member
    4022                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$24)
    4023                      .dwattr $C$DW$576, DW_AT_name("FOPT")
    4024                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_FOPT")
    4025                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4026                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    4027              $C$DW$577       .dwtag  DW_TAG_member
    4028                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$24)
    4029                      .dwattr $C$DW$577, DW_AT_name("rsvd_1")
    4030                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_rsvd_1")
    4031                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4032                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    4033              $C$DW$578       .dwtag  DW_TAG_member
    4034                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$24)
    4035                      .dwattr $C$DW$578, DW_AT_name("FPWR")
    4036                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_FPWR")
    4037                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4038                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    4039              $C$DW$579       .dwtag  DW_TAG_member
    4040                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$24)
    4041                      .dwattr $C$DW$579, DW_AT_name("FSTATUS")
    4042                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_FSTATUS")
    4043                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4044                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    4045              $C$DW$580       .dwtag  DW_TAG_member
    4046                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$24)
    4047                      .dwattr $C$DW$580, DW_AT_name("FSTDBYWAIT")
    4048                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    4049                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4050                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    4051              $C$DW$581       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$24)
    4053                      .dwattr $C$DW$581, DW_AT_name("FACTIVEWAIT")
    4054                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    4055                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4056                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    4057              $C$DW$582       .dwtag  DW_TAG_member
    4058                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$24)
    4059                      .dwattr $C$DW$582, DW_AT_name("FBANKWAIT")
    4060                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_FBANKWAIT")
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   80

    4061                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4062                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    4063              $C$DW$583       .dwtag  DW_TAG_member
    4064                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$24)
    4065                      .dwattr $C$DW$583, DW_AT_name("FOTPWAIT")
    4066                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_FOTPWAIT")
    4067                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4068                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    4069                      .dwendtag $C$DW$T$76
    4070              
    4071              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    4072                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$76)
    4073                      .dwattr $C$DW$T$89, DW_AT_address_class(0x16)
    4074              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    4075                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    4076                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    4077              
    4078              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    4079                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
    4080                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
    4081              $C$DW$584       .dwtag  DW_TAG_member
    4082                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$77)
    4083                      .dwattr $C$DW$584, DW_AT_name("GPACTRL")
    4084                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_GPACTRL")
    4085                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4086                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    4087              $C$DW$585       .dwtag  DW_TAG_member
    4088                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$77)
    4089                      .dwattr $C$DW$585, DW_AT_name("GPAQSEL1")
    4090                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_GPAQSEL1")
    4091                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4092                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    4093              $C$DW$586       .dwtag  DW_TAG_member
    4094                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$77)
    4095                      .dwattr $C$DW$586, DW_AT_name("GPAQSEL2")
    4096                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_GPAQSEL2")
    4097                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4098                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    4099              $C$DW$587       .dwtag  DW_TAG_member
    4100                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$77)
    4101                      .dwattr $C$DW$587, DW_AT_name("GPAMUX1")
    4102                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_GPAMUX1")
    4103                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4104                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    4105              $C$DW$588       .dwtag  DW_TAG_member
    4106                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$77)
    4107                      .dwattr $C$DW$588, DW_AT_name("GPAMUX2")
    4108                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_GPAMUX2")
    4109                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4110                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    4111              $C$DW$589       .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$77)
    4113                      .dwattr $C$DW$589, DW_AT_name("GPADIR")
    4114                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_GPADIR")
    4115                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   81

    4116                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$590       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$77)
    4119                      .dwattr $C$DW$590, DW_AT_name("GPAPUD")
    4120                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_GPAPUD")
    4121                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4122                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    4123              $C$DW$591       .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$27)
    4125                      .dwattr $C$DW$591, DW_AT_name("rsvd_1")
    4126                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_rsvd_1")
    4127                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4128                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$592       .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$77)
    4131                      .dwattr $C$DW$592, DW_AT_name("GPBCTRL")
    4132                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_GPBCTRL")
    4133                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4134                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4135              $C$DW$593       .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$77)
    4137                      .dwattr $C$DW$593, DW_AT_name("GPBQSEL1")
    4138                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_GPBQSEL1")
    4139                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4140                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    4141              $C$DW$594       .dwtag  DW_TAG_member
    4142                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$27)
    4143                      .dwattr $C$DW$594, DW_AT_name("rsvd_2")
    4144                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_rsvd_2")
    4145                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4146                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    4147              $C$DW$595       .dwtag  DW_TAG_member
    4148                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$77)
    4149                      .dwattr $C$DW$595, DW_AT_name("GPBMUX1")
    4150                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_GPBMUX1")
    4151                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4152                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    4153              $C$DW$596       .dwtag  DW_TAG_member
    4154                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$27)
    4155                      .dwattr $C$DW$596, DW_AT_name("rsvd_3")
    4156                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_rsvd_3")
    4157                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4158                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4159              $C$DW$597       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$77)
    4161                      .dwattr $C$DW$597, DW_AT_name("GPBDIR")
    4162                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_GPBDIR")
    4163                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4164                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4165              $C$DW$598       .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$77)
    4167                      .dwattr $C$DW$598, DW_AT_name("GPBPUD")
    4168                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_GPBPUD")
    4169                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4170                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.5 Sat Jul 08 16:16:11 2017

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\wmj\AppData\Local\Temp\1433210                              PAGE   82

    4171              $C$DW$599       .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$78)
    4173                      .dwattr $C$DW$599, DW_AT_name("rsvd_4")
    4174                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_rsvd_4")
    4175                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4176                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4177              $C$DW$600       .dwtag  DW_TAG_member
    4178                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$77)
    4179                      .dwattr $C$DW$600, DW_AT_name("AIOMUX1")
    4180                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_AIOMUX1")
    4181                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4182                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4183              $C$DW$601       .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$27)
    4185                      .dwattr $C$DW$601, DW_AT_name("rsvd_5")
    4186                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_rsvd_5")
    4187                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4188                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4189              $C$DW$602       .dwtag  DW_TAG_member
    4190                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$77)
    4191                      .dwattr $C$DW$602, DW_AT_name("AIODIR")
    4192                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_AIODIR")
    4193                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4194                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4195              $C$DW$603       .dwtag  DW_TAG_member
    4196                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$79)
    4197                      .dwattr $C$DW$603, DW_AT_name("rsvd_6")
    4198                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_rsvd_6")
    4199                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4200                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4201              $C$DW$604       .dwtag  DW_TAG_member
    4202                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$77)
    4203                      .dwattr $C$DW$604, DW_AT_name("GPADAT")
    4204                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_GPADAT")
    4205                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4206                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4207              $C$DW$605       .dwtag  DW_TAG_member
    4208                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$77)
    4209                      .dwattr $C$DW$605, DW_AT_name("GPASET")
    4210                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_GPASET")
    4211                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4212                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4213              $C$DW$606       .dwtag  DW_TAG_member
    4214                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$77)
    4215                      .dwattr $C$DW$606, DW_AT_name("GPACLEAR")
    4216                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_GPACLEAR")
    4217                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4218                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4219              $C$DW$607       .dwtag  DW_TAG_member
    4220                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$77)
    4221                      .dwattr $C$DW$607, DW_AT_name("GPATOGGLE")
    4222                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_GPATOGGLE")
    4223                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4224                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4225              $C$DW$608       .dwtag  DW_TAG_member
